{"sl_translate":"description,descriptionPlain,category","id":65456,"slug":"og-shark","name":"OG Shark","subtitle":null,"symbol":"Ogs","category":"Hybrid","description":"\u003cp class=\"p1\"\u003eOG Shark, a rare strain found primarily in Canada, sets high standards with its impressive THC content and pungent, earthy aroma. Patients most commonly turn to this heavy-hitter for nausea, pain, and sleep disorders, as well as many other symptoms.\u003c/p\u003e\n","descriptionPlain":"OG Shark, a rare strain found primarily in Canada, sets high standards with its impressive THC content and pungent, earthy aroma. Patients most commonly turn to this heavy-hitter for nausea, pain, and sleep disorders, as well as many other symptoms.\n","aka":"OG/Shark","rating":4.53,"highlightedReviews":[{"id":1412667,"username":"nagchampa","text":"Outstanding! I felt almost immediate effects from this excellent strain - the OG Shark was great for pain relief and appetite stimulation. Quelled chronic nausea and enabled me to both cook and eat a good meal. After a small pre-bed toke, I had a great sleep \u0026 awoke refreshed. Only downside was a slight anxious/paranoid feeling, but that could have been my mood.  This will for sure be in my Top 10; maybe even my Top 5.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1598954,"username":"shannon447","text":"I like this strain for the most part as it’s really good for both my anxiety and for pain. It does make me super sleepy though which makes it hard to smoke during the day! ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-10880","title":"Moving to Canada Post-Election? Try These Canadian Strains When You Get There","author":"Bailey Rahn","category":null,"date":"\/Date(1478649921000)\/","text":"Since the presidential nominations of Hillary Clinton and Donald Trump, record numbers of people have been searching Google for “How to Move to Canada.” The grass may be greener on the other side, whether we’re talking about Prime Minister Justin Trudeau or Canada-grown bud. So for those of you seeking democracy to the North, allow us to point you to a few memorable cannabis varieties with Canadian roots for you to enjoy after your grand escape.\n\n   OG Shark\nA strain so potent, it’ll make you forget all the woes you left back home. OG Shark is a powerful hybrid strain that knocks out stress, depression, headaches, and many other symptoms the 2016 election may have left you with. True to its OG roots, this hybrid reeks of lemony fuel with hints of forest pine that’ll keep you coming back to the bowl for more.\n   Nuken\nNuken is an indica strain that strikes a balance between relaxation and invigoration, giving your body escape from pain and tension while the mind soars with upbeat euphoria. Weaving together genetics from the widely cherished parent strains Shishkaberry and God Bud, Nuken was destined for success. Herbal, woody aromas come together to create an organic flavor profile that brings the mind a little closer to nature and the peace it provides. We know you need it.\n\n   Black Tuna\nThis BC native mixes old school indica genetics from Herijuana and the Jamaican sativa Lamb’s Bread to build a unique hybrid named for its original packaging: sealed tuna cans. The days of Black Tuna’s secretive marketing may be no more, but Black Tuna lives on, offering powerfully sedating effects that can help you hibernate until the 2020 election.\n   Island Sweet Skunk\nIsland Sweet Skunk is a sativa strain from Vancouver Island that offers sweet-tasting freedom from stress and anxiety alongside its creative effects. Sour skunky notes intermix with tropical orange and grapefruit to create an intricate composition of flavors that no doubt helped bring this strain fame and prosperity far beyond the borders in which it first grew.\n\n   Chemo\nAs the story goes, Chemo was developed in Canada in the early 1970s at the University of British Columbia to treat the side effects of chemotherapy. Maintained by Canadian cannabis breeders Jordan of the Isles, Chemo remains an indica staple, showing itself off with a woody, earthy aroma. Its effects sink deep in the body, relaxing muscles while simultaneously backhanding nausea, insomnia, and appetite loss.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/11/08154134/canada-strains.jpg","urlslug":"/news/strains-products/canada-cannabis-strains-post-election"},{"id":"contentitems-2993","title":"6 Shark-Themed Cannabis Strains That Pack a Powerful Bite","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1466976600000)\/","text":"The most highly anticipated stretch of summer is here: Shark Week. It\u0027s a seven day-long marathon where we gather around our televisions to gawk, mouth agape with terror, at the aquatic beasts staring back at use with their dead eyes and rows of razor-sharp teeth. To more adequately prepare you for a week-long bout with the only sea creature to ever kill Samuel L. Jackson, here are a few strains that will have you saying, “We need a bigger boat\" (or bowl).\n  Great White Shark\nThe Great White Shark is the mob boss of the deep blue sea. Having survived for millions of years on the flesh of others, this creature doesn’t only have a taste for blood, it lives for it. If you manage to get your hands on its ravenous strain counterpart, take note of its fruity odor and dense coating of crystals. Indulge in this strain\u0027s pleasant olfactory and visual stimuli, because it will likely be your last, right before Great White Shark takes a bite right out of your dome-piece.\n  Shark Shock\nWhen I think of Shock Shark, I think of some electrified abomination with gleaming bone saws for teeth and a devil-may-care attitude. This particular strain is more stunning than shocking, leaning toward full indica genetics that stink of skunks devoured by this carnivorous lightning rod floating just below the water’s placid surface.\n  OG Shark\nOG Shark makes more sense than people give it credit for. Ocean Grown Shark is the only kind of shark I’ve seen. So, knowing OG Shark began in Canada makes this cartilaginous predator slightly more polite, but it will still bite you right in the face. Canadian or not, this shark only knows mind-altering ferocity.\n  CBD Shark\nCBD Shark, the only CBD strain to make the shark list, is like the squeaky rubber shark toy you might play with in the bath, except it weights two thousand pounds. While it may be less intimidating by way of its supplementary anti-inflammatory and anti-anxiety effects, this 80/20 indica will straight bite your legs off, making leaving the couch or bed or floor slightly more difficult. But don’t even sweat it — you\u0027ll be so lit on CBD Shark you’ll barely notice your missed appendages.\n  Shark Bite\nShark Bite is one of Leafly’s more literal shark strains. This strain is a cross of Great White Shark and Face Off OG, which is a suitable combination for this week-long television holiday dedicated to ocean predators that have the ability to remove body parts from unsuspecting victims.\n  Shark Attack\nShark Attack is a beautiful indica-dominant cross with rather conventional genetics. Crossing Super Skunk and White Widow, one hit of this strain will have you hearing John William’s Jaws score. Every dark corridor or unlit room become a vast, inky ocean full of razor-sharp teeth. This munchie-inducing strain will have you thanking your fridge manufacturer for the tiny interior light. (Just kidding, your fridge is full of sharks, too.)\nShark Week may only happen one week a year, but you can find potent strains that will take a bite out of your anxiety, depression, chronic pain, and laziness any time at Leafly — just check our Strain Explorer for options, or take a peek at some of our recommendations for strong cannabis strains.\n.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001315/6-shark-themed-cannabis-strains-that-pack-a-powerful-bite.jpg","urlslug":"/news/strains-products/6-shark-themed-cannabis-strains-that-pack-a-powerful-bite"}],"reviewCount":118,"flavors":[{"name":"Earthy","score":33.6033982594281},{"name":"Chemical","score":8.4852880232076249},{"name":"Pungent","score":8.2159138002486536},{"name":"Woody","score":6.8379610443431407},{"name":"Pine","score":5.1906340654786565}],"effects":[{"name":"Relaxed","score":71.21632822213013},{"name":"Happy","score":67.403646912556979},{"name":"Euphoric","score":64.647741400745957},{"name":"Uplifted","score":46.688769167012019},{"name":"Hungry","score":29.397016162453379}],"symptoms":[{"name":"Insomnia","score":50.774968918358887},{"name":"Cramps","score":43.812681309573144},{"name":"Headaches","score":43.346456692913385},{"name":"Pain","score":33.137173642768339},{"name":"Depression","score":32.815996684624949}],"conditions":[{"name":"Anxiety","score":53.997099046829668},{"name":"PMS","score":41.574803149606296},{"name":"PTSD","score":29.666390385412349},{"name":"Gastrointestinal Disorder","score":26.444260256941568},{"name":"Migraines","score":25.190634065478658}],"negatives":[{"name":"Dry Mouth","score":28.019063406547865},{"name":"Dry Eyes","score":7.4285122254455036},{"name":"Dizzy","score":3.8126813095731453},{"name":"Paranoid","score":1.3779527559055118},{"name":"Anxious","score":0.984251968503937}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/og-shark/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/og-shark/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-shark_100x100_e17e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/637102/b/og-shark__primary_c71d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-shark_100x100_884d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/605171/b/og-shark__primary_f3e9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-shark_100x100_24e5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/571051/b/og-shark__primary_a792.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-shark_100x100_26db.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/569524/b/og-shark__primary_e21a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-shark_100x100_c708.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/564715/b/og-shark__primary_c192.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-shark_100x100_5c3e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/470770/b/og-shark__primary_178a.jpg"}],"photoTotalCount":21,"popularCities":["Toronto, ON","Vancouver, BC","Calgary, AB","Montréal, QC","Ottawa, ON","Edmonton, AB","Hamilton, ON","Winnipeg, MB","Mississauga, ON","London, ON"],"permalink":"https://mobileapi.leafly.com/hybrid/og-shark","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.53389830508475/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"\n\tRequires a dry outdoor climate\n\tBest results when plants are grown large and not confined to pots\n\tFour phenotypes, three of which typically express sativa influence while the fourth exhibits more indica-like characteristics\n\n"}}
