{"sl_translate":"description,descriptionPlain,category","id":187792,"slug":"suzy-q","name":"Suzy Q","subtitle":null,"symbol":"Szq","category":"Hybrid","description":"\u003cp\u003eSuzy Q is a high-CBD, low-THC strain with a piney taste that helps treat symptoms with little to no euphoric high.\u0026nbsp;This hybrid is great for daytime use or by those who want to relieve chronic pain, nausea, arthritis, muscle spasms, and anxiety without intoxicating effects. \u0026nbsp; \u0026nbsp;\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Suzy Q is a high-CBD, low-THC strain with a piney taste that helps treat symptoms with little to no euphoric high.\u0026nbsp;This hybrid is great for daytime use or by those who want to relieve chronic pain, nausea, arthritis, muscle spasms, and anxiety without intoxicating effects. \u0026nbsp; \u0026nbsp;\u0026nbsp;\n","aka":null,"rating":4.24,"highlightedReviews":[{"id":1376948,"username":"Cmunz","text":"Tested about 18% cbd less than 1% thc. Aroma was amazingly appealing of sweet skunky pine. Buds were somewhat loose and leafy compared to what i\u0027m used to, but harvesting a little prematurely is a technique growers use to maximize cbd ratios. I don\u0027t have any serious pathology so cannot comment on the effects against  pain, spasms so forth. To me the \"high\" was more of an equalizing and calming of the psyche, like a cup of green tea.  I use it to take the edge off higher thc strains by blending some in.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1627676,"username":"annabeanOG","text":"Suzy Q is one spicy tamale! Smells just like pepper corn and even burnt my nose a bit after the initial smell. \n\nGreat if you’re at work and need to get rid of some pain but don’t want to appear intoxicated. \nThe job I work at doesn’t care if you smoke pot but I cannot function in a work environment well at all. \n\n","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59186","title":"Which Cannabis Strains Are Highest in CBD, According to Lab Data?","author":"Bailey Rahn","category":null,"date":"\/Date(1519851079000)\/","text":"Cannabidiol, or CBD, is becoming a mainstay in consumers’ medicine cabinets as it combats pain, inflammation, anxiety, and much more. However, even as CBD strains and products become more readily available, the price tag can often make one flinch. For this reason, it’s worth knowing which products will bring the best value based on CBD abundance.\n\nLooking at data from cannabis testing labs across Washington State, we compiled a list of strains that tend to produce significant amount of CBD. These numbers are derived from the testing samples of cannabis flowers and do not include CBD concentrates.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nIn the above graph, you’ll find the average cannabinoid contents of ten popular CBD-dominant strains. You’ll notice that many of these strains contain only trace amounts of THC, while others exhibit a more balanced CBD:THC ratio (which means they will be more euphoric in effect). This graph is based on datasets from multiple reliable testing labs across Washington State. However, it’s worth noting that the datasets from each individual lab differ slightly.\nTake a look at the cannabinoid data from one lab, and notice how the numbers shift slightly.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nMost strains maintain a CBD:THC ratio similar to that in the averaged dataset. However, you’ll also see deviations, like ACDC which exhibits a more balanced CBD:THC ratio according to this lab’s individual testing results.\nNow let’s see how the dataset of Lab A compares to a different lab, also represented in the larger, averaged dataset above.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nAs you can see, the CBD levels from Lab B are much higher on average than those from Lab A. There are a number of possible explanations for this. A lab may manufacture bloated cannabinoid profiles, as we’ve seen some labs do in the past. It could also be that Lab B simply tested samples from growers who achieved higher CBD levels in their harvest.\nThe main takeaway here is this: the cannabinoid profile printed on your product depends not only on the strain’s genetics and expertise of the grower, but also on the testing methods (and ethics) of the local lab that performed the chemical analysis. The Dancehall you bought on your last trip to the dispensary is likely to reflect the cannabinoid data illustrated in the above graphs–however, if you see deviation, the reason lies in the many layers of strain and data variability.\n\nCannabis Strains With High Levels of CBD\nWith this caveat in mind, let’s look at the strains that expressed the highest levels of CBD according to the above lab data.\n\nFind Dancehall Nearby\nDancehall is an upbeat and inspiring strain meant to lift your spirits while coercing creativity. With a CBD:THC ratio of nearly 20:1 on average, this strain delivers little to no euphoric effects that might distract focus or dampen cognition in THC-sensitive consumers.\n\nFind ACDC Nearby\nKnown for its keen ability to lift anxiety of all shades, ACDC is a godsend to consumers susceptible to the side effects of THC. This strain allows you to harness many of the desirable traits of cannabis, like light-footed physical relaxation and gentle mood elevation, without the cost of a clear, calm mind.\n\nFind Suzy Q Nearby\nSuzy Q is a CBD-dominant strain with an extremely modest amount of THC, making it another mellow strain with little to no high. The mild effects of this pine-scented strain help you shed anxious or demotivating mental blocks that stood in the way of creativity and productivity.\n\nFind Ringo’s Gift Nearby\nNamed in recognition of the CBD pioneer Lawrence Ringo, Ringo’s Gift imbues the consumer with a sense of wellbeing alongside steady relief in the body. Use this strain to take the edge off pain and stress, while allowing the mind to roam free without the shackles of paranoia or distracting euphoria.\n\nFind Charlotte’s Web Nearby\nCharlotte’s Web was the first CBD strain to receive media attention, and has achieved legendary status among CBD varieties ever since. Although its reputation is built upon its success in treating epilepsy, this strain has aided patients treating many other conditions including pain, anxiety, and inflammation. Charlotte’s Web is grown by CW Pharmaceuticals in Colorado.\n\nFind Remedy Nearby\nRemedy is a high-CBD strain that quietly ushers in easy relaxation without mental fog. For consumers seeking something a little more relaxing than a cup of tea, Remedy offers a solution with effects that rid the mind of anxiety while soothing aches, pains, and inflammation.\n\nFind Sour Tsunami Nearby\nSour Tsunami has become a household name among high-CBD strains. This variety tends to produce less than 1-2% of THC, so you can reap its medicinal benefits without the high. Sour Tsunami is fairly prolific, so keep an eye out for this strain at your next dispensary visit if you’re looking to quell pain or anxiety symptoms without the interference of THC.\n\nFind Hawaiian Dream Nearby\nIf you’re looking to harness the benefits of THC and CBD but wary of getting too high, Hawaiian Dream is the strain for you. With a THC content of around 5% and a CBD profile stretching between 5-10%, Hawaiian Dream can help abate symptoms with only mild, gentle euphoria. As an added bonus, this strain throws in a little tropical flavor to sweeten the experience.\n\nFind Dance World Nearby\nDance World is a CBD-dominant strain that almost achieves a balanced CBD:THC ratio, making it especially appropriate for consumers struggling with pain, depression, and lack of appetite. This synergy of THC and CBD helps to inspire positivity and more vibrant moods by handing you subdued euphoria on a leash.\n\nFind Nordle Nearby\nNordle offers a balanced abundance of both THC and CBD that makes it especially suitable for patients dealing with pain, insomnia, muscle spasms, and anxiety. If your symptoms are keeping you up at night, Nordle is a great nightcap solution for dialing down pain and worries so you can spend less time tossing and turning.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28121936/high-cbd-strains.jpg","urlslug":"/news/strains-products/high-cbd-marijuana-strains-according-to-lab-data"}],"reviewCount":29,"flavors":[{"name":"Spicy/Herbal","score":30.406698564593302},{"name":"Pine","score":21.531100478468897},{"name":"Pepper","score":20},{"name":"Coffee","score":20},{"name":"Earthy","score":14.952153110047846}],"effects":[{"name":"Hungry","score":45.263157894736842},{"name":"Relaxed","score":44.162679425837318},{"name":"Sleepy","score":23.94736842105263},{"name":"Euphoric","score":23.94736842105263},{"name":"Uplifted","score":23.444976076555026}],"symptoms":[{"name":"Pain","score":82.3444976076555},{"name":"Inflammation","score":58.899521531100476},{"name":"Stress","score":20.215311004784688},{"name":"Fatigue","score":18.899521531100476},{"name":"Headaches","score":13.038277511961724}],"conditions":[{"name":"Fibromyalgia","score":54.952153110047846},{"name":"Gastrointestinal Disorder","score":41.315789473684212},{"name":"Anxiety","score":36.267942583732051},{"name":"ADD/ADHD","score":29.090909090909093},{"name":"Migraines","score":14.952153110047846}],"negatives":[{"name":"Headache","score":53.636363636363633},{"name":"Dry Mouth","score":19.497607655502392},{"name":"Dry Eyes","score":16.267942583732054}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/suzy-q_100x100_f681.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/621840/b/suzy-q__primary_ed18.jpg"}],"photoTotalCount":1,"popularCities":["Portland, OR","Aspen, CO","Astoria, OR","Denver, CO","Everett, WA","Goldendale, WA","Los Angeles, CA","Peshastin, WA","Pullman, WA","Redmond, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/suzy-q","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.24137931034483/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
