{
    "aka": "Blue Headband",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1511383998000)/",
            "id": "contentitems-49637",
            "text": "A lot of people think of alcohol as the classic social lubricant. For some of us, it is. Alcohol can loosen us up, make us chatty and animated, and wash away social anxiety. It’s also often readily available at social occasions. Meanwhile, many people avoid cannabis use during social events—for one thing, it’s generally not served, and for another, many can recall a time cannabis made them paranoid or sleepy at a party, and don’t want to have that happen again.\n\nLuckily, with the right strains you can avoid the unwanted effects mentioned above. We used the advanced filters in Leafly’s strain explorer to get started, sorting to include strains with the happiest, most talkative highs, and to exclude any strains that make users anxious, paranoid, or sleepy. (If only alcohol’s drawbacks were so easy to filter out, am I right?)\nWe’ve curated the resultant list with our in-house expertise, vetting all suggestions against our own experiences and ensuring there’s a pick for every type of party. Attendees heading to any social occasion will find something below.\nAnd the awards for the best party cannabis strains go to…\nChocolope\nStrain type: Sativa\nBest for: All occasions.\nDNA Genetics developed Chocolope by crossing Chocolate Thai with Cannalope Haze to create their homage to the super-popular Chocolate strains of the 1980s. The hefty sativa buds give earthy, sweet coffee flavors that provide a dreamy, cerebral effect. It’s known around the Leafly office as “the party strain,” and for good reason—it’s basically impossible to be unhappy or introverted with such a feel-good high.\n\nWhite Russian\nStrain type: Hybrid\nBest for: Dinner parties.\nOriginally created by Dutch breeders Serious Seeds, White Russian is a cross of two legendary strains, White Widow and AK-47. An indica-dominant hybrid, it won the High Times Cannabis Cup “Best Overall” in 1996. White Russian is an extremely fragrant plant, and with a flavor that is smooth and spicy with undertones of skunk and earth, and its high is quite cerebral (especially for an indica-dominant strain), making it great for conversation with those around you.\nTangie\nStrain type: Sativa\nBest for: Cocktail parties.\nAnother fave among the Leafly crew, particularly for group gatherings after work, Tangie is a fantastic offering from DNA Genetics in Amsterdam. This strain is a remake of sorts of the popular version of Tangerine Dream that was sought-after in the 1990s, with genetics derived from a cross of California Orange and a Skunk hybrid. Its citrus heritage is the most evident in its refreshing tangerine aroma.\nBlue Goo\nStrain type: Hybrid\nBest for: Friends and family gatherings.\nBlue Goo is a sativa-dominant hybrid that’s a cross between the famous hybrid Blue Dream and indica Afgoo. A moderate to high potency yields uplifting effects that are standard for sativas, but not excessively energetic thanks to Afgoo’s contribution as well as the mellow nature of Blue Dream. This strain is appropriate for day or nighttime consumption and provides smooth smoke and berry flavor.\n\nSour Lemon OG\nStrain type: Hybrid\nBest for: Birthday parties.\nBred by Emerald Triangle Seeds, Sour Lemon OG is a sativa-dominant hybrid cross between California Sour and Lemon OG. This 65% sativa strain is named after its aromatic sour smell with recognizable notes of lemon, lime, and apple. Sour Lemon OG elevates the mind and body simultaneously, making this a natural go-to strain for celebrations, social engagements, or even just a busy day.\nBlue Diesel\nStrain type: Hybrid\nBest for: Happy hour.\nDaughter of indica-dominant Blueberry and sativa-dominant NYC Diesel, Blue Diesel (also known as Blue City Diesel) falls slightly on the indica side of things with a pleasant, moderate- to long-lasting body buzz (perfect if you want to extend the happy for more than an hour). Thanks to its Blueberry genetics, this flower emanates a light berry aroma that is smooth, expansive, and fast-acting. This strain is optimal for daytime use, and relaxes the consumer in social settings without putting you to sleep.\nPez\nStrain type: Indica\nBest for: Cannabis-focused parties.\nPez is an indica daughter of Afghani and Pakistani strains. These sweet, frosty buds offer the relaxation typical of indicas without the drowsiness, making the strain great for daytime use. We recommend this one as a shareable contribution to any 420-friendly gathering—it’s also on our list of the Top 100 Must-Try Strains, meaning it will be a particularly popular addition to any event with open cannabis consumption.\n\nOrange Bud\nStrain type: Hybrid\nBest for: Hosting.\nMatching plenty of social energy with a dose of subtle relaxation, this strain is perfect for gatherings where you’re in charge and want to stay upbeat and level-headed. First bred in 1980s by Dutch Passion, Orange Bud is a combination of two members of the 100% Skunk family. With bright orange hairs coating the surface, it showcases scents of orange and nectarine.\nBlueberry Headband\nStrain type: Hybrid\nBest for: Parties you don’t want to attend.\nSeveral renditions of the Blueberry Headband hybrid are known to exist, but the original Blueberry Headband from NorCal’s Emerald Triangle Seeds is the most well-known. It’s a 50/50 indica-sativa hybrid that smells of diesel, berries and pepper, and it produces a perfectly balanced high with a nice cerebral rush and relaxing body effects. This is great for staying sufficiently present while mentally floating high above any social event you wish you didn’t have to attend (think work parties, baby showers, and so on).\nBanana Kush\nStrain type: Hybrid\nBest for: Potlucks.\nThis legendary West Coast strain crosses Ghost OG and Skunk Haze to create an indica-dominant hybrid that tastes and smells like a bushel of fresh bananas (and will whet your appetite if there’s food around). Although it leans towards an indica genetically, the effects are balanced by the Haze’s mellow sativa buzz that provides a relaxed sense of euphoria. Banana Kush also help its consumers remain talkative in social settings.\n\nDurban Cookies\nStrain type: Sativa\nBest for: Loud parties.\nDurban Cookies is the Durban Poison-dominant phenotype of GSC. Known for its invigorating mental energy and body buzz, Durban Cookies offers a more energizing experience, making this sativa-dominant strain a top choice throughout the day and into the evening, particularly if you’re headed to a high-energy event where you’ll be surrounded by music, people, and movement.\nBubblegum Kush\nStrain type: Indica\nBest for: Low-key get-togethers.\nThis strain is for laid-back social situations; it’ll leave you relaxed and comfy on any given couch, but also chatty and ready to hang with whoever sits down next to you. An 80% indica strain from Bulldog Seeds in the Netherlands, Bubblegum Kush is a cross between Bubble Gum and an undisclosed Kush, and has a satisfyingly sour smell and flavor.\nStrawberry\nStrain type: Sativa\nBest for: Being a plus-one.\nOriginally bred in the Netherlands, Strawberry is a mostly sativa cannabis strain with a pungent fruity scent and uplifting effects. Consumers prone to anxiety choose Strawberry for its stress-relieving qualities without the jarring paranoia common among high-THC strains (which makes it great for small talk with people you don’t know). Comfortable and relaxing, Strawberry brings with it a hearty dose of physical and mental ease.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/22124021/best-cannabis-strains-for-parties.jpg",
            "title": "The 13 Best Cannabis Strains for Parties",
            "urlslug": "/news/strains-products/the-13-best-cannabis-strains-for-parties"
        },
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1506976615000)/",
            "id": "contentitems-43694",
            "text": "Dating back to the 18th century, bluegrass sits at the intersection of traditional Scottish, Irish, and English folk music. Settlers brought their ballads, dance music, and fiddles to the Appalachian Mountains in North America, where their individual melodies mixed together to create an uplifting sound that has been passed down from musician to musician for generations.\n\nBluegrass may be a cousin to folk, traditional, and Americana music, but at its heart it exists as one of the most distinct and noteworthy individual genres of our time. It is music that weaves stories and moves the soul—it’s a rich and colorful genre that can excite and invigorate the senses, especially with a little cannabis nearby.\nBelow, explore five bluegrass bands with your favorite pre-roll in hand—preferably on a rocking chair, soaking in the soulful tunes.\nLaws of Gravity by The Infamous Stringdusters\n\nStrain Pairing Recommendation: Tangilope\nThe Infamous Stringdusters’ latest album, Laws of Gravity, wastes no time as it bursts into life with their first track, “Freedom,” instantly immersing listeners in a rich and invigorating sound. The album, released this year, packs a powerful punch that is vibrant, complex and uniquely its own.\nLaws of Gravity manages to encapsulate the traditions of bluegrass while merging it with modern grooves and instrumentation. The bright movements of Jeremy Garrett’s fiddle and Chris Pandolfi’s banjo sing across the soundscape of bass, dobro, and guitar for a symphony that shines with and without the engaging and lively lyrics.\nWhen the lyrics do fade away, listeners enjoy the intricate improvisational jamming that is a hallmark of The Infamous Stringdusters. Laws of Gravity has a life of its own that proves once again why the band continues to be a resounding favorite across the genre’s fanbase.\nThe Muscle Shoals Recordings by The Steeldrivers\n\nStrain Pairing Recommendation: Blueberry Headband\nThe Muscle Shoals Recordings starts with light, happy banjo on the track “Long Way Down,” setting the tone for an album that combines the essence of bluegrass with rich complexity. Gary Nichols’ distinct and powerful voice, often accompanied by beautiful backing vocals, cruises effortlessly across the instrumentation and inspires with its authenticity and depth.\nThe Steeldrivers feature banjo, mandolin, guitar, bass, and fiddle for a full and delightfully classic bluegrass feel. The Muscle Shoals Recordings, produced in 2015, is the band’s fourth album and earned them a Grammy in the Best Bluegrass category.\nFrom the first track to the last, this is a spirited album that uplifts the mind and moves the body with energetic sound.\n\nThief by Keller & The Keels\n\nStrain Pairing Recommendation: Lodi Dodi\nWith a distinctly joyful beat, Thief picks you up and whisks you off into a dance of folky bluegrass with Keller William’s playful vocals leading the way. Williams is joined by Jenny Keel on upright bass and flat picker Larry Keel. Together, the three bring a decidedly full sound to their latest acoustic album.\nKeller & The Keels have never shied away from creative covers, and Thief, released in 2010, is no exception. Unlike their first album, Grass (released in 2006), Thief does not feature any original songs, focusing solely on covers. The album’s title is an ode to this decision.\nBluegrass versions of Amy Winehouse’s “Rehab” and Marcy Playground’s “Sex and Candy” are among the familiar but undeniably fresh covers. The tracks allow the listener to immediately jump in and sing along while still being immersed in new tunes and feelings.\nWilliams’ knack for composing solo music lends expertise to the composition of his trio, and as such, Thief has an intricacy that is impressive for such a small acoustic group.\nFriends of Fall by Crooked Still\n\nStrain Pairing Recommendation: Lemon Drop\nCrooked Still offers a unique bluegrass element that is light, airy, and melodic. Lead singer Aoife O’Donovan’s voice carries across the backdrop of banjo, bass, cello, and fiddle like a shooting star.\nFriends of Fall, released in 2011, brings an ethereal beauty and complexity to the genre of bluegrass. Songs such as “Pretty Bird” will stir emotion, while “It’ll End Too Soon” inspires and invigorates. Often described as ‘progressive bluegrass’ due to innovative acoustics, Crooked Still’s high-energy sound encourages engagement from the first note to the last thanks to its unique instrumentation.\nFriends of Fall is refreshing and wholly uplifting, carrying the spirit of bluegrass as it soars to new and delightful heights.\n\nLove. Ain’t Love  by Yonder Mountain String Band\n\nStrain Pairing Recommendation: Afgooey\nLove. Ain’t Love, released this year, is the latest from Yonder Mountain String Band, encompassing a full thirteen tracks of rich and engaging rhythms that will keep you on your toes.\nFeaturing five band members on banjo, bass, fiddle, guitar, and mandolin, Yonder Mountain String Band also has the distinction of all five members acting as vocalists, which allows them to create beautifully layered and rich harmonies.\nOn the other hand, Love. Ain’t Love does not shy away from fully instrumental tracks, such as “Fall Outta Line,” which showcases the band’s innovation in its tune. This ability to embrace the full merits of their instrumentation has won YMSB fans across various genres, including those in the jam band scene. When listening to Love. Ain’t Love, one can get lost in the music as it paints stories with and without lyrics.\nLove. Ain’t Love provides a playful, energetic, and creative soundscape. The passion and vibrancy in every note of the album act as joyful reminders that Yonder Mountain String Band continues to inspire and be inspired by bluegrass, even 18 years after the release of their first album.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/10/02124702/bluegrass-albums-while-high.jpg",
            "title": "5 Bold Bluegrass Albums to Listen to While High",
            "urlslug": "/news/lifestyle/bluegrass-albums-listen-high"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 33.648148148148145
        },
        {
            "name": "Migraines",
            "score": 14.62824074074074
        },
        {
            "name": "ADD/ADHD",
            "score": 12.020370370370369
        },
        {
            "name": "PTSD",
            "score": 9.991203703703702
        },
        {
            "name": "Bipolar Disorder",
            "score": 9.47662037037037
        }
    ],
    "description": "<p>Several renditions of the Blueberry Headband hybrid are known to exist, which is unsurprising considering the popularity of its parent strains, but the original Blueberry Headband from NorCal&rsquo;s Emerald Triangle Seeds is the most documented version. Rather than a simple cross of <a href=\"https://www.leafly.com/hybrid/headband\">Headband</a> and <a href=\"https://www.leafly.com/indica/blueberry\">Blueberry</a>, the ETS version combines &lsquo;76 Blueberry, <a href=\"https://www.leafly.com/indica/emerald-og\">Emerald OG Kush</a>, Cali Sour D, and <a href=\"https://www.leafly.com/indica/pre-98-bubba-kush\">Pre-98 Bubba Kush</a> into a 50/50 indica-sativa hybrid that smells of diesel, berries and pepper. Growers can expect medium-tall, bushy plants with huge yields of highly resinous colas. &nbsp;Blueberry Headband produces a hybrid-type high, with a nice cerebral rush and relaxing body effect. &nbsp;</p>\n",
    "descriptionPlain": "Several renditions of the Blueberry Headband hybrid are known to exist, which is unsurprising considering the popularity of its parent strains, but the original Blueberry Headband from NorCal&rsquo;s Emerald Triangle Seeds is the most documented version. Rather than a simple cross of Headband and Blueberry, the ETS version combines &lsquo;76 Blueberry, Emerald OG Kush, Cali Sour D, and Pre-98 Bubba Kush into a 50/50 indica-sativa hybrid that smells of diesel, berries and pepper. Growers can expect medium-tall, bushy plants with huge yields of highly resinous colas. &nbsp;Blueberry Headband produces a hybrid-type high, with a nice cerebral rush and relaxing body effect. &nbsp;\n",
    "effects": [
        {
            "name": "Euphoric",
            "score": 88.72916666666666
        },
        {
            "name": "Happy",
            "score": 72.46111111111111
        },
        {
            "name": "Relaxed",
            "score": 56.49166666666666
        },
        {
            "name": "Tingly",
            "score": 55.03564814814815
        },
        {
            "name": "Energetic",
            "score": 47.72453703703704
        }
    ],
    "flavors": [
        {
            "name": "Blueberry",
            "score": 43.78055555555555
        },
        {
            "name": "Berry",
            "score": 20.430324074074072
        },
        {
            "name": "Flowery",
            "score": 14.45486111111111
        },
        {
            "name": "Sweet",
            "score": 11.924537037037036
        },
        {
            "name": "Earthy",
            "score": 9.676620370370369
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1416469,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Blueberry Headband is my strain of choice. I have crippling anxiety and OCD and blueberry headband completely takes away my pains and puts me in a dreamy, pleasurable state of euphoria and mental clarity. For once, I'm not over-thinking and over-analyzing everything. \n\nBlueberry Headband is a full body high. Your entire body relaxes and feels at peace. Sometimes my muscles twitch when I'm super stoned on this, but it isn't bothersome. Everything is insanely hilarious; I'm constantly fighting back giggle-fits. And any pain, mental or physical, is completely dulled by this powerful but heavenly strain, dominant in Indica but with just the right among of Sativa. It's perfect! Too bad it's harder to find in my area.",
            "username": "bubblegumbitch"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png",
            "id": 1642101,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Most munchies I’ve ever had smoking, feet and legs feel insane especially when running. Strong body and mental high. Friend got super paranoid though.",
            "username": "Sean85837"
        }
    ],
    "id": 392,
    "name": "Blueberry Headband",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 46.860416666666666
        },
        {
            "name": "Anxious",
            "score": 31.72546296296296
        },
        {
            "name": "Headache",
            "score": 27.37384259259259
        },
        {
            "name": "Dry Eyes",
            "score": 11.85787037037037
        },
        {
            "name": "Dizzy",
            "score": 8.09537037037037
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/blueberry",
            "category": "Indica",
            "name": "Blueberry",
            "permalink": "https://mobileapi.leafly.com/indica/blueberry",
            "slug": "blueberry",
            "subtitle": null,
            "symbol": "Bry"
        },
        {
            "applink": "leafly://strain/emerald-og",
            "category": "Indica",
            "name": "Emerald OG",
            "permalink": "https://mobileapi.leafly.com/indica/emerald-og",
            "slug": "emerald-og",
            "subtitle": null,
            "symbol": "Emd"
        },
        {
            "applink": "leafly://strain/pre-98-bubba-kush",
            "category": "Indica",
            "name": "Pre-98 Bubba Kush",
            "permalink": "https://mobileapi.leafly.com/indica/pre-98-bubba-kush",
            "slug": "pre-98-bubba-kush",
            "subtitle": null,
            "symbol": "P98"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/blueberry-headband",
    "photoTotalCount": 85,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003541/b/blueberry-headband__primary_f4ee.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-headband_100x100_a641.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/671756/b/blueberry-headband__primary_0104.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-headband_100x100_f82b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/670733/b/blueberry-headband__primary_50b3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-headband_100x100_ae3c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/669547/b/blueberry-headband__primary_5fed.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-headband_100x100_ca64.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/667182/b/blueberry-headband__primary_f720.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-headband_100x100_d6c8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/637838/b/blueberry-headband__primary_dafa.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-headband_100x100_0712.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Spokane, WA",
        "Seattle, WA",
        "Portland, OR",
        "Aurora, CO",
        "Eugene, OR",
        "Salem, OR",
        "Springfield, OR",
        "Bellingham, WA",
        "Everett, WA"
    ],
    "rating": 4.3,
    "relatedStrains": [],
    "reviewCount": 320,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "blueberry-headband",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.303125/240",
    "subtitle": null,
    "symbol": "Bh",
    "symptoms": [
        {
            "name": "Stress",
            "score": 47.96967592592593
        },
        {
            "name": "Depression",
            "score": 41.54884259259259
        },
        {
            "name": "Pain",
            "score": 31.978935185185186
        },
        {
            "name": "Headaches",
            "score": 27.74976851851852
        },
        {
            "name": "Insomnia",
            "score": 20.16111111111111
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
