{"sl_translate":"description,descriptionPlain,category","id":72946,"slug":"sunset-sherbert","name":"Sunset Sherbet","subtitle":null,"symbol":"Sun","category":"Hybrid","description":"\u003cp\u003eHeir to the \u003ca href=\"http://www.leafly.com/hybrid/girl-scout-cookie\"\u003eGSC (f.k.a. Girl Scout Cookies)\u003c/a\u003e throne is Sunset Sherbet (or Sunset\u0026nbsp;Sherbert), an indica-leaning \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e with intoxicatingly potent effects. Sunset Sherbet inherits the genetic lineage of its GSC parent, whose ancestors include the famed \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003eOG Kush\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/indica/cherry-pie\"\u003eCherry Pie\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/sativa/durban-poison\"\u003eDurban Poison\u003c/a\u003e. Crossed with an \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e known as Pink Panties, Sunset Sherbet exhibits powerful full-body effects elevated by a jolt of cerebral \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergy\u003c/a\u003e. A complex aroma colors Sunset Sherbet with notes of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-skunk\"\u003eskunky\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-citrus\"\u003ecitrus\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-berry\"\u003eberry\u003c/a\u003e, and that candy-like smell redolent of its GSC parent. \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003eStress\u003c/a\u003e, tension, and sour moods melt away with the carefree mindset and physical \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003erelaxation\u003c/a\u003e that comes with this rich hybrid.\u003c/p\u003e\n","descriptionPlain":"Heir to the GSC (f.k.a. Girl Scout Cookies) throne is Sunset Sherbet (or Sunset\u0026nbsp;Sherbert), an indica-leaning hybrid with intoxicatingly potent effects. Sunset Sherbet inherits the genetic lineage of its GSC parent, whose ancestors include the famed OG Kush, Cherry Pie, and Durban Poison. Crossed with an indica known as Pink Panties, Sunset Sherbet exhibits powerful full-body effects elevated by a jolt of cerebral energy. A complex aroma colors Sunset Sherbet with notes of skunky citrus, sweet berry, and that candy-like smell redolent of its GSC parent. Stress, tension, and sour moods melt away with the carefree mindset and physical relaxation that comes with this rich hybrid.\n","aka":"Sunset Sherbert, Sherbert","rating":4.61,"highlightedReviews":[{"id":1418969,"username":"gmenez88","text":"It smells as if heaven cracked open its Mason jars and said enjoy. fruity sweet bliss in a bud. amazing body buzz with a soaring sativa cerebral blast. one of my new favorites and hope it stays around for years to come ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1643314,"username":"BrenikCat","text":"Great for relaxing or working. Good body high, sedative but not tiring. Just about the perfect strain, one of my favorites, along with Blue Dream and Blackberry Kush.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YF4IWg6ljZxpQvuxRnRMjMBsgkk=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fUss3hqISoaDEdtujGcQY_30529CC4-6515-4DB9-B658-4EFE1C0621EE.jpeg"}],"relatedStrains":[],"articles":[{"id":"contentitems-35762","title":"3 Strains, Products, and Pieces of Advice for Viewing the Total Solar Eclipse","author":"Brett Konen","category":null,"date":"\/Date(1501292783000)\/","text":"Summer 2017’s total solar eclipse is America’s celestial event of the century. The first eclipse to fully cross the contiguous United States since 1918, it will mobilize millions of travelers on (and to) the North American continent. Happily, the eclipse has decided to include a rec-legal state in its path of totality.\nAs many as a million visitors are expected in Oregon alone on August 21st, and a good many of them will be marveling at the solar phenomenon in an elevated state of mind. The following are three strains and three products we recommend for viewing the event, as well as three pieces of advice for getting high while the world goes dark.\n\nBest Cannabis Strains for Viewing the Eclipse\nSunset Sherbet \nThe name alone brings this one to mind right away, but its effervescent cerebral effects and feel-good full body high are what make this strain a perfect eclipse-viewing pick. The indica-leaning hybrid is potent but won’t put you under, and offers a jolt of imaginative energy that will have you in awe over everything going on up above.\nMt. Hood Magic\nAn Oregon-born hybrid cross between Durban Poison and Northern Lights #5, Mt. Hood Magic can be found in Portland, Seaside, and Bend, and begets a bubbly, euphoric, social high and a delectable dose of citrusy flavor. If you want to get extra-local, this is your pick—just be sure to check whether the dispensary you’re hitting will have it, as it’s rarer than either Sunset Sherbet or Super Silver Haze.\nSuper Silver Haze\nThis earthy sativa is the perfect way to fully appreciate the natural beauty of the eclipse—as a Haze, it’ll leave you feeling happy yet relaxed and fully at peace with the world around you. Where Mt. Hood Magic can be tricky to track down, Super Silver Haze products and pre-rolls are everywhere, so you can definitely find this strain no matter where you end up watching the event.\n\nBest Cannabis Products for the Eclipse\nD!PPER by Dipstick Vapes\nYou’ll be camped out ready to watch the eclipse for awhile (it starts coming on around 9:00 a.m. and reaches totality right about 10:20), so you’ll want something portable with a solid battery life. This concentrate vape is the way to go: It includes a unique Vapor Tip Atomizer attachment for actual dabs, or a Quartz Crystal Atomizer that can be loaded in a more traditional manner. Remember to clean it out thoroughly if you’ll be flying home—no transporting cannabis across state lines.\nWana Jewels\nThere’s a good chance you’ll be near a ton of people while you’re watching, so be considerate with smoke, vapor, and smells, particularly if you’re around families. Edibles are the most discreet way to do it. We recommend low-dose edibles so you can slowly tailor your high to the perfect level as the eclipse comes on. Wana Jewels are delicious and ideal for this kind of dosing, as they contain less than 2mg per candy.\nMary’s Medicinals Transdermal Gel Pen\nThis purchase is an investment in comfort—you’re going to be craning your neck for hours watching the sun. A transdermal topical is the perfect thing to have on hand: Rub it between your wrists for a subtle mental buzz, or massage a few pumps into your neck for localized relief and minimal psychoactive effects.\n\nAdvice for Watching the Eclipse While High\nBe wary of dry eyes.\nSmoking or vaping in particular can cause them, which won’t make for an enjoyable viewing experience. Solution: Stay hydrated, bring eye drops, and if you want to be extra-careful, close your eyes when you exhale a lungful of smoke or vapor. And speaking of eyes, don’t forget your shades—meaning eclipse viewing glasses, which you’ll need to safely look at the sky (no, regular sunglasses won’t work).\nPack a survival kit.\nInclude munchies, water, eye drops, sunscreen, an extra lighter, those eclipse viewing glasses, a camera or your phone, a blanket, a pillow—and don’t forget your cannabis. It’s far better to be over-prepared than under-prepared. Speaking of preparedness, set multiple alarms on the morning of the eclipse, and stake out your preferred viewing location in advance.\nMake a trip of it.\nWant to spend more than a day in Oregon? Good plan, because trying to arrive at a viewing location anywhere close to Monday morning is going to be your worst nightmare in terms of traffic (we’re talking standstills, not a crawl). What to do: Check out our complete Oregon cannabis road trip itinerary, which zig-zags between the state’s cannabis hubs before ending up in the path of totality in time for the eclipse. That way, if untimely clouds ruin your viewing plans, you’ll still have had a fantastic time in this beautiful state.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/28184319/solar-eclipse-guide.jpg","urlslug":"/news/strains-products/3-strains-products-and-pieces-of-advice-for-viewing-the-total-solar-eclipse"},{"id":"contentitems-24013","title":"10 Strains You Might Not Know Are Siblings","author":"Lisa Rough","category":null,"date":"\/Date(1491865568000)\/","text":"In honor of National Siblings Day, we decided to take a look at some of the most popular strains in cannabis and their offspring. There are quite a few strains that share genetics, but it just might surprise you to find out which strains are siblings.\n  Granddaddy Purple\nGDP is one of the oldest and most well-known strains. Let’s check out the kiddos!\nCandyland\nThis sativa-dominant hybrid is an award-winning strain from GDP and Bay Platinum Cookies. Its sativa side stems from the Platinum Cookies parent, which was created from OG Kush, Durban Poison, and a third unknown strain. Candyland is a rare sativa known for its relaxing relief from muscle aches with the added benefit of uplifting and stimulating effects.\nCherry Pie\nCherry Pie is renowned for its strong effects and high potency. The offspring of two cannabis heavyweights–GDP and Durban Poison–Cherry Pie has a fruity flavor and a high that can last several hours. Although there are claims that this strain tastes like real cherry pie, others compare the flavor to berries, much like the flavor of GDP. This sweet strain will melt away your stress and bring on a strong craving for your favorite munchies!\n\n  Blueberry\nBlueberry’s fruity genetics provide the backdrop for some of the most common and delicious strains available.\nBlue Dream\nThe “Blue” in this sativa-dominant celebrity strain comes from the Blue in Blueberry, while the “Dream” comes from another champion strain, Haze, a dreamy and euphoric sativa. Blue Dream is easily the most popular strain on Leafly, and its mild, uplifting effects make it the perfect strain for novice smokers.\nBerry White\nBerry White may be the offspring of two legendary strains, but this relaxing indica is famous in its own right for its balanced effects and a euphoric escape from stress and anxiety. With parentage from Blueberry and the epic hybrid White Widow, Berry White tends to taste like overripe sour blueberries and offers such mind-bending effects that you may forget you have arms.\n\n  Trainwreck\nA freight train of a hybrid strain, Trainwreck is sure to knock your socks off. What about its offspring?\nCasey Jones\nA little history lesson for you: Casey Jones is the name of a famous train engineer who was killed in a train wreck in 1900. However, for those of you who were raised on Saturday morning 90s cartoons, the name may sound more familiar as the hockey-masked vigilante from Teenage Mutant Ninja Turtles. Either way, this earthy sativa combines Oriental Express (an offshoot of Trainwreck and Thai) with East Coast Sour Diesel to create a power-packed punch that’s great for inspiring creativity.\nPineapple Express\nAh yes, everyone’s favorite movie-turned-famous-strain is known for its fruity sweet undertones. But did you know that it has roots in the speedy hybrid, Trainwreck? Pineapple Express is more than just a famous name, it combines Trainwreck and Hawaiian for a long-lasting energetic buzz and a sweet mango and pineapple citrus flavor that makes for one golden afternoon.\n\n  GSC (f.k.a Girl Scout Cookies)\nGSC (f.k.a Girl Scout Cookies) is the Genghis Khan of genetic stomp-arounds–these days, it seems like there are Cookies genetics in every new strain.\nSunset Sherbet\nSunset Sherbet is the heir apparent to the GSC throne. It’s known to have the heady, cerebral effects of GSC with an intoxicating boost from a heavy indica known as Pink Panties. Sunset Sherbet is so nicknamed due to its sweet, sherbet-like flavor, and tends to lean more heavily towards its indica roots than the standard GSC, so be prepared for a calm, relaxing high.\nMoon Cookies\nThis intergalactic herb crosses GSC (f.k.a Girl Scout Cookies) with another phenotype of itself to create a complex woody, earthy scent with some strong, heavy indica-leaning relaxation. These buds are hard, dense, resinous rocks that taste like cookie dough and will send you soaring up to the stars. But don’t consume too much Moon Cookies or you just might get lost in space.\n\n  Jack Herer\nOne of the most notorious cannabis activists spawned this world-renowned sativa, and Jack Herer‘s litany of offspring continues to expand with no end in sight.\nXJ-13\nWhat sounds like a top-secret government experiment is actually one of the most delightfully uplifting hybrids you can find. XJ-13 combines Jack Herer’s warm, fuzzy sativa genetics with the dreamy high of G13 Haze to create a stimulating and euphoric experience. It’s not heavy enough to make you feel asleep, but not stimulating enough to cause paranoia, giving consumers a perfectly balanced buzz that is high, happy, and carefree.\nDragon’s Breath\nThis sativa-dominant hybrid was born of two heavyweight strains, Jack Herer and Northern Lights. The name Dragon’s Breath is a reference to the spicy flavor and aroma accompanied by this hazy strain, but it won’t burn you out. Instead, you can expect a clear-headed, energetic, productive high. But be forewarned–too much of the Dragon may leave you feeling a bit paranoid.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/04/10154425/national-sibling-day.jpg","urlslug":"/news/strains-products/10-strains-might-not-know-siblings"}],"reviewCount":836,"flavors":[{"name":"Sweet","score":38.306962471286234},{"name":"Citrus","score":26.807276032638566},{"name":"Tropical","score":18.707105511633479},{"name":"Earthy","score":17.082346848179935},{"name":"Pungent","score":13.180551445200749}],"effects":[{"name":"Relaxed","score":78.055602531039057},{"name":"Happy","score":61.749179103425924},{"name":"Euphoric","score":54.312455079693905},{"name":"Uplifted","score":44.640567088036747},{"name":"Creative","score":36.001352893924654}],"symptoms":[{"name":"Stress","score":40.607093532885187},{"name":"Pain","score":31.967368480390085},{"name":"Depression","score":31.055362956073225},{"name":"Fatigue","score":18.765519525359714},{"name":"Insomnia","score":16.828467847630321}],"conditions":[{"name":"Anxiety","score":29.627302385884811},{"name":"Bipolar Disorder","score":13.812412801758763},{"name":"PTSD","score":13.811849095956822},{"name":"Arthritis","score":11.191691681111628},{"name":"ADD/ADHD","score":9.82424710043828}],"negatives":[{"name":"Dry Mouth","score":28.487066475006696},{"name":"Dry Eyes","score":13.86647571132626},{"name":"Paranoid","score":2.9297904423681285},{"name":"Anxious","score":2.8167498132724531},{"name":"Dizzy","score":2.6048492791612059}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-sherbet_100x100_1f5d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003499/b/sunset-sherbet__primary_a7ea.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-sherbet_100x100_5376.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003137/b/sunset-sherbet__primary_7739.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-sherbet_100x100_467a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003134/b/sunset-sherbet__primary_f151.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-sherbet_100x100_ca8f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003037/b/sunset-sherbet__primary_a806.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-sherbet_100x100_ae8a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002442/b/sunset-sherbet__primary_a1af.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-sherbet_100x100_3331.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000782/b/sunset-sherbet__primary_eeb2.jpg"}],"photoTotalCount":199,"popularCities":["Portland, OR","Los Angeles, CA","Seattle, WA","Eugene, OR","Phoenix, AZ","San Francisco, CA","Detroit, MI","Spokane, WA","San Diego, CA","Berkeley, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/sunset-sherbert","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.61244019138756/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"GSC","subtitle":null,"slug":"gsc","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/gsc","symbol":"Gsc","applink":"leafly://strain/gsc"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":56,"outdoorFinish":null,"height":"Medium","averageYield":"Medium","environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":72946,"slug":"sunset-sherbert","name":"Sunset Sherbet","subtitle":null,"symbol":"Sun","category":"Hybrid","description":"\u003cp\u003eHeir to the \u003ca href=\"http://www.leafly.com/hybrid/girl-scout-cookie\"\u003eGSC (f.k.a. Girl Scout Cookies)\u003c/a\u003e throne is Sunset Sherbet (or Sunset\u0026nbsp;Sherbert), an indica-leaning \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e with intoxicatingly potent effects. Sunset Sherbet inherits the genetic lineage of its GSC parent, whose ancestors include the famed \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003eOG Kush\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/indica/cherry-pie\"\u003eCherry Pie\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/sativa/durban-poison\"\u003eDurban Poison\u003c/a\u003e. Crossed with an \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e known as Pink Panties, Sunset Sherbet exhibits powerful full-body effects elevated by a jolt of cerebral \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergy\u003c/a\u003e. A complex aroma colors Sunset Sherbet with notes of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-skunk\"\u003eskunky\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-citrus\"\u003ecitrus\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-berry\"\u003eberry\u003c/a\u003e, and that candy-like smell redolent of its GSC parent. \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003eStress\u003c/a\u003e, tension, and sour moods melt away with the carefree mindset and physical \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003erelaxation\u003c/a\u003e that comes with this rich hybrid.\u003c/p\u003e\n","descriptionPlain":"Heir to the GSC (f.k.a. Girl Scout Cookies) throne is Sunset Sherbet (or Sunset\u0026nbsp;Sherbert), an indica-leaning hybrid with intoxicatingly potent effects. Sunset Sherbet inherits the genetic lineage of its GSC parent, whose ancestors include the famed OG Kush, Cherry Pie, and Durban Poison. Crossed with an indica known as Pink Panties, Sunset Sherbet exhibits powerful full-body effects elevated by a jolt of cerebral energy. A complex aroma colors Sunset Sherbet with notes of skunky citrus, sweet berry, and that candy-like smell redolent of its GSC parent. Stress, tension, and sour moods melt away with the carefree mindset and physical relaxation that comes with this rich hybrid.\n","aka":"Sunset Sherbert, Sherbert","rating":4.61,"highlightedReviews":[{"id":1418969,"username":"gmenez88","text":"It smells as if heaven cracked open its Mason jars and said enjoy. fruity sweet bliss in a bud. amazing body buzz with a soaring sativa cerebral blast. one of my new favorites and hope it stays around for years to come ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1643314,"username":"BrenikCat","text":"Great for relaxing or working. Good body high, sedative but not tiring. Just about the perfect strain, one of my favorites, along with Blue Dream and Blackberry Kush.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YF4IWg6ljZxpQvuxRnRMjMBsgkk=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fUss3hqISoaDEdtujGcQY_30529CC4-6515-4DB9-B658-4EFE1C0621EE.jpeg"}],"relatedStrains":[],"articles":[{"id":"contentitems-35762","title":"3 Strains, Products, and Pieces of Advice for Viewing the Total Solar Eclipse","author":"Brett Konen","category":null,"date":"\/Date(1501292783000)\/","text":"Summer 2017’s total solar eclipse is America’s celestial event of the century. The first eclipse to fully cross the contiguous United States since 1918, it will mobilize millions of travelers on (and to) the North American continent. Happily, the eclipse has decided to include a rec-legal state in its path of totality.\nAs many as a million visitors are expected in Oregon alone on August 21st, and a good many of them will be marveling at the solar phenomenon in an elevated state of mind. The following are three strains and three products we recommend for viewing the event, as well as three pieces of advice for getting high while the world goes dark.\n\nBest Cannabis Strains for Viewing the Eclipse\nSunset Sherbet \nThe name alone brings this one to mind right away, but its effervescent cerebral effects and feel-good full body high are what make this strain a perfect eclipse-viewing pick. The indica-leaning hybrid is potent but won’t put you under, and offers a jolt of imaginative energy that will have you in awe over everything going on up above.\nMt. Hood Magic\nAn Oregon-born hybrid cross between Durban Poison and Northern Lights #5, Mt. Hood Magic can be found in Portland, Seaside, and Bend, and begets a bubbly, euphoric, social high and a delectable dose of citrusy flavor. If you want to get extra-local, this is your pick—just be sure to check whether the dispensary you’re hitting will have it, as it’s rarer than either Sunset Sherbet or Super Silver Haze.\nSuper Silver Haze\nThis earthy sativa is the perfect way to fully appreciate the natural beauty of the eclipse—as a Haze, it’ll leave you feeling happy yet relaxed and fully at peace with the world around you. Where Mt. Hood Magic can be tricky to track down, Super Silver Haze products and pre-rolls are everywhere, so you can definitely find this strain no matter where you end up watching the event.\n\nBest Cannabis Products for the Eclipse\nD!PPER by Dipstick Vapes\nYou’ll be camped out ready to watch the eclipse for awhile (it starts coming on around 9:00 a.m. and reaches totality right about 10:20), so you’ll want something portable with a solid battery life. This concentrate vape is the way to go: It includes a unique Vapor Tip Atomizer attachment for actual dabs, or a Quartz Crystal Atomizer that can be loaded in a more traditional manner. Remember to clean it out thoroughly if you’ll be flying home—no transporting cannabis across state lines.\nWana Jewels\nThere’s a good chance you’ll be near a ton of people while you’re watching, so be considerate with smoke, vapor, and smells, particularly if you’re around families. Edibles are the most discreet way to do it. We recommend low-dose edibles so you can slowly tailor your high to the perfect level as the eclipse comes on. Wana Jewels are delicious and ideal for this kind of dosing, as they contain less than 2mg per candy.\nMary’s Medicinals Transdermal Gel Pen\nThis purchase is an investment in comfort—you’re going to be craning your neck for hours watching the sun. A transdermal topical is the perfect thing to have on hand: Rub it between your wrists for a subtle mental buzz, or massage a few pumps into your neck for localized relief and minimal psychoactive effects.\n\nAdvice for Watching the Eclipse While High\nBe wary of dry eyes.\nSmoking or vaping in particular can cause them, which won’t make for an enjoyable viewing experience. Solution: Stay hydrated, bring eye drops, and if you want to be extra-careful, close your eyes when you exhale a lungful of smoke or vapor. And speaking of eyes, don’t forget your shades—meaning eclipse viewing glasses, which you’ll need to safely look at the sky (no, regular sunglasses won’t work).\nPack a survival kit.\nInclude munchies, water, eye drops, sunscreen, an extra lighter, those eclipse viewing glasses, a camera or your phone, a blanket, a pillow—and don’t forget your cannabis. It’s far better to be over-prepared than under-prepared. Speaking of preparedness, set multiple alarms on the morning of the eclipse, and stake out your preferred viewing location in advance.\nMake a trip of it.\nWant to spend more than a day in Oregon? Good plan, because trying to arrive at a viewing location anywhere close to Monday morning is going to be your worst nightmare in terms of traffic (we’re talking standstills, not a crawl). What to do: Check out our complete Oregon cannabis road trip itinerary, which zig-zags between the state’s cannabis hubs before ending up in the path of totality in time for the eclipse. That way, if untimely clouds ruin your viewing plans, you’ll still have had a fantastic time in this beautiful state.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/28184319/solar-eclipse-guide.jpg","urlslug":"/news/strains-products/3-strains-products-and-pieces-of-advice-for-viewing-the-total-solar-eclipse"},{"id":"contentitems-24013","title":"10 Strains You Might Not Know Are Siblings","author":"Lisa Rough","category":null,"date":"\/Date(1491865568000)\/","text":"In honor of National Siblings Day, we decided to take a look at some of the most popular strains in cannabis and their offspring. There are quite a few strains that share genetics, but it just might surprise you to find out which strains are siblings.\n  Granddaddy Purple\nGDP is one of the oldest and most well-known strains. Let’s check out the kiddos!\nCandyland\nThis sativa-dominant hybrid is an award-winning strain from GDP and Bay Platinum Cookies. Its sativa side stems from the Platinum Cookies parent, which was created from OG Kush, Durban Poison, and a third unknown strain. Candyland is a rare sativa known for its relaxing relief from muscle aches with the added benefit of uplifting and stimulating effects.\nCherry Pie\nCherry Pie is renowned for its strong effects and high potency. The offspring of two cannabis heavyweights–GDP and Durban Poison–Cherry Pie has a fruity flavor and a high that can last several hours. Although there are claims that this strain tastes like real cherry pie, others compare the flavor to berries, much like the flavor of GDP. This sweet strain will melt away your stress and bring on a strong craving for your favorite munchies!\n\n  Blueberry\nBlueberry’s fruity genetics provide the backdrop for some of the most common and delicious strains available.\nBlue Dream\nThe “Blue” in this sativa-dominant celebrity strain comes from the Blue in Blueberry, while the “Dream” comes from another champion strain, Haze, a dreamy and euphoric sativa. Blue Dream is easily the most popular strain on Leafly, and its mild, uplifting effects make it the perfect strain for novice smokers.\nBerry White\nBerry White may be the offspring of two legendary strains, but this relaxing indica is famous in its own right for its balanced effects and a euphoric escape from stress and anxiety. With parentage from Blueberry and the epic hybrid White Widow, Berry White tends to taste like overripe sour blueberries and offers such mind-bending effects that you may forget you have arms.\n\n  Trainwreck\nA freight train of a hybrid strain, Trainwreck is sure to knock your socks off. What about its offspring?\nCasey Jones\nA little history lesson for you: Casey Jones is the name of a famous train engineer who was killed in a train wreck in 1900. However, for those of you who were raised on Saturday morning 90s cartoons, the name may sound more familiar as the hockey-masked vigilante from Teenage Mutant Ninja Turtles. Either way, this earthy sativa combines Oriental Express (an offshoot of Trainwreck and Thai) with East Coast Sour Diesel to create a power-packed punch that’s great for inspiring creativity.\nPineapple Express\nAh yes, everyone’s favorite movie-turned-famous-strain is known for its fruity sweet undertones. But did you know that it has roots in the speedy hybrid, Trainwreck? Pineapple Express is more than just a famous name, it combines Trainwreck and Hawaiian for a long-lasting energetic buzz and a sweet mango and pineapple citrus flavor that makes for one golden afternoon.\n\n  GSC (f.k.a Girl Scout Cookies)\nGSC (f.k.a Girl Scout Cookies) is the Genghis Khan of genetic stomp-arounds–these days, it seems like there are Cookies genetics in every new strain.\nSunset Sherbet\nSunset Sherbet is the heir apparent to the GSC throne. It’s known to have the heady, cerebral effects of GSC with an intoxicating boost from a heavy indica known as Pink Panties. Sunset Sherbet is so nicknamed due to its sweet, sherbet-like flavor, and tends to lean more heavily towards its indica roots than the standard GSC, so be prepared for a calm, relaxing high.\nMoon Cookies\nThis intergalactic herb crosses GSC (f.k.a Girl Scout Cookies) with another phenotype of itself to create a complex woody, earthy scent with some strong, heavy indica-leaning relaxation. These buds are hard, dense, resinous rocks that taste like cookie dough and will send you soaring up to the stars. But don’t consume too much Moon Cookies or you just might get lost in space.\n\n  Jack Herer\nOne of the most notorious cannabis activists spawned this world-renowned sativa, and Jack Herer‘s litany of offspring continues to expand with no end in sight.\nXJ-13\nWhat sounds like a top-secret government experiment is actually one of the most delightfully uplifting hybrids you can find. XJ-13 combines Jack Herer’s warm, fuzzy sativa genetics with the dreamy high of G13 Haze to create a stimulating and euphoric experience. It’s not heavy enough to make you feel asleep, but not stimulating enough to cause paranoia, giving consumers a perfectly balanced buzz that is high, happy, and carefree.\nDragon’s Breath\nThis sativa-dominant hybrid was born of two heavyweight strains, Jack Herer and Northern Lights. The name Dragon’s Breath is a reference to the spicy flavor and aroma accompanied by this hazy strain, but it won’t burn you out. Instead, you can expect a clear-headed, energetic, productive high. But be forewarned–too much of the Dragon may leave you feeling a bit paranoid.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/04/10154425/national-sibling-day.jpg","urlslug":"/news/strains-products/10-strains-might-not-know-siblings"}],"reviewCount":836,"flavors":[{"name":"Sweet","score":38.306962471286234},{"name":"Citrus","score":26.807276032638566},{"name":"Tropical","score":18.707105511633479},{"name":"Earthy","score":17.082346848179935},{"name":"Pungent","score":13.180551445200749}],"effects":[{"name":"Relaxed","score":78.055602531039057},{"name":"Happy","score":61.749179103425924},{"name":"Euphoric","score":54.312455079693905},{"name":"Uplifted","score":44.640567088036747},{"name":"Creative","score":36.001352893924654}],"symptoms":[{"name":"Stress","score":40.607093532885187},{"name":"Pain","score":31.967368480390085},{"name":"Depression","score":31.055362956073225},{"name":"Fatigue","score":18.765519525359714},{"name":"Insomnia","score":16.828467847630321}],"conditions":[{"name":"Anxiety","score":29.627302385884811},{"name":"Bipolar Disorder","score":13.812412801758763},{"name":"PTSD","score":13.811849095956822},{"name":"Arthritis","score":11.191691681111628},{"name":"ADD/ADHD","score":9.82424710043828}],"negatives":[{"name":"Dry Mouth","score":28.487066475006696},{"name":"Dry Eyes","score":13.86647571132626},{"name":"Paranoid","score":2.9297904423681285},{"name":"Anxious","score":2.8167498132724531},{"name":"Dizzy","score":2.6048492791612059}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-sherbet_100x100_1f5d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003499/b/sunset-sherbet__primary_a7ea.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-sherbet_100x100_5376.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003137/b/sunset-sherbet__primary_7739.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-sherbet_100x100_467a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003134/b/sunset-sherbet__primary_f151.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-sherbet_100x100_ca8f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003037/b/sunset-sherbet__primary_a806.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-sherbet_100x100_ae8a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002442/b/sunset-sherbet__primary_a1af.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-sherbet_100x100_3331.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000782/b/sunset-sherbet__primary_eeb2.jpg"}],"photoTotalCount":199,"popularCities":["Portland, OR","Los Angeles, CA","Seattle, WA","Eugene, OR","Phoenix, AZ","San Francisco, CA","Detroit, MI","Spokane, WA","San Diego, CA","Berkeley, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/sunset-sherbert","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.61244019138756/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"GSC","subtitle":null,"slug":"gsc","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/gsc","symbol":"Gsc","applink":"leafly://strain/gsc"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":56,"outdoorFinish":null,"height":"Medium","averageYield":"Medium","environment":null,"growNotes":""}}
