{
    "aka": "Goji OG Kush, Goji, Gogi OG, Gogi",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1517961153000)/",
            "id": "contentitems-56870",
            "text": "It’s been a busy week in Avid Dabber-land! Last week was a whirlwind of excessive coffee drinking, food truck gluttony, and rubbing elbows with some of the best growers and extractors from Oregon. I got to hang with a bunch of awesome people and enjoy some of Portland’s culinary scene, but most importantly, I got to experience some of the finest flower and hash available in the state.\nLast time I shared some of the temperature ranges I prefer when dabbing. This week, I wanted to show a little love for my Nectar Collector. If you’ve never seen or used a Nectar Collector, it is tool with an inventive approach to dabbing. I love the simplicity and portability, and how self-contained a Nectar Collector makes the dabbing experience. It’s always met with some degree of awe and wonder whenever I bust it out in front of someone who hasn’t had a chance to dab with one before.\nBrowse Dab & Oil Rigs\n\n\n\n\n\n How did you feel about dabs from the #nectarcollector? I love the simplicity, portability, and how contained it keeps the dabbing experience. 🐝🍯 . . . #aviddabber #Seattle #leafly #onlydabthebest #onlythebest #onlysmokethebest #dab #dabs #cannabis #dabbing #dablife #dabstagram #shatter #dailydabbers #dabbersdaily #bho #sho #weshouldsmoke #highsociety #stayhigh #concentrates #710 #420 #710community\nA post shared by  The Avid Dabber (@the.avid.dabber) on Feb 6, 2018 at 12:53pm PST\n\n\n\nWhat Makes a Nectar Collector Different?\nWhen I introduce someone to the Nectar Collector, there’s usually a moment of confusion as they try to figure out how this long, glass device is used. Simply put, it’s a “percolating dab straw.” Like a standard dab rig, Nectar Collectors are designed to vaporize hash and concentrates. They are portable and use a dish to help avoid some of the mess of tooling your dab when on the go. And of course, what’s a dab without proper percolation? A Nectar Collector offers water-filtration typical of the common dab rig, but in a spill-proof design.\n\nHow Does a Nectar Collector Work?\nWhat makes the Nectar Collector’s functionality so unique is that instead of applying a dab to the surface of a nail or banger, you apply the hot tip to a small pile of hash in your dish.\nTo prepare your dab, you can load just about any amount of hash in the serving dish. When I take my Nectar Collector on camping trips, I’ll drop the whole gram in the dish and have dabs on deck for the entire weekend.\n\n\n\n\n\n Starting my week off on the hot tip… just like my #nectarcollector Hope everyone has a great week! . . . #aviddabber #Seattle #leafly #onlydabthebest #onlythebest #onlysmokethebest #dab #dabs #cannabis #dabbing #dablife #dabstagram #shatter #dailydabbers #dabbersdaily #bho #sho #weshouldsmoke #highsociety #stayhigh #concentrates #710 #420 #710community #glassofig 📷 @juliasumpter\nA post shared by  The Avid Dabber (@the.avid.dabber) on Jan 29, 2018 at 11:29am PST\n\n\n\nWith your hash is sitting in the serving dish, heat the tip of the Nectar Collector just like you would with a standard nail or banger. With the tip of the Nectar Collector red hot, give it about a minute to cool down before you take your dab. Most Nectar Collectors will come with a quartz tip, a titanium tip, or both. I prefer the quartz tip, but the titanium tip offers more durability since it is less susceptible to breaking if it drops out.\nOnce the tip has cooled to your preferred temperature, tap the hot tip along your pile of concentrate sitting in the dish. Take note, the longer you hold the tip against the hash, the larger your dab will be. I’ve found the best way to control the size of your dab is to repeatedly tap your Nectar Collector until you’ve pulled enough vapor through.\nFrom there, the vapor will travel up through the Nectar Collector, percolating through the water chamber until it meets you at the mouth piece. Exhale and enjoy!\n\nPros & Cons of Dabbing with a Nectar Collector\n\n\n\n\n\n Only two more days to get 20% off all old school & new school original Nectar Collectors!! To make a purchase go to our website NectarCollector.org! Again that's 20% off of everything!! 😃 #justthetip #dipandsip #theoriginalverticalvaporizer #710 #glassforsale #420sale  Photo credit to @primalglass thanks for the awesome shot!\nA post shared by  Nectar Collector (@nectarcollector710) on Apr 22, 2016 at 3:13pm PDT\n\n\n\nPros\nUnique – The novel design of a Nectar Collector is always sure to catch attention.\nDesign – The spill-proof design makes travel easy, and the fact that you can take it apart makes cleaning simple.\nPortable – It’s easy to take with you and offers a mess-free dabbing experience on the go.\nSelf-contained – No tools needed; just heat, dab, and enjoy.\nCons\nMultiple components – Thanks to gravity, the component pieces can detach and fall if not properly secured. Pro tip: You can use a keck clip to help keep your glass attachments secure.\nLong and unwieldy – The long shape can be a bit awkward and cumbersome, especially when passing around a Nectar Collector with a red-hot tip.\nLack of temperature control – While you can find e-nail adapters and heater coils that work with a Nectar Collector, the traditional heat and cool method doesn’t offer the same standardization as a typical quartz banger. It will take some trail and error to find the sweet spot and manage the temperature fluctuation.\nExplore Dabbing Tools & Accessories\nAvid Dab of the Week\n\n\n\n\n\n Sunday morning dabs… #goji flower rosin I pressed from @ftsfarms flower. A little on the hot side but still 👌🔥💯🚀 . . . #aviddabber #Seattle #leafly #onlydabthebest #onlythebest #onlysmokethebest #dab #dabs #cannabis #dabbing #dablife #dabstagram #shatter #dailydabbers #dabbersdaily #flowerrosin #rosin #sho #weshouldsmoke #highsociety #stayhigh #concentrates #710 #420 #710community\nA post shared by  The Avid Dabber (@the.avid.dabber) on Jan 28, 2018 at 1:28pm PST\n\n\n\nThis week’s dab features some flower rosin I pressed myself from Goji OG grown by From The Soil in Elma, WA. After pressing and collecting the rosin, I left it to cure for 48 hours, allowing it to butter up into a creamy, opaque consistency. The flavor is a mix of earthy pine and subtle hints of berry sweetness on the exhale.\nHave you dabbed with a Nectar Collector? Share your experiences in the comments section below or post them to Instagram and tag me (@the.avid.dabber) using #aviddabber. Keep your nail hot and your eyes locked on Leafly for the next installment of The Avid Dabber. Until next week, ONLY DAB THE BEST!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/06113912/will-hyde-avid-dabber-final-4-web.jpg",
            "title": "The Avid Dabber: Dabbing With a Nectar Collector",
            "urlslug": "/news/strains-products/the-avid-dabber-dabbing-with-a-nectar-collector"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1440774000000)/",
            "id": "contentitems-3423",
            "text": "Breeders and growers duked it out last weekend in Michigan for yet another High Times Cannabis Cup. The best of the best were pitted against each other, and we're curious how many of you have had the pleasure of trying these champs. Share your thoughts in a strain review or check out where to find these elite genetics at a shop near you by navigating to their strain page and clicking \"Availability.\"\nWithout further ado, here are your 2015 winners!\n \nCANNABIS FLOWER WINNERS\n\nBest Indica Flower\n1st Place: Zkittlez from 3rd Gen Family with Terphogz and The Union\n2nd Place: Strawberry Banana from Greenwolf Oregon with G.C. Rebellion Farms\n3rd Place: Deathwalker OG from Radicle Genetics in collaboration with Lenz and Valerio\n \nBest Sativa Flower\n1st Place: Strawberry Banana from Mass Genetics\n2nd Place: Tropicana from Cannabiotix\n3rd Place: Dreamy Jones from Bud White at Interlochen Alternative Health\n \nBest Hybrid Flower\n1st Place: Sunshine #4 by Bodhi Seeds from The Green Room Detroit\n2nd Place: Savant’s Grail from 710 Savant\n3rd Place: Crown OG from Crown OG with A Detroit Alternative and Moxie 71\n \nBest CBD Flower\n1st Place: Perkins Cut Cannatonic from Mota Rebel Genetics\n2nd Place: CBDee’s #1B from Pure West Compassion Club with LightSky Farms\n3rd Place: Super Sonic CBD from Radicle Genetics in collaboration with Valerio\n \nCANNABIS CONCENTRATE WINNERS\n\nBest Indica Concentrate\n1st Place: Faygo Red Pop Live Resin from 710 Savant\n2nd Place: Grape Valley Kush Live Resin from PeaceOil\n3rd Place: Moxie Goji Live Resin from A Detroit Alternative\n \nBest Sativa Concentrate\n1st Place: Clementine Live Resin from Crockett Family Farms\n2nd Place: Romulan Grenade’s Live Plant Run from LightSky Farms with NLG\n3rd Place: Tangie Live Resin from Greenwolf Oregon and Moxie Genetics\n \nBest Hybrid Concentrate\n1st Place: Strawberry Banana Lemonade from Greenwolf Oregon and Moxie 710\n2nd Place: Strawberry Banana from Loud Pack Extracts Oregon with Moxie Mix\n3rd Place: Crown OG from Moxie Genetics with ADA East\n \nBest Non-Solvent Hash\n1st Place: Goji Rosin from Moxie Seeds & Extracts with ADA East and Foundation Extracts\n2nd Place: Moxie Solventless Goji 120-micron from A Detroit Alternative\n3rd Place: 73-micron Bruce Banner #3 Freeze Dried Water Hash from Michigan Made Melts in collaboration with Kushmanjockin\n \nBest CBD Concentrate\n1st Place: CBD Cookies / Cannatonic / Cannasphere from Kannacare in collaboration with TerpTitan\n2nd Place: CBDee’s #1B Live Plant Run from Pure West Compassion Club with LightSky Farms\n3rd Place: Startonic Sap from Genotype A2 with A2 Wellness\n \nCANNABIS PRODUCT WINNERS\n\nBest Cannabis Edible\n1st Place: Kief Krispy from Budsuds with R.I. Finest and Kief Krispy\n2nd Place: Captain Kirk’s Truffle Tropicales from Captain Kirk Edibles of Ann Arbor Health Collective\n3rd Place: Got Milk? From Mindright\n \nBest CBD Cannabis Edible\n1st Place: Special Fx Labs CBD Dark Chocolate Mint from Jackson County Compassion Center\n2nd Place: Cherry Almond Sherbet Delight – CBD Special from Arborside Delights\n3rd Place: CBDee’s Strawberry Lemonade from LightSky Farms with NLG\n \nBest Cannabis Topical\n1st Place: PBO from PBOHeals.com\n2nd Place: Budsuds Purple Chem Topical Soap Bar from Budsuds with R.I. Finest and The Cali Connection\n3rd Place: Truu Hemp Infused Lotion from Mindright\n \nBest Cannabis Product\n1st Place: MOXIE | Moxie Mix\n2nd Place: Raw Papers | HBI\n3rd Place: Advanced Nutrients | Advanced Nutrients\n \nBest Glass\n1st Place: We Grow Michigan | Joe P x SD Ryno “Devil Duck Bot”\n2nd Place: Sacred Expressions | The Collector\n3rd Place: Nexus Glass | Tesla V3\n \nBest Vaporizer\n1st Place: Puff Co | Puff Co\n2nd Place: VaporZ | VaporZ\n3rd Place: WildBill’s Tobacco | Honey Pen",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/08/12002437/new-strains-alert-the-2015-michigan-cannabis-cup-winners.png",
            "title": "New Strains Alert: The 2015 Michigan Cannabis Cup Winners",
            "urlslug": "/news/strains-products/new-strains-alert-the-2015-michigan-cannabis-cup-winners"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 29.056383289512127
        },
        {
            "name": "ADD/ADHD",
            "score": 18.745252702307916
        },
        {
            "name": "PTSD",
            "score": 11.041484078293895
        },
        {
            "name": "Migraines",
            "score": 9.390885188431202
        },
        {
            "name": "Bipolar Disorder",
            "score": 9.084136722173533
        }
    ],
    "description": "<p>Goji OG is a <a href=\"http://www.leafly.com/sativa\">sativa</a>-dominant <a href=\"http://www.leafly.com/hybrid\">hybrid</a> bred by Bodhi Seeds crossed between Nepali OG and <a href=\"https://www.leafly.com/hybrid/snow-lotus\">Snow Lotus</a>. The flavor is as unique as the berry it&#39;s named after, offering&nbsp;a dynamic aroma&nbsp;including red&nbsp;<a href=\"http://www.leafly.com/explore#/explore/flavors-berry\">berry</a>, black cherry, <a href=\"http://www.leafly.com/explore#/explore/flavors-strawberry\">strawberry</a>, <a href=\"http://www.leafly.com/explore#/explore/flavors-tropical\">hawaiian punch</a>, and licorice. Indoor or outdoor grows offer high yields with a flowering time of around 9 weeks.</p>\n\n<p>&nbsp;</p>\n",
    "descriptionPlain": "Goji OG is a sativa-dominant hybrid bred by Bodhi Seeds crossed between Nepali OG and Snow Lotus. The flavor is as unique as the berry it&#39;s named after, offering&nbsp;a dynamic aroma&nbsp;including red&nbsp;berry, black cherry, strawberry, hawaiian punch, and licorice. Indoor or outdoor grows offer high yields with a flowering time of around 9 weeks.\n\n&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 84.0008764241893
        },
        {
            "name": "Happy",
            "score": 74.49313467718375
        },
        {
            "name": "Uplifted",
            "score": 64.25503943908852
        },
        {
            "name": "Euphoric",
            "score": 59.77943324569091
        },
        {
            "name": "Energetic",
            "score": 46.47385334501899
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 39.62898042652643
        },
        {
            "name": "Berry",
            "score": 38.90739117732983
        },
        {
            "name": "Sweet",
            "score": 32.51095530236635
        },
        {
            "name": "Earthy",
            "score": 18.475021910604735
        },
        {
            "name": "Pungent",
            "score": 16.09406952965235
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": null,
        "environment": null,
        "floweringDays": 63,
        "growNotes": "",
        "height": "Tall",
        "outdoorFinish": "October",
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1415552,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Pro: Smooth to smoke but adds a little punch taste when you are done.  Very smokey, earthy and licorice taste.   First, the clarity.  I lost my lighter for 2 hours ... did the same steps 20 times, couldn't find it.   Smoked this stuff and within 15 seconds, did another look at how I was doing the steps and found the lighter, no lie - \"Like of course it would be there\".   \n\nLet the feeding time begin - you'll be wanting to eat right away after smoking this.  Another time I was smoking this, I ended up baking chocolate chip cookies, and that's very productive for me!   \n\nYou will like dancing and moving around. You'll be so awake, you'll be creative, you'll be lovin life.  Listening to Dave Rawlings Machine.  This is probably the best day-time medicine you could get.\n\nCon:  No side effects at all - but it's not long-lasting.  After 2-3 hours, it's like you didn't do much.\n\nWhen: When some idiot wants to talk about Republican ideas and their candidates  \n\nWarn:  When I smoke 1 or 2 - it's awesome.  When I do  like 4, it's a hard hard high - one that is too strong and I actually dislike it.  But, love it when I do 1 or 2 hits.    It does have some Indica in there so you are neither tired or awake - it's very in between - but not so much you want to sleep.",
            "username": "DieselDude420"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1640364,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Wow 420710ryder from tha beast coast puffin tough gojiog holy moley lolo fuking stright gasssssssssss love tha unique taste and smooth n fruity taste its just banging ...props 207 finest beast coast 420710ryders all day everyday",
            "username": "Trxxx"
        }
    ],
    "id": 96719,
    "name": "Goji OG",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 27.59567630733275
        },
        {
            "name": "Dry Eyes",
            "score": 21.009348524685947
        },
        {
            "name": "Dizzy",
            "score": 13.269062226117441
        },
        {
            "name": "Paranoid",
            "score": 12.042068361086766
        },
        {
            "name": "Anxious",
            "score": 9.967864446392053
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/snow-lotus",
            "category": "Hybrid",
            "name": "Snow Lotus",
            "permalink": "https://mobileapi.leafly.com/hybrid/snow-lotus",
            "slug": "snow-lotus",
            "subtitle": null,
            "symbol": "Slt"
        },
        {
            "applink": "leafly://strain/nepalese",
            "category": "Sativa",
            "name": "Nepalese",
            "permalink": "https://mobileapi.leafly.com/sativa/nepalese",
            "slug": "nepalese",
            "subtitle": null,
            "symbol": "Np"
        },
        {
            "applink": "leafly://strain/og-kush",
            "category": "Hybrid",
            "name": "OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/og-kush",
            "slug": "og-kush",
            "subtitle": null,
            "symbol": "Ogk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/goji-og",
    "photoTotalCount": 25,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001703/b/goji-og__primary_443b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/goji-og_100x100_8f72.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001682/b/goji-og__primary_7f6d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/goji-og_100x100_187a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/519019/b/goji-og__primary_d4e5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/goji-og_100x100_ef99.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/518604/b/goji-og__primary_8541.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/goji-og_100x100_5692.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/513458/b/goji-og__primary_4f9c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/goji-og_100x100_f1b4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/465144/b/goji-og__primary_58f1.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/goji-og_100x100_7f2e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Portland, OR",
        "Seattle, WA",
        "Los Angeles, CA",
        "Eugene, OR",
        "San Francisco, CA",
        "Salem, OR",
        "Detroit, MI",
        "Santa Ana, CA",
        "Spokane, WA"
    ],
    "rating": 4.47,
    "relatedStrains": [],
    "reviewCount": 165,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "goji-og",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.46666666666667/240",
    "subtitle": null,
    "symbol": "Goj",
    "symptoms": [
        {
            "name": "Stress",
            "score": 42.32544551562957
        },
        {
            "name": "Depression",
            "score": 39.75460122699386
        },
        {
            "name": "Pain",
            "score": 31.780601811276657
        },
        {
            "name": "Insomnia",
            "score": 19.358749634823255
        },
        {
            "name": "Headaches",
            "score": 17.401402278702893
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
