{
    "aka": "Chem Jones, Chemdawg Jones",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1513714353000)/",
            "id": "contentitems-52330",
            "text": "Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis concentrates of 2017. How many have you tried? What was your favorite concentrate of 2017? Share with us in the comments below!\n\nDouble Tangie Banana Sugar Resin by Oleum Extracts\nAvailable in: Washington\nBursting with citrus aroma, Oleum Extracts’ delicious Double Tangie Banana Sugar Resin brings maximum flavor along with buzzy sativa-dominant qualities. We love it for its huge terpene profile, and find it to beget a subtle, controllable high with each and every dab.\nSpace Queen Cartridge by Artizen Cannabis\nAvailable in: Washington\nNotes of bold cherry mixed with a soft vanilla scent are found in Artizen’s hybrid Space Queen Cartridge. We recommend this delectable concentrate for beginners and newbies as it delivers a well-balanced high and sweet taste that will keep you (and us) coming back for more.\nHarley Twin CBD Sap by Cannavative\nAvailable in: Nevada\nPacked with 57.6mg CBD to 23.3mg THC, we’re loving Cannavative’s pain-crushing Harley Twin CBD Sap. Wrap yourself in a stimulating buzz with a healthy dab of this sativa strain before taking on the day.\n\nCHILL Cartridge by SuicideGirls Cannabis\nAvailable in: California\nThe Suicide Girls released a line of effects-based cartridges that will perfectly match your mood, and we’ve been getting up close and personal with their relaxing CHILL Cartridge filled with a whopping 80% THC and mouthwatering fruity terpenes.\nAlso featured in: We Tried the Suicide Girls’ New Cannabis Vape Line\nGreen Crack Distillate Cartridge by Bullet Concentrates\nAvailable in: Nevada\nBullet Concentrates’ Silver Bullet Distillate Cartridges are as effective as they are elevating, and the Green Crack Cartridge is no exception. We’ve been including it as part of a balanced wake and bake morning for its burst of energy and robust terpene profile.\nTHCA Crystalline Distillate by Oleum Extracts\nAvailable in: Washington\nOleum Extracts comes up time and again when we talk great local concentrates, and their potent THCA Crystalline Distillate is a favorite amongst our more experienced concentrate lovers. When pressed on a hot dab nail, THCA decarboxylates into strong and active THC. With little to no terpene content in a crystalline distillate, the rush is smooth and tasteless, and these crystals can be added to standard dabs for an intense high-potency experience (trust us, it’ll feel like you’re taking your first dab all over again).\n\nTropical Trainwreck 1g Kit by Orchid Essentials\nAvailable in: California and Oregon\nLeafly’s office is located in Seattle, which means we clamor for any product that lets us escape from the clouds and rain. Enter the Tropical Trainwreck Cartridge Kit by Orchid Essentials, loaded with tropical terpenes boasting citrus and pineapple flavors. It’s as close to sitting on a sunny beach as we can get.\nFreshTerps by Evolab\nAvailable in: Colorado\nEvolab’s FreshTerps is a step up in the world of cannabis flavors and aroma. We’ve fallen head over heels for this concentrate, which contains about 90% terpenes (plus 10% THC) and can be vaped individually or blended with your favorite oils to produce the most delicious dabs you’ve ever had.\nAlso featured in: Best Products to Pick Up Before 4/20\nEureka Clear Disposable Vape Pen in Indica by Eureka Vapor\nAvailable in: California and Colorado\nWith 300mg of cannabinoids, Eureka’s calming Disposable Vape Pen has our indica lovers singing its praises. Featuring classic indica strains like Granddaddy Purple and Skywalker and a full test analysis for each pen, we admire Eureka Vapor’s attention to quality and ease of use.\nAlso featured in: 10 Brands Making Awesome Disposable Cannabis Vape Pens\n\nRed Apple Clear Cartridge by The Clear\nAvailable in: California, Colorado, and Oregon\nThe Clear brings the sweet and crisp fragrance of a fresh apple orchard right to your lips with their half-gram Red Apple Clear Cartridge. We can also get down with The Clear’s other cartridges featuring a wide range of delicious flavors (once you’re done with Red Apple, try the lush Orange Cream).\nAlso featured in: In Photos: These ‘Dragon Balls’ Contain 3,000 Grams of Pure Cannabis Oil\nChemmy Jones Blonde BHO by Dorado Extracts\nAvailable in: Washington\nDorado Extracts’ extra-terpy Chemmy Jones Blonde BHO provides an ultra-rich taste with a high-energy buzz. We especially love their innovative soft lid packaging and quality concentrate at a budget-friendly price point.\nAlso featured in: What Are Your Smoking? Episode 17\nSuper Lemon Haze Vape Cartridge by The Bloom Brand\nAvailable in: California and Washington\nFree of solvents, lipids, waxes, and impurities, The Bloom Brand’s Super Lemon Haze Vape Cartridges are triple distilled and contain only oil and terpenes, giving you an ultra-pure cannabis concentrate.\nLead image by rgbspace/iStock",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/19120551/leafly-faves-concentrate.jpg",
            "title": "Leafly’s Faves 2017: Concentrates",
            "urlslug": "/news/strains-products/leaflys-faves-2017-concentrates"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1441382400000)/",
            "id": "contentitems-3213",
            "text": "New strains have just been added to the Leafly Strain Explorer, and we want your reviews! From the ridiculous Alien Asshat and Honey Boo Boo to the alluring Haze Mist and Tangerine Power, this week's newcomers are sure to raise a few eyebrows. So tell us — have you tried any of these new strains? What did you think?\n \n 1. Alien Asshat\n\nAlien Asshat is a hybrid cannabis strain grown by Sky High Gardens in Washington. With a staggeringly high THC content, Alien Asshat launches you into the cosmos with a powerful euphoric blast. Its buds are a tangle of green calyxes and leaves wrapped in a constellation of shining crystal resin. If you’re new to cannabis, be sure to start small with this heavy-hitter.\n\nAlien Asshat can currently be found at High Society in Anacortes, WA\n \n 2. Honey Boo Boo\n\nAn 80% indica by DNA Genetics, Honey Boo Boo is a limited edition strain that crosses a Bubba Kush mother with a Captain Krypt OG male. With a sweet flavor that in part lends this strain her name, Honey Boo Boo deals a heavy-handed blast of euphoria that melts throughout the body. Her dense buds finish flowering after 8 to 9 weeks, and her maturation is often marked by darkened purple leaf tips.\n\nFind out which locations are currently carrying Honey Boo Boo\n \n 3. Chemmy Jones\n\nChemmy Jones by Connoisseur Genetics is a hybrid strain that unites genetics from Chemdawg D and Casey Jones. Uplifting and revitalizing, Chemmy Jones manages to induce a functional, high-energy buzz that allows you to stay productive. Diesel flavors are counterbalanced by a floral sweetness, inviting the senses before you even indulge in the invigorating effects this sativa-dominant strain has to offer.\n\nFind out which locations are currently carrying Chemmy Jones\n \n 4. Haze Mist\n\nBred by Flying Dutchmen, Haze Mist is a sativa strain that was parented by a South Indian Skunk hybrid and a Haze male. Haze Mist balances sweet, sour, and spicy flavors while its effects lean entirely to the cerebral side of the spectrum with very little full-body sensations. Like a true sativa, Haze Mist stretches tall and requires patience during her 13 to 14 week flowering cycle.\n\n \n 5. Tangerine Power\n\nTangerine Power is a hybrid strain by Sin City Seeds that combines Agent Orange and Blue Power. As one might expect, Tangerine Power carries an unmistakable citrus aroma inherited from the Agent Orange parent. However, this hybrid takes after Blue Power in its paralyzing euphoria and full-body relaxation that trickles over both mind and body.\n\nFind out which locations are currently carrying Tangerine Power\n \n 6. Katsu Kush\n\nKatsu Kush, or just Katsu, is an indica cannabis strain that descends from the hardy Hindu Kush landraces. This indica is named after the original breeder’s alias, and has garnered a reputation for its powerful, full-body effects that leave you blissfully stuck to the couch. Some phenotypes of Katsu Kush exhibit higher levels of CBD, so patients treating pain, inflammation, and anxiety should keep an eye out for this type. With a sweet earthy flavor, Katsu Kush offers a solution for stressful days and sleepless nights.\n\nFind out which locations are currently carrying Katsu Kush\n \n 7. White Skunk\n\nWhite Skunk is an indica-dominant variation of Skunk from Sensi Seeds’ White Label. In a demonstration of its heritage, White Skunk delivers a sour, skunky flavor and a balance of effects that ease both mind and body into a relaxed state. Like many Skunk varieties, this resilient strain is a great choice for beginner growers and offers bountiful yields after a short flowering cycle.\n\nFind out which locations are currently carrying White Skunk\n \nCheck out our other new strains recently added to the Leafly Explorer, or catch up on last week's Michigan Cannabis Cup winners!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/09/12001927/new-strains-alert-alien-asshat-honey-boo-boo-haze-mist-chemmy-jon.png",
            "title": "New Strains Alert: Alien Asshat, Honey Boo Boo, Haze Mist, Chemmy Jones, and More",
            "urlslug": "/news/strains-products/new-strains-alert-alien-asshat-honey-boo-boo-haze-mist-chemmy-jon"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "ADD/ADHD",
            "score": 14.187344913151366
        },
        {
            "name": "Phantom Limb Pain",
            "score": 10
        },
        {
            "name": "Anxiety",
            "score": 7.071960297766749
        },
        {
            "name": "Bipolar Disorder",
            "score": 4.187344913151365
        },
        {
            "name": "Epilepsy",
            "score": 2.0936724565756824
        }
    ],
    "description": "<p>Chemmy Jones by Connoisseur Genetics is a hybrid strain that unites genetics from <a href=\"https://www.leafly.com/hybrid/chemdawg\">Chemdawg</a> D and <a href=\"https://www.leafly.com/sativa/casey-jones\">Casey Jones</a>. Uplifting and revitalizing, Chemmy Jones manages to induce a functional, high-energy buzz that allows you to stay productive. Diesel flavors are counterbalanced by a floral sweetness, inviting the senses before you even indulge in the invigorating effects this sativa-dominant strain has to offer.</p>\n",
    "descriptionPlain": "Chemmy Jones by Connoisseur Genetics is a hybrid strain that unites genetics from Chemdawg D and Casey Jones. Uplifting and revitalizing, Chemmy Jones manages to induce a functional, high-energy buzz that allows you to stay productive. Diesel flavors are counterbalanced by a floral sweetness, inviting the senses before you even indulge in the invigorating effects this sativa-dominant strain has to offer.\n",
    "effects": [
        {
            "name": "Euphoric",
            "score": 72.037841191067
        },
        {
            "name": "Happy",
            "score": 63.30955334987593
        },
        {
            "name": "Relaxed",
            "score": 57.35732009925559
        },
        {
            "name": "Uplifted",
            "score": 52.34801488833747
        },
        {
            "name": "Energetic",
            "score": 46.88895781637717
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 21.259305210918114
        },
        {
            "name": "Diesel",
            "score": 17.72332506203474
        },
        {
            "name": "Citrus",
            "score": 12.574441687344914
        },
        {
            "name": "Spicy/Herbal",
            "score": 12.093672456575682
        },
        {
            "name": "Pungent",
            "score": 6.2810173697270475
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 56,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1416654,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Farts are treacherous, especially the little ones you think won't stink, like the the tiny pooter you just one-cheek-sneaked in your cube. \"Ah -- The perfect crime,\" you think, sticking to your theory that it was \"all sound and no fury\". So when you test that little theory by giving a little sniff, you promptly get frying-panned right in the face by The Stench That Came from C'Thulu's Ass. And as you're ducking staplers thrown at you by your gagging co-workers, you think, \"What the FUCK just happened to me?\"\n\nChemmy Jones is a little like this. As soon as you blaze the Jones, everyone in your zip code is going to know you're getting lit -- it's just that pungent. No little sneaker hits here; you might as well just hire a skywriter to emblazon the heavens with \"HEY, DUDES! I SCORED SOME CHEMMY JONES AND I'M GONNA GET HELLA BAKED!\" as soon as you take your first hit. And about that hit -- be ye wary of how many you take because this stuff is the ultimate sneaker weed. One minute you're all, \"Yeah, I guess Yes is an ok band . . .\" and 20 seconds later you're \"HOLY JESUS, AN -ORGAN SOLO- RIGHT IN THE MIDDLE OF THE SONG? THAT'S FUCKING BRILLIANT!\" This weed shifts gears faster than your local politician when asked if that was really him photographed blowing a horse, so be cautious with the over-tokage. Even if you don't end up in Spinney Land due to being one toke over the line, the \"normal\" high will totally 9/11 your brain and you will DEFINITELY \"never forget\".",
            "username": "StukaFox"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1632869,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Newley discovered strain for me...instantly my fav...amazing flavor and high 👍👍",
            "username": "kbphillips03"
        }
    ],
    "id": 178417,
    "name": "Chemmy Jones",
    "negatives": [
        {
            "name": "Dry Eyes",
            "score": 38.85545905707196
        },
        {
            "name": "Dry Mouth",
            "score": 32.391439205955336
        },
        {
            "name": "Dizzy",
            "score": 17.413151364764268
        },
        {
            "name": "Paranoid",
            "score": 10.48076923076923
        },
        {
            "name": "Anxious",
            "score": 5.319478908188586
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/chemdawg",
            "category": "Hybrid",
            "name": "Chemdawg",
            "permalink": "https://mobileapi.leafly.com/hybrid/chemdawg",
            "slug": "chemdawg",
            "subtitle": null,
            "symbol": "Cd"
        },
        {
            "applink": "leafly://strain/casey-jones",
            "category": "Sativa",
            "name": "Casey Jones",
            "permalink": "https://mobileapi.leafly.com/sativa/casey-jones",
            "slug": "casey-jones",
            "subtitle": null,
            "symbol": "Cas"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/chemmy-jones",
    "photoTotalCount": 7,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/637489/b/chemmy-jones__primary_07b2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chemmy-jones_100x100_af30.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/609644/b/chemmy-jones__primary_bcb3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chemmy-jones_100x100_3098.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/560654/b/chemmy-jones__primary_5c89.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chemmy-jones_100x100_ad6d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/498222/b/chemmy-jones__primary_0e3e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chemmy-jones_100x100_9572.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/457213/b/chemmy-jones__primary_6ffc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chemmy-jones_100x100_eb63.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/409782/b/chemmy-jones__primary_d06c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chemmy-jones_100x100_e2bf.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Bellingham, WA",
        "Everett, WA",
        "Mount Vernon, WA",
        "Spokane, WA",
        "Denver, CO",
        "Tacoma, WA",
        "Vancouver, WA",
        "Wenatchee, WA",
        "Arlington, WA"
    ],
    "rating": 4.66,
    "relatedStrains": [],
    "reviewCount": 64,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "chemmy-jones",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.65625/240",
    "subtitle": null,
    "symbol": "Chj",
    "symptoms": [
        {
            "name": "Stress",
            "score": 27.05955334987593
        },
        {
            "name": "Headaches",
            "score": 15.800248138957818
        },
        {
            "name": "Pain",
            "score": 15.459057071960299
        },
        {
            "name": "Nausea",
            "score": 14.016749379652605
        },
        {
            "name": "Depression",
            "score": 12.872208436724566
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
