{"sl_translate":"description,descriptionPlain,category","id":410,"slug":"lemon-drop","name":"Lemon Drop","subtitle":null,"symbol":"Ld","category":"Hybrid","description":"\u003cp\u003eLemon Drop is a mellow, fluffy bud that provides a pleasant, giggly sensation. This strain tends to provide a more euphoric, focused experience, though indica-dominant variations exist and produce a stronger body feeling that is relaxing yet not overpowering. Fittingly, Lemon Drop has a lemony, clean taste that is reminiscent of the candy of the same name.\u003c/p\u003e\n","descriptionPlain":"Lemon Drop is a mellow, fluffy bud that provides a pleasant, giggly sensation. This strain tends to provide a more euphoric, focused experience, though indica-dominant variations exist and produce a stronger body feeling that is relaxing yet not overpowering. Fittingly, Lemon Drop has a lemony, clean taste that is reminiscent of the candy of the same name.\n","aka":null,"rating":4.15,"highlightedReviews":[{"id":1417762,"username":"Bch0909","text":"I additionally used this strain to unwind because I was tired of working on an extensive policy brief due the next day, so I decided to kick back and vape a little lemon drop. when I was done, all I wanted to do was work!! this could be big pharmas worst enemy when it comes to ADD!! Adderall? forget it, this is much more fun and efficient. 4/5, I feel like the high doesn\u0027t last as long as other top shelfs. tastes like lemony goodness. I think it\u0027d be cool to put lemon Gatorade in a bong and smoke lemon drop, probably a solid flavor profile. anyways I\u0027m rambling. Taste through the vape was 5/5. straight terps, big milky hits should send a tingling sensation down your body. recommended for daytime use, highly functional, but also a great go to if you wanna kick back and watch Netflix. definitely sativa dominant tho. why? because it\u0027s fucking 4 am and I have to get up in less than 4 hours and I\u0027m writing an intricate pot review instead of sleeping","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1639908,"username":"Lins0530","text":"Love it! Has a great flavor !","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-43694","title":"5 Bold Bluegrass Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1506976615000)\/","text":"Dating back to the 18th century, bluegrass sits at the intersection of traditional Scottish, Irish, and English folk music. Settlers brought their ballads, dance music, and fiddles to the Appalachian Mountains in North America, where their individual melodies mixed together to create an uplifting sound that has been passed down from musician to musician for generations.\n\nBluegrass may be a cousin to folk, traditional, and Americana music, but at its heart it exists as one of the most distinct and noteworthy individual genres of our time. It is music that weaves stories and moves the soul—it’s a rich and colorful genre that can excite and invigorate the senses, especially with a little cannabis nearby.\nBelow, explore five bluegrass bands with your favorite pre-roll in hand—preferably on a rocking chair, soaking in the soulful tunes.\nLaws of Gravity by The Infamous Stringdusters\n\nStrain Pairing Recommendation: Tangilope\nThe Infamous Stringdusters’ latest album, Laws of Gravity, wastes no time as it bursts into life with their first track, “Freedom,” instantly immersing listeners in a rich and invigorating sound. The album, released this year, packs a powerful punch that is vibrant, complex and uniquely its own.\nLaws of Gravity manages to encapsulate the traditions of bluegrass while merging it with modern grooves and instrumentation. The bright movements of Jeremy Garrett’s fiddle and Chris Pandolfi’s banjo sing across the soundscape of bass, dobro, and guitar for a symphony that shines with and without the engaging and lively lyrics.\nWhen the lyrics do fade away, listeners enjoy the intricate improvisational jamming that is a hallmark of The Infamous Stringdusters. Laws of Gravity has a life of its own that proves once again why the band continues to be a resounding favorite across the genre’s fanbase.\nThe Muscle Shoals Recordings by The Steeldrivers\n\nStrain Pairing Recommendation: Blueberry Headband\nThe Muscle Shoals Recordings starts with light, happy banjo on the track “Long Way Down,” setting the tone for an album that combines the essence of bluegrass with rich complexity. Gary Nichols’ distinct and powerful voice, often accompanied by beautiful backing vocals, cruises effortlessly across the instrumentation and inspires with its authenticity and depth.\nThe Steeldrivers feature banjo, mandolin, guitar, bass, and fiddle for a full and delightfully classic bluegrass feel. The Muscle Shoals Recordings, produced in 2015, is the band’s fourth album and earned them a Grammy in the Best Bluegrass category.\nFrom the first track to the last, this is a spirited album that uplifts the mind and moves the body with energetic sound.\n\nThief by Keller \u0026 The Keels\n\nStrain Pairing Recommendation: Lodi Dodi\nWith a distinctly joyful beat, Thief picks you up and whisks you off into a dance of folky bluegrass with Keller William’s playful vocals leading the way. Williams is joined by Jenny Keel on upright bass and flat picker Larry Keel. Together, the three bring a decidedly full sound to their latest acoustic album.\nKeller \u0026 The Keels have never shied away from creative covers, and Thief, released in 2010, is no exception. Unlike their first album, Grass (released in 2006), Thief does not feature any original songs, focusing solely on covers. The album’s title is an ode to this decision.\nBluegrass versions of Amy Winehouse’s “Rehab” and Marcy Playground’s “Sex and Candy” are among the familiar but undeniably fresh covers. The tracks allow the listener to immediately jump in and sing along while still being immersed in new tunes and feelings.\nWilliams’ knack for composing solo music lends expertise to the composition of his trio, and as such, Thief has an intricacy that is impressive for such a small acoustic group.\nFriends of Fall by Crooked Still\n\nStrain Pairing Recommendation: Lemon Drop\nCrooked Still offers a unique bluegrass element that is light, airy, and melodic. Lead singer Aoife O’Donovan’s voice carries across the backdrop of banjo, bass, cello, and fiddle like a shooting star.\nFriends of Fall, released in 2011, brings an ethereal beauty and complexity to the genre of bluegrass. Songs such as “Pretty Bird” will stir emotion, while “It’ll End Too Soon” inspires and invigorates. Often described as ‘progressive bluegrass’ due to innovative acoustics, Crooked Still’s high-energy sound encourages engagement from the first note to the last thanks to its unique instrumentation.\nFriends of Fall is refreshing and wholly uplifting, carrying the spirit of bluegrass as it soars to new and delightful heights.\n\nLove. Ain’t Love  by Yonder Mountain String Band\n\nStrain Pairing Recommendation: Afgooey\nLove. Ain’t Love, released this year, is the latest from Yonder Mountain String Band, encompassing a full thirteen tracks of rich and engaging rhythms that will keep you on your toes.\nFeaturing five band members on banjo, bass, fiddle, guitar, and mandolin, Yonder Mountain String Band also has the distinction of all five members acting as vocalists, which allows them to create beautifully layered and rich harmonies.\nOn the other hand, Love. Ain’t Love does not shy away from fully instrumental tracks, such as “Fall Outta Line,” which showcases the band’s innovation in its tune. This ability to embrace the full merits of their instrumentation has won YMSB fans across various genres, including those in the jam band scene. When listening to Love. Ain’t Love, one can get lost in the music as it paints stories with and without lyrics.\nLove. Ain’t Love provides a playful, energetic, and creative soundscape. The passion and vibrancy in every note of the album act as joyful reminders that Yonder Mountain String Band continues to inspire and be inspired by bluegrass, even 18 years after the release of their first album.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/10/02124702/bluegrass-albums-while-high.jpg","urlslug":"/news/lifestyle/bluegrass-albums-listen-high"},{"id":"contentitems-34817","title":"5 Rustic Americana Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1500942707000)\/","text":"Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg","urlslug":"/news/lifestyle/americana-albums-listen-high"}],"reviewCount":162,"flavors":[{"name":"Lemon","score":91.337285902503282},{"name":"Sweet","score":24.489459815546773},{"name":"Citrus","score":21.563460693895479},{"name":"Diesel","score":12.620772946859903},{"name":"Woody","score":10.05709266578832}],"effects":[{"name":"Relaxed","score":77.700922266139656},{"name":"Focused","score":76.471234079929729},{"name":"Uplifted","score":72.139877031181371},{"name":"Happy","score":71.920289855072468},{"name":"Euphoric","score":54.611330698287219}],"symptoms":[{"name":"Stress","score":53.765920070267896},{"name":"Depression","score":42.380324989020636},{"name":"Fatigue","score":30.753184014053581},{"name":"Lack of Appetite","score":21.612867808519983},{"name":"Insomnia","score":8.6297760210803673}],"conditions":[{"name":"Anxiety","score":42.160737812911719},{"name":"Anorexia","score":12.741545893719806},{"name":"ADD/ADHD","score":9.3544137022397891},{"name":"Asthma","score":5.02854633289416},{"name":"Bipolar Disorder","score":3.8427755819060172}],"negatives":[{"name":"Dry Eyes","score":29.446640316205531},{"name":"Dry Mouth","score":22.891963109354414},{"name":"Headache","score":13.22463768115942},{"name":"Dizzy","score":3.7220026350461133},{"name":"Anxious","score":0.60386473429951693}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_011c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/546904/b/lemon-drop__primary_3da0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_2066.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/497743/b/lemon-drop__primary_9c13.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_5883.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/497196/b/lemon-drop__primary_2cd0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_9284.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/484811/b/lemon-drop__primary_df88.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_943e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/438863/b/lemon-drop__primary_24dc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_444e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/437005/b/lemon-drop__primary_c790.jpg"}],"photoTotalCount":44,"popularCities":["Vancouver, BC","Bellingham, WA","Everett, WA","Portland, OR","Seattle, WA","Spokane, WA","Colorado Springs, CO","Denver, CO","Los Angeles, CA","Lynnwood, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/lemon-drop","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.14814814814815/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":410,"slug":"lemon-drop","name":"Lemon Drop","subtitle":null,"symbol":"Ld","category":"Hybrid","description":"\u003cp\u003eLemon Drop is a mellow, fluffy bud that provides a pleasant, giggly sensation. This strain tends to provide a more euphoric, focused experience, though indica-dominant variations exist and produce a stronger body feeling that is relaxing yet not overpowering. Fittingly, Lemon Drop has a lemony, clean taste that is reminiscent of the candy of the same name.\u003c/p\u003e\n","descriptionPlain":"Lemon Drop is a mellow, fluffy bud that provides a pleasant, giggly sensation. This strain tends to provide a more euphoric, focused experience, though indica-dominant variations exist and produce a stronger body feeling that is relaxing yet not overpowering. Fittingly, Lemon Drop has a lemony, clean taste that is reminiscent of the candy of the same name.\n","aka":null,"rating":4.15,"highlightedReviews":[{"id":1417762,"username":"Bch0909","text":"I additionally used this strain to unwind because I was tired of working on an extensive policy brief due the next day, so I decided to kick back and vape a little lemon drop. when I was done, all I wanted to do was work!! this could be big pharmas worst enemy when it comes to ADD!! Adderall? forget it, this is much more fun and efficient. 4/5, I feel like the high doesn\u0027t last as long as other top shelfs. tastes like lemony goodness. I think it\u0027d be cool to put lemon Gatorade in a bong and smoke lemon drop, probably a solid flavor profile. anyways I\u0027m rambling. Taste through the vape was 5/5. straight terps, big milky hits should send a tingling sensation down your body. recommended for daytime use, highly functional, but also a great go to if you wanna kick back and watch Netflix. definitely sativa dominant tho. why? because it\u0027s fucking 4 am and I have to get up in less than 4 hours and I\u0027m writing an intricate pot review instead of sleeping","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1639908,"username":"Lins0530","text":"Love it! Has a great flavor !","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-43694","title":"5 Bold Bluegrass Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1506976615000)\/","text":"Dating back to the 18th century, bluegrass sits at the intersection of traditional Scottish, Irish, and English folk music. Settlers brought their ballads, dance music, and fiddles to the Appalachian Mountains in North America, where their individual melodies mixed together to create an uplifting sound that has been passed down from musician to musician for generations.\n\nBluegrass may be a cousin to folk, traditional, and Americana music, but at its heart it exists as one of the most distinct and noteworthy individual genres of our time. It is music that weaves stories and moves the soul—it’s a rich and colorful genre that can excite and invigorate the senses, especially with a little cannabis nearby.\nBelow, explore five bluegrass bands with your favorite pre-roll in hand—preferably on a rocking chair, soaking in the soulful tunes.\nLaws of Gravity by The Infamous Stringdusters\n\nStrain Pairing Recommendation: Tangilope\nThe Infamous Stringdusters’ latest album, Laws of Gravity, wastes no time as it bursts into life with their first track, “Freedom,” instantly immersing listeners in a rich and invigorating sound. The album, released this year, packs a powerful punch that is vibrant, complex and uniquely its own.\nLaws of Gravity manages to encapsulate the traditions of bluegrass while merging it with modern grooves and instrumentation. The bright movements of Jeremy Garrett’s fiddle and Chris Pandolfi’s banjo sing across the soundscape of bass, dobro, and guitar for a symphony that shines with and without the engaging and lively lyrics.\nWhen the lyrics do fade away, listeners enjoy the intricate improvisational jamming that is a hallmark of The Infamous Stringdusters. Laws of Gravity has a life of its own that proves once again why the band continues to be a resounding favorite across the genre’s fanbase.\nThe Muscle Shoals Recordings by The Steeldrivers\n\nStrain Pairing Recommendation: Blueberry Headband\nThe Muscle Shoals Recordings starts with light, happy banjo on the track “Long Way Down,” setting the tone for an album that combines the essence of bluegrass with rich complexity. Gary Nichols’ distinct and powerful voice, often accompanied by beautiful backing vocals, cruises effortlessly across the instrumentation and inspires with its authenticity and depth.\nThe Steeldrivers feature banjo, mandolin, guitar, bass, and fiddle for a full and delightfully classic bluegrass feel. The Muscle Shoals Recordings, produced in 2015, is the band’s fourth album and earned them a Grammy in the Best Bluegrass category.\nFrom the first track to the last, this is a spirited album that uplifts the mind and moves the body with energetic sound.\n\nThief by Keller \u0026 The Keels\n\nStrain Pairing Recommendation: Lodi Dodi\nWith a distinctly joyful beat, Thief picks you up and whisks you off into a dance of folky bluegrass with Keller William’s playful vocals leading the way. Williams is joined by Jenny Keel on upright bass and flat picker Larry Keel. Together, the three bring a decidedly full sound to their latest acoustic album.\nKeller \u0026 The Keels have never shied away from creative covers, and Thief, released in 2010, is no exception. Unlike their first album, Grass (released in 2006), Thief does not feature any original songs, focusing solely on covers. The album’s title is an ode to this decision.\nBluegrass versions of Amy Winehouse’s “Rehab” and Marcy Playground’s “Sex and Candy” are among the familiar but undeniably fresh covers. The tracks allow the listener to immediately jump in and sing along while still being immersed in new tunes and feelings.\nWilliams’ knack for composing solo music lends expertise to the composition of his trio, and as such, Thief has an intricacy that is impressive for such a small acoustic group.\nFriends of Fall by Crooked Still\n\nStrain Pairing Recommendation: Lemon Drop\nCrooked Still offers a unique bluegrass element that is light, airy, and melodic. Lead singer Aoife O’Donovan’s voice carries across the backdrop of banjo, bass, cello, and fiddle like a shooting star.\nFriends of Fall, released in 2011, brings an ethereal beauty and complexity to the genre of bluegrass. Songs such as “Pretty Bird” will stir emotion, while “It’ll End Too Soon” inspires and invigorates. Often described as ‘progressive bluegrass’ due to innovative acoustics, Crooked Still’s high-energy sound encourages engagement from the first note to the last thanks to its unique instrumentation.\nFriends of Fall is refreshing and wholly uplifting, carrying the spirit of bluegrass as it soars to new and delightful heights.\n\nLove. Ain’t Love  by Yonder Mountain String Band\n\nStrain Pairing Recommendation: Afgooey\nLove. Ain’t Love, released this year, is the latest from Yonder Mountain String Band, encompassing a full thirteen tracks of rich and engaging rhythms that will keep you on your toes.\nFeaturing five band members on banjo, bass, fiddle, guitar, and mandolin, Yonder Mountain String Band also has the distinction of all five members acting as vocalists, which allows them to create beautifully layered and rich harmonies.\nOn the other hand, Love. Ain’t Love does not shy away from fully instrumental tracks, such as “Fall Outta Line,” which showcases the band’s innovation in its tune. This ability to embrace the full merits of their instrumentation has won YMSB fans across various genres, including those in the jam band scene. When listening to Love. Ain’t Love, one can get lost in the music as it paints stories with and without lyrics.\nLove. Ain’t Love provides a playful, energetic, and creative soundscape. The passion and vibrancy in every note of the album act as joyful reminders that Yonder Mountain String Band continues to inspire and be inspired by bluegrass, even 18 years after the release of their first album.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/10/02124702/bluegrass-albums-while-high.jpg","urlslug":"/news/lifestyle/bluegrass-albums-listen-high"},{"id":"contentitems-34817","title":"5 Rustic Americana Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1500942707000)\/","text":"Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg","urlslug":"/news/lifestyle/americana-albums-listen-high"}],"reviewCount":162,"flavors":[{"name":"Lemon","score":91.337285902503282},{"name":"Sweet","score":24.489459815546773},{"name":"Citrus","score":21.563460693895479},{"name":"Diesel","score":12.620772946859903},{"name":"Woody","score":10.05709266578832}],"effects":[{"name":"Relaxed","score":77.700922266139656},{"name":"Focused","score":76.471234079929729},{"name":"Uplifted","score":72.139877031181371},{"name":"Happy","score":71.920289855072468},{"name":"Euphoric","score":54.611330698287219}],"symptoms":[{"name":"Stress","score":53.765920070267896},{"name":"Depression","score":42.380324989020636},{"name":"Fatigue","score":30.753184014053581},{"name":"Lack of Appetite","score":21.612867808519983},{"name":"Insomnia","score":8.6297760210803673}],"conditions":[{"name":"Anxiety","score":42.160737812911719},{"name":"Anorexia","score":12.741545893719806},{"name":"ADD/ADHD","score":9.3544137022397891},{"name":"Asthma","score":5.02854633289416},{"name":"Bipolar Disorder","score":3.8427755819060172}],"negatives":[{"name":"Dry Eyes","score":29.446640316205531},{"name":"Dry Mouth","score":22.891963109354414},{"name":"Headache","score":13.22463768115942},{"name":"Dizzy","score":3.7220026350461133},{"name":"Anxious","score":0.60386473429951693}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_011c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/546904/b/lemon-drop__primary_3da0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_2066.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/497743/b/lemon-drop__primary_9c13.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_5883.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/497196/b/lemon-drop__primary_2cd0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_9284.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/484811/b/lemon-drop__primary_df88.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_943e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/438863/b/lemon-drop__primary_24dc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_444e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/437005/b/lemon-drop__primary_c790.jpg"}],"photoTotalCount":44,"popularCities":["Vancouver, BC","Bellingham, WA","Everett, WA","Portland, OR","Seattle, WA","Spokane, WA","Colorado Springs, CO","Denver, CO","Los Angeles, CA","Lynnwood, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/lemon-drop","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.14814814814815/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":410,"slug":"lemon-drop","name":"Lemon Drop","subtitle":null,"symbol":"Ld","category":"Hybrid","description":"\u003cp\u003eLemon Drop is a mellow, fluffy bud that provides a pleasant, giggly sensation. This strain tends to provide a more euphoric, focused experience, though indica-dominant variations exist and produce a stronger body feeling that is relaxing yet not overpowering. Fittingly, Lemon Drop has a lemony, clean taste that is reminiscent of the candy of the same name.\u003c/p\u003e\n","descriptionPlain":"Lemon Drop is a mellow, fluffy bud that provides a pleasant, giggly sensation. This strain tends to provide a more euphoric, focused experience, though indica-dominant variations exist and produce a stronger body feeling that is relaxing yet not overpowering. Fittingly, Lemon Drop has a lemony, clean taste that is reminiscent of the candy of the same name.\n","aka":null,"rating":4.15,"highlightedReviews":[{"id":1417762,"username":"Bch0909","text":"I additionally used this strain to unwind because I was tired of working on an extensive policy brief due the next day, so I decided to kick back and vape a little lemon drop. when I was done, all I wanted to do was work!! this could be big pharmas worst enemy when it comes to ADD!! Adderall? forget it, this is much more fun and efficient. 4/5, I feel like the high doesn\u0027t last as long as other top shelfs. tastes like lemony goodness. I think it\u0027d be cool to put lemon Gatorade in a bong and smoke lemon drop, probably a solid flavor profile. anyways I\u0027m rambling. Taste through the vape was 5/5. straight terps, big milky hits should send a tingling sensation down your body. recommended for daytime use, highly functional, but also a great go to if you wanna kick back and watch Netflix. definitely sativa dominant tho. why? because it\u0027s fucking 4 am and I have to get up in less than 4 hours and I\u0027m writing an intricate pot review instead of sleeping","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1639908,"username":"Lins0530","text":"Love it! Has a great flavor !","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-43694","title":"5 Bold Bluegrass Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1506976615000)\/","text":"Dating back to the 18th century, bluegrass sits at the intersection of traditional Scottish, Irish, and English folk music. Settlers brought their ballads, dance music, and fiddles to the Appalachian Mountains in North America, where their individual melodies mixed together to create an uplifting sound that has been passed down from musician to musician for generations.\n\nBluegrass may be a cousin to folk, traditional, and Americana music, but at its heart it exists as one of the most distinct and noteworthy individual genres of our time. It is music that weaves stories and moves the soul—it’s a rich and colorful genre that can excite and invigorate the senses, especially with a little cannabis nearby.\nBelow, explore five bluegrass bands with your favorite pre-roll in hand—preferably on a rocking chair, soaking in the soulful tunes.\nLaws of Gravity by The Infamous Stringdusters\n\nStrain Pairing Recommendation: Tangilope\nThe Infamous Stringdusters’ latest album, Laws of Gravity, wastes no time as it bursts into life with their first track, “Freedom,” instantly immersing listeners in a rich and invigorating sound. The album, released this year, packs a powerful punch that is vibrant, complex and uniquely its own.\nLaws of Gravity manages to encapsulate the traditions of bluegrass while merging it with modern grooves and instrumentation. The bright movements of Jeremy Garrett’s fiddle and Chris Pandolfi’s banjo sing across the soundscape of bass, dobro, and guitar for a symphony that shines with and without the engaging and lively lyrics.\nWhen the lyrics do fade away, listeners enjoy the intricate improvisational jamming that is a hallmark of The Infamous Stringdusters. Laws of Gravity has a life of its own that proves once again why the band continues to be a resounding favorite across the genre’s fanbase.\nThe Muscle Shoals Recordings by The Steeldrivers\n\nStrain Pairing Recommendation: Blueberry Headband\nThe Muscle Shoals Recordings starts with light, happy banjo on the track “Long Way Down,” setting the tone for an album that combines the essence of bluegrass with rich complexity. Gary Nichols’ distinct and powerful voice, often accompanied by beautiful backing vocals, cruises effortlessly across the instrumentation and inspires with its authenticity and depth.\nThe Steeldrivers feature banjo, mandolin, guitar, bass, and fiddle for a full and delightfully classic bluegrass feel. The Muscle Shoals Recordings, produced in 2015, is the band’s fourth album and earned them a Grammy in the Best Bluegrass category.\nFrom the first track to the last, this is a spirited album that uplifts the mind and moves the body with energetic sound.\n\nThief by Keller \u0026 The Keels\n\nStrain Pairing Recommendation: Lodi Dodi\nWith a distinctly joyful beat, Thief picks you up and whisks you off into a dance of folky bluegrass with Keller William’s playful vocals leading the way. Williams is joined by Jenny Keel on upright bass and flat picker Larry Keel. Together, the three bring a decidedly full sound to their latest acoustic album.\nKeller \u0026 The Keels have never shied away from creative covers, and Thief, released in 2010, is no exception. Unlike their first album, Grass (released in 2006), Thief does not feature any original songs, focusing solely on covers. The album’s title is an ode to this decision.\nBluegrass versions of Amy Winehouse’s “Rehab” and Marcy Playground’s “Sex and Candy” are among the familiar but undeniably fresh covers. The tracks allow the listener to immediately jump in and sing along while still being immersed in new tunes and feelings.\nWilliams’ knack for composing solo music lends expertise to the composition of his trio, and as such, Thief has an intricacy that is impressive for such a small acoustic group.\nFriends of Fall by Crooked Still\n\nStrain Pairing Recommendation: Lemon Drop\nCrooked Still offers a unique bluegrass element that is light, airy, and melodic. Lead singer Aoife O’Donovan’s voice carries across the backdrop of banjo, bass, cello, and fiddle like a shooting star.\nFriends of Fall, released in 2011, brings an ethereal beauty and complexity to the genre of bluegrass. Songs such as “Pretty Bird” will stir emotion, while “It’ll End Too Soon” inspires and invigorates. Often described as ‘progressive bluegrass’ due to innovative acoustics, Crooked Still’s high-energy sound encourages engagement from the first note to the last thanks to its unique instrumentation.\nFriends of Fall is refreshing and wholly uplifting, carrying the spirit of bluegrass as it soars to new and delightful heights.\n\nLove. Ain’t Love  by Yonder Mountain String Band\n\nStrain Pairing Recommendation: Afgooey\nLove. Ain’t Love, released this year, is the latest from Yonder Mountain String Band, encompassing a full thirteen tracks of rich and engaging rhythms that will keep you on your toes.\nFeaturing five band members on banjo, bass, fiddle, guitar, and mandolin, Yonder Mountain String Band also has the distinction of all five members acting as vocalists, which allows them to create beautifully layered and rich harmonies.\nOn the other hand, Love. Ain’t Love does not shy away from fully instrumental tracks, such as “Fall Outta Line,” which showcases the band’s innovation in its tune. This ability to embrace the full merits of their instrumentation has won YMSB fans across various genres, including those in the jam band scene. When listening to Love. Ain’t Love, one can get lost in the music as it paints stories with and without lyrics.\nLove. Ain’t Love provides a playful, energetic, and creative soundscape. The passion and vibrancy in every note of the album act as joyful reminders that Yonder Mountain String Band continues to inspire and be inspired by bluegrass, even 18 years after the release of their first album.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/10/02124702/bluegrass-albums-while-high.jpg","urlslug":"/news/lifestyle/bluegrass-albums-listen-high"},{"id":"contentitems-34817","title":"5 Rustic Americana Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1500942707000)\/","text":"Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg","urlslug":"/news/lifestyle/americana-albums-listen-high"}],"reviewCount":162,"flavors":[{"name":"Lemon","score":91.337285902503282},{"name":"Sweet","score":24.489459815546773},{"name":"Citrus","score":21.563460693895479},{"name":"Diesel","score":12.620772946859903},{"name":"Woody","score":10.05709266578832}],"effects":[{"name":"Relaxed","score":77.700922266139656},{"name":"Focused","score":76.471234079929729},{"name":"Uplifted","score":72.139877031181371},{"name":"Happy","score":71.920289855072468},{"name":"Euphoric","score":54.611330698287219}],"symptoms":[{"name":"Stress","score":53.765920070267896},{"name":"Depression","score":42.380324989020636},{"name":"Fatigue","score":30.753184014053581},{"name":"Lack of Appetite","score":21.612867808519983},{"name":"Insomnia","score":8.6297760210803673}],"conditions":[{"name":"Anxiety","score":42.160737812911719},{"name":"Anorexia","score":12.741545893719806},{"name":"ADD/ADHD","score":9.3544137022397891},{"name":"Asthma","score":5.02854633289416},{"name":"Bipolar Disorder","score":3.8427755819060172}],"negatives":[{"name":"Dry Eyes","score":29.446640316205531},{"name":"Dry Mouth","score":22.891963109354414},{"name":"Headache","score":13.22463768115942},{"name":"Dizzy","score":3.7220026350461133},{"name":"Anxious","score":0.60386473429951693}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_011c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/546904/b/lemon-drop__primary_3da0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_2066.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/497743/b/lemon-drop__primary_9c13.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_5883.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/497196/b/lemon-drop__primary_2cd0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_9284.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/484811/b/lemon-drop__primary_df88.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_943e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/438863/b/lemon-drop__primary_24dc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-drop_100x100_444e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/437005/b/lemon-drop__primary_c790.jpg"}],"photoTotalCount":44,"popularCities":["Vancouver, BC","Bellingham, WA","Everett, WA","Portland, OR","Seattle, WA","Spokane, WA","Colorado Springs, CO","Denver, CO","Los Angeles, CA","Lynnwood, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/lemon-drop","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.14814814814815/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
