{"sl_translate":"description,descriptionPlain,category","id":178576,"slug":"tommys-home-grown","name":"Tommy\u0027s Home Grown","subtitle":null,"symbol":"Thg","category":"Hybrid","description":"\u003cp\u003eTommy\u0026rsquo;s Home Grown, or THG for short, is a balanced hybrid strain that falls under the \u0026ldquo;Chong Certified\u0026rdquo; label. Exclusively offered at \u003ca href=\"https://www.leafly.com/dispensary-info/encanto-green-cross\"\u003eEncanto Green Cross\u003c/a\u003e in Phoenix, THG delivers uplifting and energizing effects alongside a sweet tropical aroma. Comfortable and functional, Tommy\u0026rsquo;s Home Grown is a favorite for winding down after a long and stressful day.\u003c/p\u003e\n","descriptionPlain":"Tommy\u0026rsquo;s Home Grown, or THG for short, is a balanced hybrid strain that falls under the \u0026ldquo;Chong Certified\u0026rdquo; label. Exclusively offered at Encanto Green Cross in Phoenix, THG delivers uplifting and energizing effects alongside a sweet tropical aroma. Comfortable and functional, Tommy\u0026rsquo;s Home Grown is a favorite for winding down after a long and stressful day.\n","aka":"T.H.G., THG, Tommys Home Grown","rating":4,"highlightedReviews":[{"id":1212057,"username":"martinezd","text":"This is one of the four new Certified Tommy Chong Strains only available at Encanto Green Cross Dispensary.\nI got to try three of the four but this was the most sativa dominant.\n\nIt has a tropical taste with a hint of earthly flavor, and brings to mind that comfortable feeling of home.  I was energetic and uplifted.  \nDispensary recommends THG to aid in stress, depression, and a variety of inflammatory conditions.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1416648,"username":"PresidentDonaldTwitt","text":"Lol,  nutty?  There is no dominant nutty terpenoids. Just like \"garlic\".  These buds have soaked up the smell of organic pesticides. Its in the plant fiber, not the resins, very easy to tell once you start vaporizing like a modern tokers should. \n\nSame with these stupid \"milk\"  strains.  Do they come with instructions on how to grow them?  With pesticides that smell nutty, garlicy or milky?  Unless the buds smell like a Chinese restaurant, that \"nutty\"  smell is Azadirachtin, a controversial birth defect causing nut derived pesticide. I never smelled any of this crap out of the hundreds of lbs of Northwest bud that passed through my hands.  Real growers know better than to grows strains dependent on pesticides.  Stay away from the nutty butty!  Once you learn how Cannabis phenotypes differ from each other,  you can grasp the fact that this weed is commercially grown in Az, and does not reflect medical quality Cannabis in any regard. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/0/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3251","title":"New Strains Alert: Cherry OG, WSU, OG Chem, Tommy\u0027s Home Grown, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1441987200000)\/","text":"New and trending strains have just been added to the Leafly strain Explorer! See any that look familiar? If so, we want to see those strain reviews pouring in. Otherwise, check out the links below to find out if any of these new strains are offered near you!\n \n 1. Cherry OG\n\nCherry OG by Emerald Triangle Seeds is a hybrid cannabis strain bred by combining Cherry Thai, Afghani, and Lost Coast OG genetics. A 50/50 hybrid, Cherry OG truly brings you the best of both sativa and indica worlds as it delivers full-body euphoria alongside high-flying cerebral lucidity. While its name sets expectations of a fruity cherry aroma, this strain can sometimes express more sour and diesel-like flavors.\n\nFind out which locations are currently carrying Cherry OG\n \n 2. WSU\n\nWSU is a Washington-grown rendition of the indica strain Chemo and it’s waiting for you on the shelves of recreational stores state-wide. Named in homage to Washington State University, don’t confuse this strain with the UW indica, whose name is derived from the rivaling University of Washington. Its effects are described as relaxed and spacey. Citrus and berry flavors invade the palate on the inhale, providing a flavorful introduction to WSU’s heavy indica effects.\n\nFind out which locations are currently carrying WSU\n \n 3. Tommy\u0027s Home Grown\n\nTommy’s Home Grown, or THG for short, is a balanced hybrid strain that falls under the “Chong Certified” label. Exclusively offered at Encanto Green Cross in Phoenix, THG delivers uplifting and energizing effects alongside a sweet tropical aroma. Comfortable and functional, Tommy’s Home Grown is a favorite for winding down after a long and stressful day.\n\nTommy\u0027s Home Grown is available at Encanto Green Cross in Phoenix, AZ\n \n 4. NL5 Haze Mist\n\nNL5 Haze Mist by Green House Seeds is a classic sativa-dominant strain that mixes genetics from Northern Lights #5, Haze, and Kali Mist. Though primarily cerebral in effect, NL5 Haze Mist also provides a light body buzz that eases muscles into relaxation. This sativa brings a newfound vibrancy to the senses, allowing you to unlock creativity and appreciation of your surroundings.\n\n \n 5. SinMint Cookies\n\nSinMint Cookies is Sin City Seeds’ signature hybrid cross between GSC (f.k.a Girl Scout Cookies) and Blue Power. Leaning slightly to the indica side, SinMint Cookies provides powerfully euphoric effects that let your mind float blissfully away from the day’s stresses. Its aroma is a subtle mix of earthy sweetness with a trace of sharp mint.\n\nFind out which locations are currently carrying SinMint Cookies\n \n 6. Training Day\n\nBred by DNA Genetics, Training Day is a 70% indica that combines parent strains Trainwreck and LA Confidential. This California native takes after its LA Confidential parent in aroma and delivers a pungent earthy and pine flavor. As demonstrated by its thick blanket of crystal resin, Training Day will put your THC tolerance to the test so novices should approach this strain with caution.\n\nFind out which locations are currently carrying Training Day\n \n 7. OG Chem\n\nOG Chem, also called Chem OG, is a sativa-dominant cross between two legendary strains, Chemdawg and OG Kush. The diesel notes of Chemdawg combine with the sour, piney scent of OG Kush to create a pungent skunky aroma that fills the room. Uplifting and euphoric, OG Chem invites the mind to indulge in its creative side while elevating the mood to a light and carefree state.\n\nFind out which locations are currently carrying OG Chem\n \nCheck out our other new strains recently added to the Leafly Explorer, or catch up on last week\u0027s New Strains Alert!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/09/12002025/new-strains-alert-cherry-og-wsu-tommy.png","urlslug":"/news/strains-products/new-strains-alert-cherry-og-wsu-tommy"}],"reviewCount":16,"flavors":[{"name":"Earthy","score":2.9411764705882351},{"name":"Spicy/Herbal","score":1.4705882352941175},{"name":"Tropical","score":1.4705882352941175},{"name":"Woody","score":1.4705882352941175},{"name":"Nutty","score":1.4705882352941175}],"effects":[{"name":"Energetic","score":7.3529411764705888},{"name":"Relaxed","score":5.88235294117647},{"name":"Uplifted","score":4.4117647058823533},{"name":"Creative","score":4.4117647058823533},{"name":"Focused","score":4.4117647058823533}],"symptoms":[{"name":"Stress","score":4.4117647058823533},{"name":"Depression","score":2.9411764705882351},{"name":"Lack of Appetite","score":1.4705882352941175}],"conditions":[{"name":"ADD/ADHD","score":1.4705882352941175},{"name":"Crohn\u0027s Disease","score":1.4705882352941175},{"name":"Gastrointestinal Disorder","score":1.4705882352941175}],"negatives":[{"name":"Dry Eyes","score":1.4705882352941175},{"name":"Dry Mouth","score":1.4705882352941175}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/tommy-s-home-grown_100x100_fbfa.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/457522/b/tommy-s-home-grown__primary_2fd6.jpg"}],"photoTotalCount":1,"popularCities":[],"permalink":"https://mobileapi.leafly.com/hybrid/tommys-home-grown","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
