{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1514495213000)/",
            "id": "contentitems-52994",
            "text": "New Year’s resolutions are an excellent way to jump-start your goals and keep you focused for the year ahead. But they can also be difficult to maintain as time moves forward—motivation wanes and life gets in the way. We get it, so to help you accomplish your goals, we gathered a few cannabis strains that will keep you on the right track (long past January).\n\nWhether you want to get fit, obtain a healthy weight, increase your productivity, get more sleep, or lower your stress levels, there’s a strain that can help you stay on top of these resolutions and enhance your overall well-being. Head to your favorite dispensary to load up on these picks before the clock strikes midnight on December 31st.\nWhat strains do you use to stay motivated? Tell us about them in the comments.\nUp Your Fitness Game With Green Crack\nIf your goals include running a 10K, bench pressing your partner, or simply increasing your confidence, there are plenty of reasons why working out is such a popular New Year’s resolution. It can be hard to stay motivated when it comes to fitness, so choosing a strain that offers an abundance of energy is a great way to boost morale and steer you away from winter hibernation.\nStrain Recommendation: Green Crack is the perfect strain for spiking your energy, holding your focus, and warding off fatigue. With a fruity, sweet flavor that pairs perfectly with a healthy breakfast, this bright sativa will kick you into high gear and stick with you on your morning run.\n\nEmbrace Self Care and Get More Sleep With Northern Lights\nIt’s a busy world, and too many of us get so wrapped up in our responsibilities that we forget about one of the most important things we can do for our health: sleep. Lack of sleep increases your risk for a variety of health issues, while quality sleep can improve focus, concentration, memory, and physical well-being. The first step to a great day is a good night’s sleep; to ensure you are performing at your best, avoid strains that will keep you wired into the late evening and opt for ones that promote a healing slumber.\nStrain Recommendation: Northern Lights is the optimal strain for bedtime bliss. This pure indica melts into the body and calms the mind. Make a cup of tea, light up a joint, and sink into pure alleviation.\nStay Focused and Be Productive With Durban Poison\nIf you’re like me, you’re constantly thinking about how to be a more productive person, but maintaining focus doesn’t always come easy. The New Year is the perfect time to reassess your productivity goals so you can be your best self in work, school, or any other important obligations. If this is your goal, reach for a strain that complements and enhances a sharp mind.\nStrain Recommendation: Durban Poison is the cure for de-motivation. Known for its energizing properties and aid to creativity, this sativa will uplift your mood and give you the push you need to become a productivity machine.\n\nObtain a Healthy Weight With Remedy and Banana OG\nOne of the top goals on everyone’s New Year’s resolutions lists is to lose weight. But for some, it can be equally important to maintain or put on a few pounds. Whatever your goal, reaching a healthy weight can seem a daunting task that is especially difficult to sustain. With a little help from cannabis, you may be able to cross this resolution off your list sooner than you think.\nStrain Recommendation: Remedy is a great strain for avoiding the munchies. A high-CBD indica, this strain has trace amounts of THC, but packs a powerful punch against pain, anxiety, and superfluous hunger. Its sweet, floral, and citrus notes will leave you free to indulge in a tasty treat—without all the calories.\nBanana OG steps up to the plate for those who need a little help stimulating their appetite. If you have a hard time keeping weight on or maintaining your weight without the scale dropping, Banana OG will open you up to the munchies and keep you feeling comfortable in indulging. This strong hybrid suits its name with powerful banana flavors and a 25% THC content that will get your stomach rumbling in no time.\n\nLower Your Stress Levels With Blue Dream\nWhen looking back over the past year, with all of its trials and tribulations, you may feel that all you did was stress. You’re not alone, and that’s why the promise of a new year can bring renewed peace and tranquility for so many. If your New Year’s resolution is to stress less and live more, then you’ll want a cannabis strain that can take the edge off.\nStrain Recommendation: Blue Dream is a legendary strain for a reason, and when it comes to conquering stress, few do it as well as a bowl packed with this long-time favorite. This buzzy hybrid works wonders for embracing full-body relaxation without a sedating mental fog—replacing stress with euphoric calm.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/28130345/strains-new-year-resolution.jpg",
            "title": "5 Strains to Help You Reach Your Goals in the New Year",
            "urlslug": "/news/strains-products/5-strains-goals-in-the-new-year"
        },
        {
            "author": "Lisa Rough",
            "category": null,
            "date": "/Date(1435011180000)/",
            "id": "contentitems-3527",
            "text": "There was some beautiful competition at the NorCal High Times Cannabis Cup this past weekend and we were there to cover all of the action. Among all of the hubbub and hoopla, here are the winners of this year’s 2015 NorCal Cannabis Cup:\n \nCANNABIS FLOWER WINNERS\n\nBest Sativa Cannabis Strains\n1st Place: Schlemons by The Source Genetics\n2nd Place: Super Silver Haze by Life is Good\n3rd Place: Super Glue by Vallejo Patients Care\n \nBest Indica Cannabis Strains\n1st Place: Zkittles by 3rd Gen Family\n2nd Place: Kosher Kush from DNA by Greenwolf Los Angeles and Cali Kush Farms\n3rd Place: 24K OG Kush by Strain Collective with Pearl Pharma\n \nBest Hybrid Cannabis Strains\n1st Place: Orange Crush by Cannabiotix\n2nd Place: Tahoe Chem by C.R.A.F.T.\n3rd Place: Chiquita Banana by Utopia Meds – Santa Cruz\n \nBest CBD Cannabis Flower\n1st Place: CBD OG by C.R.A.F.T.\n2nd Place: Doctor Cookies by Northstar Holistic Collective\n3rd Place: Sunkiss CBD by California Growers Guild\n \nCANNABIS CONCENTRATE WINNERS\n\nBest Sativa Cannabis Concentrates\n1st Place: Citrix #4 by Gold Coast Collection with Apothecary 420\n2nd Place: Purple Tangie by Zeinstein Gardens & Loudpack Extracts\n3rd Place: Double Tangie Banana by Crockett Family Farms\n \nBest Indica Cannabis Concentrates\n1st Place: AHHS Brand OG by Alternative Herbal Health Services\n2nd Place: Banana OG by Crockett Family Farms\n3rd Place: Crown OG Live Resin by Prime Extractions\n \nBest Hybrid Cannabis Concentrates\n1st Place: Emperors Mandarins “Shatter” by the Kind Center with Unregistered Extracts\n2nd Place: Emperors Mandarins by Greenwolf Collective X Cali Kush Farms\n3rd Place: Crown OG x Dab Vader OG Zombie Resin by Crown Genetics\n \nBest Non-Solvent Hash Products\n1st Place: Kimbo Kush Cubantech Drysift by Cubanhashqueen with Exotic Genetix\n2nd Place: Cookies & Cream Cubantech Drysift by Exotic Genetix\n3rd Place: Peaches ‘N Cream by Full Flava Extracts with E.T. Extracts\n \nCANNABIS-INFUSED EDIBLE WINNERS\n\n1st Place: Dark Chocolate Macaroons by Utopia Meds\n2nd Place: Pineapple Delight Bites by Lifted Edibles\n3rd Place: Cinnamon Maple Tree Hugger – Om Edibles & Gold Drop Collaboration\n \nCANNABIS TOPICAL WINNERS\n\n1st Place: Crown OG “It’s the Balm Haling Salve” by Crown Genetics\n2nd Place: Honey Pot Bear Butter by Honey Pot with Pure Joy Collective\n3rd Place: Absorb CBD Topical Relief by Absorb with Seasonal Apothecary\n \nHIGH CBD PRODUCT WINNERS\n\nBest High CBD Cannabis Concentrates\n1st Place: Goji D.C. Live Resin by Moxie Genetics\n2nd Place: ACDC by Scapegoat Genetics\n3rd Place: ACDC by Dankman Extrax\n \nBest High CBD Cannabis Edibles\n1st Place: Raw CBD Sipping Cacao by Om Edibles All Female Collective\n2nd Place: Beezle’s CBD Brulee – Chocolate Orange by Beezle Extracts\n3rd Place: CBD/THC Honey by Baked Beez with the W.E.E.D. Studio City",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/06/12002748/the-2015-norcal-cannabis-cup-winners.jpg",
            "title": "The 2015 NorCal Cannabis Cup Winners",
            "urlslug": "/news/strains-products/the-2015-norcal-cannabis-cup-winners"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 22.112771739130434
        },
        {
            "name": "ADD/ADHD",
            "score": 16.168478260869566
        },
        {
            "name": "PTSD",
            "score": 11.141304347826086
        },
        {
            "name": "Bipolar Disorder",
            "score": 9.307065217391305
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 8.389945652173914
        }
    ],
    "description": "<p>Banana OG is an indica-dominant cross between <a href=\"http://leafly.com/hybrid/og-kush\">OG Kush</a> and Banana. With a smell and flavor of overripe bananas, this hybrid definitely earns its name. Banana OG has tested at over 25% THC and has a reputation as a &ldquo;creeper,&rdquo; leaving those who over-imbibe in a near comatose state before intense hunger and sleepiness sets in. Patients treating muscular pain, loss of appetite, and insomnia may benefit from Banana OG.</p>\n",
    "descriptionPlain": "Banana OG is an indica-dominant cross between OG Kush and Banana. With a smell and flavor of overripe bananas, this hybrid definitely earns its name. Banana OG has tested at over 25% THC and has a reputation as a &ldquo;creeper,&rdquo; leaving those who over-imbibe in a near comatose state before intense hunger and sleepiness sets in. Patients treating muscular pain, loss of appetite, and insomnia may benefit from Banana OG.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 71.73913043478261
        },
        {
            "name": "Happy",
            "score": 60.39402173913044
        },
        {
            "name": "Euphoric",
            "score": 56.55570652173913
        },
        {
            "name": "Sleepy",
            "score": 49.32065217391305
        },
        {
            "name": "Tingly",
            "score": 46.297554347826086
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 29.6875
        },
        {
            "name": "Earthy",
            "score": 21.671195652173914
        },
        {
            "name": "Tropical",
            "score": 20.618206521739133
        },
        {
            "name": "Pungent",
            "score": 16.338315217391305
        },
        {
            "name": "Honey",
            "score": 14.334239130434783
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1416338,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Banana OG.  Where do I start?  Potency is sky high.  Not a strain you want to smoke when you have stuff to do.  Doesn't put you to sleep as much as it just makes you feel comatose.  Lets you live in your own head for a bit, very introspective yet no anxiety!  This is a strain you smoke and then tell a complete stranger your complicated theories on the origins of life lol.  Flavors are strong in this order: Bananas, then Vanilla, then...grass of all things!  It has a very strong leafy green aftertaste.  That being said, super strong.  It's the one you bust out at a party when people whine about how weak the bud is lol.  Knock em on their ass.",
            "username": "sud0"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1635292,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "great for sleep aid. Its definatly a creeper, 64 day flower smells of Light Roast coffee and hints of chocolate, tast like good kush and sweet hash undertones",
            "username": "AlkemistLost"
        }
    ],
    "id": 3110,
    "name": "Banana OG",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 42.52717391304348
        },
        {
            "name": "Dizzy",
            "score": 11.71875
        },
        {
            "name": "Dry Eyes",
            "score": 9.375
        },
        {
            "name": "Paranoid",
            "score": 8.186141304347826
        },
        {
            "name": "Anxious",
            "score": 7.846467391304348
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/og-kush",
            "category": "Hybrid",
            "name": "OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/og-kush",
            "slug": "og-kush",
            "subtitle": null,
            "symbol": "Ogk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/banana-og",
    "photoTotalCount": 85,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001541/b/banana-og__primary_6c32.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/banana-og_100x100_737e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630417/b/banana-og__primary_d527.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/banana-og_100x100_8ac0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/614639/b/banana-og__primary_8ed2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/banana-og_100x100_1117.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/586554/b/banana-og__primary_c76f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/banana-og_100x100_cca4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/520910/b/banana-og__primary_af8f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/banana-og_100x100_1450.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/499762/b/banana-og__primary_fcf8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/banana-og_100x100_175c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Los Angeles, CA",
        "Portland, OR",
        "San Diego, CA",
        "Detroit, MI",
        "Everett, WA",
        "Las Vegas, NV",
        "Seattle, WA",
        "Spokane, WA",
        "Bellingham, WA",
        "Eugene, OR"
    ],
    "rating": 4.38,
    "relatedStrains": [],
    "reviewCount": 332,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "banana-og",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.38253012048193/240",
    "subtitle": null,
    "symbol": "Bng",
    "symptoms": [
        {
            "name": "Stress",
            "score": 43.58016304347826
        },
        {
            "name": "Insomnia",
            "score": 40.99864130434783
        },
        {
            "name": "Pain",
            "score": 34.74864130434783
        },
        {
            "name": "Depression",
            "score": 31.41983695652174
        },
        {
            "name": "Nausea",
            "score": 17.49320652173913
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
