{"sl_translate":"description,descriptionPlain,category","id":222063,"slug":"og-skunk","name":"OG Skunk","subtitle":null,"symbol":"Osk","category":"Hybrid","description":"\u003cp\u003eA cross between \u003ca href=\"https://www.leafly.com/hybrid/og-18\"\u003eOG #18\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/hybrid/skunk-1\"\u003eSkunk #1\u003c/a\u003e, OG Skunk is a 60% sativa-dominant hybrid from DNA Genetics. Flavors of sour fuel and skunky citrus are sure to please fans of both parent strains, while the high offers a nice uplifting head effect along with a relaxing body buzz. Its THC levels have been measured between 16% and 22%.\u003c/p\u003e\n","descriptionPlain":"A cross between OG #18 and Skunk #1, OG Skunk is a 60% sativa-dominant hybrid from DNA Genetics. Flavors of sour fuel and skunky citrus are sure to please fans of both parent strains, while the high offers a nice uplifting head effect along with a relaxing body buzz. Its THC levels have been measured between 16% and 22%.\n","aka":"Skunk OG","rating":4.58,"highlightedReviews":[{"id":1416661,"username":"GhostOfJack","text":"This combines 2 of my favorite strains from 2 different decades.  I loved skunk #1 in the  late 90s and early 2000s  What I Love about skunk #1 is its versatility and resistance to tolerance.  Ive came across hundreds of strains in my life and some were great but often times the high thc strains became like drinking decaf after a few weeks of daily use.  S1 can be smoked morning, afternoon or evening, its downside is it doesnt put you down after a hard workday and thats where private reserve (og #18) shines.  It has the ability to be used in the day but if you want to to be put out just overindulge, its very potent and has this lemony gas dankness that keeps me coming back.  Crossing these two brought out the best is both world, now I have a high flying High THC strain that isnt prone to rapid tolerance.  The Skunk #1 adds a little more old school chronic smell and taste to the weed that brings back memories.  the Skunk #1 adds an element of extra happyness.  Def going to add this to my rotation this summer!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1636413,"username":"classicbenny","text":"While bearing a unique flavour, this strain defies the ugly part of its name as well as provides mood lifting effects. An easy 5.0 from me!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-49877","title":"11 Unsung Cannabis Strains Worth Discovering","author":"Brett Konen","category":null,"date":"\/Date(1511894705000)\/","text":"As we explored recently with our list of 9 Most Overhyped Cannabis Strains, a few of the best-known cannabis varieties on the market are a little overrated. Correspondingly, it’s no surprise that there are some underrated cannabis strains out there, too.\n\nThe following represent 11 varieties of cannabis that we think get less love than they deserve, based on Leafly review data, regional availability, and the personal experiences of our cannabis expert team. This is far from an exhaustive list—with thousands of strains available in the world, it’s virtually impossible to give all of them the attention we wish we could. Nevertheless, take the following as just a few recommendations of lesser-known types you should keep an eye out for—who knows? You just might find your new favorite strain among them.\nTahoe OG Kush\nStrain type: Hybrid\nParent strains: OG Kush, SFV OG Kush\nWhy it’s underrated: “Tahoe OG isn’t underrated in the traditional sense of the word. In fact, most people I know who’ve come across this select OG Kush phenotype will share their excitement for the pungent, piney sweetness and the strain’s dynamic mix of deep relaxation and profound euphoria. However, when I think of the OG family tree, the Tahoe cut doesn’t seem to get quite the same notoriety that some of its relatives. The SFV, Larry, and Fire OGs manage to capture a lot of the buzz, while other cuts, like the Ghost and WiFi OGs, have somewhat cult followings. This leaves room for Tahoe OG to stand on its own, which is OK by me. I love its dank, complex aroma and the sedating effects, so the less hype there is for Tahoe OG, the more of this delicious strain is available for me!” —Will Hyde\n\nLodi Dodi\nStrain type: Hybrid\nParent strains: Undisclosed\nWhy it’s underrated: “This strain is a mainstay in the Pacific Northwest, but still flies beneath the radar outside the region. Sativa-dominant in effect, this unknown cultivar has been propagated throughout the Evergreen State for decades. Lodi Dodi’s airy physical lightness and uplifting mental buzz allow the consumer to metaphorically levitate two inches above their problems and their pain. I personally enjoy working out after consuming this strain for its stimulating aura and a mental haze that allows me to fade into my headphones and run forever. It’s equally satisfying on the dancefloor or in the bedroom, as long as you mind your dosage. Lodi Dodi came to party—it don’t cause trouble or bother nobody.” —Jeremiah Wilhelm\nChocolope Kush\nStrain type: Hybrid\nParent strains:  Chocolope, Kosher Kush\nWhy it’s underrated: “This is, weirdly, one of the lowest-rated strains on Leafly (yep, a four-star rating is on the low end—Leafly reviewers give most cannabis pretty high marks), but riddle me this: How can a marriage of superstars like Chocolope and Kosher Kush possibly be bad? Those parent strains are two of our all-time faves (in fact, both landed on our Top 100 Strains list) and given that the apple rarely falls far from the tree, this super-low rating for Chocolate Kush is undeserved.” —Brett Konen\n\nDancehall\nStrain type: Hybrid\nParent strains: Juanita La Lagrimosa, Kalijah\nWhy it’s underrated: “Dancehall is an exceptional CBD-dominant strain that doesn’t get much recognition by comparison to CBD hallmarks like Harlequin, ACDC, Charlotte’s Web, and Cannatonic. With a near 21:1 CBD:THC ratio, Dancehall delivers soothing, easygoing effects with just enough sativa-dominant influence to elevate mood, which makes it a constant companion for consumers who like to stay level and clearheaded while enjoying cannabis. The terpene profile also offers deeper, skunkier notes than the usual grassy, hay-like aroma CBD strains are known for. Whether you’re enjoying it for what it is, or blending with your THC-dominant strains, Dancehall adds something special and drastically underappreciate to any joint or bowl.” —Jeremiah Wilhelm\nBay Dream\nStrain type: Sativa\nParent strains: Blue Dream, Bay 11\nWhy it’s underrated: “Bay Dream is an uplifting strain with sharp citrus notes and subtle earthiness. It seems to be overlooked because of its polarizing parent strain, Blue Dream, but in combination with the sweet, skunky flavors and focused headspace of Bay 11 the mix is a pleasant surprise. I appreciate that Bay Dream trades some of Blue Dream’s fruit notes for a deeper, more poignant Kush-like palate of flavors. So, if you’re in the ‘Blue Dream is overrated’ crowd, don’t shy away from Bay Dream—you might be amazed by how much this strain expresses its individuality.” —Will Hyde\n\nSour Urkle\nStrain type: Hybrid\nParent strains: Sour Diesel, Purple Urkle\nWhy it’s underrated: “Sour Urkle is the potent union of pungent, polar opposites. Created from Sour Diesel and Purple Urkle, this funky and surprisingly affordable bud packs the best of both strains into one frosty package. This strain emits an odd floral and chemical aroma that is contrasted against a latent but tangible sweetness brought forth by the fruitiness of Purple Urkle. This flavor profile can be challenging for some, but the effects are undeniably heady while draping the body in a soothing, mellow aura.” —Jeremiah Wilhelm\nPresidential Kush\nStrain type: Indica\nParent strains: Bubble Gum, OG Kush\nWhy it’s underrated: “Easily one of the more picturesque strains I’ve come across, Presidential Kush (also known as Presidential OG) expresses itself with deep green and purple hues. A thick blanket of trichomes adds another dimension to the strain’s aesthetic, but PK is so much more than just a pretty flower. It’s a potent, complex, and flavorful experience that only takes a puff or two before you feel the comforting weight of deep relaxation wash over you. The piney, diesel flavors make it hard to put down, and I still find myself embarking on epic journeys just to track down this beautiful bud. In my opinion, genetics this compelling should be easier to find and should be garnering more attention in the cannabis community, so for that reason, I’d like to encourage more growers to add this strain to their stable, and if you find it at your local dispensary as a consumer, definitely do not overlook it!” —Will Hyde\n\nDurban Poison\nStrain type: Sativa\nParent strains: African\nWhy it’s underrated: “Landrace strains, including Durban Poison, are hard to find and often faked. As such, many people have had a less-enjoyable-than-average experience with a strain they believed, mistakenly, to be the landrace advertised on the packaging. Durban Poison is a fantastic pure sativa that many people, including myself, loved at first smoke, so if Durban Poison didn’t wow you the first time around, give it another chance—that first batch might have been something else that was merely masquerading as this iconic strain.” —Brett Konen\nApple Jack\nStrain type: Hybrid\nParent strains: Jack Herer, White Widow\nWhy it’s underrated: “Apple Jack hasn’t gained much in the way of ratings on Leafly, but that doesn’t mean it’s a dud. It blends two well-known cuts together (Jack Herer x White Widow) to create something greater than the sum of its parts. Apple Jack’s initially clear-headed high relieves stress while elevating the mind and encouraging creativity. The happy effects and accessible THC concentration make it a friendly flower for consumers of all potency levels. And even though its flavor doesn’t always live up the name, Apple Jack’s sweet, earthy terpene profile still offers satisfying flavors alongside a productive buzz.” —Jeremiah Wilhelm\n\nPlushberry\nStrain type: Indica\nParent strains: Black Cherry Soda, Space Queen\nWhy it’s underrated: “Plushberry is an incredible strain that’s underrated simply because it hasn’t appeared to travel beyond the Pacific Northwest. Wrapped in beautiful lavender foliage, it smells like sweet wildflowers and mixed berries, and if you have the chance to try it while you’re in the area, Plushberry is a strain you won’t soon forget.” —Bailey Rahn\nSkunk No. 1\nStrain type: Hybrid\nParent strains: Afghani, Acapulco Gold, Colombian Gold\nWhy it’s underrated: “Even if you don’t love the flavor of the flower itself, you’ve got to respect a strain that’s given us so many of our favorites on the market—I’m talking Green Crack, Island Sweet Skunk, Amnesia, Pineapple Chunk, UK Cheese, and so many more. Skunk No. 1 is a true original among cannabis strains, and while its skunky flavor is an acquired taste, you’re smoking a piece of history with Skunk No. 1—so respect your elders.” —Brett Konen","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/28103218/most-underrated-cannabis-strains.jpg","urlslug":"/news/strains-products/11-underrated-marijuana-strains"},{"id":"contentitems-3241","title":"New Strains Alert: Butter OG, Blackberry Pie, Khufu, Mammoth, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1461360600000)\/","text":"The Leafly database was just updated with some new strains, and we\u0027re curious to hear if you\u0027ve tried any of them! New varieties are born every day, so we\u0027d like to hear from you — which strains should we add next? Let us know in the comments below!\n \n  1. Blackberry Pie\n\nBlackberry Pie is a hybrid cross of Jojorizo’s Blackberry Widow and a Crystal Locomotive created by Gage Green Genetics. This hybrid is easy to grow and all phenotypes present the potency and high resin content you would expect given its White Widow and Trainwreck heritage. A beautiful and aromatic plant featuring flowers with deep purple hues and ample trichomes, Blackberry Pie offers a nice blend of heady euphoria with a medicinal body high.\n\n \n  2. Butter OG\n\nWhile there is not much information available on the origins of Butter OG, it is generally thought to be an indica-dominant strain as it gives users a very relaxing, giggly high that gradually fades to sleepiness. Its dense, sparkly buds give off a fruity scent with slight undertones of ammonia. The smoke is very light and smooth, with sweet flavors on the inhale and, like its name suggests, a buttery aftertaste. Butter OG is potentially beneficial for treating pain, anxiety, depression, and insomnia.\n\n \n  3. Blueberry Blast\n\nA mostly sativa hybrid from Snow High Seeds, Blueberry Blast is a the result of the famous Blueberry–Haze genetics of Blue Dream being pollinated by a Johnny Blaze male. These flowers smell strongly of blueberry, musk, and sweet candy, and taste like cedar and berries when smoked or vaped. A definite sativa effect is to be expected, with soaring, trippy highs that gradually fade into relaxation.\n\n \n  4. Mammoth\n\nThis hybrid from The Bank Cannabis Genetics is a cross between the sativa-dominant Snowcap and indica-dominant LA Confidential. There isn’t a lot of information available on Mammoth, but the breeder suggests that growers should look for phenotypes featuring the enormous yields of Snowcap, the shorter flowering time and manageable height of LA Confidential, and the dense buds, high potency, resin production, and disease resistance of both parents.\n\n \n  5. Khufu\n\nKhufu is an indica-dominant hybrid from The Devil’s Harvest Seed Company that combines Cheese, Afghani #1, and SFV OG genetics to excellent effect. Growers can expect extremely high yields of potent Kush-type flowers, with giant calyxes and very little leaf. The effects of Khufu will leave you wanting nothing more than to gorge on snacks while glued to your favorite chair. Patients treating pain, anxiety, nausea, and insomnia may benefit from Khufu’s therapeutic effects.\n\n \n  6. OG Skunk\n\nA cross between OG #18 and Skunk #1, OG Skunk is a 60% sativa-dominant hybrid from DNA Genetics. Flavors of sour fuel and skunky citrus are sure to please fans of both parent strains, while the high offers a nice uplifting head effect along with a relaxing body buzz. Its THC levels have been measured between 16% and 22%.\n\n \n  7. Merlot OG\n\nSoCal cannabis breeders Ocean Grown Seeds originally designed the Merlot OG in 2006 as an attempt to create an OG Kush-type plant with deep purple colors by crossing Larry OG and Grape Ape. The resulting plant was then crossed with Blackberry Rhino x SFV OG and then backcrossed to stabilize its OG characteristics. Merlot OG produces large, dense indica-type buds that are blanketed in white trichomes and will often turn dark purple, especially in cooler conditions.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/04/12002008/new-strains-alert-butter-og-blackberry-pie-khufu-mammoth-and-more.jpg","urlslug":"/news/strains-products/new-strains-alert-butter-og-blackberry-pie-khufu-mammoth-and-more"}],"reviewCount":40,"flavors":[{"name":"Skunk","score":46.47286821705427},{"name":"Earthy","score":36.31782945736434},{"name":"Woody","score":33.565891472868216},{"name":"Chestnut","score":25},{"name":"Citrus","score":5.6589147286821708}],"effects":[{"name":"Happy","score":53.139534883720927},{"name":"Relaxed","score":46.47286821705427},{"name":"Uplifted","score":38.643410852713181},{"name":"Euphoric","score":30.310077519379846},{"name":"Creative","score":15.232558139534884}],"symptoms":[{"name":"Stress","score":11.899224806201552},{"name":"Depression","score":8.5658914728682181},{"name":"Pain","score":7.9844961240310077},{"name":"Insomnia","score":6.24031007751938},{"name":"Lack of Appetite","score":6.24031007751938}],"conditions":[{"name":"Bipolar Disorder","score":26.162790697674417},{"name":"Anxiety","score":6.8217054263565888},{"name":"ADD/ADHD","score":1.7441860465116279},{"name":"Arthritis","score":1.7441860465116279},{"name":"PTSD","score":1.7441860465116279}],"negatives":[{"name":"Dry Mouth","score":29.651162790697676},{"name":"Dry Eyes","score":5.0775193798449614},{"name":"Anxious","score":4.4961240310077519},{"name":"Headache","score":3.9147286821705429},{"name":"Dizzy","score":0.58139534883720934}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_62ba.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/504311/b/og-skunk__primary_bbd9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_2294.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502513/b/og-skunk__primary_60c6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_6a15.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502512/b/og-skunk__primary_1a90.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_d2ea.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/499323/b/og-skunk__primary_82db.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_a40c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500061/b/og-skunk__primary_4969.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_56de.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/496177/b/og-skunk__primary_6eeb.jpg"}],"photoTotalCount":7,"popularCities":["Spokane, WA","Vancouver, BC","Bellingham, WA","Edmonton, AB","Las Vegas, NV","Los Angeles, CA","Montréal, QC","Phoenix, AZ","Portland, OR","Seattle, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/og-skunk","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.575/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"OG #18","subtitle":null,"slug":"og-18","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-18","symbol":"O18","applink":"leafly://strain/og-18"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":222063,"slug":"og-skunk","name":"OG Skunk","subtitle":null,"symbol":"Osk","category":"Hybrid","description":"\u003cp\u003eA cross between \u003ca href=\"https://www.leafly.com/hybrid/og-18\"\u003eOG #18\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/hybrid/skunk-1\"\u003eSkunk #1\u003c/a\u003e, OG Skunk is a 60% sativa-dominant hybrid from DNA Genetics. Flavors of sour fuel and skunky citrus are sure to please fans of both parent strains, while the high offers a nice uplifting head effect along with a relaxing body buzz. Its THC levels have been measured between 16% and 22%.\u003c/p\u003e\n","descriptionPlain":"A cross between OG #18 and Skunk #1, OG Skunk is a 60% sativa-dominant hybrid from DNA Genetics. Flavors of sour fuel and skunky citrus are sure to please fans of both parent strains, while the high offers a nice uplifting head effect along with a relaxing body buzz. Its THC levels have been measured between 16% and 22%.\n","aka":"Skunk OG","rating":4.58,"highlightedReviews":[{"id":1416661,"username":"GhostOfJack","text":"This combines 2 of my favorite strains from 2 different decades.  I loved skunk #1 in the  late 90s and early 2000s  What I Love about skunk #1 is its versatility and resistance to tolerance.  Ive came across hundreds of strains in my life and some were great but often times the high thc strains became like drinking decaf after a few weeks of daily use.  S1 can be smoked morning, afternoon or evening, its downside is it doesnt put you down after a hard workday and thats where private reserve (og #18) shines.  It has the ability to be used in the day but if you want to to be put out just overindulge, its very potent and has this lemony gas dankness that keeps me coming back.  Crossing these two brought out the best is both world, now I have a high flying High THC strain that isnt prone to rapid tolerance.  The Skunk #1 adds a little more old school chronic smell and taste to the weed that brings back memories.  the Skunk #1 adds an element of extra happyness.  Def going to add this to my rotation this summer!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1636413,"username":"classicbenny","text":"While bearing a unique flavour, this strain defies the ugly part of its name as well as provides mood lifting effects. An easy 5.0 from me!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-49877","title":"11 Unsung Cannabis Strains Worth Discovering","author":"Brett Konen","category":null,"date":"\/Date(1511894705000)\/","text":"As we explored recently with our list of 9 Most Overhyped Cannabis Strains, a few of the best-known cannabis varieties on the market are a little overrated. Correspondingly, it’s no surprise that there are some underrated cannabis strains out there, too.\n\nThe following represent 11 varieties of cannabis that we think get less love than they deserve, based on Leafly review data, regional availability, and the personal experiences of our cannabis expert team. This is far from an exhaustive list—with thousands of strains available in the world, it’s virtually impossible to give all of them the attention we wish we could. Nevertheless, take the following as just a few recommendations of lesser-known types you should keep an eye out for—who knows? You just might find your new favorite strain among them.\nTahoe OG Kush\nStrain type: Hybrid\nParent strains: OG Kush, SFV OG Kush\nWhy it’s underrated: “Tahoe OG isn’t underrated in the traditional sense of the word. In fact, most people I know who’ve come across this select OG Kush phenotype will share their excitement for the pungent, piney sweetness and the strain’s dynamic mix of deep relaxation and profound euphoria. However, when I think of the OG family tree, the Tahoe cut doesn’t seem to get quite the same notoriety that some of its relatives. The SFV, Larry, and Fire OGs manage to capture a lot of the buzz, while other cuts, like the Ghost and WiFi OGs, have somewhat cult followings. This leaves room for Tahoe OG to stand on its own, which is OK by me. I love its dank, complex aroma and the sedating effects, so the less hype there is for Tahoe OG, the more of this delicious strain is available for me!” —Will Hyde\n\nLodi Dodi\nStrain type: Hybrid\nParent strains: Undisclosed\nWhy it’s underrated: “This strain is a mainstay in the Pacific Northwest, but still flies beneath the radar outside the region. Sativa-dominant in effect, this unknown cultivar has been propagated throughout the Evergreen State for decades. Lodi Dodi’s airy physical lightness and uplifting mental buzz allow the consumer to metaphorically levitate two inches above their problems and their pain. I personally enjoy working out after consuming this strain for its stimulating aura and a mental haze that allows me to fade into my headphones and run forever. It’s equally satisfying on the dancefloor or in the bedroom, as long as you mind your dosage. Lodi Dodi came to party—it don’t cause trouble or bother nobody.” —Jeremiah Wilhelm\nChocolope Kush\nStrain type: Hybrid\nParent strains:  Chocolope, Kosher Kush\nWhy it’s underrated: “This is, weirdly, one of the lowest-rated strains on Leafly (yep, a four-star rating is on the low end—Leafly reviewers give most cannabis pretty high marks), but riddle me this: How can a marriage of superstars like Chocolope and Kosher Kush possibly be bad? Those parent strains are two of our all-time faves (in fact, both landed on our Top 100 Strains list) and given that the apple rarely falls far from the tree, this super-low rating for Chocolate Kush is undeserved.” —Brett Konen\n\nDancehall\nStrain type: Hybrid\nParent strains: Juanita La Lagrimosa, Kalijah\nWhy it’s underrated: “Dancehall is an exceptional CBD-dominant strain that doesn’t get much recognition by comparison to CBD hallmarks like Harlequin, ACDC, Charlotte’s Web, and Cannatonic. With a near 21:1 CBD:THC ratio, Dancehall delivers soothing, easygoing effects with just enough sativa-dominant influence to elevate mood, which makes it a constant companion for consumers who like to stay level and clearheaded while enjoying cannabis. The terpene profile also offers deeper, skunkier notes than the usual grassy, hay-like aroma CBD strains are known for. Whether you’re enjoying it for what it is, or blending with your THC-dominant strains, Dancehall adds something special and drastically underappreciate to any joint or bowl.” —Jeremiah Wilhelm\nBay Dream\nStrain type: Sativa\nParent strains: Blue Dream, Bay 11\nWhy it’s underrated: “Bay Dream is an uplifting strain with sharp citrus notes and subtle earthiness. It seems to be overlooked because of its polarizing parent strain, Blue Dream, but in combination with the sweet, skunky flavors and focused headspace of Bay 11 the mix is a pleasant surprise. I appreciate that Bay Dream trades some of Blue Dream’s fruit notes for a deeper, more poignant Kush-like palate of flavors. So, if you’re in the ‘Blue Dream is overrated’ crowd, don’t shy away from Bay Dream—you might be amazed by how much this strain expresses its individuality.” —Will Hyde\n\nSour Urkle\nStrain type: Hybrid\nParent strains: Sour Diesel, Purple Urkle\nWhy it’s underrated: “Sour Urkle is the potent union of pungent, polar opposites. Created from Sour Diesel and Purple Urkle, this funky and surprisingly affordable bud packs the best of both strains into one frosty package. This strain emits an odd floral and chemical aroma that is contrasted against a latent but tangible sweetness brought forth by the fruitiness of Purple Urkle. This flavor profile can be challenging for some, but the effects are undeniably heady while draping the body in a soothing, mellow aura.” —Jeremiah Wilhelm\nPresidential Kush\nStrain type: Indica\nParent strains: Bubble Gum, OG Kush\nWhy it’s underrated: “Easily one of the more picturesque strains I’ve come across, Presidential Kush (also known as Presidential OG) expresses itself with deep green and purple hues. A thick blanket of trichomes adds another dimension to the strain’s aesthetic, but PK is so much more than just a pretty flower. It’s a potent, complex, and flavorful experience that only takes a puff or two before you feel the comforting weight of deep relaxation wash over you. The piney, diesel flavors make it hard to put down, and I still find myself embarking on epic journeys just to track down this beautiful bud. In my opinion, genetics this compelling should be easier to find and should be garnering more attention in the cannabis community, so for that reason, I’d like to encourage more growers to add this strain to their stable, and if you find it at your local dispensary as a consumer, definitely do not overlook it!” —Will Hyde\n\nDurban Poison\nStrain type: Sativa\nParent strains: African\nWhy it’s underrated: “Landrace strains, including Durban Poison, are hard to find and often faked. As such, many people have had a less-enjoyable-than-average experience with a strain they believed, mistakenly, to be the landrace advertised on the packaging. Durban Poison is a fantastic pure sativa that many people, including myself, loved at first smoke, so if Durban Poison didn’t wow you the first time around, give it another chance—that first batch might have been something else that was merely masquerading as this iconic strain.” —Brett Konen\nApple Jack\nStrain type: Hybrid\nParent strains: Jack Herer, White Widow\nWhy it’s underrated: “Apple Jack hasn’t gained much in the way of ratings on Leafly, but that doesn’t mean it’s a dud. It blends two well-known cuts together (Jack Herer x White Widow) to create something greater than the sum of its parts. Apple Jack’s initially clear-headed high relieves stress while elevating the mind and encouraging creativity. The happy effects and accessible THC concentration make it a friendly flower for consumers of all potency levels. And even though its flavor doesn’t always live up the name, Apple Jack’s sweet, earthy terpene profile still offers satisfying flavors alongside a productive buzz.” —Jeremiah Wilhelm\n\nPlushberry\nStrain type: Indica\nParent strains: Black Cherry Soda, Space Queen\nWhy it’s underrated: “Plushberry is an incredible strain that’s underrated simply because it hasn’t appeared to travel beyond the Pacific Northwest. Wrapped in beautiful lavender foliage, it smells like sweet wildflowers and mixed berries, and if you have the chance to try it while you’re in the area, Plushberry is a strain you won’t soon forget.” —Bailey Rahn\nSkunk No. 1\nStrain type: Hybrid\nParent strains: Afghani, Acapulco Gold, Colombian Gold\nWhy it’s underrated: “Even if you don’t love the flavor of the flower itself, you’ve got to respect a strain that’s given us so many of our favorites on the market—I’m talking Green Crack, Island Sweet Skunk, Amnesia, Pineapple Chunk, UK Cheese, and so many more. Skunk No. 1 is a true original among cannabis strains, and while its skunky flavor is an acquired taste, you’re smoking a piece of history with Skunk No. 1—so respect your elders.” —Brett Konen","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/28103218/most-underrated-cannabis-strains.jpg","urlslug":"/news/strains-products/11-underrated-marijuana-strains"},{"id":"contentitems-3241","title":"New Strains Alert: Butter OG, Blackberry Pie, Khufu, Mammoth, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1461360600000)\/","text":"The Leafly database was just updated with some new strains, and we\u0027re curious to hear if you\u0027ve tried any of them! New varieties are born every day, so we\u0027d like to hear from you — which strains should we add next? Let us know in the comments below!\n \n  1. Blackberry Pie\n\nBlackberry Pie is a hybrid cross of Jojorizo’s Blackberry Widow and a Crystal Locomotive created by Gage Green Genetics. This hybrid is easy to grow and all phenotypes present the potency and high resin content you would expect given its White Widow and Trainwreck heritage. A beautiful and aromatic plant featuring flowers with deep purple hues and ample trichomes, Blackberry Pie offers a nice blend of heady euphoria with a medicinal body high.\n\n \n  2. Butter OG\n\nWhile there is not much information available on the origins of Butter OG, it is generally thought to be an indica-dominant strain as it gives users a very relaxing, giggly high that gradually fades to sleepiness. Its dense, sparkly buds give off a fruity scent with slight undertones of ammonia. The smoke is very light and smooth, with sweet flavors on the inhale and, like its name suggests, a buttery aftertaste. Butter OG is potentially beneficial for treating pain, anxiety, depression, and insomnia.\n\n \n  3. Blueberry Blast\n\nA mostly sativa hybrid from Snow High Seeds, Blueberry Blast is a the result of the famous Blueberry–Haze genetics of Blue Dream being pollinated by a Johnny Blaze male. These flowers smell strongly of blueberry, musk, and sweet candy, and taste like cedar and berries when smoked or vaped. A definite sativa effect is to be expected, with soaring, trippy highs that gradually fade into relaxation.\n\n \n  4. Mammoth\n\nThis hybrid from The Bank Cannabis Genetics is a cross between the sativa-dominant Snowcap and indica-dominant LA Confidential. There isn’t a lot of information available on Mammoth, but the breeder suggests that growers should look for phenotypes featuring the enormous yields of Snowcap, the shorter flowering time and manageable height of LA Confidential, and the dense buds, high potency, resin production, and disease resistance of both parents.\n\n \n  5. Khufu\n\nKhufu is an indica-dominant hybrid from The Devil’s Harvest Seed Company that combines Cheese, Afghani #1, and SFV OG genetics to excellent effect. Growers can expect extremely high yields of potent Kush-type flowers, with giant calyxes and very little leaf. The effects of Khufu will leave you wanting nothing more than to gorge on snacks while glued to your favorite chair. Patients treating pain, anxiety, nausea, and insomnia may benefit from Khufu’s therapeutic effects.\n\n \n  6. OG Skunk\n\nA cross between OG #18 and Skunk #1, OG Skunk is a 60% sativa-dominant hybrid from DNA Genetics. Flavors of sour fuel and skunky citrus are sure to please fans of both parent strains, while the high offers a nice uplifting head effect along with a relaxing body buzz. Its THC levels have been measured between 16% and 22%.\n\n \n  7. Merlot OG\n\nSoCal cannabis breeders Ocean Grown Seeds originally designed the Merlot OG in 2006 as an attempt to create an OG Kush-type plant with deep purple colors by crossing Larry OG and Grape Ape. The resulting plant was then crossed with Blackberry Rhino x SFV OG and then backcrossed to stabilize its OG characteristics. Merlot OG produces large, dense indica-type buds that are blanketed in white trichomes and will often turn dark purple, especially in cooler conditions.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/04/12002008/new-strains-alert-butter-og-blackberry-pie-khufu-mammoth-and-more.jpg","urlslug":"/news/strains-products/new-strains-alert-butter-og-blackberry-pie-khufu-mammoth-and-more"}],"reviewCount":40,"flavors":[{"name":"Skunk","score":46.47286821705427},{"name":"Earthy","score":36.31782945736434},{"name":"Woody","score":33.565891472868216},{"name":"Chestnut","score":25},{"name":"Citrus","score":5.6589147286821708}],"effects":[{"name":"Happy","score":53.139534883720927},{"name":"Relaxed","score":46.47286821705427},{"name":"Uplifted","score":38.643410852713181},{"name":"Euphoric","score":30.310077519379846},{"name":"Creative","score":15.232558139534884}],"symptoms":[{"name":"Stress","score":11.899224806201552},{"name":"Depression","score":8.5658914728682181},{"name":"Pain","score":7.9844961240310077},{"name":"Insomnia","score":6.24031007751938},{"name":"Lack of Appetite","score":6.24031007751938}],"conditions":[{"name":"Bipolar Disorder","score":26.162790697674417},{"name":"Anxiety","score":6.8217054263565888},{"name":"ADD/ADHD","score":1.7441860465116279},{"name":"Arthritis","score":1.7441860465116279},{"name":"PTSD","score":1.7441860465116279}],"negatives":[{"name":"Dry Mouth","score":29.651162790697676},{"name":"Dry Eyes","score":5.0775193798449614},{"name":"Anxious","score":4.4961240310077519},{"name":"Headache","score":3.9147286821705429},{"name":"Dizzy","score":0.58139534883720934}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_62ba.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/504311/b/og-skunk__primary_bbd9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_2294.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502513/b/og-skunk__primary_60c6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_6a15.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502512/b/og-skunk__primary_1a90.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_d2ea.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/499323/b/og-skunk__primary_82db.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_a40c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500061/b/og-skunk__primary_4969.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_56de.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/496177/b/og-skunk__primary_6eeb.jpg"}],"photoTotalCount":7,"popularCities":["Spokane, WA","Vancouver, BC","Bellingham, WA","Edmonton, AB","Las Vegas, NV","Los Angeles, CA","Montréal, QC","Phoenix, AZ","Portland, OR","Seattle, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/og-skunk","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.575/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"OG #18","subtitle":null,"slug":"og-18","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-18","symbol":"O18","applink":"leafly://strain/og-18"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":222063,"slug":"og-skunk","name":"OG Skunk","subtitle":null,"symbol":"Osk","category":"Hybrid","description":"\u003cp\u003eA cross between \u003ca href=\"https://www.leafly.com/hybrid/og-18\"\u003eOG #18\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/hybrid/skunk-1\"\u003eSkunk #1\u003c/a\u003e, OG Skunk is a 60% sativa-dominant hybrid from DNA Genetics. Flavors of sour fuel and skunky citrus are sure to please fans of both parent strains, while the high offers a nice uplifting head effect along with a relaxing body buzz. Its THC levels have been measured between 16% and 22%.\u003c/p\u003e\n","descriptionPlain":"A cross between OG #18 and Skunk #1, OG Skunk is a 60% sativa-dominant hybrid from DNA Genetics. Flavors of sour fuel and skunky citrus are sure to please fans of both parent strains, while the high offers a nice uplifting head effect along with a relaxing body buzz. Its THC levels have been measured between 16% and 22%.\n","aka":"Skunk OG","rating":4.58,"highlightedReviews":[{"id":1416661,"username":"GhostOfJack","text":"This combines 2 of my favorite strains from 2 different decades.  I loved skunk #1 in the  late 90s and early 2000s  What I Love about skunk #1 is its versatility and resistance to tolerance.  Ive came across hundreds of strains in my life and some were great but often times the high thc strains became like drinking decaf after a few weeks of daily use.  S1 can be smoked morning, afternoon or evening, its downside is it doesnt put you down after a hard workday and thats where private reserve (og #18) shines.  It has the ability to be used in the day but if you want to to be put out just overindulge, its very potent and has this lemony gas dankness that keeps me coming back.  Crossing these two brought out the best is both world, now I have a high flying High THC strain that isnt prone to rapid tolerance.  The Skunk #1 adds a little more old school chronic smell and taste to the weed that brings back memories.  the Skunk #1 adds an element of extra happyness.  Def going to add this to my rotation this summer!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1636413,"username":"classicbenny","text":"While bearing a unique flavour, this strain defies the ugly part of its name as well as provides mood lifting effects. An easy 5.0 from me!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-49877","title":"11 Unsung Cannabis Strains Worth Discovering","author":"Brett Konen","category":null,"date":"\/Date(1511894705000)\/","text":"As we explored recently with our list of 9 Most Overhyped Cannabis Strains, a few of the best-known cannabis varieties on the market are a little overrated. Correspondingly, it’s no surprise that there are some underrated cannabis strains out there, too.\n\nThe following represent 11 varieties of cannabis that we think get less love than they deserve, based on Leafly review data, regional availability, and the personal experiences of our cannabis expert team. This is far from an exhaustive list—with thousands of strains available in the world, it’s virtually impossible to give all of them the attention we wish we could. Nevertheless, take the following as just a few recommendations of lesser-known types you should keep an eye out for—who knows? You just might find your new favorite strain among them.\nTahoe OG Kush\nStrain type: Hybrid\nParent strains: OG Kush, SFV OG Kush\nWhy it’s underrated: “Tahoe OG isn’t underrated in the traditional sense of the word. In fact, most people I know who’ve come across this select OG Kush phenotype will share their excitement for the pungent, piney sweetness and the strain’s dynamic mix of deep relaxation and profound euphoria. However, when I think of the OG family tree, the Tahoe cut doesn’t seem to get quite the same notoriety that some of its relatives. The SFV, Larry, and Fire OGs manage to capture a lot of the buzz, while other cuts, like the Ghost and WiFi OGs, have somewhat cult followings. This leaves room for Tahoe OG to stand on its own, which is OK by me. I love its dank, complex aroma and the sedating effects, so the less hype there is for Tahoe OG, the more of this delicious strain is available for me!” —Will Hyde\n\nLodi Dodi\nStrain type: Hybrid\nParent strains: Undisclosed\nWhy it’s underrated: “This strain is a mainstay in the Pacific Northwest, but still flies beneath the radar outside the region. Sativa-dominant in effect, this unknown cultivar has been propagated throughout the Evergreen State for decades. Lodi Dodi’s airy physical lightness and uplifting mental buzz allow the consumer to metaphorically levitate two inches above their problems and their pain. I personally enjoy working out after consuming this strain for its stimulating aura and a mental haze that allows me to fade into my headphones and run forever. It’s equally satisfying on the dancefloor or in the bedroom, as long as you mind your dosage. Lodi Dodi came to party—it don’t cause trouble or bother nobody.” —Jeremiah Wilhelm\nChocolope Kush\nStrain type: Hybrid\nParent strains:  Chocolope, Kosher Kush\nWhy it’s underrated: “This is, weirdly, one of the lowest-rated strains on Leafly (yep, a four-star rating is on the low end—Leafly reviewers give most cannabis pretty high marks), but riddle me this: How can a marriage of superstars like Chocolope and Kosher Kush possibly be bad? Those parent strains are two of our all-time faves (in fact, both landed on our Top 100 Strains list) and given that the apple rarely falls far from the tree, this super-low rating for Chocolate Kush is undeserved.” —Brett Konen\n\nDancehall\nStrain type: Hybrid\nParent strains: Juanita La Lagrimosa, Kalijah\nWhy it’s underrated: “Dancehall is an exceptional CBD-dominant strain that doesn’t get much recognition by comparison to CBD hallmarks like Harlequin, ACDC, Charlotte’s Web, and Cannatonic. With a near 21:1 CBD:THC ratio, Dancehall delivers soothing, easygoing effects with just enough sativa-dominant influence to elevate mood, which makes it a constant companion for consumers who like to stay level and clearheaded while enjoying cannabis. The terpene profile also offers deeper, skunkier notes than the usual grassy, hay-like aroma CBD strains are known for. Whether you’re enjoying it for what it is, or blending with your THC-dominant strains, Dancehall adds something special and drastically underappreciate to any joint or bowl.” —Jeremiah Wilhelm\nBay Dream\nStrain type: Sativa\nParent strains: Blue Dream, Bay 11\nWhy it’s underrated: “Bay Dream is an uplifting strain with sharp citrus notes and subtle earthiness. It seems to be overlooked because of its polarizing parent strain, Blue Dream, but in combination with the sweet, skunky flavors and focused headspace of Bay 11 the mix is a pleasant surprise. I appreciate that Bay Dream trades some of Blue Dream’s fruit notes for a deeper, more poignant Kush-like palate of flavors. So, if you’re in the ‘Blue Dream is overrated’ crowd, don’t shy away from Bay Dream—you might be amazed by how much this strain expresses its individuality.” —Will Hyde\n\nSour Urkle\nStrain type: Hybrid\nParent strains: Sour Diesel, Purple Urkle\nWhy it’s underrated: “Sour Urkle is the potent union of pungent, polar opposites. Created from Sour Diesel and Purple Urkle, this funky and surprisingly affordable bud packs the best of both strains into one frosty package. This strain emits an odd floral and chemical aroma that is contrasted against a latent but tangible sweetness brought forth by the fruitiness of Purple Urkle. This flavor profile can be challenging for some, but the effects are undeniably heady while draping the body in a soothing, mellow aura.” —Jeremiah Wilhelm\nPresidential Kush\nStrain type: Indica\nParent strains: Bubble Gum, OG Kush\nWhy it’s underrated: “Easily one of the more picturesque strains I’ve come across, Presidential Kush (also known as Presidential OG) expresses itself with deep green and purple hues. A thick blanket of trichomes adds another dimension to the strain’s aesthetic, but PK is so much more than just a pretty flower. It’s a potent, complex, and flavorful experience that only takes a puff or two before you feel the comforting weight of deep relaxation wash over you. The piney, diesel flavors make it hard to put down, and I still find myself embarking on epic journeys just to track down this beautiful bud. In my opinion, genetics this compelling should be easier to find and should be garnering more attention in the cannabis community, so for that reason, I’d like to encourage more growers to add this strain to their stable, and if you find it at your local dispensary as a consumer, definitely do not overlook it!” —Will Hyde\n\nDurban Poison\nStrain type: Sativa\nParent strains: African\nWhy it’s underrated: “Landrace strains, including Durban Poison, are hard to find and often faked. As such, many people have had a less-enjoyable-than-average experience with a strain they believed, mistakenly, to be the landrace advertised on the packaging. Durban Poison is a fantastic pure sativa that many people, including myself, loved at first smoke, so if Durban Poison didn’t wow you the first time around, give it another chance—that first batch might have been something else that was merely masquerading as this iconic strain.” —Brett Konen\nApple Jack\nStrain type: Hybrid\nParent strains: Jack Herer, White Widow\nWhy it’s underrated: “Apple Jack hasn’t gained much in the way of ratings on Leafly, but that doesn’t mean it’s a dud. It blends two well-known cuts together (Jack Herer x White Widow) to create something greater than the sum of its parts. Apple Jack’s initially clear-headed high relieves stress while elevating the mind and encouraging creativity. The happy effects and accessible THC concentration make it a friendly flower for consumers of all potency levels. And even though its flavor doesn’t always live up the name, Apple Jack’s sweet, earthy terpene profile still offers satisfying flavors alongside a productive buzz.” —Jeremiah Wilhelm\n\nPlushberry\nStrain type: Indica\nParent strains: Black Cherry Soda, Space Queen\nWhy it’s underrated: “Plushberry is an incredible strain that’s underrated simply because it hasn’t appeared to travel beyond the Pacific Northwest. Wrapped in beautiful lavender foliage, it smells like sweet wildflowers and mixed berries, and if you have the chance to try it while you’re in the area, Plushberry is a strain you won’t soon forget.” —Bailey Rahn\nSkunk No. 1\nStrain type: Hybrid\nParent strains: Afghani, Acapulco Gold, Colombian Gold\nWhy it’s underrated: “Even if you don’t love the flavor of the flower itself, you’ve got to respect a strain that’s given us so many of our favorites on the market—I’m talking Green Crack, Island Sweet Skunk, Amnesia, Pineapple Chunk, UK Cheese, and so many more. Skunk No. 1 is a true original among cannabis strains, and while its skunky flavor is an acquired taste, you’re smoking a piece of history with Skunk No. 1—so respect your elders.” —Brett Konen","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/28103218/most-underrated-cannabis-strains.jpg","urlslug":"/news/strains-products/11-underrated-marijuana-strains"},{"id":"contentitems-3241","title":"New Strains Alert: Butter OG, Blackberry Pie, Khufu, Mammoth, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1461360600000)\/","text":"The Leafly database was just updated with some new strains, and we\u0027re curious to hear if you\u0027ve tried any of them! New varieties are born every day, so we\u0027d like to hear from you — which strains should we add next? Let us know in the comments below!\n \n  1. Blackberry Pie\n\nBlackberry Pie is a hybrid cross of Jojorizo’s Blackberry Widow and a Crystal Locomotive created by Gage Green Genetics. This hybrid is easy to grow and all phenotypes present the potency and high resin content you would expect given its White Widow and Trainwreck heritage. A beautiful and aromatic plant featuring flowers with deep purple hues and ample trichomes, Blackberry Pie offers a nice blend of heady euphoria with a medicinal body high.\n\n \n  2. Butter OG\n\nWhile there is not much information available on the origins of Butter OG, it is generally thought to be an indica-dominant strain as it gives users a very relaxing, giggly high that gradually fades to sleepiness. Its dense, sparkly buds give off a fruity scent with slight undertones of ammonia. The smoke is very light and smooth, with sweet flavors on the inhale and, like its name suggests, a buttery aftertaste. Butter OG is potentially beneficial for treating pain, anxiety, depression, and insomnia.\n\n \n  3. Blueberry Blast\n\nA mostly sativa hybrid from Snow High Seeds, Blueberry Blast is a the result of the famous Blueberry–Haze genetics of Blue Dream being pollinated by a Johnny Blaze male. These flowers smell strongly of blueberry, musk, and sweet candy, and taste like cedar and berries when smoked or vaped. A definite sativa effect is to be expected, with soaring, trippy highs that gradually fade into relaxation.\n\n \n  4. Mammoth\n\nThis hybrid from The Bank Cannabis Genetics is a cross between the sativa-dominant Snowcap and indica-dominant LA Confidential. There isn’t a lot of information available on Mammoth, but the breeder suggests that growers should look for phenotypes featuring the enormous yields of Snowcap, the shorter flowering time and manageable height of LA Confidential, and the dense buds, high potency, resin production, and disease resistance of both parents.\n\n \n  5. Khufu\n\nKhufu is an indica-dominant hybrid from The Devil’s Harvest Seed Company that combines Cheese, Afghani #1, and SFV OG genetics to excellent effect. Growers can expect extremely high yields of potent Kush-type flowers, with giant calyxes and very little leaf. The effects of Khufu will leave you wanting nothing more than to gorge on snacks while glued to your favorite chair. Patients treating pain, anxiety, nausea, and insomnia may benefit from Khufu’s therapeutic effects.\n\n \n  6. OG Skunk\n\nA cross between OG #18 and Skunk #1, OG Skunk is a 60% sativa-dominant hybrid from DNA Genetics. Flavors of sour fuel and skunky citrus are sure to please fans of both parent strains, while the high offers a nice uplifting head effect along with a relaxing body buzz. Its THC levels have been measured between 16% and 22%.\n\n \n  7. Merlot OG\n\nSoCal cannabis breeders Ocean Grown Seeds originally designed the Merlot OG in 2006 as an attempt to create an OG Kush-type plant with deep purple colors by crossing Larry OG and Grape Ape. The resulting plant was then crossed with Blackberry Rhino x SFV OG and then backcrossed to stabilize its OG characteristics. Merlot OG produces large, dense indica-type buds that are blanketed in white trichomes and will often turn dark purple, especially in cooler conditions.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/04/12002008/new-strains-alert-butter-og-blackberry-pie-khufu-mammoth-and-more.jpg","urlslug":"/news/strains-products/new-strains-alert-butter-og-blackberry-pie-khufu-mammoth-and-more"}],"reviewCount":40,"flavors":[{"name":"Skunk","score":46.47286821705427},{"name":"Earthy","score":36.31782945736434},{"name":"Woody","score":33.565891472868216},{"name":"Chestnut","score":25},{"name":"Citrus","score":5.6589147286821708}],"effects":[{"name":"Happy","score":53.139534883720927},{"name":"Relaxed","score":46.47286821705427},{"name":"Uplifted","score":38.643410852713181},{"name":"Euphoric","score":30.310077519379846},{"name":"Creative","score":15.232558139534884}],"symptoms":[{"name":"Stress","score":11.899224806201552},{"name":"Depression","score":8.5658914728682181},{"name":"Pain","score":7.9844961240310077},{"name":"Insomnia","score":6.24031007751938},{"name":"Lack of Appetite","score":6.24031007751938}],"conditions":[{"name":"Bipolar Disorder","score":26.162790697674417},{"name":"Anxiety","score":6.8217054263565888},{"name":"ADD/ADHD","score":1.7441860465116279},{"name":"Arthritis","score":1.7441860465116279},{"name":"PTSD","score":1.7441860465116279}],"negatives":[{"name":"Dry Mouth","score":29.651162790697676},{"name":"Dry Eyes","score":5.0775193798449614},{"name":"Anxious","score":4.4961240310077519},{"name":"Headache","score":3.9147286821705429},{"name":"Dizzy","score":0.58139534883720934}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_62ba.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/504311/b/og-skunk__primary_bbd9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_2294.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502513/b/og-skunk__primary_60c6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_6a15.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502512/b/og-skunk__primary_1a90.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_d2ea.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/499323/b/og-skunk__primary_82db.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_a40c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500061/b/og-skunk__primary_4969.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_56de.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/496177/b/og-skunk__primary_6eeb.jpg"}],"photoTotalCount":7,"popularCities":["Spokane, WA","Vancouver, BC","Bellingham, WA","Edmonton, AB","Las Vegas, NV","Los Angeles, CA","Montréal, QC","Phoenix, AZ","Portland, OR","Seattle, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/og-skunk","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.575/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"OG #18","subtitle":null,"slug":"og-18","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-18","symbol":"O18","applink":"leafly://strain/og-18"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":222063,"slug":"og-skunk","name":"OG Skunk","subtitle":null,"symbol":"Osk","category":"Hybrid","description":"\u003cp\u003eA cross between \u003ca href=\"https://www.leafly.com/hybrid/og-18\"\u003eOG #18\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/hybrid/skunk-1\"\u003eSkunk #1\u003c/a\u003e, OG Skunk is a 60% sativa-dominant hybrid from DNA Genetics. Flavors of sour fuel and skunky citrus are sure to please fans of both parent strains, while the high offers a nice uplifting head effect along with a relaxing body buzz. Its THC levels have been measured between 16% and 22%.\u003c/p\u003e\n","descriptionPlain":"A cross between OG #18 and Skunk #1, OG Skunk is a 60% sativa-dominant hybrid from DNA Genetics. Flavors of sour fuel and skunky citrus are sure to please fans of both parent strains, while the high offers a nice uplifting head effect along with a relaxing body buzz. Its THC levels have been measured between 16% and 22%.\n","aka":"Skunk OG","rating":4.58,"highlightedReviews":[{"id":1416661,"username":"GhostOfJack","text":"This combines 2 of my favorite strains from 2 different decades.  I loved skunk #1 in the  late 90s and early 2000s  What I Love about skunk #1 is its versatility and resistance to tolerance.  Ive came across hundreds of strains in my life and some were great but often times the high thc strains became like drinking decaf after a few weeks of daily use.  S1 can be smoked morning, afternoon or evening, its downside is it doesnt put you down after a hard workday and thats where private reserve (og #18) shines.  It has the ability to be used in the day but if you want to to be put out just overindulge, its very potent and has this lemony gas dankness that keeps me coming back.  Crossing these two brought out the best is both world, now I have a high flying High THC strain that isnt prone to rapid tolerance.  The Skunk #1 adds a little more old school chronic smell and taste to the weed that brings back memories.  the Skunk #1 adds an element of extra happyness.  Def going to add this to my rotation this summer!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1636413,"username":"classicbenny","text":"While bearing a unique flavour, this strain defies the ugly part of its name as well as provides mood lifting effects. An easy 5.0 from me!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-49877","title":"11 Unsung Cannabis Strains Worth Discovering","author":"Brett Konen","category":null,"date":"\/Date(1511894705000)\/","text":"As we explored recently with our list of 9 Most Overhyped Cannabis Strains, a few of the best-known cannabis varieties on the market are a little overrated. Correspondingly, it’s no surprise that there are some underrated cannabis strains out there, too.\n\nThe following represent 11 varieties of cannabis that we think get less love than they deserve, based on Leafly review data, regional availability, and the personal experiences of our cannabis expert team. This is far from an exhaustive list—with thousands of strains available in the world, it’s virtually impossible to give all of them the attention we wish we could. Nevertheless, take the following as just a few recommendations of lesser-known types you should keep an eye out for—who knows? You just might find your new favorite strain among them.\nTahoe OG Kush\nStrain type: Hybrid\nParent strains: OG Kush, SFV OG Kush\nWhy it’s underrated: “Tahoe OG isn’t underrated in the traditional sense of the word. In fact, most people I know who’ve come across this select OG Kush phenotype will share their excitement for the pungent, piney sweetness and the strain’s dynamic mix of deep relaxation and profound euphoria. However, when I think of the OG family tree, the Tahoe cut doesn’t seem to get quite the same notoriety that some of its relatives. The SFV, Larry, and Fire OGs manage to capture a lot of the buzz, while other cuts, like the Ghost and WiFi OGs, have somewhat cult followings. This leaves room for Tahoe OG to stand on its own, which is OK by me. I love its dank, complex aroma and the sedating effects, so the less hype there is for Tahoe OG, the more of this delicious strain is available for me!” —Will Hyde\n\nLodi Dodi\nStrain type: Hybrid\nParent strains: Undisclosed\nWhy it’s underrated: “This strain is a mainstay in the Pacific Northwest, but still flies beneath the radar outside the region. Sativa-dominant in effect, this unknown cultivar has been propagated throughout the Evergreen State for decades. Lodi Dodi’s airy physical lightness and uplifting mental buzz allow the consumer to metaphorically levitate two inches above their problems and their pain. I personally enjoy working out after consuming this strain for its stimulating aura and a mental haze that allows me to fade into my headphones and run forever. It’s equally satisfying on the dancefloor or in the bedroom, as long as you mind your dosage. Lodi Dodi came to party—it don’t cause trouble or bother nobody.” —Jeremiah Wilhelm\nChocolope Kush\nStrain type: Hybrid\nParent strains:  Chocolope, Kosher Kush\nWhy it’s underrated: “This is, weirdly, one of the lowest-rated strains on Leafly (yep, a four-star rating is on the low end—Leafly reviewers give most cannabis pretty high marks), but riddle me this: How can a marriage of superstars like Chocolope and Kosher Kush possibly be bad? Those parent strains are two of our all-time faves (in fact, both landed on our Top 100 Strains list) and given that the apple rarely falls far from the tree, this super-low rating for Chocolate Kush is undeserved.” —Brett Konen\n\nDancehall\nStrain type: Hybrid\nParent strains: Juanita La Lagrimosa, Kalijah\nWhy it’s underrated: “Dancehall is an exceptional CBD-dominant strain that doesn’t get much recognition by comparison to CBD hallmarks like Harlequin, ACDC, Charlotte’s Web, and Cannatonic. With a near 21:1 CBD:THC ratio, Dancehall delivers soothing, easygoing effects with just enough sativa-dominant influence to elevate mood, which makes it a constant companion for consumers who like to stay level and clearheaded while enjoying cannabis. The terpene profile also offers deeper, skunkier notes than the usual grassy, hay-like aroma CBD strains are known for. Whether you’re enjoying it for what it is, or blending with your THC-dominant strains, Dancehall adds something special and drastically underappreciate to any joint or bowl.” —Jeremiah Wilhelm\nBay Dream\nStrain type: Sativa\nParent strains: Blue Dream, Bay 11\nWhy it’s underrated: “Bay Dream is an uplifting strain with sharp citrus notes and subtle earthiness. It seems to be overlooked because of its polarizing parent strain, Blue Dream, but in combination with the sweet, skunky flavors and focused headspace of Bay 11 the mix is a pleasant surprise. I appreciate that Bay Dream trades some of Blue Dream’s fruit notes for a deeper, more poignant Kush-like palate of flavors. So, if you’re in the ‘Blue Dream is overrated’ crowd, don’t shy away from Bay Dream—you might be amazed by how much this strain expresses its individuality.” —Will Hyde\n\nSour Urkle\nStrain type: Hybrid\nParent strains: Sour Diesel, Purple Urkle\nWhy it’s underrated: “Sour Urkle is the potent union of pungent, polar opposites. Created from Sour Diesel and Purple Urkle, this funky and surprisingly affordable bud packs the best of both strains into one frosty package. This strain emits an odd floral and chemical aroma that is contrasted against a latent but tangible sweetness brought forth by the fruitiness of Purple Urkle. This flavor profile can be challenging for some, but the effects are undeniably heady while draping the body in a soothing, mellow aura.” —Jeremiah Wilhelm\nPresidential Kush\nStrain type: Indica\nParent strains: Bubble Gum, OG Kush\nWhy it’s underrated: “Easily one of the more picturesque strains I’ve come across, Presidential Kush (also known as Presidential OG) expresses itself with deep green and purple hues. A thick blanket of trichomes adds another dimension to the strain’s aesthetic, but PK is so much more than just a pretty flower. It’s a potent, complex, and flavorful experience that only takes a puff or two before you feel the comforting weight of deep relaxation wash over you. The piney, diesel flavors make it hard to put down, and I still find myself embarking on epic journeys just to track down this beautiful bud. In my opinion, genetics this compelling should be easier to find and should be garnering more attention in the cannabis community, so for that reason, I’d like to encourage more growers to add this strain to their stable, and if you find it at your local dispensary as a consumer, definitely do not overlook it!” —Will Hyde\n\nDurban Poison\nStrain type: Sativa\nParent strains: African\nWhy it’s underrated: “Landrace strains, including Durban Poison, are hard to find and often faked. As such, many people have had a less-enjoyable-than-average experience with a strain they believed, mistakenly, to be the landrace advertised on the packaging. Durban Poison is a fantastic pure sativa that many people, including myself, loved at first smoke, so if Durban Poison didn’t wow you the first time around, give it another chance—that first batch might have been something else that was merely masquerading as this iconic strain.” —Brett Konen\nApple Jack\nStrain type: Hybrid\nParent strains: Jack Herer, White Widow\nWhy it’s underrated: “Apple Jack hasn’t gained much in the way of ratings on Leafly, but that doesn’t mean it’s a dud. It blends two well-known cuts together (Jack Herer x White Widow) to create something greater than the sum of its parts. Apple Jack’s initially clear-headed high relieves stress while elevating the mind and encouraging creativity. The happy effects and accessible THC concentration make it a friendly flower for consumers of all potency levels. And even though its flavor doesn’t always live up the name, Apple Jack’s sweet, earthy terpene profile still offers satisfying flavors alongside a productive buzz.” —Jeremiah Wilhelm\n\nPlushberry\nStrain type: Indica\nParent strains: Black Cherry Soda, Space Queen\nWhy it’s underrated: “Plushberry is an incredible strain that’s underrated simply because it hasn’t appeared to travel beyond the Pacific Northwest. Wrapped in beautiful lavender foliage, it smells like sweet wildflowers and mixed berries, and if you have the chance to try it while you’re in the area, Plushberry is a strain you won’t soon forget.” —Bailey Rahn\nSkunk No. 1\nStrain type: Hybrid\nParent strains: Afghani, Acapulco Gold, Colombian Gold\nWhy it’s underrated: “Even if you don’t love the flavor of the flower itself, you’ve got to respect a strain that’s given us so many of our favorites on the market—I’m talking Green Crack, Island Sweet Skunk, Amnesia, Pineapple Chunk, UK Cheese, and so many more. Skunk No. 1 is a true original among cannabis strains, and while its skunky flavor is an acquired taste, you’re smoking a piece of history with Skunk No. 1—so respect your elders.” —Brett Konen","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/28103218/most-underrated-cannabis-strains.jpg","urlslug":"/news/strains-products/11-underrated-marijuana-strains"},{"id":"contentitems-3241","title":"New Strains Alert: Butter OG, Blackberry Pie, Khufu, Mammoth, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1461360600000)\/","text":"The Leafly database was just updated with some new strains, and we\u0027re curious to hear if you\u0027ve tried any of them! New varieties are born every day, so we\u0027d like to hear from you — which strains should we add next? Let us know in the comments below!\n \n  1. Blackberry Pie\n\nBlackberry Pie is a hybrid cross of Jojorizo’s Blackberry Widow and a Crystal Locomotive created by Gage Green Genetics. This hybrid is easy to grow and all phenotypes present the potency and high resin content you would expect given its White Widow and Trainwreck heritage. A beautiful and aromatic plant featuring flowers with deep purple hues and ample trichomes, Blackberry Pie offers a nice blend of heady euphoria with a medicinal body high.\n\n \n  2. Butter OG\n\nWhile there is not much information available on the origins of Butter OG, it is generally thought to be an indica-dominant strain as it gives users a very relaxing, giggly high that gradually fades to sleepiness. Its dense, sparkly buds give off a fruity scent with slight undertones of ammonia. The smoke is very light and smooth, with sweet flavors on the inhale and, like its name suggests, a buttery aftertaste. Butter OG is potentially beneficial for treating pain, anxiety, depression, and insomnia.\n\n \n  3. Blueberry Blast\n\nA mostly sativa hybrid from Snow High Seeds, Blueberry Blast is a the result of the famous Blueberry–Haze genetics of Blue Dream being pollinated by a Johnny Blaze male. These flowers smell strongly of blueberry, musk, and sweet candy, and taste like cedar and berries when smoked or vaped. A definite sativa effect is to be expected, with soaring, trippy highs that gradually fade into relaxation.\n\n \n  4. Mammoth\n\nThis hybrid from The Bank Cannabis Genetics is a cross between the sativa-dominant Snowcap and indica-dominant LA Confidential. There isn’t a lot of information available on Mammoth, but the breeder suggests that growers should look for phenotypes featuring the enormous yields of Snowcap, the shorter flowering time and manageable height of LA Confidential, and the dense buds, high potency, resin production, and disease resistance of both parents.\n\n \n  5. Khufu\n\nKhufu is an indica-dominant hybrid from The Devil’s Harvest Seed Company that combines Cheese, Afghani #1, and SFV OG genetics to excellent effect. Growers can expect extremely high yields of potent Kush-type flowers, with giant calyxes and very little leaf. The effects of Khufu will leave you wanting nothing more than to gorge on snacks while glued to your favorite chair. Patients treating pain, anxiety, nausea, and insomnia may benefit from Khufu’s therapeutic effects.\n\n \n  6. OG Skunk\n\nA cross between OG #18 and Skunk #1, OG Skunk is a 60% sativa-dominant hybrid from DNA Genetics. Flavors of sour fuel and skunky citrus are sure to please fans of both parent strains, while the high offers a nice uplifting head effect along with a relaxing body buzz. Its THC levels have been measured between 16% and 22%.\n\n \n  7. Merlot OG\n\nSoCal cannabis breeders Ocean Grown Seeds originally designed the Merlot OG in 2006 as an attempt to create an OG Kush-type plant with deep purple colors by crossing Larry OG and Grape Ape. The resulting plant was then crossed with Blackberry Rhino x SFV OG and then backcrossed to stabilize its OG characteristics. Merlot OG produces large, dense indica-type buds that are blanketed in white trichomes and will often turn dark purple, especially in cooler conditions.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/04/12002008/new-strains-alert-butter-og-blackberry-pie-khufu-mammoth-and-more.jpg","urlslug":"/news/strains-products/new-strains-alert-butter-og-blackberry-pie-khufu-mammoth-and-more"}],"reviewCount":40,"flavors":[{"name":"Skunk","score":46.47286821705427},{"name":"Earthy","score":36.31782945736434},{"name":"Woody","score":33.565891472868216},{"name":"Chestnut","score":25},{"name":"Citrus","score":5.6589147286821708}],"effects":[{"name":"Happy","score":53.139534883720927},{"name":"Relaxed","score":46.47286821705427},{"name":"Uplifted","score":38.643410852713181},{"name":"Euphoric","score":30.310077519379846},{"name":"Creative","score":15.232558139534884}],"symptoms":[{"name":"Stress","score":11.899224806201552},{"name":"Depression","score":8.5658914728682181},{"name":"Pain","score":7.9844961240310077},{"name":"Insomnia","score":6.24031007751938},{"name":"Lack of Appetite","score":6.24031007751938}],"conditions":[{"name":"Bipolar Disorder","score":26.162790697674417},{"name":"Anxiety","score":6.8217054263565888},{"name":"ADD/ADHD","score":1.7441860465116279},{"name":"Arthritis","score":1.7441860465116279},{"name":"PTSD","score":1.7441860465116279}],"negatives":[{"name":"Dry Mouth","score":29.651162790697676},{"name":"Dry Eyes","score":5.0775193798449614},{"name":"Anxious","score":4.4961240310077519},{"name":"Headache","score":3.9147286821705429},{"name":"Dizzy","score":0.58139534883720934}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_62ba.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/504311/b/og-skunk__primary_bbd9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_2294.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502513/b/og-skunk__primary_60c6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_6a15.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502512/b/og-skunk__primary_1a90.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_d2ea.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/499323/b/og-skunk__primary_82db.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_a40c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500061/b/og-skunk__primary_4969.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/og-skunk_100x100_56de.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/496177/b/og-skunk__primary_6eeb.jpg"}],"photoTotalCount":7,"popularCities":["Spokane, WA","Vancouver, BC","Bellingham, WA","Edmonton, AB","Las Vegas, NV","Los Angeles, CA","Montréal, QC","Phoenix, AZ","Portland, OR","Seattle, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/og-skunk","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.575/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"OG #18","subtitle":null,"slug":"og-18","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-18","symbol":"O18","applink":"leafly://strain/og-18"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
