{"sl_translate":"description,descriptionPlain,category","id":186479,"slug":"mandala-1","name":"Mandala #1","subtitle":null,"symbol":"Man","category":"Hybrid","description":"\u003cp\u003eBred by Mandala Seeds, Mandala #1 is a hybrid strain with genetic roots in \u003ca href=\"https://www.leafly.com/sativa/african\"\u003eSouth Africa\u003c/a\u003e, New Zealand, and Northern India. Dreamy euphoria illuminates the mind, waking creativity and happiness with a sweet fragrance of apples, raspberry, and mint. Mandala #1 may hit like a sativa, but to the delight of commercial growers, it grows like an indica with a short flowering cycle of just 55 to 60 days\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Bred by Mandala Seeds, Mandala #1 is a hybrid strain with genetic roots in South Africa, New Zealand, and Northern India. Dreamy euphoria illuminates the mind, waking creativity and happiness with a sweet fragrance of apples, raspberry, and mint. Mandala #1 may hit like a sativa, but to the delight of commercial growers, it grows like an indica with a short flowering cycle of just 55 to 60 days\n\n\u0026nbsp;\n","aka":"Mandala, Mandala 1, Mandala No. 1","rating":4.44,"highlightedReviews":[{"id":1354525,"username":"johnnymariseed","text":"Very smokey/earthy flavor. easily cloned. high pest resistance. very easy to grow. grows short and bushy. fair yielded. dense sticky buds. short flower tume of 60-65 days. really Gatta mess stuff up to kill this one. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"},{"id":1545484,"username":"Thcdna","text":"Very good strain as longest it around 5% -15 abut cbd. 1.0 % this is a must have. It hit u good and u feel very calm and peacefull but it can cause a panic attacks in higer amount. Depends if u taking medcation and smoking or drinki g can make it alot worst. But gonin smokth and yummy. Ome of a good strain for all type of promblems  a-z.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3369","title":"New Strains Alert: Poochie Love, Dark Side of the Moon, Omega, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1446246000000)\/","text":"Looking for a good indica to kick back with this weekend? Or maybe an uplifting sativa to keep you busy? Check out all of our newly added strains and see if they\u0027re available near you by clicking the links below!\n \n Bubblicious\n\nBubblicious (not to be confused with Wonka’s Bubblicious) is Nirvana Seeds’ rendition of the classic Indiana Bubble Gum. Refined in the Netherlands since the 1990s, Bubblicious captures the signature bubble gum flavor that first lent this hybrid widespread notoriety. Sometimes, Bubblicious will even take on a pink hue that further justifies the naming of this sweet-smelling hybrid. Potent and relaxing, Bubblicious offers full-body effects that soothe tension and stress even in seasoned THC veterans.\n\nClick here for a full list of locations currently carrying Bubblicious\n \n Dark Side of the Moon\n\nFrom Exotic Genetix comes Dark Side of the Moon, an indica strain that pays homage to the legendary 1973 Pink Floyd album. A cross between Spirit in the Sky and Green Ribbon, Dark Side of the Moon flowers bloom with a starry coat of crystal trichomes wreathed by dark purple leaves, giving the strain an almost celestial appearance. Earthy, hashy flavors lead the way with full, sweet fruity notes to follow.\n\n \n Poochie Love\n\nPoochie Love from Archive Seed Bank is a 70% sativa strain that descends from the ever-so-tasteful Dog Shit and Face Off OG. The Dog Shit parent is famous for its, um, “novel” smell that gave this strain its name, but Poochie Love came out smelling a bit more like earthy and herbal spice. Where Poochie Love really shines, however, is in its powerful but motivating euphoria. Stimulating creative and social energy, Poochie Love is the perfect companion strain for busy days in which a functional mind is paramount.\n\n \n Omega\n\nBred over generations from White Widow, Kush, NYC Diesel, and Permafrost genetics, Omega by Rogue Buds is a hybrid strain that lets the mind soar while relaxing the body. This high-THC strain carries a pungent and complex aroma comprised of earthy pine, sweet citrus, and spicy menthol notes. Omega eases muscle tension and frees the head space of excessive stress, making this strain a perfect partner for winding down after a long day.\n\nClick here for a full list of locations currently carrying Omega\n \n Gobbilygoo\n\nGobbilygoo is an indica strain bred by Alphakronik, who combines genetics from Blue Magoo and Gobbstopper (a Purple Urkle and Sin City Kush hybrid). With a sweet flavor of blueberries and grapes, Gobbilygoo delivers deeply relaxing effects that keep both mind and body heavily pacified. Designed for growers in the Pacific Northwest, Gobbilygoo is highly resistant to mildew and flowers in 50 to 55 days.\n\nClick here for a full list of locations currently carrying Gobbilygoo\n \n Purple Cow\n\nPurple Cow is a sativa cannabis strain bred from parents Flo and Dairy Queen. She primarily inherits sativa qualities, passing on uplifting cerebral effects to the consumer. Creative minds will appreciate the extra spark provided by Purple Cow’s dreamy, invigorating euphoria, and her sweet, sour mango aroma has something to offer flavor connoisseurs as well. Purple Cow buds explode with chunky, resin-packed calyxes which can take on a slight purple hue at the end of her maturation cycle.\n\n \n Mandala #1\n\nBred by Mandala Seeds, Mandala #1 is a hybrid strain with genetic roots in South Africa, New Zealand, and Northern India. Dreamy euphoria illuminates the mind, waking creativity and happiness with a sweet fragrance of apples, raspberry, and mint. Mandala #1 may hit like a sativa, but to the delight of commercial growers, it grows like an indica with a short flowering cycle of just 55 to 60 days.\n\nClick here for a full list of locations currently carrying Mandala #1\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002316/new-strains-alert-poochie-love-dark-side-of-the-moon-omega-and-mo.png","urlslug":"/news/strains-products/new-strains-alert-poochie-love-dark-side-of-the-moon-omega-and-mo"}],"reviewCount":9,"flavors":[{"name":"Mint","score":54.166666666666664},{"name":"Berry","score":54.166666666666664},{"name":"Earthy","score":54.166666666666664},{"name":"Citrus","score":52.083333333333336},{"name":"Diesel","score":50}],"effects":[{"name":"Euphoric","score":64.583333333333329},{"name":"Creative","score":62.5},{"name":"Energetic","score":60.416666666666671},{"name":"Uplifted","score":58.333333333333329},{"name":"Happy","score":58.333333333333329}],"symptoms":[{"name":"Headaches","score":54.166666666666664},{"name":"Nausea","score":54.166666666666664},{"name":"Depression","score":52.083333333333336},{"name":"Stress","score":52.083333333333336},{"name":"Cramps","score":50}],"conditions":[{"name":"Anxiety","score":52.083333333333336},{"name":"Asthma","score":52.083333333333336},{"name":"PMS","score":52.083333333333336},{"name":"ADD/ADHD","score":50},{"name":"Alzheimer\u0027s","score":50}],"negatives":[{"name":"Dizzy","score":50},{"name":"Dry Mouth","score":6.25},{"name":"Dry Eyes","score":4.1666666666666661},{"name":"Anxious","score":4.1666666666666661},{"name":"Paranoid","score":2.083333333333333}],"articlesAvailable":true,"articleTotalCount":1,"photos":[],"photoTotalCount":0,"popularCities":["Spokane, WA","Bend, OR","Medford, OR","Saint Helens, OR","Tillamook, OR"],"permalink":"https://mobileapi.leafly.com/hybrid/mandala-1","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.44444444444444/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"African","subtitle":null,"slug":"african","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/african","symbol":"Afr","applink":"leafly://strain/african"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":57,"outdoorFinish":null,"height":"Medium","averageYield":null,"environment":null,"growNotes":""}}
