{
    "aka": "Marleys Collie",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1486400400000)/",
            "id": "contentitems-3001",
            "text": "Today we honor the birthday of Robert Nesta Marley. The Reggae legend, better known as Bob, would have turned 72 today. To celebrate the man who spent so much of his life singing the songs of universal peace, love and, of course, cannabis, we give you seven strains that were influenced by him and his home island of Jamaica.\n1. Jamaican\n\n \n \n \n \nThe Jamaican strain refers to the indigenous varieties of cannabis (or landraces) that grow natively in this region of the world. Because of Jamaica’s latitude and climate, these varieties tend to be sativa in structure and effect.\n2. Lamb’s Bread\n\n \n \n \n \nAlso called “Lamb’s Breath,” Lamb’s Bread is a bright green and sticky sativa strain. The effects have been known to give mass amounts of energy and positive introspection. Stress subsides quickly from the Lamb’s Bread buzz, which can help ease depression. The origins of this plant comes from Jamaica and it has been reported that even Bob Marley himself has encountered this wonderful slice of cannabis genealogy.\n3. Jamaican Pearl\n\n \n \n \n \nJamaican Pearl is a sweetly potent outdoor sativa strain from Dutch breeder Sensi Seeds whose presence will bring a taste of the Caribbean to cannabis consumers. Jamaica is home to sativas of astounding quality and potency, selectively bred for countless generations. This strain, a genetic cross between Marley’s Collie and Early Pearl, provides a nice breezy cerebral sensation with tropical flavors.\n4. King’s Bread\n\n \n \n \n \nSaid to be a sativa landrace from the Blue Mountains of Jamaica, King’s Bread (or King’s Breath) delivers mellowing and euphoric cerebral effects. Finger-like bulbs reach out from the citrus-scented buds wrapped in crystal trichomes. Lamb’s Bread is counted among its progeny, although King’s Bread’s lineage is not well documented. Pain relief, appetite stimulation, and stress alleviation are just a few of the therapeutic benefits King’s Bread has to offer.\n5. Jamaican Dream\n\n \n \n \n \nJamaican Dream is a 90% sativa bred by Eva Seeds using Jamaican genetics. A subtle and sweet flavor carries you through to an elevated mood and weightless euphoria. The effects are light enough to start your day with, making this strain ideal for early treatment of depression and fatigue. Jamaican Dream’s pointed, compact buds will finish their flowering cycle after 42 to 45 days indoors, or at the end of September in outdoor gardens.\n6. Marley’s Collie\n\n \n \n \n \nMarley’s Collie is an indica-dominant hybrid bred by Sensi Seeds that won the Dutch High Life Cup in 1999. These sticky, spiky buds offer a pungent sweet aroma with musky Afghani undertones, delivering effects that are strong in both physical and cerebral sensation. Indoor and outdoor grows can expect flowers between 60 and 65 days.\n7. Jamaican Lion\n\n \n \n \n \nJamaican Lion is a high-CBD sativa strain with mildly psychoactive effects that stimulate creativity and focus without the loss of functionality. Its rich genetic background combines Mountain Lion — a Rockbud and Lionheart cross — with a Jamaican sativa known as Yarders. Shadrock, Jamaican Lion’s creator, first brought the strain to California in 2007, where it was distributed to patients by Harborside. Ushered in by a sweet herbal aroma, Jamaican Lion induces mild psychoactivity that carries through despite its low THC content. Sensory perception sharpens as bad moods dull in clear-headed sensations that can be described as simultaneously uplifting and calming. Few strains compare to Jamaican Lion as it eases pain, anxiety, and inflammation without intoxication or mental cloudiness. Its CBD content is highest around week 9 of flowering, but if you’re looking for more of a 1:1 ratio of CBD and THC, Shadrock recommends harvesting at week 8 instead.\nHave you tried any of these Jamaican strains? If so, leave your review on the strain’s detail page. If these don’t sound like your kind of cannabis, use the Leafly Explorer to find the strain with the flavors and effects you are looking. Happy Birthday Bob! Stir it up!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/02/12001330/7-jamaican-strains-to-try-in-honor-of-bob-marleys-birthday.jpg",
            "title": "7 Jamaican Cannabis Strains to Try in Honor of Bob Marley's Birthday",
            "urlslug": "/news/strains-products/7-jamaican-strains-to-try-in-honor-of-bob-marleys-birthday"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anorexia",
            "score": 25
        },
        {
            "name": "Anxiety",
            "score": 2.083333333333333
        },
        {
            "name": "Asthma",
            "score": 2.083333333333333
        },
        {
            "name": "Hypertension",
            "score": 2.083333333333333
        },
        {
            "name": "PTSD",
            "score": 2.083333333333333
        }
    ],
    "description": "<p>Marley&#39;s Collie is an <a href=\"http://www.leafly.com/indica\">indica</a>-dominant <a href=\"http://www.leafly.com/hybrid\">hybrid</a> bred by Sensi Seeds that won the Dutch High Life Cup in 1999. These sticky, spiky buds offer a pungent <a href=\"http://www.leafly.com/explore#/explore/flavors-sweet\">sweet</a> aroma with musky Afghan undertones, delivering effects that are strong in both physical and cerebral sensation. Indoor and outdoor grows can expect flowers between 60 and 65 days.</p>\n",
    "descriptionPlain": "Marley&#39;s Collie is an indica-dominant hybrid bred by Sensi Seeds that won the Dutch High Life Cup in 1999. These sticky, spiky buds offer a pungent sweet aroma with musky Afghan undertones, delivering effects that are strong in both physical and cerebral sensation. Indoor and outdoor grows can expect flowers between 60 and 65 days.\n",
    "effects": [
        {
            "name": "Focused",
            "score": 29.166666666666664
        },
        {
            "name": "Aroused",
            "score": 27.083333333333332
        },
        {
            "name": "Hungry",
            "score": 27.083333333333332
        },
        {
            "name": "Tingly",
            "score": 25
        },
        {
            "name": "Relaxed",
            "score": 10.416666666666668
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 4.166666666666666
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 63,
        "growNotes": "\n\tRestrict outdoor grows to climates within 40 degrees of the equator.\n\tThree to four weeks of vegetation can expect a growth of 130 - 160 centimeters.\n\tAvoid topping the central stem to optimize yield.\n\n",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1178055,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This strain is amazing, I love it. nice taste, great feel, better with Marley music. Just relax and dont think too much about it, thats how all sesh sessions should be.. Relaxed (:",
            "username": "TheCidraStrain"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png",
            "id": 1200250,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I really enjoy this strain it melts the stress away, but doesn't dumb you down in fact it helps with your focus, and it's a pretty good creative high.\n\nWhile I wouldn't use before a day of work, it's definitely a high functioning plant. Bring this to a party and have a great time, or smoke a few bowls and netflix it, this plant is versatile everything becomes way cooler.\n\n******Weird descriptions:\n\nA Ferris Bueller's Day Off type weed.",
            "username": "Uhyeahitis"
        }
    ],
    "id": 102544,
    "name": "Marley's Collie",
    "negatives": [
        {
            "name": "Dizzy",
            "score": 25
        },
        {
            "name": "Dry Mouth",
            "score": 25
        },
        {
            "name": "Paranoid",
            "score": 2.083333333333333
        },
        {
            "name": "Anxious",
            "score": 2.083333333333333
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/jamaican",
            "category": "Sativa",
            "name": "Jamaican",
            "permalink": "https://mobileapi.leafly.com/sativa/jamaican",
            "slug": "jamaican",
            "subtitle": null,
            "symbol": "Jam"
        },
        {
            "applink": "leafly://strain/maple-leaf-indica",
            "category": "Indica",
            "name": "Maple Leaf Indica",
            "permalink": "https://mobileapi.leafly.com/indica/maple-leaf-indica",
            "slug": "maple-leaf-indica",
            "subtitle": null,
            "symbol": "Ml"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/marleys-collie",
    "photoTotalCount": 3,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/379135/b/marley-s-collie__primary_32d9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/marley-s-collie_100x100_73a6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/257103/b/marley-s-collie__primary_d753.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/marley-s-collie_100x100_bf9d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/190637/b/marley-s-collie__primary_7963.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/marley-s-collie_100x100_8c81.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [],
    "rating": 4.4,
    "relatedStrains": [],
    "reviewCount": 10,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "marleys-collie",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.4/240",
    "subtitle": null,
    "symbol": "Mlc",
    "symptoms": [
        {
            "name": "Lack of Appetite",
            "score": 25
        },
        {
            "name": "Stress",
            "score": 4.166666666666666
        },
        {
            "name": "Depression",
            "score": 2.083333333333333
        },
        {
            "name": "Insomnia",
            "score": 2.083333333333333
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
