{"sl_translate":"description,descriptionPlain,category","id":17293,"slug":"snoop-s-dream","name":"Snoop\u0027s Dream","subtitle":null,"symbol":"Snd","category":"Hybrid","description":"\u003cp\u003eSnoop Dogg is a hip-hop superstar who has quite a bit of fame in the cannabis community. Given his status, Snoop\u0026rsquo;s Dream is a strain that has a big name to live up to and this indica-dominant hybrid does not disappoint. Snoop\u0026rsquo;s Dream is a mix of \u003ca href=\"http://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/master-kush\"\u003eMaster Kush\u003c/a\u003e, which are purportedly two of the rapper\u0026rsquo;s favorites. Looks-wise, these plants and flowers take after their Blue Dream parent with medium-sized dense buds covered in orange hairs. The taste is where the kush side of this strain shows itself. Sweet blueberry flavors are there with a pine aftertaste that takes over. This hybrid has a strong indica side for sure and may make doing any focused task difficult. Head effects can also be strong, making this a choice that beginners might want to work up to. Tests have shown samples of Snoop\u0026rsquo;s Dream have high THC levels ranging between 18 and 22%.\u003c/p\u003e\n","descriptionPlain":"Snoop Dogg is a hip-hop superstar who has quite a bit of fame in the cannabis community. Given his status, Snoop\u0026rsquo;s Dream is a strain that has a big name to live up to and this indica-dominant hybrid does not disappoint. Snoop\u0026rsquo;s Dream is a mix of Blue Dream and Master Kush, which are purportedly two of the rapper\u0026rsquo;s favorites. Looks-wise, these plants and flowers take after their Blue Dream parent with medium-sized dense buds covered in orange hairs. The taste is where the kush side of this strain shows itself. Sweet blueberry flavors are there with a pine aftertaste that takes over. This hybrid has a strong indica side for sure and may make doing any focused task difficult. Head effects can also be strong, making this a choice that beginners might want to work up to. Tests have shown samples of Snoop\u0026rsquo;s Dream have high THC levels ranging between 18 and 22%.\n","aka":"Snoop\u0027s Master Kush","rating":4.56,"highlightedReviews":[{"id":1417563,"username":"StukaFox","text":"Being upper-middle class and white, much of what Snoop Dogg raps about resonates with me. I certainly have my mind on my money -- investments, savings, 401(k)s -- and my money on my mind -- and I enjoy both gin AND juice. So when I spied a a strain bearing Mr. Dogg\u0027s name, I knew that I would soon be saying \"awwwwwwwshit son\" and blazing up blunts of his chronic while listening to Snoop\u0027s thought-provoking lyrics about bitches and hos. Make no mistake, Snoop\u0027s Dream is wonderful as his music: a smooth, active high without anxiety or the leaden feeling that comes with some other indica strains. In fact, Snoop\u0027s Dream has become my \"daily toker\" just because the high is right at the Goldilocks zone of not too light and not too heavy. Thank the Doggfather for this fantastic strain, preferably by not rapping if you\u0027re over 35 and white.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1631016,"username":"DestinationHwy420","text":"Pleasant \u0026 balanced high, helped relax the mind and body.  Sweet berry flavor.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sprevdc92bvNKojx0pps2BUvIVU=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fybBOy14QEGEFlO94pZSC_DH420logoNOBKG.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-7858","title":"Pair These Cannabis Strains With 5 of Stephen King\u0027s Best Novels","author":"Gage Peake","category":null,"date":"\/Date(1474584346000)\/","text":"From classics like The Green Mile and Rita Hayworth and Shawshank Redemption to supernatural spookers like Carrie and The Shining, Stephen King has gifted the world with magnificent pieces of literature that feature surprising depth. If you’re thinking of picking up one of his works, here are some cannabis strains that pair well with some of our favorite stories from the King of Horror.\nCujo\n\nYou might remember this classic from 1981. Cujo, a sweet good-natured dog in the beginning of the story, gets bit on the nose by a rabid bat and ultimately transforms into a killing machine that tears into neighbors and police sheriffs indiscriminately. Like all of the entries on this list, Cujo was adapted into a movie in 1983.\nStrain Pairing: Snoop’s Dream\n\nPicking a strain to pair with this story proved difficult, but after some consideration, we had to choose one of our favorite dog-themed strains, Snoop Dream. Named after the hip-hop superstar, Snoop’s Dream is a mix of Blue Dream and Master Kush, making for medium-sized dense buds covered in orange hairs. The hybrid’s relaxing qualities would be the perfect mix to calm down a killer dog terrorizing a small town in Maine.\nIT\n\nAnother Stephen King Horror novel, IT, published in 1986, follows the exploits of seven children as they are terrorized by the eponymous being, which exploits the fears and phobias of its victims in order to disguise itself while hunting its prey. Pennywise, the villain in the book, primarily appears in the form of a clown in the story, making this a truly riveting tale that was the best-selling book in the United States the year it came out.\nStrain Pairing: Pennywise\n\nPairing this story with a cannabis strain was easy — we recommend Pennywise, which got its name from King’s book. Pennywise is a high-CBD indica cross between Harlequin and Jack the Ripper, a combination that lends this strain its killer clown name. The high CBD would help with any pain brought on by a psychopathic killer clown.\nRita Hayworth and Shawshank Redemption (from Different Seasons)\n\nMy personal favorite Stephen King story, Rita Hayworth and Shawshank Redemption, appears in his anthology Different Seasons, published in 1982. It was adapted for the big screen in 1994 as The Shawshank Redemption, one of the most critically acclaimed movies of all time. The story follows a man named Andy Dufrense, a banker from Maine, who was convicted for the double murder of his wife and her lover. The only problem? He didn’t commit the crimes. Dufresne spends nearly 30 years in prison before escaping through a tunnel he’d spent two decades digging with a rock hammer.\nStrain Pairing: Star Killer\n\nStar Killer is a solid pairing with Shawshank, as the dense, purple buds offer a sweet, lemon flavor and aid in treating pain, insomnia, and PTSD, among other things. It’s a good option for a person who just dug his way out of prison after spending nearly three decades there locked up.\nThe Shining\n\nPublished in 1977, Stephen King’s The Shining is still captivating audiences all around the world. The book was King’s first hardback bestseller, establishing himas a preeminent author in the horror genre. The Shining centers on the life of Jack Torrance, an aspiring writer and recovering alcoholic, who takes over the historic Overlook Hotel in the Colorado Rockies. His family joins him, including his young son Danny, who possesses “the shining,” an array of psychic abilities that allow him to see the hotel’s horrific past. While the family is holed up in the hotel for the winter, supernatural forces emerge and put the whole family in grave danger.\nStrain Pairing: Jack Herer\nWe paired this story with Jack Herer, a sativa-dominant cannabis strain, as a nod to one of the famous lines from Stanley Kubrick’s film adaption of the novel, “All work and no play makes Jack a dull boy.” With this strain, there will be no dullness in your life, that’s for sure.\nThe Green Mile\n\nLast but certainly not least is the serial novel The Green Mile. Another one of my personal favorites, the story is about a death row supervisor’s encounter with John Coffey, an unusual inmate who displays inexplicable healing and empathetic abilities. Written in 1996, the book takes place in Louisiana in the early 1930s.\nStrain Pairing: Supernatural\nWe paired it with the cannabis strain Supernatural, something that is very relatable to Mr. Coffey. The strain is a sativa-dominant blend that is a great indoor option, with a biting, skunky zest and uplifting sativa effects that will surely bring you supernatural powers.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/22140726/stephen-king.jpg","urlslug":"/news/strains-products/pair-cannabis-strains-5-stephen-kings-best-novels"},{"id":"contentitems-3587","title":"10 Great Cannabis Strains for Breast Cancer Patients","author":"Kayla Williams","category":null,"date":"\/Date(1381420800000)\/","text":"October is National Breast Cancer Awareness month. In observance of the awareness effort, and in support of all breast cancer patients who are battling for their life or their health, here are the best strains for alleviating the three most common treatment side effects: nausea, lack of appetite, and fatigue.\n\n\n\n\n \nVerde Electric is a hybrid cannabis strain known for its smooth delivery and long-lasting effects. It is best used for nausea, pain relief, and regulating digestion.\n\n\n \nBordering on sedative, Kush Berry is a great nighttime option for nausea relief as well as other mental ailments like stress, anxiety, and depression.\n\n\n \nUseful for both pain and nausea, this Afghanica hybrid offers potent sativa and indica effects.\n\n\n \nOG Wreck is a potent hybrid that\u0027s a great nighttime strain for nausea and pain, offering physical and psychoactive relief.\n\n\n \nArmageddon packs a double punch with powerful mind and body effects that are optimal for nausea relief, and is a great choice for dinner with friends before a relaxing evening.\n\nCan\u0027t find the above strains in your area? Our Strain and Products Explorer allows you to filter results based on effects and medical usage, so you can check out other cannabis strains that help with nausea.\n \n \n \n\n\n\n\n\n \nLooking for daytime pain and nausea relief that will also whet your appetite? This OCD sativa does it all, but be cautious: it can increase anxiety.\n\n\n \nOptimal for treating nausea and lack of appetite, the balanced hybrid known as Russian Rocket Fuel is also an effective mood lifter and great for daytime use.\n\n\n \nKnown best for treating anxiety, this high-quality hybrid Snoop\u0027s Dream is well-balanced between cerebral and physical effects and will relieve nausea and lack of appetite.\n\n\n \nTangie is a high-rated hybrid that\u0027s effective in treating nausea and increasing appetite, and is favored for its euphoric, energetic, and relaxing effects. \n\nCheck out some other cannabis strains that help with stimulating appetite.\n \n \n \n\n\n\n\n\n\nSpecialized in treating fatigue but also useful for insomnia and pain relief, this Master Yoda hybrid tends toward indica effects but also offers a mellow sativa buzz.\n \n\n\nHere are some other cannabis strains that help counteract fatigue.\n \n \n \nimage sources: nausea, lack of appetite,  fatigue","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2013/10/12002925/top-10-strains-for-breast-cancer-patients.jpg","urlslug":"/news/strains-products/top-10-strains-for-breast-cancer-patients"}],"reviewCount":312,"flavors":[{"name":"Earthy","score":35.711199734130936},{"name":"Berry","score":20.385510136257892},{"name":"Blueberry","score":14.518943170488534},{"name":"Sweet","score":10.676304420073114},{"name":"Pine","score":5.82834828846793}],"effects":[{"name":"Relaxed","score":95.950481887670321},{"name":"Hungry","score":49.899468261881019},{"name":"Euphoric","score":49.478231970754408},{"name":"Uplifted","score":42.819042871385847},{"name":"Sleepy","score":40.676304420073109}],"symptoms":[{"name":"Stress","score":49.931871053506143},{"name":"Lack of Appetite","score":44.440013293452971},{"name":"Insomnia","score":33.609172482552346},{"name":"Depression","score":31.327683615819208},{"name":"Nausea","score":29.122632103688932}],"conditions":[{"name":"Anxiety","score":37.406114988368223},{"name":"PTSD","score":19.538052509139249},{"name":"ADD/ADHD","score":16.596876038551013},{"name":"Arthritis","score":15.404619474908607},{"name":"Bipolar Disorder","score":14.353605849119308}],"negatives":[{"name":"Dry Mouth","score":37.680292455965436},{"name":"Paranoid","score":22.596377534064473},{"name":"Dry Eyes","score":16.675805915586572},{"name":"Dizzy","score":14.557161847789963},{"name":"Headache","score":10.423728813559322}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/snoop-s-dream_100x100_275c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/660589/b/snoop-s-dream__primary_9c9e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/snoop-s-dream_100x100_36df.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/655061/b/snoop-s-dream__primary_2b0b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/snoop-s-dream_100x100_6595.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/651573/b/snoop-s-dream__primary_7b6d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/snoop-s-dream_100x100_bde3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648558/b/snoop-s-dream__primary_4da9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/snoop-s-dream_100x100_5970.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645997/b/snoop-s-dream__primary_b8ae.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/snoop-s-dream_100x100_be2e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/643473/b/snoop-s-dream__primary_3384.jpg"}],"photoTotalCount":46,"popularCities":["Seattle, WA","Portland, OR","Spokane, WA","Everett, WA","Tacoma, WA","Lynnwood, WA","Bothell, WA","Eugene, OR","Shoreline, WA","Vancouver, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/snoop-s-dream","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.55769230769231/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"},{"name":"Master Kush","subtitle":null,"slug":"master-kush","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/master-kush","symbol":"Mks","applink":"leafly://strain/master-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
