{"sl_translate":"description,descriptionPlain,category","id":228911,"slug":"blueberry-muffins","name":"Blueberry Muffins","subtitle":null,"symbol":"Bbm","category":"Hybrid","description":"\u003cp\u003eBlueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains \u003ca href=\"https://www.leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/indica/blueberry\"\u003eBlueberry\u003c/a\u003e. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of -- you guessed it -- blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea. This strain was bred and developed by \u003ca href=\"http://humboldtseedcompany.com/\"\u003eHumboldt Seed Company\u003c/a\u003e.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Blueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains Afghani and Blueberry. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of -- you guessed it -- blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea. This strain was bred and developed by Humboldt Seed Company.\u0026nbsp;\n","aka":"Muffins","rating":4.66,"highlightedReviews":[{"id":1416517,"username":"ChefBoyarGabe","text":"I will never forget the time I got a chance to try this amazing strain. I fell in love with it immediately. I love everything about it. The aroma smells just like Blueberries. But until inhaled no one will truly understand why the name is Blueberry Muffins and not just Blueberry. When inhaled it tastes exactly like blueberries and when exhaled it\u0027s a warm sweet taste that is exactly like blueberry muffins. The high is the best high I\u0027ve ever had. It\u0027s a nice slow hitting high. It slowly eases into it and eventually the high hits the highest point and it\u0027s just a super relaxed feeling that never couch locks. This is by far my favorite strain I have tried for not just the effects but the aroma, the taste, \u0026 the effects. 5 stars all around in all categories.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1641092,"username":"DesertApollo","text":"Blueberry Muffins is definitely a 5 Star strain!  It has a great aroma, taste and will get you faded for hours, even if you have a higher tolerance. It also helped with my lower back pain. If you see some in the shop give it a try. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-60005","title":"8 Amazing Places to Blaze Up in Humboldt County","author":"Ocean Malandra","category":null,"date":"\/Date(1520701248000)\/","text":"For any cannabis aficionado, hearing the words “Humboldt County” can get the goosebumps going. One of the top cannabis producers in the Emerald Triangle—reaching back to the 1960s and 70s—Humboldt is known far and wide as the Napa Valley of weed; the place that produces the best quality outdoor cannabis in the entire country.\nBut while many connoisseurs have sampled its finest wares, Humboldt County has a lot more to offer than its incredible bud; it’s also a natural paradise filled with gorgeous landscapes and stunning views. And now that California has finally gone recreational, exploring Humboldt County—and all it has to offer—has become one of the best cannabis-infused trips in the world.\n\nBursting with wild coastlines, pristine rivers, unique small towns, and towering stands of ancient redwoods, Humboldt County is a truly breathtaking experience.\nBelow, discover some incredible places to light up and enjoy one of California’s greatest gems.\nPatrick’s Point State Park\n(Redwood Coast/Flickr Creative Commons)\nThe dramatic meeting of land and sea that Humboldt County embodies is on full display at Patrick’s Point State Park—a single square mile of lush forest teeters over the vast ocean on rugged rock promontories. Day hikes along the cliff edge offer fantastic views of raw Humboldt coastline, while inside the park a model Yurok village gives you a chance to explore daily indigenous life before European contact.\nCheck out Wedding Rock before you go, where countless couples have tied the knot backed by awe-inspiring panoramas of Agate Beach, where semi-precious stones lie hidden in the golden sands. Spark up a deliciously relaxing and euphoric strain, like Blueberry Muffins from Humboldt Seed Company, to take in this Eden-like paradise.\nThe Trinity River\n(CampPhoto/iStock)\nClear as glass and sparkling green, the living jewel known as the Trinity River winds its way out of the snowcapped Trinity Alps—the highest point on California’s coastal range. Locals flock here in the summertime to soak in high temperatures in this mountainous paradise. An hour inland from Eureka and Arcata, the town of Willow Creek is the center of activity here. Stop by River Song Natural Foods (a great place to stock up on munchies before hitting the river), and check out a handful of white water rafting outfits around the area.\nCamp Kimtu, just outside Willow Creek, fronts multiple swimming holes and riverside camping while the South Fork of Trinity offers a crystalline paradise of natural pools and rocky edges. For something truly mind-blowing, head into the Hoopa Indian Reservation, the largest in the state, and check out Tish Tang. This native run campground and natural beach offers a spectacular backdrop of forest covered mountains at a picture-perfect bend in the shimmering river. End the day by massaging your tired muscles with Wipe Out Salve by Humboldt Marijuana Company before beginning another adventure in the clear waters.\n\nThe Manila Dunes\n(Redwood Coast/Flickr Creative Commons)\nThe narrow spits that separate the tranquil Humboldt Bay from the Pacific Ocean are home to eco-systems bursting with wildflowers. They seem to have been made just for whiling away the better part of a cannabis-infused afternoon.\nMake your way to the lookout point above the Manila community center for a panoramic view of the bay and the rolling redwood hills before meandering through the dunes and, finally, onto the wilderness beach. From here, it’s a short trot over to the Humboldt Coastal Nature Center, a hobbit-hole like structure built right into the side of a massive sand dune that hosts a variety of educational exhibits for public enjoyment.\nThe Lost Coast\n(Redwood Coast/ Flickr Creative Commons)\nAn endless stretch of black sand beaches against a backdrop of rugged, ocean-worn mountains, the Lost Coast is the largest wilderness coastline on the west outside of Alaska. While the breathtaking Lost Coast Trail takes up to five days to hike—weaving up and down the wind swept summits of the Kings Range to isolated beaches—it is also possible to access the pristine coastline from the town of Shelter Cove, where you’ll find the Black Sands Beach trailhead.\nAn incredible day hike is also possible at King’s Peak, which offers dramatic 360° views of the Lost Coast at 4,000 feet. Exploring the old farming communities of the Matolle Valley, a bastion of old school hippies and a center of cannabis fueled counter cultures via the Lost Coast Scenic Drive, makes for slow travel at its best. It boasts several stand-out swimming holes along the Matolle River made more spectacular with fresh fruit dipped in Humboldt Valley Farms’ infused Chocolate Space Sauce.\n\nThe Humboldt Bay\n(shunyufan/iStock)\nThe largest protected body of water between San Francisco Bay and Puget Sound, Humboldt Bay is bookended by two unique towns—the Victorian seaport of Eureka and the hip college town of Arcata. The bay is home to California sea lions, river otters, and other marine mammals as well as an abundance of avian species.\nFrom the Eureka side, you’ll find the mural-peppered waterfront where Old Town reveals several stand-out small businesses worth patronizing. The Works record store, the palatial Eureka Books with its vast selection of local hiking and wildlife guides, and Humboldt Herbals, where you can stock up on natural, local products like Redwood Honey and talk to an herbalist about your medical marijuana regime.\nThe Victorian downtown area gives way to a bay-front promenade lined with benches, making it a wonderful place to spark up Bubba’s Gift—developed by Humboldt Seed Organization—before taking in the views over the marina and the redwood carpeted hills in the background. If you’re feeling adventurous, kayaks and small sailboat rentals are available, while the 1930s-era Madaket Ferry offers daily sunset cocktail cruises which sets out from the Eureka boardwalk daily.\nIn Arcata, known far and wide for its dedication to all things eco-friendly, an innovative wastewater treatment program has transformed a tidal marsh into a bird sanctuary that offers sweeping views out over the Humboldt Bay.\nThe Arcata Community Forest\n(yhelfman/iStock)\nConsidered a “model” for ecological sustainability, Arcata’s community owned forest blankets the hills just behind Humboldt State University, covering nearly 800 acres. Although you won’t find the several thousand-year-old giants here that exist in nearby State and National Parks, you will enjoy the pleasant and well-kept trail system that let you get completely lost in nature just steps from downtown Arcata. Frisbee golfers have set up a world-class course within the community forest, and just below it—in the grassy open space known as Redwood Park—cannabis lovers gather to puff and pass all day long.\n\nGrizzly Creek Redwoods State Park\n(maislam/iStock)\nYou have to leave the tourist track and head up the rural Highway 36 into Humboldt’s mountainous interior in order to reach Grizzly Creek Redwoods State Park. It’s a hidden gem where old growth forest surrounds the sapphire waters of the Van Duzen River. Fill a thermos of Kikoko’s Positivi-Tea (made with Humboldt-grown bud) to lift the spirits as you travel through the woods and rivers.\nThis small but picture-perfect park is the ultimate place to shun reality in exchange for clear summer skies, hot swimming weather, and spectacular star-gazing through the forest canopy. While car-camping is available at the main entrance, there are several nicely clandestine camping sites located in the gorgeous groves just steps from the riverbank.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/08123143/8-amazing-places-to-toke-up-31.jpg","urlslug":"/news/lifestyle/8-amazing-places-to-blaze-up-in-humboldt-county"},{"id":"contentitems-3249","title":"New Strains Alert: Chem Jong Ill, Afternoon Delight, Slazerbeam, Blueberry Muffins, and More","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1464998400000)\/","text":"Check out the new strains added to the Leafly database! This week’s batch hails from Colorado, bringing potency that will have you thinking you’re a mile high. Starting with his superior dankness, Chem Jong Ill, this dictatorial strain demands respect with a potency suited for pros. But if totalitarianism isn’t quite your speed, maybe tuck into some Blueberry Muffins, yielding fruit-forward fire that would make the Pillsbury Doughboy consider cannibalism. A strain named after America’s #1 single of 1976 couldn’t possibility be this potent, right? Wrong! As Afternoon Delight so aptly put it: “…Thinkin’ of you’s working up an appetite,” and then you eat the whole fridge (if you can get off the couch, that is).\nBut there’s more! Check out all our newly added strains and share your experiences in a review!\n \n   1. Chem Jong Ill\n\nThis sativa-dominant cross is for cannabis pros looking to take the top third of their head clean off! Chem Jong Ill is a powerful hybrid by Colorado Seed Inc. that was bred using Chemdawg #4 and Gupta Kush genetics. Built for potency and longevity, this strain is an excellent option for extended physical activity, offering an uplifted, airy high in the body that is easy on the joints. The aroma is thick with a chemical funk and floral notes typical to Kush varieties.\n\n \n   2. Afternoon Delight\n\nAfternoon Delight is a difficult strain to track down. Noted for its small, dense nuggets and an aroma of pine and pungent terpenes, Afternoon Delight is described as an indica-dominant hybrid with a hazy aura that engulfs the mind and body. But indulge with caution, as this hybrid has also been known for its potency.\n\n \n   3. Flo Limone\n\nFlo Limone is Colorado Seed’s twist on a cannabis classic. Flo, the 1996 Cannabis Cup winner known for its light and bright buzz, is crossed against Nina Limone (Super Lemon Haze x Rebel God Smoke) to create an outstanding, full-flavored sativa that is motivating without an aggressive raciness. The terpene profile has also been described as aroma therapeutic, with notes of citrus incense intermixed with Moroccan hash.\n\n \n   4. Blueberry Muffins\n\nBlueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains Afghani and Blueberry. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of — you guessed it — blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea.\n\n \n   5. Slazerbeam\n\nA sativa-dominant hybrid of Super Lemon Haze and Gupta Kush, Slazerbeam is loaded with dense, zesty buds. This combo is sweet and lemony while exhibiting hints of OG Kush on the inhale. The flower also packs potency, with an average THC content above 20%. Count on latent Haze and Kush effects that ground this 70% sativa with functionally heavy body effects.\n\n \n   6. Bootlegger\n\nBootlegger is a potent cross of AK-47 and Rugburn OG from Rare Dankness Seeds. The front-end parentage of AK-47 offers famous potency, but the addition of Rungburn OG (Ghost OG x Rare Dankness #1) improves bud growth and structure, leading to pungent, oily colas that mature in about 8 to 9 weeks. Expect a sweet, earthy aroma with effects distinct to hybrid crosses: creative, cerebral, and mood lifting, along with the functional sedation common among many OG strains.\n\n \n   7. Big Holy Nina\n\nBig Holy Nina from Helping Hands Herbal is a sativa-dominant cross of S.A.G.E. and Nina Limone (Super Lemon Haze x Rebel God Smoke). This stout sativa blend is infused with energy and will ignite your appetite and brighten your mind.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12002021/new-strains-alert-chem-jong-ill-afternoon-delight-slazerbeam-blue.png","urlslug":"/news/strains-products/new-strains-alert-chem-jong-ill-afternoon-delight-slazerbeam-blue"}],"reviewCount":56,"flavors":[{"name":"Blueberry","score":86.979166666666671},{"name":"Sweet","score":31.249999999999996},{"name":"Grape","score":18.229166666666664},{"name":"Berry","score":10.9375},{"name":"Earthy","score":9.375}],"effects":[{"name":"Euphoric","score":75.520833333333329},{"name":"Relaxed","score":74.479166666666657},{"name":"Happy","score":45.833333333333329},{"name":"Giggly","score":45.312499999999993},{"name":"Uplifted","score":40.625}],"symptoms":[{"name":"Stress","score":41.666666666666664},{"name":"Pain","score":34.895833333333329},{"name":"Depression","score":33.333333333333329},{"name":"Seizures","score":18.749999999999996},{"name":"Headaches","score":10.416666666666668}],"conditions":[{"name":"Anxiety","score":28.645833333333332},{"name":"Bipolar Disorder","score":21.874999999999996},{"name":"Arthritis","score":18.229166666666664},{"name":"PTSD","score":7.2916666666666661},{"name":"PMS","score":6.770833333333333}],"negatives":[{"name":"Dry Mouth","score":42.187499999999993},{"name":"Paranoid","score":16.666666666666664},{"name":"Dry Eyes","score":7.2916666666666661},{"name":"Dizzy","score":2.083333333333333},{"name":"Anxious","score":1.5625}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_b0bd.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/628272/b/blueberry-muffins__primary_afa1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_4a72.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/618645/b/blueberry-muffins__primary_4ffe.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_9583.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617201/b/blueberry-muffins__primary_912c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_da18.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/616525/b/blueberry-muffins__primary_ee06.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_ca76.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/613745/b/blueberry-muffins__primary_48bc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_7b5e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/611562/b/blueberry-muffins__primary_894b.jpg"}],"photoTotalCount":11,"popularCities":["Caguas, Caguas, Puerto Rico","Las Vegas, NV","Scottsdale, AZ","Arnold, CA","Chandler, AZ","Los Angeles, CA","McKinleyville, CA","San Diego, CA","San Juan, San Juan, Puerto Rico","Weed, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/blueberry-muffins","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.66071428571429/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":228911,"slug":"blueberry-muffins","name":"Blueberry Muffins","subtitle":null,"symbol":"Bbm","category":"Hybrid","description":"\u003cp\u003eBlueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains \u003ca href=\"https://www.leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/indica/blueberry\"\u003eBlueberry\u003c/a\u003e. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of -- you guessed it -- blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea. This strain was bred and developed by \u003ca href=\"http://humboldtseedcompany.com/\"\u003eHumboldt Seed Company\u003c/a\u003e.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Blueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains Afghani and Blueberry. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of -- you guessed it -- blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea. This strain was bred and developed by Humboldt Seed Company.\u0026nbsp;\n","aka":"Muffins","rating":4.66,"highlightedReviews":[{"id":1416517,"username":"ChefBoyarGabe","text":"I will never forget the time I got a chance to try this amazing strain. I fell in love with it immediately. I love everything about it. The aroma smells just like Blueberries. But until inhaled no one will truly understand why the name is Blueberry Muffins and not just Blueberry. When inhaled it tastes exactly like blueberries and when exhaled it\u0027s a warm sweet taste that is exactly like blueberry muffins. The high is the best high I\u0027ve ever had. It\u0027s a nice slow hitting high. It slowly eases into it and eventually the high hits the highest point and it\u0027s just a super relaxed feeling that never couch locks. This is by far my favorite strain I have tried for not just the effects but the aroma, the taste, \u0026 the effects. 5 stars all around in all categories.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1641092,"username":"DesertApollo","text":"Blueberry Muffins is definitely a 5 Star strain!  It has a great aroma, taste and will get you faded for hours, even if you have a higher tolerance. It also helped with my lower back pain. If you see some in the shop give it a try. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-60005","title":"8 Amazing Places to Blaze Up in Humboldt County","author":"Ocean Malandra","category":null,"date":"\/Date(1520701248000)\/","text":"For any cannabis aficionado, hearing the words “Humboldt County” can get the goosebumps going. One of the top cannabis producers in the Emerald Triangle—reaching back to the 1960s and 70s—Humboldt is known far and wide as the Napa Valley of weed; the place that produces the best quality outdoor cannabis in the entire country.\nBut while many connoisseurs have sampled its finest wares, Humboldt County has a lot more to offer than its incredible bud; it’s also a natural paradise filled with gorgeous landscapes and stunning views. And now that California has finally gone recreational, exploring Humboldt County—and all it has to offer—has become one of the best cannabis-infused trips in the world.\n\nBursting with wild coastlines, pristine rivers, unique small towns, and towering stands of ancient redwoods, Humboldt County is a truly breathtaking experience.\nBelow, discover some incredible places to light up and enjoy one of California’s greatest gems.\nPatrick’s Point State Park\n(Redwood Coast/Flickr Creative Commons)\nThe dramatic meeting of land and sea that Humboldt County embodies is on full display at Patrick’s Point State Park—a single square mile of lush forest teeters over the vast ocean on rugged rock promontories. Day hikes along the cliff edge offer fantastic views of raw Humboldt coastline, while inside the park a model Yurok village gives you a chance to explore daily indigenous life before European contact.\nCheck out Wedding Rock before you go, where countless couples have tied the knot backed by awe-inspiring panoramas of Agate Beach, where semi-precious stones lie hidden in the golden sands. Spark up a deliciously relaxing and euphoric strain, like Blueberry Muffins from Humboldt Seed Company, to take in this Eden-like paradise.\nThe Trinity River\n(CampPhoto/iStock)\nClear as glass and sparkling green, the living jewel known as the Trinity River winds its way out of the snowcapped Trinity Alps—the highest point on California’s coastal range. Locals flock here in the summertime to soak in high temperatures in this mountainous paradise. An hour inland from Eureka and Arcata, the town of Willow Creek is the center of activity here. Stop by River Song Natural Foods (a great place to stock up on munchies before hitting the river), and check out a handful of white water rafting outfits around the area.\nCamp Kimtu, just outside Willow Creek, fronts multiple swimming holes and riverside camping while the South Fork of Trinity offers a crystalline paradise of natural pools and rocky edges. For something truly mind-blowing, head into the Hoopa Indian Reservation, the largest in the state, and check out Tish Tang. This native run campground and natural beach offers a spectacular backdrop of forest covered mountains at a picture-perfect bend in the shimmering river. End the day by massaging your tired muscles with Wipe Out Salve by Humboldt Marijuana Company before beginning another adventure in the clear waters.\n\nThe Manila Dunes\n(Redwood Coast/Flickr Creative Commons)\nThe narrow spits that separate the tranquil Humboldt Bay from the Pacific Ocean are home to eco-systems bursting with wildflowers. They seem to have been made just for whiling away the better part of a cannabis-infused afternoon.\nMake your way to the lookout point above the Manila community center for a panoramic view of the bay and the rolling redwood hills before meandering through the dunes and, finally, onto the wilderness beach. From here, it’s a short trot over to the Humboldt Coastal Nature Center, a hobbit-hole like structure built right into the side of a massive sand dune that hosts a variety of educational exhibits for public enjoyment.\nThe Lost Coast\n(Redwood Coast/ Flickr Creative Commons)\nAn endless stretch of black sand beaches against a backdrop of rugged, ocean-worn mountains, the Lost Coast is the largest wilderness coastline on the west outside of Alaska. While the breathtaking Lost Coast Trail takes up to five days to hike—weaving up and down the wind swept summits of the Kings Range to isolated beaches—it is also possible to access the pristine coastline from the town of Shelter Cove, where you’ll find the Black Sands Beach trailhead.\nAn incredible day hike is also possible at King’s Peak, which offers dramatic 360° views of the Lost Coast at 4,000 feet. Exploring the old farming communities of the Matolle Valley, a bastion of old school hippies and a center of cannabis fueled counter cultures via the Lost Coast Scenic Drive, makes for slow travel at its best. It boasts several stand-out swimming holes along the Matolle River made more spectacular with fresh fruit dipped in Humboldt Valley Farms’ infused Chocolate Space Sauce.\n\nThe Humboldt Bay\n(shunyufan/iStock)\nThe largest protected body of water between San Francisco Bay and Puget Sound, Humboldt Bay is bookended by two unique towns—the Victorian seaport of Eureka and the hip college town of Arcata. The bay is home to California sea lions, river otters, and other marine mammals as well as an abundance of avian species.\nFrom the Eureka side, you’ll find the mural-peppered waterfront where Old Town reveals several stand-out small businesses worth patronizing. The Works record store, the palatial Eureka Books with its vast selection of local hiking and wildlife guides, and Humboldt Herbals, where you can stock up on natural, local products like Redwood Honey and talk to an herbalist about your medical marijuana regime.\nThe Victorian downtown area gives way to a bay-front promenade lined with benches, making it a wonderful place to spark up Bubba’s Gift—developed by Humboldt Seed Organization—before taking in the views over the marina and the redwood carpeted hills in the background. If you’re feeling adventurous, kayaks and small sailboat rentals are available, while the 1930s-era Madaket Ferry offers daily sunset cocktail cruises which sets out from the Eureka boardwalk daily.\nIn Arcata, known far and wide for its dedication to all things eco-friendly, an innovative wastewater treatment program has transformed a tidal marsh into a bird sanctuary that offers sweeping views out over the Humboldt Bay.\nThe Arcata Community Forest\n(yhelfman/iStock)\nConsidered a “model” for ecological sustainability, Arcata’s community owned forest blankets the hills just behind Humboldt State University, covering nearly 800 acres. Although you won’t find the several thousand-year-old giants here that exist in nearby State and National Parks, you will enjoy the pleasant and well-kept trail system that let you get completely lost in nature just steps from downtown Arcata. Frisbee golfers have set up a world-class course within the community forest, and just below it—in the grassy open space known as Redwood Park—cannabis lovers gather to puff and pass all day long.\n\nGrizzly Creek Redwoods State Park\n(maislam/iStock)\nYou have to leave the tourist track and head up the rural Highway 36 into Humboldt’s mountainous interior in order to reach Grizzly Creek Redwoods State Park. It’s a hidden gem where old growth forest surrounds the sapphire waters of the Van Duzen River. Fill a thermos of Kikoko’s Positivi-Tea (made with Humboldt-grown bud) to lift the spirits as you travel through the woods and rivers.\nThis small but picture-perfect park is the ultimate place to shun reality in exchange for clear summer skies, hot swimming weather, and spectacular star-gazing through the forest canopy. While car-camping is available at the main entrance, there are several nicely clandestine camping sites located in the gorgeous groves just steps from the riverbank.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/08123143/8-amazing-places-to-toke-up-31.jpg","urlslug":"/news/lifestyle/8-amazing-places-to-blaze-up-in-humboldt-county"},{"id":"contentitems-3249","title":"New Strains Alert: Chem Jong Ill, Afternoon Delight, Slazerbeam, Blueberry Muffins, and More","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1464998400000)\/","text":"Check out the new strains added to the Leafly database! This week’s batch hails from Colorado, bringing potency that will have you thinking you’re a mile high. Starting with his superior dankness, Chem Jong Ill, this dictatorial strain demands respect with a potency suited for pros. But if totalitarianism isn’t quite your speed, maybe tuck into some Blueberry Muffins, yielding fruit-forward fire that would make the Pillsbury Doughboy consider cannibalism. A strain named after America’s #1 single of 1976 couldn’t possibility be this potent, right? Wrong! As Afternoon Delight so aptly put it: “…Thinkin’ of you’s working up an appetite,” and then you eat the whole fridge (if you can get off the couch, that is).\nBut there’s more! Check out all our newly added strains and share your experiences in a review!\n \n   1. Chem Jong Ill\n\nThis sativa-dominant cross is for cannabis pros looking to take the top third of their head clean off! Chem Jong Ill is a powerful hybrid by Colorado Seed Inc. that was bred using Chemdawg #4 and Gupta Kush genetics. Built for potency and longevity, this strain is an excellent option for extended physical activity, offering an uplifted, airy high in the body that is easy on the joints. The aroma is thick with a chemical funk and floral notes typical to Kush varieties.\n\n \n   2. Afternoon Delight\n\nAfternoon Delight is a difficult strain to track down. Noted for its small, dense nuggets and an aroma of pine and pungent terpenes, Afternoon Delight is described as an indica-dominant hybrid with a hazy aura that engulfs the mind and body. But indulge with caution, as this hybrid has also been known for its potency.\n\n \n   3. Flo Limone\n\nFlo Limone is Colorado Seed’s twist on a cannabis classic. Flo, the 1996 Cannabis Cup winner known for its light and bright buzz, is crossed against Nina Limone (Super Lemon Haze x Rebel God Smoke) to create an outstanding, full-flavored sativa that is motivating without an aggressive raciness. The terpene profile has also been described as aroma therapeutic, with notes of citrus incense intermixed with Moroccan hash.\n\n \n   4. Blueberry Muffins\n\nBlueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains Afghani and Blueberry. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of — you guessed it — blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea.\n\n \n   5. Slazerbeam\n\nA sativa-dominant hybrid of Super Lemon Haze and Gupta Kush, Slazerbeam is loaded with dense, zesty buds. This combo is sweet and lemony while exhibiting hints of OG Kush on the inhale. The flower also packs potency, with an average THC content above 20%. Count on latent Haze and Kush effects that ground this 70% sativa with functionally heavy body effects.\n\n \n   6. Bootlegger\n\nBootlegger is a potent cross of AK-47 and Rugburn OG from Rare Dankness Seeds. The front-end parentage of AK-47 offers famous potency, but the addition of Rungburn OG (Ghost OG x Rare Dankness #1) improves bud growth and structure, leading to pungent, oily colas that mature in about 8 to 9 weeks. Expect a sweet, earthy aroma with effects distinct to hybrid crosses: creative, cerebral, and mood lifting, along with the functional sedation common among many OG strains.\n\n \n   7. Big Holy Nina\n\nBig Holy Nina from Helping Hands Herbal is a sativa-dominant cross of S.A.G.E. and Nina Limone (Super Lemon Haze x Rebel God Smoke). This stout sativa blend is infused with energy and will ignite your appetite and brighten your mind.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12002021/new-strains-alert-chem-jong-ill-afternoon-delight-slazerbeam-blue.png","urlslug":"/news/strains-products/new-strains-alert-chem-jong-ill-afternoon-delight-slazerbeam-blue"}],"reviewCount":56,"flavors":[{"name":"Blueberry","score":86.979166666666671},{"name":"Sweet","score":31.249999999999996},{"name":"Grape","score":18.229166666666664},{"name":"Berry","score":10.9375},{"name":"Earthy","score":9.375}],"effects":[{"name":"Euphoric","score":75.520833333333329},{"name":"Relaxed","score":74.479166666666657},{"name":"Happy","score":45.833333333333329},{"name":"Giggly","score":45.312499999999993},{"name":"Uplifted","score":40.625}],"symptoms":[{"name":"Stress","score":41.666666666666664},{"name":"Pain","score":34.895833333333329},{"name":"Depression","score":33.333333333333329},{"name":"Seizures","score":18.749999999999996},{"name":"Headaches","score":10.416666666666668}],"conditions":[{"name":"Anxiety","score":28.645833333333332},{"name":"Bipolar Disorder","score":21.874999999999996},{"name":"Arthritis","score":18.229166666666664},{"name":"PTSD","score":7.2916666666666661},{"name":"PMS","score":6.770833333333333}],"negatives":[{"name":"Dry Mouth","score":42.187499999999993},{"name":"Paranoid","score":16.666666666666664},{"name":"Dry Eyes","score":7.2916666666666661},{"name":"Dizzy","score":2.083333333333333},{"name":"Anxious","score":1.5625}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_b0bd.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/628272/b/blueberry-muffins__primary_afa1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_4a72.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/618645/b/blueberry-muffins__primary_4ffe.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_9583.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617201/b/blueberry-muffins__primary_912c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_da18.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/616525/b/blueberry-muffins__primary_ee06.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_ca76.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/613745/b/blueberry-muffins__primary_48bc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_7b5e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/611562/b/blueberry-muffins__primary_894b.jpg"}],"photoTotalCount":11,"popularCities":["Caguas, Caguas, Puerto Rico","Las Vegas, NV","Scottsdale, AZ","Arnold, CA","Chandler, AZ","Los Angeles, CA","McKinleyville, CA","San Diego, CA","San Juan, San Juan, Puerto Rico","Weed, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/blueberry-muffins","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.66071428571429/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":228911,"slug":"blueberry-muffins","name":"Blueberry Muffins","subtitle":null,"symbol":"Bbm","category":"Hybrid","description":"\u003cp\u003eBlueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains \u003ca href=\"https://www.leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/indica/blueberry\"\u003eBlueberry\u003c/a\u003e. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of -- you guessed it -- blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea. This strain was bred and developed by \u003ca href=\"http://humboldtseedcompany.com/\"\u003eHumboldt Seed Company\u003c/a\u003e.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Blueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains Afghani and Blueberry. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of -- you guessed it -- blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea. This strain was bred and developed by Humboldt Seed Company.\u0026nbsp;\n","aka":"Muffins","rating":4.66,"highlightedReviews":[{"id":1416517,"username":"ChefBoyarGabe","text":"I will never forget the time I got a chance to try this amazing strain. I fell in love with it immediately. I love everything about it. The aroma smells just like Blueberries. But until inhaled no one will truly understand why the name is Blueberry Muffins and not just Blueberry. When inhaled it tastes exactly like blueberries and when exhaled it\u0027s a warm sweet taste that is exactly like blueberry muffins. The high is the best high I\u0027ve ever had. It\u0027s a nice slow hitting high. It slowly eases into it and eventually the high hits the highest point and it\u0027s just a super relaxed feeling that never couch locks. This is by far my favorite strain I have tried for not just the effects but the aroma, the taste, \u0026 the effects. 5 stars all around in all categories.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1641092,"username":"DesertApollo","text":"Blueberry Muffins is definitely a 5 Star strain!  It has a great aroma, taste and will get you faded for hours, even if you have a higher tolerance. It also helped with my lower back pain. If you see some in the shop give it a try. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-60005","title":"8 Amazing Places to Blaze Up in Humboldt County","author":"Ocean Malandra","category":null,"date":"\/Date(1520701248000)\/","text":"For any cannabis aficionado, hearing the words “Humboldt County” can get the goosebumps going. One of the top cannabis producers in the Emerald Triangle—reaching back to the 1960s and 70s—Humboldt is known far and wide as the Napa Valley of weed; the place that produces the best quality outdoor cannabis in the entire country.\nBut while many connoisseurs have sampled its finest wares, Humboldt County has a lot more to offer than its incredible bud; it’s also a natural paradise filled with gorgeous landscapes and stunning views. And now that California has finally gone recreational, exploring Humboldt County—and all it has to offer—has become one of the best cannabis-infused trips in the world.\n\nBursting with wild coastlines, pristine rivers, unique small towns, and towering stands of ancient redwoods, Humboldt County is a truly breathtaking experience.\nBelow, discover some incredible places to light up and enjoy one of California’s greatest gems.\nPatrick’s Point State Park\n(Redwood Coast/Flickr Creative Commons)\nThe dramatic meeting of land and sea that Humboldt County embodies is on full display at Patrick’s Point State Park—a single square mile of lush forest teeters over the vast ocean on rugged rock promontories. Day hikes along the cliff edge offer fantastic views of raw Humboldt coastline, while inside the park a model Yurok village gives you a chance to explore daily indigenous life before European contact.\nCheck out Wedding Rock before you go, where countless couples have tied the knot backed by awe-inspiring panoramas of Agate Beach, where semi-precious stones lie hidden in the golden sands. Spark up a deliciously relaxing and euphoric strain, like Blueberry Muffins from Humboldt Seed Company, to take in this Eden-like paradise.\nThe Trinity River\n(CampPhoto/iStock)\nClear as glass and sparkling green, the living jewel known as the Trinity River winds its way out of the snowcapped Trinity Alps—the highest point on California’s coastal range. Locals flock here in the summertime to soak in high temperatures in this mountainous paradise. An hour inland from Eureka and Arcata, the town of Willow Creek is the center of activity here. Stop by River Song Natural Foods (a great place to stock up on munchies before hitting the river), and check out a handful of white water rafting outfits around the area.\nCamp Kimtu, just outside Willow Creek, fronts multiple swimming holes and riverside camping while the South Fork of Trinity offers a crystalline paradise of natural pools and rocky edges. For something truly mind-blowing, head into the Hoopa Indian Reservation, the largest in the state, and check out Tish Tang. This native run campground and natural beach offers a spectacular backdrop of forest covered mountains at a picture-perfect bend in the shimmering river. End the day by massaging your tired muscles with Wipe Out Salve by Humboldt Marijuana Company before beginning another adventure in the clear waters.\n\nThe Manila Dunes\n(Redwood Coast/Flickr Creative Commons)\nThe narrow spits that separate the tranquil Humboldt Bay from the Pacific Ocean are home to eco-systems bursting with wildflowers. They seem to have been made just for whiling away the better part of a cannabis-infused afternoon.\nMake your way to the lookout point above the Manila community center for a panoramic view of the bay and the rolling redwood hills before meandering through the dunes and, finally, onto the wilderness beach. From here, it’s a short trot over to the Humboldt Coastal Nature Center, a hobbit-hole like structure built right into the side of a massive sand dune that hosts a variety of educational exhibits for public enjoyment.\nThe Lost Coast\n(Redwood Coast/ Flickr Creative Commons)\nAn endless stretch of black sand beaches against a backdrop of rugged, ocean-worn mountains, the Lost Coast is the largest wilderness coastline on the west outside of Alaska. While the breathtaking Lost Coast Trail takes up to five days to hike—weaving up and down the wind swept summits of the Kings Range to isolated beaches—it is also possible to access the pristine coastline from the town of Shelter Cove, where you’ll find the Black Sands Beach trailhead.\nAn incredible day hike is also possible at King’s Peak, which offers dramatic 360° views of the Lost Coast at 4,000 feet. Exploring the old farming communities of the Matolle Valley, a bastion of old school hippies and a center of cannabis fueled counter cultures via the Lost Coast Scenic Drive, makes for slow travel at its best. It boasts several stand-out swimming holes along the Matolle River made more spectacular with fresh fruit dipped in Humboldt Valley Farms’ infused Chocolate Space Sauce.\n\nThe Humboldt Bay\n(shunyufan/iStock)\nThe largest protected body of water between San Francisco Bay and Puget Sound, Humboldt Bay is bookended by two unique towns—the Victorian seaport of Eureka and the hip college town of Arcata. The bay is home to California sea lions, river otters, and other marine mammals as well as an abundance of avian species.\nFrom the Eureka side, you’ll find the mural-peppered waterfront where Old Town reveals several stand-out small businesses worth patronizing. The Works record store, the palatial Eureka Books with its vast selection of local hiking and wildlife guides, and Humboldt Herbals, where you can stock up on natural, local products like Redwood Honey and talk to an herbalist about your medical marijuana regime.\nThe Victorian downtown area gives way to a bay-front promenade lined with benches, making it a wonderful place to spark up Bubba’s Gift—developed by Humboldt Seed Organization—before taking in the views over the marina and the redwood carpeted hills in the background. If you’re feeling adventurous, kayaks and small sailboat rentals are available, while the 1930s-era Madaket Ferry offers daily sunset cocktail cruises which sets out from the Eureka boardwalk daily.\nIn Arcata, known far and wide for its dedication to all things eco-friendly, an innovative wastewater treatment program has transformed a tidal marsh into a bird sanctuary that offers sweeping views out over the Humboldt Bay.\nThe Arcata Community Forest\n(yhelfman/iStock)\nConsidered a “model” for ecological sustainability, Arcata’s community owned forest blankets the hills just behind Humboldt State University, covering nearly 800 acres. Although you won’t find the several thousand-year-old giants here that exist in nearby State and National Parks, you will enjoy the pleasant and well-kept trail system that let you get completely lost in nature just steps from downtown Arcata. Frisbee golfers have set up a world-class course within the community forest, and just below it—in the grassy open space known as Redwood Park—cannabis lovers gather to puff and pass all day long.\n\nGrizzly Creek Redwoods State Park\n(maislam/iStock)\nYou have to leave the tourist track and head up the rural Highway 36 into Humboldt’s mountainous interior in order to reach Grizzly Creek Redwoods State Park. It’s a hidden gem where old growth forest surrounds the sapphire waters of the Van Duzen River. Fill a thermos of Kikoko’s Positivi-Tea (made with Humboldt-grown bud) to lift the spirits as you travel through the woods and rivers.\nThis small but picture-perfect park is the ultimate place to shun reality in exchange for clear summer skies, hot swimming weather, and spectacular star-gazing through the forest canopy. While car-camping is available at the main entrance, there are several nicely clandestine camping sites located in the gorgeous groves just steps from the riverbank.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/08123143/8-amazing-places-to-toke-up-31.jpg","urlslug":"/news/lifestyle/8-amazing-places-to-blaze-up-in-humboldt-county"},{"id":"contentitems-3249","title":"New Strains Alert: Chem Jong Ill, Afternoon Delight, Slazerbeam, Blueberry Muffins, and More","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1464998400000)\/","text":"Check out the new strains added to the Leafly database! This week’s batch hails from Colorado, bringing potency that will have you thinking you’re a mile high. Starting with his superior dankness, Chem Jong Ill, this dictatorial strain demands respect with a potency suited for pros. But if totalitarianism isn’t quite your speed, maybe tuck into some Blueberry Muffins, yielding fruit-forward fire that would make the Pillsbury Doughboy consider cannibalism. A strain named after America’s #1 single of 1976 couldn’t possibility be this potent, right? Wrong! As Afternoon Delight so aptly put it: “…Thinkin’ of you’s working up an appetite,” and then you eat the whole fridge (if you can get off the couch, that is).\nBut there’s more! Check out all our newly added strains and share your experiences in a review!\n \n   1. Chem Jong Ill\n\nThis sativa-dominant cross is for cannabis pros looking to take the top third of their head clean off! Chem Jong Ill is a powerful hybrid by Colorado Seed Inc. that was bred using Chemdawg #4 and Gupta Kush genetics. Built for potency and longevity, this strain is an excellent option for extended physical activity, offering an uplifted, airy high in the body that is easy on the joints. The aroma is thick with a chemical funk and floral notes typical to Kush varieties.\n\n \n   2. Afternoon Delight\n\nAfternoon Delight is a difficult strain to track down. Noted for its small, dense nuggets and an aroma of pine and pungent terpenes, Afternoon Delight is described as an indica-dominant hybrid with a hazy aura that engulfs the mind and body. But indulge with caution, as this hybrid has also been known for its potency.\n\n \n   3. Flo Limone\n\nFlo Limone is Colorado Seed’s twist on a cannabis classic. Flo, the 1996 Cannabis Cup winner known for its light and bright buzz, is crossed against Nina Limone (Super Lemon Haze x Rebel God Smoke) to create an outstanding, full-flavored sativa that is motivating without an aggressive raciness. The terpene profile has also been described as aroma therapeutic, with notes of citrus incense intermixed with Moroccan hash.\n\n \n   4. Blueberry Muffins\n\nBlueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains Afghani and Blueberry. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of — you guessed it — blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea.\n\n \n   5. Slazerbeam\n\nA sativa-dominant hybrid of Super Lemon Haze and Gupta Kush, Slazerbeam is loaded with dense, zesty buds. This combo is sweet and lemony while exhibiting hints of OG Kush on the inhale. The flower also packs potency, with an average THC content above 20%. Count on latent Haze and Kush effects that ground this 70% sativa with functionally heavy body effects.\n\n \n   6. Bootlegger\n\nBootlegger is a potent cross of AK-47 and Rugburn OG from Rare Dankness Seeds. The front-end parentage of AK-47 offers famous potency, but the addition of Rungburn OG (Ghost OG x Rare Dankness #1) improves bud growth and structure, leading to pungent, oily colas that mature in about 8 to 9 weeks. Expect a sweet, earthy aroma with effects distinct to hybrid crosses: creative, cerebral, and mood lifting, along with the functional sedation common among many OG strains.\n\n \n   7. Big Holy Nina\n\nBig Holy Nina from Helping Hands Herbal is a sativa-dominant cross of S.A.G.E. and Nina Limone (Super Lemon Haze x Rebel God Smoke). This stout sativa blend is infused with energy and will ignite your appetite and brighten your mind.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12002021/new-strains-alert-chem-jong-ill-afternoon-delight-slazerbeam-blue.png","urlslug":"/news/strains-products/new-strains-alert-chem-jong-ill-afternoon-delight-slazerbeam-blue"}],"reviewCount":56,"flavors":[{"name":"Blueberry","score":86.979166666666671},{"name":"Sweet","score":31.249999999999996},{"name":"Grape","score":18.229166666666664},{"name":"Berry","score":10.9375},{"name":"Earthy","score":9.375}],"effects":[{"name":"Euphoric","score":75.520833333333329},{"name":"Relaxed","score":74.479166666666657},{"name":"Happy","score":45.833333333333329},{"name":"Giggly","score":45.312499999999993},{"name":"Uplifted","score":40.625}],"symptoms":[{"name":"Stress","score":41.666666666666664},{"name":"Pain","score":34.895833333333329},{"name":"Depression","score":33.333333333333329},{"name":"Seizures","score":18.749999999999996},{"name":"Headaches","score":10.416666666666668}],"conditions":[{"name":"Anxiety","score":28.645833333333332},{"name":"Bipolar Disorder","score":21.874999999999996},{"name":"Arthritis","score":18.229166666666664},{"name":"PTSD","score":7.2916666666666661},{"name":"PMS","score":6.770833333333333}],"negatives":[{"name":"Dry Mouth","score":42.187499999999993},{"name":"Paranoid","score":16.666666666666664},{"name":"Dry Eyes","score":7.2916666666666661},{"name":"Dizzy","score":2.083333333333333},{"name":"Anxious","score":1.5625}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_b0bd.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/628272/b/blueberry-muffins__primary_afa1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_4a72.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/618645/b/blueberry-muffins__primary_4ffe.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_9583.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617201/b/blueberry-muffins__primary_912c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_da18.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/616525/b/blueberry-muffins__primary_ee06.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_ca76.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/613745/b/blueberry-muffins__primary_48bc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_7b5e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/611562/b/blueberry-muffins__primary_894b.jpg"}],"photoTotalCount":11,"popularCities":["Caguas, Caguas, Puerto Rico","Las Vegas, NV","Scottsdale, AZ","Arnold, CA","Chandler, AZ","Los Angeles, CA","McKinleyville, CA","San Diego, CA","San Juan, San Juan, Puerto Rico","Weed, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/blueberry-muffins","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.66071428571429/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":228911,"slug":"blueberry-muffins","name":"Blueberry Muffins","subtitle":null,"symbol":"Bbm","category":"Hybrid","description":"\u003cp\u003eBlueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains \u003ca href=\"https://www.leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/indica/blueberry\"\u003eBlueberry\u003c/a\u003e. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of -- you guessed it -- blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea. This strain was bred and developed by \u003ca href=\"http://humboldtseedcompany.com/\"\u003eHumboldt Seed Company\u003c/a\u003e.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Blueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains Afghani and Blueberry. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of -- you guessed it -- blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea. This strain was bred and developed by Humboldt Seed Company.\u0026nbsp;\n","aka":"Muffins","rating":4.66,"highlightedReviews":[{"id":1416517,"username":"ChefBoyarGabe","text":"I will never forget the time I got a chance to try this amazing strain. I fell in love with it immediately. I love everything about it. The aroma smells just like Blueberries. But until inhaled no one will truly understand why the name is Blueberry Muffins and not just Blueberry. When inhaled it tastes exactly like blueberries and when exhaled it\u0027s a warm sweet taste that is exactly like blueberry muffins. The high is the best high I\u0027ve ever had. It\u0027s a nice slow hitting high. It slowly eases into it and eventually the high hits the highest point and it\u0027s just a super relaxed feeling that never couch locks. This is by far my favorite strain I have tried for not just the effects but the aroma, the taste, \u0026 the effects. 5 stars all around in all categories.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1641092,"username":"DesertApollo","text":"Blueberry Muffins is definitely a 5 Star strain!  It has a great aroma, taste and will get you faded for hours, even if you have a higher tolerance. It also helped with my lower back pain. If you see some in the shop give it a try. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-60005","title":"8 Amazing Places to Blaze Up in Humboldt County","author":"Ocean Malandra","category":null,"date":"\/Date(1520701248000)\/","text":"For any cannabis aficionado, hearing the words “Humboldt County” can get the goosebumps going. One of the top cannabis producers in the Emerald Triangle—reaching back to the 1960s and 70s—Humboldt is known far and wide as the Napa Valley of weed; the place that produces the best quality outdoor cannabis in the entire country.\nBut while many connoisseurs have sampled its finest wares, Humboldt County has a lot more to offer than its incredible bud; it’s also a natural paradise filled with gorgeous landscapes and stunning views. And now that California has finally gone recreational, exploring Humboldt County—and all it has to offer—has become one of the best cannabis-infused trips in the world.\n\nBursting with wild coastlines, pristine rivers, unique small towns, and towering stands of ancient redwoods, Humboldt County is a truly breathtaking experience.\nBelow, discover some incredible places to light up and enjoy one of California’s greatest gems.\nPatrick’s Point State Park\n(Redwood Coast/Flickr Creative Commons)\nThe dramatic meeting of land and sea that Humboldt County embodies is on full display at Patrick’s Point State Park—a single square mile of lush forest teeters over the vast ocean on rugged rock promontories. Day hikes along the cliff edge offer fantastic views of raw Humboldt coastline, while inside the park a model Yurok village gives you a chance to explore daily indigenous life before European contact.\nCheck out Wedding Rock before you go, where countless couples have tied the knot backed by awe-inspiring panoramas of Agate Beach, where semi-precious stones lie hidden in the golden sands. Spark up a deliciously relaxing and euphoric strain, like Blueberry Muffins from Humboldt Seed Company, to take in this Eden-like paradise.\nThe Trinity River\n(CampPhoto/iStock)\nClear as glass and sparkling green, the living jewel known as the Trinity River winds its way out of the snowcapped Trinity Alps—the highest point on California’s coastal range. Locals flock here in the summertime to soak in high temperatures in this mountainous paradise. An hour inland from Eureka and Arcata, the town of Willow Creek is the center of activity here. Stop by River Song Natural Foods (a great place to stock up on munchies before hitting the river), and check out a handful of white water rafting outfits around the area.\nCamp Kimtu, just outside Willow Creek, fronts multiple swimming holes and riverside camping while the South Fork of Trinity offers a crystalline paradise of natural pools and rocky edges. For something truly mind-blowing, head into the Hoopa Indian Reservation, the largest in the state, and check out Tish Tang. This native run campground and natural beach offers a spectacular backdrop of forest covered mountains at a picture-perfect bend in the shimmering river. End the day by massaging your tired muscles with Wipe Out Salve by Humboldt Marijuana Company before beginning another adventure in the clear waters.\n\nThe Manila Dunes\n(Redwood Coast/Flickr Creative Commons)\nThe narrow spits that separate the tranquil Humboldt Bay from the Pacific Ocean are home to eco-systems bursting with wildflowers. They seem to have been made just for whiling away the better part of a cannabis-infused afternoon.\nMake your way to the lookout point above the Manila community center for a panoramic view of the bay and the rolling redwood hills before meandering through the dunes and, finally, onto the wilderness beach. From here, it’s a short trot over to the Humboldt Coastal Nature Center, a hobbit-hole like structure built right into the side of a massive sand dune that hosts a variety of educational exhibits for public enjoyment.\nThe Lost Coast\n(Redwood Coast/ Flickr Creative Commons)\nAn endless stretch of black sand beaches against a backdrop of rugged, ocean-worn mountains, the Lost Coast is the largest wilderness coastline on the west outside of Alaska. While the breathtaking Lost Coast Trail takes up to five days to hike—weaving up and down the wind swept summits of the Kings Range to isolated beaches—it is also possible to access the pristine coastline from the town of Shelter Cove, where you’ll find the Black Sands Beach trailhead.\nAn incredible day hike is also possible at King’s Peak, which offers dramatic 360° views of the Lost Coast at 4,000 feet. Exploring the old farming communities of the Matolle Valley, a bastion of old school hippies and a center of cannabis fueled counter cultures via the Lost Coast Scenic Drive, makes for slow travel at its best. It boasts several stand-out swimming holes along the Matolle River made more spectacular with fresh fruit dipped in Humboldt Valley Farms’ infused Chocolate Space Sauce.\n\nThe Humboldt Bay\n(shunyufan/iStock)\nThe largest protected body of water between San Francisco Bay and Puget Sound, Humboldt Bay is bookended by two unique towns—the Victorian seaport of Eureka and the hip college town of Arcata. The bay is home to California sea lions, river otters, and other marine mammals as well as an abundance of avian species.\nFrom the Eureka side, you’ll find the mural-peppered waterfront where Old Town reveals several stand-out small businesses worth patronizing. The Works record store, the palatial Eureka Books with its vast selection of local hiking and wildlife guides, and Humboldt Herbals, where you can stock up on natural, local products like Redwood Honey and talk to an herbalist about your medical marijuana regime.\nThe Victorian downtown area gives way to a bay-front promenade lined with benches, making it a wonderful place to spark up Bubba’s Gift—developed by Humboldt Seed Organization—before taking in the views over the marina and the redwood carpeted hills in the background. If you’re feeling adventurous, kayaks and small sailboat rentals are available, while the 1930s-era Madaket Ferry offers daily sunset cocktail cruises which sets out from the Eureka boardwalk daily.\nIn Arcata, known far and wide for its dedication to all things eco-friendly, an innovative wastewater treatment program has transformed a tidal marsh into a bird sanctuary that offers sweeping views out over the Humboldt Bay.\nThe Arcata Community Forest\n(yhelfman/iStock)\nConsidered a “model” for ecological sustainability, Arcata’s community owned forest blankets the hills just behind Humboldt State University, covering nearly 800 acres. Although you won’t find the several thousand-year-old giants here that exist in nearby State and National Parks, you will enjoy the pleasant and well-kept trail system that let you get completely lost in nature just steps from downtown Arcata. Frisbee golfers have set up a world-class course within the community forest, and just below it—in the grassy open space known as Redwood Park—cannabis lovers gather to puff and pass all day long.\n\nGrizzly Creek Redwoods State Park\n(maislam/iStock)\nYou have to leave the tourist track and head up the rural Highway 36 into Humboldt’s mountainous interior in order to reach Grizzly Creek Redwoods State Park. It’s a hidden gem where old growth forest surrounds the sapphire waters of the Van Duzen River. Fill a thermos of Kikoko’s Positivi-Tea (made with Humboldt-grown bud) to lift the spirits as you travel through the woods and rivers.\nThis small but picture-perfect park is the ultimate place to shun reality in exchange for clear summer skies, hot swimming weather, and spectacular star-gazing through the forest canopy. While car-camping is available at the main entrance, there are several nicely clandestine camping sites located in the gorgeous groves just steps from the riverbank.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/08123143/8-amazing-places-to-toke-up-31.jpg","urlslug":"/news/lifestyle/8-amazing-places-to-blaze-up-in-humboldt-county"},{"id":"contentitems-3249","title":"New Strains Alert: Chem Jong Ill, Afternoon Delight, Slazerbeam, Blueberry Muffins, and More","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1464998400000)\/","text":"Check out the new strains added to the Leafly database! This week’s batch hails from Colorado, bringing potency that will have you thinking you’re a mile high. Starting with his superior dankness, Chem Jong Ill, this dictatorial strain demands respect with a potency suited for pros. But if totalitarianism isn’t quite your speed, maybe tuck into some Blueberry Muffins, yielding fruit-forward fire that would make the Pillsbury Doughboy consider cannibalism. A strain named after America’s #1 single of 1976 couldn’t possibility be this potent, right? Wrong! As Afternoon Delight so aptly put it: “…Thinkin’ of you’s working up an appetite,” and then you eat the whole fridge (if you can get off the couch, that is).\nBut there’s more! Check out all our newly added strains and share your experiences in a review!\n \n   1. Chem Jong Ill\n\nThis sativa-dominant cross is for cannabis pros looking to take the top third of their head clean off! Chem Jong Ill is a powerful hybrid by Colorado Seed Inc. that was bred using Chemdawg #4 and Gupta Kush genetics. Built for potency and longevity, this strain is an excellent option for extended physical activity, offering an uplifted, airy high in the body that is easy on the joints. The aroma is thick with a chemical funk and floral notes typical to Kush varieties.\n\n \n   2. Afternoon Delight\n\nAfternoon Delight is a difficult strain to track down. Noted for its small, dense nuggets and an aroma of pine and pungent terpenes, Afternoon Delight is described as an indica-dominant hybrid with a hazy aura that engulfs the mind and body. But indulge with caution, as this hybrid has also been known for its potency.\n\n \n   3. Flo Limone\n\nFlo Limone is Colorado Seed’s twist on a cannabis classic. Flo, the 1996 Cannabis Cup winner known for its light and bright buzz, is crossed against Nina Limone (Super Lemon Haze x Rebel God Smoke) to create an outstanding, full-flavored sativa that is motivating without an aggressive raciness. The terpene profile has also been described as aroma therapeutic, with notes of citrus incense intermixed with Moroccan hash.\n\n \n   4. Blueberry Muffins\n\nBlueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains Afghani and Blueberry. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of — you guessed it — blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea.\n\n \n   5. Slazerbeam\n\nA sativa-dominant hybrid of Super Lemon Haze and Gupta Kush, Slazerbeam is loaded with dense, zesty buds. This combo is sweet and lemony while exhibiting hints of OG Kush on the inhale. The flower also packs potency, with an average THC content above 20%. Count on latent Haze and Kush effects that ground this 70% sativa with functionally heavy body effects.\n\n \n   6. Bootlegger\n\nBootlegger is a potent cross of AK-47 and Rugburn OG from Rare Dankness Seeds. The front-end parentage of AK-47 offers famous potency, but the addition of Rungburn OG (Ghost OG x Rare Dankness #1) improves bud growth and structure, leading to pungent, oily colas that mature in about 8 to 9 weeks. Expect a sweet, earthy aroma with effects distinct to hybrid crosses: creative, cerebral, and mood lifting, along with the functional sedation common among many OG strains.\n\n \n   7. Big Holy Nina\n\nBig Holy Nina from Helping Hands Herbal is a sativa-dominant cross of S.A.G.E. and Nina Limone (Super Lemon Haze x Rebel God Smoke). This stout sativa blend is infused with energy and will ignite your appetite and brighten your mind.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12002021/new-strains-alert-chem-jong-ill-afternoon-delight-slazerbeam-blue.png","urlslug":"/news/strains-products/new-strains-alert-chem-jong-ill-afternoon-delight-slazerbeam-blue"}],"reviewCount":56,"flavors":[{"name":"Blueberry","score":86.979166666666671},{"name":"Sweet","score":31.249999999999996},{"name":"Grape","score":18.229166666666664},{"name":"Berry","score":10.9375},{"name":"Earthy","score":9.375}],"effects":[{"name":"Euphoric","score":75.520833333333329},{"name":"Relaxed","score":74.479166666666657},{"name":"Happy","score":45.833333333333329},{"name":"Giggly","score":45.312499999999993},{"name":"Uplifted","score":40.625}],"symptoms":[{"name":"Stress","score":41.666666666666664},{"name":"Pain","score":34.895833333333329},{"name":"Depression","score":33.333333333333329},{"name":"Seizures","score":18.749999999999996},{"name":"Headaches","score":10.416666666666668}],"conditions":[{"name":"Anxiety","score":28.645833333333332},{"name":"Bipolar Disorder","score":21.874999999999996},{"name":"Arthritis","score":18.229166666666664},{"name":"PTSD","score":7.2916666666666661},{"name":"PMS","score":6.770833333333333}],"negatives":[{"name":"Dry Mouth","score":42.187499999999993},{"name":"Paranoid","score":16.666666666666664},{"name":"Dry Eyes","score":7.2916666666666661},{"name":"Dizzy","score":2.083333333333333},{"name":"Anxious","score":1.5625}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_b0bd.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/628272/b/blueberry-muffins__primary_afa1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_4a72.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/618645/b/blueberry-muffins__primary_4ffe.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_9583.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617201/b/blueberry-muffins__primary_912c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_da18.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/616525/b/blueberry-muffins__primary_ee06.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_ca76.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/613745/b/blueberry-muffins__primary_48bc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-muffins_100x100_7b5e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/611562/b/blueberry-muffins__primary_894b.jpg"}],"photoTotalCount":11,"popularCities":["Caguas, Caguas, Puerto Rico","Las Vegas, NV","Scottsdale, AZ","Arnold, CA","Chandler, AZ","Los Angeles, CA","McKinleyville, CA","San Diego, CA","San Juan, San Juan, Puerto Rico","Weed, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/blueberry-muffins","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.66071428571429/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
