{"sl_translate":"description,descriptionPlain,category","id":174127,"slug":"gelato","name":"Gelato","subtitle":null,"symbol":"Gel","category":"Hybrid","description":"\u003cp\u003eGelato (also referred to as \u0026quot;Larry Bird\u0026quot;)\u0026nbsp;is another tantalizing hybrid cannabis strain from Cookie Fam Genetics, following in the footsteps of its parents \u003ca href=\"https://www.leafly.com/hybrid/sunset-sherbert\"\u003eSunset Sherbet\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/hybrid/thin-mint\"\u003eThin Mint GSC\u003c/a\u003e. This Bay Area, California native gets its name from the fruity, dessert-like aroma, a common genetic thread among the Cookie family. Her buds tend to bloom in dark purple hues illuminated by fiery orange hairs and a shining white coat of crystal resin. Novice consumers may want to approach this THC powerhouse with caution, but those armed with a high tolerance will delight in Gelato\u0026rsquo;s heavy-handed euphoria. Physical relaxation comes on strong, but many find themselves still mentally agile enough to stay productive and creative when enjoying Gelato during the day.\u003c/p\u003e\n","descriptionPlain":"Gelato (also referred to as \u0026quot;Larry Bird\u0026quot;)\u0026nbsp;is another tantalizing hybrid cannabis strain from Cookie Fam Genetics, following in the footsteps of its parents Sunset Sherbet and Thin Mint GSC. This Bay Area, California native gets its name from the fruity, dessert-like aroma, a common genetic thread among the Cookie family. Her buds tend to bloom in dark purple hues illuminated by fiery orange hairs and a shining white coat of crystal resin. Novice consumers may want to approach this THC powerhouse with caution, but those armed with a high tolerance will delight in Gelato\u0026rsquo;s heavy-handed euphoria. Physical relaxation comes on strong, but many find themselves still mentally agile enough to stay productive and creative when enjoying Gelato during the day.\n","aka":"Larry Bird","rating":4.74,"highlightedReviews":[{"id":1417514,"username":"kayelle","text":"Gelato is amazing.  A good solid floating peaceful feel.  It\u0027s a heavy hitter and I was lifted after just one bowl... It allowed me to relax.. Still hold conversations and made everything feel so great. I took a shower about 20 min after I finish blowing and OMG the shower was amazing.. Then my husband and I had the most amazing lol time together.  This is definitely a favorite.  It will make you sleepy if you give into it but you can fight through and enjoy the evening.  Either way this is a must try.  ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png"},{"id":1642828,"username":"Weedlessdickhead","text":"One my favorites","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-16353","title":"The Top Trending Cannabis Strains of 2016","author":"Bailey Rahn","category":null,"date":"\/Date(1484957722000)\/","text":"Every year we like to look back and recognize the rising stars of the cannabis world. Last year, GG4 (f.k.a Gorilla Glue #4), Critical Kush, Candyland, and ACDC were among the fastest trending strains according to Leafly user strain reviews, but which strains stood out from the crowd this year?\nTo eliminate outliers that might skew the results, we restricted our search to the top 200 ranking strains of 2016. These strains tend to be more available nationwide, and we hope you’re able to find them in your area!\nBudtenders and inventory managers – are these trending strains on your menu? If not, consider keeping an eye out for them. Because in 2016, they were flying off the shelves fast.\n\n#10. Blue Cookies\n\nWe all know that customers swarm around anything containing the word “Cookies,” thanks to the Girl Scout Cookie hype. But what makes Blue Cookies stand out from the many, many other Cookie crosses? The addition of Blueberry indica genetics, of course.\n#9. Birthday Cake Kush\n\nAnother decadent GSC (f.k.a Girl Scout Cookies) cross, Birthday Cake Kush also pulls in genetics from Cherry Pie to achieve a dessert-like taste that’s not altogether unlike cake itself. It may not be your birthday, but the luxurious and relaxing qualities of this potent hybrid are certainly something to celebrate.\n#8. Sour Tangie\n\nThe citrus-loaded sativa strain Tangie can’t possibly be improved. Or can it? DNA Genetics has done it again, spinning their Tangie masterpiece with the help of East Coast Sour Diesel genetics. Sour Tangie improves the fuel-like taste of Sour Diesel without compromising Sour D’s high-flying creative effects, making this sativa a must-have for flavor enthusiasts and artists alike.\n#7. Purple Candy\n\nPurple Candy blossomed in British Columbia, Canada. Believed to be a cross between BC Sweet Tooth and Mendocino Purps, it’s as sticky and sweet as grape hard candy. But you won’t feel a sugar rush with this indica; instead, expect the heavy-hitter to prime you for bedtime or a solid nap.\n#6. Quantum Kush\n\nA good sativa can lend a positive spark to an otherwise dreary day of chores, so it’s no wonder that Quantum Kush tipped the charts in 2016 as one of the fastest trending sativa strains. While some sativas bring on the buzz with a bit too much gusto, resulting in anxiety and paranoia, Quantum Kush manages to deliver creative, talkative, giggly qualities without what we like to call “The Fear.”\n#5. God’s Green Crack\n\nWho knew the not-so holy union of God Bud and Green Crack would result in something so heavenly? God Bud is known for producing mammoth yields of gargantuan buds, but the effects are a little heavy-handed for some. That’s why Jordan of the Islands crossbred God Bud with Green Crack, the high-flying sativa strain that focuses all of its effort on elevating the mind to a place where laughing fits are inevitable.\n#4. Gelato\n\nA new generation of GSC (f.k.a Girl Scout Cookies) has arrived, and its name is Gelato. From the same breeders that delivered fan favorites Sunset Sherbet and GSC (f.k.a Girl Scout Cookies), Cookie Fam Genetics from Bay Area, California isn’t finished with their royal line quite yet. Gelato, a descendent of Sunset Sherbet and Thin Mint GSC (f.k.a Girl Scout Cookies), blooms in bright colors that are almost as inviting as its tantalizing dessert-like aroma.\n#3. Grape Stomper\n\nGrape Stomper isn’t a new strain, but a jump in Leafly reviews will show that not all good things are sparkly and new. Strong genetics inherited from Purple Elephant and Chemdawg Sour Diesel equip this strain with the full package: flavor, potency, and consistency. Relaxing without encumbering social skills, the balanced Grape Stomper is an excellent choice for so many different activities. No wonder its popularity isn’t waning.\n#2. Nuken\n\nNuken is also an older strain making a comeback. Originally found in Canada, it’s since proliferated throughout the Pacific Northwest to states like Washington and Oregon. Herbal and sweet in flavor, Nuken cradles you in a blanket of dreamy euphoria where your thoughts can float upward to bliss.\n#1. Superglue\n\nLast year, the top trending strain was GG4 (f.k.a Gorilla Glue #4). This year it’s Superglue, which surprisingly bears no family ties to last year’s champ. A cross between Northern Lights and Afghani, Superglue develops a thick coat of sticky resin that will quite literally glue your fingers together. Though its parentage may lead you to believe Superglue will be a knockout, this strain is bred to deliver more light-footed effects. In fact, Leafly users have described this strain as focusing and creative while simultaneously relaxing the body.\n\nWhat was your favorite strain of 2016? We want to hear from you! Leave your most memorable cannabis varieties in the strain section below.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/20115737/cannabis-flower-up-close.jpg","urlslug":"/news/strains-products/top-trending-cannabis-strains-2016"},{"id":"contentitems-3255","title":"New Strains Alert: Citrix, CannaSutra, Gelato, Lemon Alien Dawg, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1438963200000)\/","text":"New strains have just been added to the Leafly strain database, and if you\u0027re the type of person who appreciates flavor, we suggest you bee line it to one of the dispensaries/shops listed below. Lemon Marmalade, Lemon Alien Dawg, Citrix, Gelato…we\u0027ve got your fruity fix covered. Now go forth and leave some strain reviews for all the ones you\u0027ve already experienced!\n \n 1. Citrix\n\nCitrix is a hybrid cannabis strain that draws its genetics from a flavorful Grapefruit mother and a resinous LA Confidential male. Named for its intense orange aroma, Citrix entices the senses before drawing you into its active, clear-headed euphoria. If Citrix makes it into your garden, the telltale signs of a good phenotype include a pungent aroma, disease resistance, heavy yields, rapid vegetative growth, and a dense bud structure.\n\nClick here for a full list of dispensaries and recreational shops carrying Citrix\n \n 2. DelaHaze\n\nDelaHaze by Paradise Seeds is a 70% sativa strain bred from Mango Haze and California Lemon Skunk genetics. To the delight of commercial growers, DelaHaze has the energetic effect profile of a Haze sativa while still offering sizeable yields and a moderate flowering time. Mango and citrus notes express themselves loudly and bring a sweet overtone to the strain\u0027s earthy, spicy aroma. Staying true to its Haze genetics, this sativa delivers uplifting cerebral energy that fuels creativity, focus, and happiness, and then tapers into calm relaxation in time.\n\nDelaHaze is currently available at Seattle Cannabis Co. (Recreational — Seattle, WA) and Local Roots Marijuana (Recreational — Bothell, WA)\n \n 3. CannaSutra\n\nCannaSutra by Delta 9 Labs is a 70/30 indica-dominant cannabis strain parented by Reclining Buddha and Sensi Star. Appropriately derived from the Sanskrit love guide Kama Sutra, this strain is said to sharpen the senses for enhanced romantic encounters. Mellow and functional enough to leave mental acuity intact, CannaSutra is an excellent indica for daytime indulgence. Its flavor is comparable to that of incense, with sweet hashy accents that leave you feeling relaxed and peaceful as you exhale.\n\nCannaSutra is currently available at Natural Green Medicine (Medical — Seattle, WA)\n \n 4. Gelato\n\nGelato is another tantalizing hybrid cannabis strain from Cookie Fam Genetics, following in the footsteps of its parents Sunset Sherbet and Thin Mint GSC (f.k.a Girl Scout Cookies). This Bay Area, California native gets its name from the fruity, dessert-like aroma, a common genetic thread among the Cookie family. Her buds tend to bloom in dark purple hues illuminated by fiery orange hairs and a shining white coat of crystal resin. Novice consumers may want to approach this THC powerhouse with caution, but those armed with a high tolerance will delight in Gelato’s heavy-handed euphoria. Physical relaxation comes on strong, but many find themselves still mentally agile enough to stay productive and creative when enjoying Gelato during the day.\n\nClick here for a full list of dispensaries and recreational shops carrying Gelato\n \n 5. White Buffalo\n\nWhite Buffalo is an 80/20 sativa-dominant cannabis strain that descends from a Romulan and a Blackberry Kush/Bay 11 hybrid. Like the sacred animal of Native American tradition, this White Buffalo is a cherished rarity that may only seldom migrate to your stash jar. Sweetly sour in flavor and covered in a snowy coat of crystal trichomes, White Buffalo provides a powerful blast of euphoria that may surprise any consumer expecting an active and uplifting sativa experience.\n\nClick here for a full list of dispensaries and recreational shops carrying White Buffalo\n \n 6. Lemon Alien Dawg\n\nLemon Alien Dawg comes from Alien Genetics, who crossbred an Alien Dawg female with Lemon Kush to create this pungent hybrid cannabis strain. Large chunky buds radiate with sweet and sour fruity notes dominated by the zesty scent of lemon. Leaning slightly to the indica side of the genetic spectrum, Lemon Alien Dawg lets your body sink into deep relaxation while the mind floats away to happy escapes.\n\nClick here for a full list of dispensaries and recreational shops carrying Lemon Alien Dawg\n \n 7. Lemon Marmalade\n\nLemon Marmalade is potent hybrid from Washington State, bred by Platinum Extracts. The strain was developed by crossing Deadhead OG with Cookie Dough, a select phenotype of GSC (f.k.a Girl Scout Cookies). Caked with trichomes and radiating citrus and diesel fumes, Lemon Marmalade creates a complex flavor mix of lemon and piney Kush with subtle fruit undertones. Lemon Marmalade took home the prize for Best BHO – THC at the 2015 DOPE Cup in Seattle and rumor has it the flower has tested upwards of 30% THC. The effects from Lemon Marmalade come on quick with a euphoric burst of heady energy that quickly levels off into a more relaxing full-bodied experience.\n\n ","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/08/12002031/new-strains-alert-citrix-cannasutra-gelato-lemon-alien-dawg-and-m.jpg","urlslug":"/news/strains-products/new-strains-alert-citrix-cannasutra-gelato-lemon-alien-dawg-and-m"}],"reviewCount":672,"flavors":[{"name":"Sweet","score":35.963619392200208},{"name":"Citrus","score":21.854919335062675},{"name":"Earthy","score":18.923541578054802},{"name":"Pungent","score":11.717211177051521},{"name":"Flowery","score":10.939383097146592}],"effects":[{"name":"Happy","score":75.935935981618627},{"name":"Euphoric","score":72.587481585466264},{"name":"Relaxed","score":72.00153279506},{"name":"Uplifted","score":55.225477256643693},{"name":"Creative","score":45.855170642867272}],"symptoms":[{"name":"Depression","score":42.343049757119829},{"name":"Stress","score":40.547239478082972},{"name":"Pain","score":28.667937809533022},{"name":"Lack of Appetite","score":19.345924280289132},{"name":"Insomnia","score":19.272326994656819}],"conditions":[{"name":"Anxiety","score":32.991305236755686},{"name":"PTSD","score":12.000474016415936},{"name":"ADD/ADHD","score":10.53929255331772},{"name":"PMS","score":9.7443566794024346},{"name":"Migraines","score":8.3240507653935172}],"negatives":[{"name":"Dry Mouth","score":34.421261857255949},{"name":"Dry Eyes","score":19.87462600469879},{"name":"Paranoid","score":7.8853178435234685},{"name":"Dizzy","score":7.7038863869665564},{"name":"Anxious","score":6.5222589955111436}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gelato_100x100_e0bc.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005566/b/gelato__primary_97f7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gelato_100x100_3f61.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1004839/b/gelato__primary_3a48.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gelato_100x100_5b75.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003214/b/gelato__primary_a9c1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gelato_100x100_2dd6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003059/b/gelato__primary_ba01.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gelato_100x100_1d13.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003043/b/gelato__primary_f05d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gelato_100x100_3eb5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002330/b/gelato__primary_0dc7.jpg"}],"photoTotalCount":134,"popularCities":["Los Angeles, CA","Portland, OR","Seattle, WA","Phoenix, AZ","San Francisco, CA","Detroit, MI","San Diego, CA","Eugene, OR","Las Vegas, NV","Chicago, IL"],"permalink":"https://mobileapi.leafly.com/hybrid/gelato","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.73809523809524/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Sunset Sherbet","subtitle":null,"slug":"sunset-sherbert","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/sunset-sherbert","symbol":"Sun","applink":"leafly://strain/sunset-sherbert"},{"name":"Thin Mint GSC","subtitle":null,"slug":"thin-mint","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/thin-mint","symbol":"Tm","applink":"leafly://strain/thin-mint"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":174127,"slug":"gelato","name":"Gelato","subtitle":null,"symbol":"Gel","category":"Hybrid","description":"\u003cp\u003eGelato (also referred to as \u0026quot;Larry Bird\u0026quot;)\u0026nbsp;is another tantalizing hybrid cannabis strain from Cookie Fam Genetics, following in the footsteps of its parents \u003ca href=\"https://www.leafly.com/hybrid/sunset-sherbert\"\u003eSunset Sherbet\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/hybrid/thin-mint\"\u003eThin Mint GSC\u003c/a\u003e. This Bay Area, California native gets its name from the fruity, dessert-like aroma, a common genetic thread among the Cookie family. Her buds tend to bloom in dark purple hues illuminated by fiery orange hairs and a shining white coat of crystal resin. Novice consumers may want to approach this THC powerhouse with caution, but those armed with a high tolerance will delight in Gelato\u0026rsquo;s heavy-handed euphoria. Physical relaxation comes on strong, but many find themselves still mentally agile enough to stay productive and creative when enjoying Gelato during the day.\u003c/p\u003e\n","descriptionPlain":"Gelato (also referred to as \u0026quot;Larry Bird\u0026quot;)\u0026nbsp;is another tantalizing hybrid cannabis strain from Cookie Fam Genetics, following in the footsteps of its parents Sunset Sherbet and Thin Mint GSC. This Bay Area, California native gets its name from the fruity, dessert-like aroma, a common genetic thread among the Cookie family. Her buds tend to bloom in dark purple hues illuminated by fiery orange hairs and a shining white coat of crystal resin. Novice consumers may want to approach this THC powerhouse with caution, but those armed with a high tolerance will delight in Gelato\u0026rsquo;s heavy-handed euphoria. Physical relaxation comes on strong, but many find themselves still mentally agile enough to stay productive and creative when enjoying Gelato during the day.\n","aka":"Larry Bird","rating":4.74,"highlightedReviews":[{"id":1417514,"username":"kayelle","text":"Gelato is amazing.  A good solid floating peaceful feel.  It\u0027s a heavy hitter and I was lifted after just one bowl... It allowed me to relax.. Still hold conversations and made everything feel so great. I took a shower about 20 min after I finish blowing and OMG the shower was amazing.. Then my husband and I had the most amazing lol time together.  This is definitely a favorite.  It will make you sleepy if you give into it but you can fight through and enjoy the evening.  Either way this is a must try.  ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png"},{"id":1642828,"username":"Weedlessdickhead","text":"One my favorites","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-16353","title":"The Top Trending Cannabis Strains of 2016","author":"Bailey Rahn","category":null,"date":"\/Date(1484957722000)\/","text":"Every year we like to look back and recognize the rising stars of the cannabis world. Last year, GG4 (f.k.a Gorilla Glue #4), Critical Kush, Candyland, and ACDC were among the fastest trending strains according to Leafly user strain reviews, but which strains stood out from the crowd this year?\nTo eliminate outliers that might skew the results, we restricted our search to the top 200 ranking strains of 2016. These strains tend to be more available nationwide, and we hope you’re able to find them in your area!\nBudtenders and inventory managers – are these trending strains on your menu? If not, consider keeping an eye out for them. Because in 2016, they were flying off the shelves fast.\n\n#10. Blue Cookies\n\nWe all know that customers swarm around anything containing the word “Cookies,” thanks to the Girl Scout Cookie hype. But what makes Blue Cookies stand out from the many, many other Cookie crosses? The addition of Blueberry indica genetics, of course.\n#9. Birthday Cake Kush\n\nAnother decadent GSC (f.k.a Girl Scout Cookies) cross, Birthday Cake Kush also pulls in genetics from Cherry Pie to achieve a dessert-like taste that’s not altogether unlike cake itself. It may not be your birthday, but the luxurious and relaxing qualities of this potent hybrid are certainly something to celebrate.\n#8. Sour Tangie\n\nThe citrus-loaded sativa strain Tangie can’t possibly be improved. Or can it? DNA Genetics has done it again, spinning their Tangie masterpiece with the help of East Coast Sour Diesel genetics. Sour Tangie improves the fuel-like taste of Sour Diesel without compromising Sour D’s high-flying creative effects, making this sativa a must-have for flavor enthusiasts and artists alike.\n#7. Purple Candy\n\nPurple Candy blossomed in British Columbia, Canada. Believed to be a cross between BC Sweet Tooth and Mendocino Purps, it’s as sticky and sweet as grape hard candy. But you won’t feel a sugar rush with this indica; instead, expect the heavy-hitter to prime you for bedtime or a solid nap.\n#6. Quantum Kush\n\nA good sativa can lend a positive spark to an otherwise dreary day of chores, so it’s no wonder that Quantum Kush tipped the charts in 2016 as one of the fastest trending sativa strains. While some sativas bring on the buzz with a bit too much gusto, resulting in anxiety and paranoia, Quantum Kush manages to deliver creative, talkative, giggly qualities without what we like to call “The Fear.”\n#5. God’s Green Crack\n\nWho knew the not-so holy union of God Bud and Green Crack would result in something so heavenly? God Bud is known for producing mammoth yields of gargantuan buds, but the effects are a little heavy-handed for some. That’s why Jordan of the Islands crossbred God Bud with Green Crack, the high-flying sativa strain that focuses all of its effort on elevating the mind to a place where laughing fits are inevitable.\n#4. Gelato\n\nA new generation of GSC (f.k.a Girl Scout Cookies) has arrived, and its name is Gelato. From the same breeders that delivered fan favorites Sunset Sherbet and GSC (f.k.a Girl Scout Cookies), Cookie Fam Genetics from Bay Area, California isn’t finished with their royal line quite yet. Gelato, a descendent of Sunset Sherbet and Thin Mint GSC (f.k.a Girl Scout Cookies), blooms in bright colors that are almost as inviting as its tantalizing dessert-like aroma.\n#3. Grape Stomper\n\nGrape Stomper isn’t a new strain, but a jump in Leafly reviews will show that not all good things are sparkly and new. Strong genetics inherited from Purple Elephant and Chemdawg Sour Diesel equip this strain with the full package: flavor, potency, and consistency. Relaxing without encumbering social skills, the balanced Grape Stomper is an excellent choice for so many different activities. No wonder its popularity isn’t waning.\n#2. Nuken\n\nNuken is also an older strain making a comeback. Originally found in Canada, it’s since proliferated throughout the Pacific Northwest to states like Washington and Oregon. Herbal and sweet in flavor, Nuken cradles you in a blanket of dreamy euphoria where your thoughts can float upward to bliss.\n#1. Superglue\n\nLast year, the top trending strain was GG4 (f.k.a Gorilla Glue #4). This year it’s Superglue, which surprisingly bears no family ties to last year’s champ. A cross between Northern Lights and Afghani, Superglue develops a thick coat of sticky resin that will quite literally glue your fingers together. Though its parentage may lead you to believe Superglue will be a knockout, this strain is bred to deliver more light-footed effects. In fact, Leafly users have described this strain as focusing and creative while simultaneously relaxing the body.\n\nWhat was your favorite strain of 2016? We want to hear from you! Leave your most memorable cannabis varieties in the strain section below.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/20115737/cannabis-flower-up-close.jpg","urlslug":"/news/strains-products/top-trending-cannabis-strains-2016"},{"id":"contentitems-3255","title":"New Strains Alert: Citrix, CannaSutra, Gelato, Lemon Alien Dawg, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1438963200000)\/","text":"New strains have just been added to the Leafly strain database, and if you\u0027re the type of person who appreciates flavor, we suggest you bee line it to one of the dispensaries/shops listed below. Lemon Marmalade, Lemon Alien Dawg, Citrix, Gelato…we\u0027ve got your fruity fix covered. Now go forth and leave some strain reviews for all the ones you\u0027ve already experienced!\n \n 1. Citrix\n\nCitrix is a hybrid cannabis strain that draws its genetics from a flavorful Grapefruit mother and a resinous LA Confidential male. Named for its intense orange aroma, Citrix entices the senses before drawing you into its active, clear-headed euphoria. If Citrix makes it into your garden, the telltale signs of a good phenotype include a pungent aroma, disease resistance, heavy yields, rapid vegetative growth, and a dense bud structure.\n\nClick here for a full list of dispensaries and recreational shops carrying Citrix\n \n 2. DelaHaze\n\nDelaHaze by Paradise Seeds is a 70% sativa strain bred from Mango Haze and California Lemon Skunk genetics. To the delight of commercial growers, DelaHaze has the energetic effect profile of a Haze sativa while still offering sizeable yields and a moderate flowering time. Mango and citrus notes express themselves loudly and bring a sweet overtone to the strain\u0027s earthy, spicy aroma. Staying true to its Haze genetics, this sativa delivers uplifting cerebral energy that fuels creativity, focus, and happiness, and then tapers into calm relaxation in time.\n\nDelaHaze is currently available at Seattle Cannabis Co. (Recreational — Seattle, WA) and Local Roots Marijuana (Recreational — Bothell, WA)\n \n 3. CannaSutra\n\nCannaSutra by Delta 9 Labs is a 70/30 indica-dominant cannabis strain parented by Reclining Buddha and Sensi Star. Appropriately derived from the Sanskrit love guide Kama Sutra, this strain is said to sharpen the senses for enhanced romantic encounters. Mellow and functional enough to leave mental acuity intact, CannaSutra is an excellent indica for daytime indulgence. Its flavor is comparable to that of incense, with sweet hashy accents that leave you feeling relaxed and peaceful as you exhale.\n\nCannaSutra is currently available at Natural Green Medicine (Medical — Seattle, WA)\n \n 4. Gelato\n\nGelato is another tantalizing hybrid cannabis strain from Cookie Fam Genetics, following in the footsteps of its parents Sunset Sherbet and Thin Mint GSC (f.k.a Girl Scout Cookies). This Bay Area, California native gets its name from the fruity, dessert-like aroma, a common genetic thread among the Cookie family. Her buds tend to bloom in dark purple hues illuminated by fiery orange hairs and a shining white coat of crystal resin. Novice consumers may want to approach this THC powerhouse with caution, but those armed with a high tolerance will delight in Gelato’s heavy-handed euphoria. Physical relaxation comes on strong, but many find themselves still mentally agile enough to stay productive and creative when enjoying Gelato during the day.\n\nClick here for a full list of dispensaries and recreational shops carrying Gelato\n \n 5. White Buffalo\n\nWhite Buffalo is an 80/20 sativa-dominant cannabis strain that descends from a Romulan and a Blackberry Kush/Bay 11 hybrid. Like the sacred animal of Native American tradition, this White Buffalo is a cherished rarity that may only seldom migrate to your stash jar. Sweetly sour in flavor and covered in a snowy coat of crystal trichomes, White Buffalo provides a powerful blast of euphoria that may surprise any consumer expecting an active and uplifting sativa experience.\n\nClick here for a full list of dispensaries and recreational shops carrying White Buffalo\n \n 6. Lemon Alien Dawg\n\nLemon Alien Dawg comes from Alien Genetics, who crossbred an Alien Dawg female with Lemon Kush to create this pungent hybrid cannabis strain. Large chunky buds radiate with sweet and sour fruity notes dominated by the zesty scent of lemon. Leaning slightly to the indica side of the genetic spectrum, Lemon Alien Dawg lets your body sink into deep relaxation while the mind floats away to happy escapes.\n\nClick here for a full list of dispensaries and recreational shops carrying Lemon Alien Dawg\n \n 7. Lemon Marmalade\n\nLemon Marmalade is potent hybrid from Washington State, bred by Platinum Extracts. The strain was developed by crossing Deadhead OG with Cookie Dough, a select phenotype of GSC (f.k.a Girl Scout Cookies). Caked with trichomes and radiating citrus and diesel fumes, Lemon Marmalade creates a complex flavor mix of lemon and piney Kush with subtle fruit undertones. Lemon Marmalade took home the prize for Best BHO – THC at the 2015 DOPE Cup in Seattle and rumor has it the flower has tested upwards of 30% THC. The effects from Lemon Marmalade come on quick with a euphoric burst of heady energy that quickly levels off into a more relaxing full-bodied experience.\n\n ","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/08/12002031/new-strains-alert-citrix-cannasutra-gelato-lemon-alien-dawg-and-m.jpg","urlslug":"/news/strains-products/new-strains-alert-citrix-cannasutra-gelato-lemon-alien-dawg-and-m"}],"reviewCount":672,"flavors":[{"name":"Sweet","score":35.963619392200208},{"name":"Citrus","score":21.854919335062675},{"name":"Earthy","score":18.923541578054802},{"name":"Pungent","score":11.717211177051521},{"name":"Flowery","score":10.939383097146592}],"effects":[{"name":"Happy","score":75.935935981618627},{"name":"Euphoric","score":72.587481585466264},{"name":"Relaxed","score":72.00153279506},{"name":"Uplifted","score":55.225477256643693},{"name":"Creative","score":45.855170642867272}],"symptoms":[{"name":"Depression","score":42.343049757119829},{"name":"Stress","score":40.547239478082972},{"name":"Pain","score":28.667937809533022},{"name":"Lack of Appetite","score":19.345924280289132},{"name":"Insomnia","score":19.272326994656819}],"conditions":[{"name":"Anxiety","score":32.991305236755686},{"name":"PTSD","score":12.000474016415936},{"name":"ADD/ADHD","score":10.53929255331772},{"name":"PMS","score":9.7443566794024346},{"name":"Migraines","score":8.3240507653935172}],"negatives":[{"name":"Dry Mouth","score":34.421261857255949},{"name":"Dry Eyes","score":19.87462600469879},{"name":"Paranoid","score":7.8853178435234685},{"name":"Dizzy","score":7.7038863869665564},{"name":"Anxious","score":6.5222589955111436}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gelato_100x100_e0bc.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005566/b/gelato__primary_97f7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gelato_100x100_3f61.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1004839/b/gelato__primary_3a48.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gelato_100x100_5b75.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003214/b/gelato__primary_a9c1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gelato_100x100_2dd6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003059/b/gelato__primary_ba01.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gelato_100x100_1d13.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003043/b/gelato__primary_f05d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gelato_100x100_3eb5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002330/b/gelato__primary_0dc7.jpg"}],"photoTotalCount":134,"popularCities":["Los Angeles, CA","Portland, OR","Seattle, WA","Phoenix, AZ","San Francisco, CA","Detroit, MI","San Diego, CA","Eugene, OR","Las Vegas, NV","Chicago, IL"],"permalink":"https://mobileapi.leafly.com/hybrid/gelato","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.73809523809524/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Sunset Sherbet","subtitle":null,"slug":"sunset-sherbert","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/sunset-sherbert","symbol":"Sun","applink":"leafly://strain/sunset-sherbert"},{"name":"Thin Mint GSC","subtitle":null,"slug":"thin-mint","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/thin-mint","symbol":"Tm","applink":"leafly://strain/thin-mint"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
