{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1428080400000)/",
            "id": "contentitems-3303",
            "text": "It's Friday and you know what that means: new strains! Oh yeah. Here are just 10 of the many new varieties added to the Leafly database this week. If any of them look familiar to you, leave a review sharing your thoughts! Also, be sure to check out more details on where to find these strains near you by navigating to their strain pages. Happy strain hunting!\n \n   1. Pineapple Purple Skunk\n\nBred by MTG Seeds, Pineapple Purple Skunk is a hybrid cannabis strain that combines Pineapple and Purple Skunk genetics. Together, these parent strains pass on a sweet and sour blend of fruity and berry flavors. Pineapple Purple Skunk blooms in vibrant hues of purple and green and shows resilience against mold.\n\n \n   2. Green Lantern\n\nGreen Lantern is a mostly sativa strain whose undocumented history poses frustrations for genetic enthusiasts. While some rumors mark the 1960s as Green Lantern’s beginning, others tell us that Green Lantern is a newer strain that resulted from crossing Green Crack and White Rhino. Whatever its parentage may be, Green Lantern inherits mellow euphoric effects and a peppery pine aroma comparable to that of Jack Herer. Its aroma suggests the presence of caryophyllene and pinene, which are terpenes that fight inflammation and promote focus.\n\n \n   3. Afghan Sour Kush\n\nAfghan Sour Kush is an indica-dominant cross between Afghani and Sour Kush. Its heavy, relaxing effects are ushered in by a sweet berry aroma and a sharp spicy flavor typical of Kush varieties. Stout and sturdy, Afghan Sour Kush plants have tight internodal spacing and finish flowering in about 60 days.\n\n \n   4. Medibud\n\nMedibud (or Medi Bud) is an uplifting hybrid strain of unknown genetic origins, but many attribute its upbeat, active effects to sativa parentage. Others claim Medibud is a 60/40 indica-dominant cross, so it’s possible that this strain expresses itself in various phenotypes. Typically, you can expect high-energy euphoria and heightened sensory awareness from Medibud, but its indica-leaning phenotypes may induce heavier, more relaxing effects.\n\n \n   5. Black Cherry OG\n\nBlack Cherry OG is an indica strain bred by Grand Daddy Purple that combines Ken’s OG with an unknown Granddaddy Purple hybrid. Dense buds take on an intense purple hue at the end of Black Cherry OG’s maturation and develop a sweet aroma like fruity tea. Relaxing full-body effects take over, ridding you of pain and insomnia while lifting the mood.\n\n \n   6. Cosmic Collision\n\nCosmic Collision is a sativa-dominant strain from MTG Seeds, who crossed Cosmic Charlie and Piña Collision into a fusion that boasts both flavor and potency. The exhale releases a tropical medley of pineapple and kiwi that hints at the Pineapple in this strain’s lineage. Uplifting and euphoric, Cosmic Collision offers a brighter outlook for those suffering from stress and depression.\n\n \n   7. Heaven Scent\n\nHeaven Scent is a hybrid cannabis strain that crosses genetics from God’s Gift and Green Crack. The polar opposite effects of its indica and sativa parents meet halfway, delivering you to a balanced state of blissful, relaxed happiness. Its buds express themselves in hues that range from deep blue to dark purple.\n\n \n   8. Godfather Purple Kush\n\nGodfather Purple Kush is an indica-dominant cross between Godfather, Purple Kush, and Afghani. This trifecta of indica genetics come together to produce heavy effects that ease your mind and body into full relaxation. Its dark purple buds give off an earthy, spicy aroma accented by sweet notes of berry.\n\n \n   9. Sour Strawberry Diesel\n\nSour Strawberry Diesel is a hybrid cross between Sour Strawberry and Turbo Diesel. With a sweet and spicy aroma, Sour Strawberry Diesel delivers a warm, uplifting buzz that melts away stress and bad moods. Its flowers grow into chunky buds with red and purple hues following its 8 to 9 week flowering cycle.\n\n \n   10. Cherry Diesel\n\nCherry Diesel combines Cherry OG and Turbo Diesel into one sweet-smelling, uplifting hybrid strain. Its plants bloom with dense, sticky buds that give off a fragrant cherry aroma after its 8 to 9 week flowering cycle.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12002141/new-strains-alert-green-lantern-black-cherry-og-cosmic-collision.png",
            "title": "New Strains Alert: Green Lantern, Black Cherry OG, Cosmic Collision, Medibud, and More",
            "urlslug": "/news/strains-products/new-strains-alert-green-lantern-black-cherry-og-cosmic-collision"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [],
    "description": "<p>Heaven Scent is a <a href=\"http://www.leafly.com/explore/category-hybrid\">hybrid</a> cannabis strain bred by MTG Seeds that crosses genetics from <a href=\"http://www.leafly.com/indica/gods-gift\">God&rsquo;s Gift</a> and <a href=\"http://www.leafly.com/sativa/green-crack\">Green Crack</a>. The polar opposite effects of its <a href=\"http://www.leafly.com/explore/category-indica\">indica</a> and <a href=\"http://www.leafly.com/explore/category-sativa\">sativa</a> parents meet halfway, delivering you to a balanced state of blissful, <a href=\"http://www.leafly.com/explore/tags-relaxed\">relaxed</a> <a href=\"http://www.leafly.com/explore/tags-happy\">happiness</a>. Its buds express themselves in hues that range from deep blue to dark purple.</p>\n",
    "descriptionPlain": "Heaven Scent is a hybrid cannabis strain bred by MTG Seeds that crosses genetics from God&rsquo;s Gift and Green Crack. The polar opposite effects of its indica and sativa parents meet halfway, delivering you to a balanced state of blissful, relaxed happiness. Its buds express themselves in hues that range from deep blue to dark purple.\n",
    "effects": [
        {
            "name": "Creative",
            "score": 5
        },
        {
            "name": "Energetic",
            "score": 5
        },
        {
            "name": "Euphoric",
            "score": 5
        },
        {
            "name": "Focused",
            "score": 5
        },
        {
            "name": "Happy",
            "score": 5
        }
    ],
    "flavors": [
        {
            "name": "Mint",
            "score": 5
        },
        {
            "name": "Sweet",
            "score": 5
        },
        {
            "name": "Tropical",
            "score": 5
        },
        {
            "name": "Flowery",
            "score": 5
        },
        {
            "name": "Pungent",
            "score": 5
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": null,
        "environment": null,
        "floweringDays": 60,
        "growNotes": "",
        "height": "Medium",
        "outdoorFinish": "Mid October",
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png",
            "id": 1359326,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Did some more research on this strain, and after going to the breeder's site, I seen that Leafly has the lineage wrong. This is copied and pasted: \"MTG seeds is a medical cannabis genetics company that has been working with some of the biggest medical marijuana farms and dispensaries in California since 1996. We create our seeds in an eco-friendly environment using only natural and organically derived materials. We started with the finest California strains, and then traveled the world to gather classic land race and exotic genetics. Heaven Scent = (Gods Gift) x (Turbo Diesel) Hybrid - Indica Dominant // Yield - Heavy // Flowering Time: 9 - 9 1/2 weeks // Medical Benefits: Pain Relief, Insomnia // This beefed up version of Gods Gift generates large amounts of bud sites and beautiful dark-purple bud flowers that finish at around 9-9 1/2 weeks. This heavy producer can develop into a large plant, and possesses an amazing Grape-Diesel terpene profile.\"\n\nHope this helps someone else.",
            "username": "spk2629"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1385317,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "felt like Jesus took a fart on my face, so magical. definitely recommend for any situation; social, work, and environment. one of the top strands out there.",
            "username": "edbtz"
        }
    ],
    "id": 148819,
    "name": "Heaven Scent",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 5
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/gods-gift",
            "category": "Indica",
            "name": "God's Gift",
            "permalink": "https://mobileapi.leafly.com/indica/gods-gift",
            "slug": "gods-gift",
            "subtitle": null,
            "symbol": "God"
        },
        {
            "applink": "leafly://strain/green-crack",
            "category": "Sativa",
            "name": "Green Crack",
            "permalink": "https://mobileapi.leafly.com/sativa/green-crack",
            "slug": "green-crack",
            "subtitle": null,
            "symbol": "Gc"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/heaven-scent",
    "photoTotalCount": 2,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/334928/b/heaven-scent__primary_c09b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/heaven-scent_100x100_4e7e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/334864/b/heaven-scent__primary_78f3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/heaven-scent_100x100_f6ed.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Vernon, BC"
    ],
    "rating": 4.75,
    "relatedStrains": [],
    "reviewCount": 4,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "heaven-scent",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.75/240",
    "subtitle": null,
    "symbol": "Hvs",
    "symptoms": [],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
