{
    "aka": "Psc",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1437763020000)/",
            "id": "contentitems-3357",
            "text": "More strains were just added to the Leafly strain database, and based on the number of requests we've gotten for these, we know at least some of you have given them a try. Go leave a strain review if you've run into any of these in your strain hunting!\nDid one of these catch your eye? Check if it's carried at a nearby shop or dispensary by navigating to the strain page and clicking the \"Availability\" tab.\n 1. Pearl Scout Cookies\n\nPearl Scout Cookies, a GSC (f.k.a Girl Scout Cookies) hybrid, is a cannabis strain developed by Fireline for recreational shops in Washington State. With a THC content that tends to push past 23%, Pearl Scout Cookies is best suited for consumers with a high tolerance. Its dense, chunky buds take on a zesty citrus aroma that brings to mind fresh lemons and oranges. Uplifting euphoria floods the mind and provides a boost of cerebral energy to fuel creativity and happiness.\n\n \n 2. Sweet and Sour Widow\n\nBred by CBD Crew, Sweet and Sour Widow is a 70/30 indica-dominant cannabis strain with a 1:1 CBD-THC ratio and a subtle sweet onion aroma. Because of its balanced cannabinoid profile, Sweet and Sour Widow’s psychoactive effects are mild, making this strain suitable for novice consumers and patients needing to medicate without a foggy head. Sweet and Sour Widow is derived from White Widow genetics and an unnamed sativa-hybrid to accentuate its CBD profile.\n\n \n 3. NightFire OG\n\nNightFire OG by Sin City Seeds is a sativa-dominant hybrid that descends from parent strains White Fire OG and White Nightmare. With strong roots in the White family, you can depend on this cannabis strain to deliver a disorienting dose of euphoria that lets you forget life’s stressors as relaxation takes over mind and body. Earthy pine, sharp lemon, and sweet berry aromas radiate from NightFire OG’s crystal-coated buds, inviting you to indulge in this hard-hitting hybrid.\n\n \n 4. Jenny Kush\n\nJenny Kush is a hybrid cannabis strain named in memory of Jenny Monson, a cannabis activist who passed away in 2013. The strain was originally bred by Rare Dankness Seeds with all proceeds going toward the Jenny Kush Foundation, a charity established to help support her children. This hybrid introduces herself with a sweet earthy aroma cut with the sharp zesty sweetness of citrus and lemon. Amnesia Haze and Rare Dankness #2 are believed to have parented Jenny Kush, giving this strain a balance of sativa and indica effects. Providing soothing relaxation with an uplifting burst, Jenny Kush is suitable for use any time of the day.\n\n \n 5. Dance World\n\nDance World is a high-CBD sativa strain bred by Royal Queen Seeds in Spain. A cross between Dancehall and Juanita La Lagrimosa, Dance World’s heritage stems primarily from Afghani and Mexican genetics. From its Dancehall parent, Dance World inherits active, uplifting effects that motivate productivity and a positive mindset. Earthy and spicy flavors dominate the palate, but subtle fruity notes bring Dance World sweet undertones. While Dance World shows its sativa genetics in its energetic effects, Dance World plants are more indica in stature and flower after just 8 weeks.\n\n \n 6. Chemdawg Sour Diesel\n\nChemdawg Sour Diesel (or Chem Sour) from Reservoir Seeds is a sativa-dominant hybrid cannabis strain that combines champion genetics from Chemdawg D and Sour Diesel. With a sharp sour bite, Chemdawg Sour Diesel has a funky fuel and earthy pine aroma that stuns the senses. Its buzzing euphoria leaves you feeling elevated and uplifted, but anxiety-prone individuals should tread carefully with this high-flying sativa.\n\n \n 7. Ken's Kush\n\nKen’s Kush is a potent hybrid cannabis strain bred by Ken Estes that crosses his famous Granddaddy Purple with the equally esteemed OG Kush and Sour Diesel. Together these parents pass on a flavor profile of sweet berries, sour skunk, and grassy earth. Dreamy relaxation pours over the mind and body, helping you feel serene without the sedation typically associated with heavy indica varieties.\n\nClick on the image to check out other new strains recently added to the Leafly Explorer!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/07/12002258/new-strains-alert-pearl-scout-cookies-jenny-kush-nightfire-og-ken.jpg",
            "title": "New Strains Alert: Pearl Scout Cookies, Jenny Kush, NightFire OG, Ken's Kush and More",
            "urlslug": "/news/strains-products/new-strains-alert-pearl-scout-cookies-jenny-kush-nightfire-og-ken"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 20.921985815602834
        },
        {
            "name": "ADD/ADHD",
            "score": 18.262411347517727
        },
        {
            "name": "PTSD",
            "score": 18.262411347517727
        },
        {
            "name": "Arthritis",
            "score": 9.397163120567374
        },
        {
            "name": "PMS",
            "score": 9.397163120567374
        }
    ],
    "description": "<p>Pearl Scout Cookies, a <a href=\"https://www.leafly.com/hybrid/girl-scout-cookie\">Girl Scout Cookies</a> hybrid, is a cannabis strain developed by Fireline for recreational shops in Washington State. With a THC content that tends to push past 23%, Pearl Scout Cookies is best suited for consumers with a high tolerance. Its dense, chunky buds take on a zesty citrus aroma that brings to mind fresh lemons and oranges. Uplifting euphoria floods the mind and provides a boost of cerebral energy to fuel creativity and happiness.</p>\n",
    "descriptionPlain": "Pearl Scout Cookies, a Girl Scout Cookies hybrid, is a cannabis strain developed by Fireline for recreational shops in Washington State. With a THC content that tends to push past 23%, Pearl Scout Cookies is best suited for consumers with a high tolerance. Its dense, chunky buds take on a zesty citrus aroma that brings to mind fresh lemons and oranges. Uplifting euphoria floods the mind and provides a boost of cerebral energy to fuel creativity and happiness.\n",
    "effects": [
        {
            "name": "Energetic",
            "score": 50.177304964539
        },
        {
            "name": "Creative",
            "score": 49.64539007092198
        },
        {
            "name": "Talkative",
            "score": 47.51773049645389
        },
        {
            "name": "Happy",
            "score": 38.829787234042556
        },
        {
            "name": "Giggly",
            "score": 38.12056737588652
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 19.858156028368793
        },
        {
            "name": "Citrus",
            "score": 19.326241134751772
        },
        {
            "name": "Lemon",
            "score": 17.730496453900706
        },
        {
            "name": "Woody",
            "score": 9.929078014184396
        },
        {
            "name": "Violet",
            "score": 8.333333333333332
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1394612,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "So I got stuck in traffic today, I haven't had sex since Bush -- the Senior Bush -- was in the White House, and all the music I thought was cool is now called \"Dad Rock\" by \n\nsmirking Millennials who never experienced the joy of ELO's \"Time\" with a pair of Sennhesier HD 800 headphones and a brain fulla Chocolate Thai. Well, fuck them! You know \n\nwhy? Because I'm blitzed to the tits on Pearl Scout Cookies right now and they aren't. That's right -- they're relishing in Autotuned garbage while I have the dulcet tones \n\nof Jeff Lynn buying me a ticket to the moon. And by the time I'm not high off this bud anymore, I could have WALKED to the moon! This isn't a hi-and-bye high, this is a \n\n\"Oh, were you just about to watch The Wall, Heavy Metal, Wizards -AND- Fritz the Cat? Don't mind if I join you!\" high. Three hits off this shit and the buzz is filing a \n\nchange of address card and putting your cortex down as its new permanent residence. But unlike your last roommate who took a dump in the catbox and then ham-slammed your \n\ncouch, this new resident is a mellow sort. No drama, no Stinky Hermans in the catbox, no waking up and finding Dickbutt drawn on your face with a Sharpie -- nope, none of \n\nthat shit. This is a strain with manners: it Fabreezes the bathroom after dropping a Taco Bell deuce, addresses your Mom as Mrs and never once says 'Oi! Wouldja lookit them \n\ntits!' within hearing range when you bring your girlfriend over. It will, however, fart on your cat if given half a chance, so, y'know, keep Mittens at a distance. Damn, am \n\nI still stoned? Ohyeah I am! So next time you need to be stoned for the length of a Yes song, remember Pearl Scout Cookies: The Dickbutt-Free Strain!",
            "username": "StukaFox"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1611154,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/2/240",
            "text": "I think in small doses this could be a really nice functional high.I  could see this defiantly being a social thing. I was motivated to do things but unable to actually concentrate. I  smoked wayyy too much and actually got really bad anxiety. Hits super smooth though, none of that sore throat ish that comes with harsher strains. My BF was on a creative rampage and was being optimistic until I started having anxiety lol We both agreed its not very anxiety friendly. Bummer!",
            "username": "cwmb711"
        }
    ],
    "id": 172687,
    "name": "Pearl Scout Cookies",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 60.46099290780141
        },
        {
            "name": "Paranoid",
            "score": 33.33333333333333
        },
        {
            "name": "Anxious",
            "score": 33.33333333333333
        },
        {
            "name": "Dry Eyes",
            "score": 10.460992907801417
        },
        {
            "name": "Dizzy",
            "score": 0.5319148936170213
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/girl-scout-cookie",
            "category": "Hybrid",
            "name": "Girl Scout Cookies",
            "permalink": "https://mobileapi.leafly.com/hybrid/girl-scout-cookie",
            "slug": "girl-scout-cookie",
            "subtitle": null,
            "symbol": "Gsc"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/pearl-scout-cookies",
    "photoTotalCount": 9,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/527084/b/pearl-scout-cookies__primary_a7a1.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pearl-scout-cookies_100x100_6107.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502648/b/pearl-scout-cookies__primary_a410.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pearl-scout-cookies_100x100_e7f6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/464198/b/pearl-scout-cookies__primary_4b95.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pearl-scout-cookies_100x100_0523.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/464638/b/pearl-scout-cookies__primary_281c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pearl-scout-cookies_100x100_e808.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/459081/b/pearl-scout-cookies__primary_55a2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pearl-scout-cookies_100x100_f630.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/455469/b/pearl-scout-cookies__primary_e1b2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pearl-scout-cookies_100x100_e66f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Bothell, WA",
        "Buckley, WA",
        "Everett, WA",
        "Vancouver, BC",
        "Vancouver, WA",
        "Arlington, WA",
        "Auburn, WA",
        "Bellevue, WA",
        "Bremerton, WA"
    ],
    "rating": 4.62,
    "relatedStrains": [],
    "reviewCount": 47,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "pearl-scout-cookies",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.61702127659574/240",
    "subtitle": null,
    "symbol": "Psc",
    "symptoms": [
        {
            "name": "Depression",
            "score": 37.588652482269495
        },
        {
            "name": "Stress",
            "score": 27.659574468085108
        },
        {
            "name": "Pain",
            "score": 18.262411347517727
        },
        {
            "name": "Insomnia",
            "score": 17.198581560283685
        },
        {
            "name": "Inflammation",
            "score": 9.397163120567374
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
