{"sl_translate":"description,descriptionPlain,category","id":8285,"slug":"cannatonic","name":"Cannatonic","subtitle":null,"symbol":"Ct","category":"Hybrid","description":"\u003cp\u003eCannatonic is a unique hybrid strain bred by Spanish seed bank Resin Seeds specifically for its low THC content (rarely above 6%) and high \u003ca href=\"https://www.leafly.com/news/cannabis-101/whats-the-deal-with-these-high-cbd-strains\"\u003eCBD\u003c/a\u003e content (6-17%). \u0026nbsp;A cross between a female \u003ca href=\"https://www.leafly.com/indica/mk-ultra\"\u003eMK Ultra\u003c/a\u003e and a famous \u003ca href=\"https://www.leafly.com/hybrid/g13-haze\"\u003eG13 Haze\u003c/a\u003e male, it produces a relatively short-lived, mellow high that is also uplifting and powerfully relaxing, thanks to the high CBD content. \u0026nbsp;As one of the premier medical strains, Cannatonic is often used to treat pain, muscle spasms, anxiety, migraines, and a wide variety of other physiological and psychological symptoms. \u0026nbsp;Most phenotypes present with a slight earthy odor and a mild, sweet, vaguely citrusy flavor.\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Cannatonic is a unique hybrid strain bred by Spanish seed bank Resin Seeds specifically for its low THC content (rarely above 6%) and high CBD content (6-17%). \u0026nbsp;A cross between a female MK Ultra and a famous G13 Haze male, it produces a relatively short-lived, mellow high that is also uplifting and powerfully relaxing, thanks to the high CBD content. \u0026nbsp;As one of the premier medical strains, Cannatonic is often used to treat pain, muscle spasms, anxiety, migraines, and a wide variety of other physiological and psychological symptoms. \u0026nbsp;Most phenotypes present with a slight earthy odor and a mild, sweet, vaguely citrusy flavor.\n\n\u0026nbsp;\n","aka":null,"rating":4.34,"highlightedReviews":[{"id":1417966,"username":"Krshna","text":"Cannatonic is a very unique strain, from my experience. I usually smoke THC dominant bud, whether it be a heavy Indica or a daytime Sativa. This is true medicinal marijuana, though. Cannatonic has very little psychoactive effect. For some, that is a negative, but for some it is a major and strain defining positive.\r\n\r\nThis certainly isn\u0027t recreational weed. It isn\u0027t going to get you stoned or high. This is just pure good stuff with true medicinal effects. About 5-10 minutes after smoking, the effect starts to set in. A very nice, broad body buzz, all pain melts away, physical, emotional, and mental. This strain has all the medicinal benefits of marijuana, without the psychological effects.\r\n\r\nPersonally, I quite enjoy the psychological high from THC, but for those of you out there truly looking for marijuana purely from a medicinal standpoint, for those of you who need relief but don\u0027t want to get high or be cloudy, this it it. \r\n\r\nThe strain is very high in CBD, and low in THC. It\u0027s very good stuff, it can be up to 60 for 1/8, but you can find deals on it too. Very worth it.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png"},{"id":1641577,"username":"MechanizedMedic","text":"I smoke a little weed very often to get CBD then I toke other stuff to get blazed, so I usually have a hard time determining the more subtle points of a low THC strain. Recently, I was without cannabis for a month due to business travel. I realised two things: a) CBD helps a lot with my muscle/nerve pain in my back. b) Cannatonic is a really good weed for low back pain.\n\nThe best part is that it doesn\u0027t taste completely awful like many of the other high CBD strains. All the different grows of Cannatonic that I\u0027ve tried have a kinda bland earthy taste with maybe a little tar or tabacco-ish flavor in there. The smell is kind of similar - earthy, skunky, a little citrus(?) - but not a \"nice\" smelling bud compared to most recreational strains.\n\nI really appreciate that Cannatonic only gets me a little high, even on my first toke in weeks, the sensation is subtle, comfortable. I feel a little fuzzy but not tired or lethargic. My back pain and spasms are calmed considerably. A great feeling to get me into some Yoga poses and loosen up my aching joints... Happy toking, my dudes!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59696","title":"6 International Cannabis Strains Worth Seeking Abroad","author":"David Bienenstock","category":null,"date":"\/Date(1520360124000)\/","text":"Updated 3/9/18\n“Travel is like cannabis; it broadens your perspectives…personally, culturally, and politically,” according to bestselling guidebook author and acclaimed PBS host Rick Steves. “Suddenly, the palette with which we paint the story of our lives has more colors.”\nFor a cannabis enthusiast, this idea of expanding our palettes rings especially true, because even in our current heady era of rapidly advancing legalization, many of the world’s finest and most exotic cannabis strains can only be found in their regions of origin. So if we think of each varietal of the plant as its own unique hue, then we must travel widely to truly experience the species in all its technicolored glory.\n\nMuch as your local liquor store carries wine and beer from around the world, we should be able to sample the finest cannabis available anywhere without leaving home. Another way to look at this is as an opportunity to get out and do some exploring.\nAs a longtime cannabis journalist, I’ve had the good fortune to travel widely in parts of the world where the love of this plant flourishes, and I can report back that each place comes complete with a particular cannabis strain that’s a point of local pride. Some among the finest I’ve ever sampled.\nSo what are we waiting for?\n\nCannatonic\nOrigin: Barcelona, Spain\nMuch like the coffeeshops in the Netherlands, the cannabis social clubs that have cropped up in Barcelona and elsewhere in Spain over the last decade aren’t really legal, they’re just tolerated—for the most part. Clubs have been busted by the authorities in the past, and the Spanish legal system is still grappling with how to enforce (or not) a set of cannabis laws that allow for “personal” consumption in a “private” setting, without ever defining those terms.\n\nThe city itself, of course, is one of the world’s ideal places to be stoned. Tapas is the ultimate stoner cuisine, and Gaudi is the best architect ever when you’re high. The most popular local strain when I was there some years ago was Jack Herer, an Dutch-bred varietal that most assuredly flourishes beneath a Spanish sun. But to experience a truly homegrown phenomenon, take the time to track down Cannatonic, a high-CBD strain bred by Spanish seed bank Resin Seeds.\nWith THC rarely above 7% and CBD potentially above 15%, it’s a cross of MK Ultra and G13 Haze with a “slight earthy odor and a mild, sweet, vaguely citrusy flavor.” While not providing much of a high due to its elevated CBD profile, the strain offers profound therapeutic relief for pain, inflammation, and anxiety. It’s the perfect way to unwind after a long hot day wandering La Rambla.\n\nDr. Grinspoon\nOrigin: Amsterdam, Netherlands\nAs a travel destination, Amsterdam offers up many charms, from the picturesque canals and lively nightlife to the parks and museums and a place called Febo, where you can buy deep fried cheese out of a coin-operated automat in the middle of the night. The city’s also been a refuge for cannabis consumers and cannabis itself for decades.\nNot only have Amsterdam’s famed coffeeshops attracted visitors from around the world since they opened in the 1970s, they’ve also served as a safe haven for cannabis strains from every continent to escape prohibition.\nIf you’re fortunate enough to make a visit, definitely sample some Neville’s Haze or any of its Haze cousins, and don’t miss out on the wide array of imported, traditionally made hashishes available from Morocco, Nepal, Afghanistan, and other distant lands. But if I had to recommend just one smoke in town, I’d say make an appointment with Dr. Grinspoon, a pure sativa heirloom strain bred by Barney’s Farm, a cannabis seed bank associated with one of Amsterdam’s top coffeeshops.\n\nLike all purebred sativas, the strain (named for medical cannabis advocate Dr. Lester Grinspoon) takes a long time to harvest and doesn’t yield very well—but who cares? You’re not growing it, you’re smoking it. And the soaring, cerebral, invigorating high will set you off on an adventure to remember (or forget) in one of the world’s most beautiful cities.\n\nLamb’s Bread\nOrigin: Jamaica\nJamaica has long been associated with ganja, a local word for cannabis that derives from an ancient Sanskrit word that reached the Caribbean in the mid 1800s, brought along by indentured servants freshly arrived from India. In time ganja spread to native born Jamaicans. In particular, the Indians’ use of cannabis as a spiritual sacrament would be adopted by Jamaica’s Rastafarian community.\nAdd in the global impact of reggae music, and the indelible idea of Jamaica as a cannabis paradise took root in the public’s imagination. Even though, until recently, cannabis remained highly illegal and the laws against it seriously enforced.\n\nHappily, however, that all began to change in 2015, when a new law decriminalized up to two ounces of cannabis and made personal grows legal.\nSo how best to celebrate if you happen to be lucky enough to make a pilgrimage? Well, nothing could be more appropriate than rolling up a joint of Lamb’s Bread—the definitive Jamaican cannabis strain, and purportedly Bob Marley’s favorite throughout his life. A bright, green, sticky heirloom sativa, it’s an uplifting, inspiring, energizing high that pairs nicely with a cup of local Blue Mountain coffee if you really want to get your day started right.\nMalawi Gold\nOrigin: Malawi\nRevered as a food, fiber, and medicine, cannabis flourished throughout Malawi until 1964, when the newly independent republic joined the United Nations and adopted the UN’s Single Convention on Narcotic Drugs.\n\nFifty years of mandated federal enforcement later, what the locals call chumba, and the world calls Malawi Gold, remains a vital cash crop throughout the impoverished African nation, but growers now plant their seeds in remote mountain clearings, hoping to elude the authorities. According to a 2011 report from the World Bank, Malawian farmers harvest around 150,000 pounds of remarkably potent cannabis in this manner every year, the vast majority bound for Europe. The plant remains illicit to this day, but there’s a strong movement in Malawi to legalize both cannabis and hemp.\nFamous throughout Africa for its potency, Malawi Gold is a pure sativa strain that’s slow to mature, with a flowering time of up to 120 days before it’s ready to harvest. But it’s worth the wait to smoke the long, resin-coated buds that have made the strain famous far beyond Malawi’s borders.\n\n\nCheese\nOrigin: United Kingdom\nBritain’s cannabis scene isn’t well known for producing high quality cannabis or award-winning strains, with one notable exception. An indica-dominant hybrid named for its sharply sour aroma, Cheese has been the herbal pride of the United Kingdom since the late 1980s. Local legend has it the original Cheese (sometimes called Original Cheese) descended from a Skunk #1 phenotype that was selected for future breeding based on its incredibly pungent aroma.\n\nThe most popular modern version comes from Big Buddha Seeds, and features the same pungent funky aroma plus the addition of Afghani indica genetics to increase trichome production and yield. Big Buddha’s version put Cheese on the global map when it took home top honors in the Sativa category at the 2006 Cannabis Cup and has been spreading out geographically ever since.\nBut it’s still best enjoyed at home, in Merry Old England, paired with a cup of Earl Grey and some tasty crumpets.\nIsland Sweet Skunk\nOrigin: Vancouver Island\nBritish Columbia—Canada’s westernmost province—stretches from the ocean to the Rocky Mountains. The region became a hotbed for cannabis cultivation starting back in the 1960s, when the ranks of the area’s homegrown farmers were swelled by the arrival of draft resisters from the US who began fleeing to Canada to avoid service in the Vietnam War. With Vancouver eventually earning the nickname Vansterdam for its tolerance of cannabis coffeeshops, and the entire province boasting vast stretches of remote land in which to grow cannabis, a culture of tolerance and acceptance took hold in BC even in the darkest days of Canada’s cannabis prohibition.\nAnd now that it’s set to be legalized nationwide this summer (with the recreational market functional by late summer/early fall), British Columbia will remain the ultimate Canadian cannabis travel destination, a place of natural beauty and vibrant culture. Island Sweet Skunk was originally bred on Vancouver Island, a 290-mile long, largely undeveloped stretch of coastlines and mountains just off the Pacific coast. A sativa with an electric buzz and a flavor profile that mixes classic skunky notes with ripe grapefruit undertones, the strain is a descendant of Skunk #1 and grows tall, straight, high-yielding plants.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/05153822/6-international-strains-abroad.jpg","urlslug":"/news/strains-products/6-international-cannabis-strains-worth-seeking-abroad"},{"id":"contentitems-36420","title":"Tips for Growing Cannatonic Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1501793677000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Bred by Resin Seeds in Spain, Cannatonic is a high-CBD strain with relatively low THC levels. With a fruity, earthy aroma and taste, Cannatonic delivers mellow, relaxing effects that are only slightly euphoric due to the low levels of THC. Cannatonic is a popular strain among medical patients, as CBD is known to relieve pain, inflammation, anxiety, and a number of other ailments.\nGrow Techniques: Cannatonic is great for indoor spaces but needs room to breathe, so keeping plants well-spaced is crucial. Prune during the vegetative stage to promote airflow between plants while training colas to be evenly spaced from each other. The plant does well in a hydroponic setup where it can get the nutrients it needs to produce high CBD levels.\nFlowering Time: 9-10 weeks\nYield: Moderate to high\nGrow Difficulty: Moderate\nClimate: Monitor humidity late into flowering to protect the plants from mold. Bring humidity levels down to 40 percent during the last few weeks, and try to keep the temperature between 72 and 82 degrees Fahrenheit.\nIndoor/Outdoor: Cannatonic does best indoors where the climate can be closely monitored. This strain is prone to mold issues if high levels of moisture are present.\nFeeding: Start with low feeding levels and slowly increase after the first few weeks of vegging.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/03134914/cannaronic-strain.jpg","urlslug":"/news/growing/how-to-grow-cannatonic-marijuana"}],"reviewCount":710,"flavors":[{"name":"Earthy","score":30.641025641025642},{"name":"Woody","score":22.195512820512821},{"name":"Pine","score":17.421875},{"name":"Citrus","score":13.455528846153847},{"name":"Spicy/Herbal","score":10.084134615384617}],"effects":[{"name":"Relaxed","score":105.65504807692308},{"name":"Happy","score":71.6826923076923},{"name":"Uplifted","score":67.287660256410263},{"name":"Sleepy","score":28.699919871794872},{"name":"Euphoric","score":27.658253205128204}],"symptoms":[{"name":"Stress","score":53.878205128205131},{"name":"Pain","score":50.580929487179489},{"name":"Depression","score":40.354567307692314},{"name":"Inflammation","score":33.85817307692308},{"name":"Insomnia","score":30.398637820512821}],"conditions":[{"name":"Anxiety","score":56.474358974358971},{"name":"PTSD","score":22.161458333333336},{"name":"Migraines","score":19.122596153846157},{"name":"Gastrointestinal Disorder","score":15.600961538461538},{"name":"Fibromyalgia","score":14.110576923076923}],"negatives":[{"name":"Dry Mouth","score":17.724358974358974},{"name":"Dry Eyes","score":10.981570512820513},{"name":"Anxious","score":3.3413461538461537},{"name":"Headache","score":2.6542467948717947},{"name":"Dizzy","score":2.2375801282051282}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/cannatonic/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/cannatonic/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cannatonic_100x100_99b6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/708943/b/cannatonic__primary_2090.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cannatonic_100x100_7767.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/653292/b/cannatonic__primary_bb3c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cannatonic_100x100_911a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/653323/b/cannatonic__primary_8512.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cannatonic_100x100_4ae1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645262/b/cannatonic__primary_7d6a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cannatonic_100x100_7a87.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/619946/b/cannatonic__primary_f401.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cannatonic_100x100_a20d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/584975/b/cannatonic__primary_e5c4.jpg"}],"photoTotalCount":62,"popularCities":["Portland, OR","Los Angeles, CA","Seattle, WA","China","Montréal, QC","Spokane, WA","Vancouver, BC","Calgary, AB","Albany, OR","Edmonton, AB"],"permalink":"https://mobileapi.leafly.com/hybrid/cannatonic","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.34225352112676/240","testGraph":"https://s3.amazonaws.com/leafly/steephill/Strain+Fingerprint+-+Cannatonic-01.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"MK Ultra","subtitle":null,"slug":"mk-ultra","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/mk-ultra","symbol":"Mk","applink":"leafly://strain/mk-ultra"},{"name":"G13 Haze","subtitle":null,"slug":"g13-haze","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/g13-haze","symbol":"13h","applink":"leafly://strain/g13-haze"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":75,"outdoorFinish":"October","height":"Medium","averageYield":"High","environment":null,"growNotes":""}}
