{
    "aka": "XJ13, xj 13",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Lisa Rough",
            "category": null,
            "date": "/Date(1491865568000)/",
            "id": "contentitems-24013",
            "text": "In honor of National Siblings Day, we decided to take a look at some of the most popular strains in cannabis and their offspring. There are quite a few strains that share genetics, but it just might surprise you to find out which strains are siblings.\n  Granddaddy Purple\nGDP is one of the oldest and most well-known strains. Let’s check out the kiddos!\nCandyland\nThis sativa-dominant hybrid is an award-winning strain from GDP and Bay Platinum Cookies. Its sativa side stems from the Platinum Cookies parent, which was created from OG Kush, Durban Poison, and a third unknown strain. Candyland is a rare sativa known for its relaxing relief from muscle aches with the added benefit of uplifting and stimulating effects.\nCherry Pie\nCherry Pie is renowned for its strong effects and high potency. The offspring of two cannabis heavyweights–GDP and Durban Poison–Cherry Pie has a fruity flavor and a high that can last several hours. Although there are claims that this strain tastes like real cherry pie, others compare the flavor to berries, much like the flavor of GDP. This sweet strain will melt away your stress and bring on a strong craving for your favorite munchies!\n\n  Blueberry\nBlueberry’s fruity genetics provide the backdrop for some of the most common and delicious strains available.\nBlue Dream\nThe “Blue” in this sativa-dominant celebrity strain comes from the Blue in Blueberry, while the “Dream” comes from another champion strain, Haze, a dreamy and euphoric sativa. Blue Dream is easily the most popular strain on Leafly, and its mild, uplifting effects make it the perfect strain for novice smokers.\nBerry White\nBerry White may be the offspring of two legendary strains, but this relaxing indica is famous in its own right for its balanced effects and a euphoric escape from stress and anxiety. With parentage from Blueberry and the epic hybrid White Widow, Berry White tends to taste like overripe sour blueberries and offers such mind-bending effects that you may forget you have arms.\n\n  Trainwreck\nA freight train of a hybrid strain, Trainwreck is sure to knock your socks off. What about its offspring?\nCasey Jones\nA little history lesson for you: Casey Jones is the name of a famous train engineer who was killed in a train wreck in 1900. However, for those of you who were raised on Saturday morning 90s cartoons, the name may sound more familiar as the hockey-masked vigilante from Teenage Mutant Ninja Turtles. Either way, this earthy sativa combines Oriental Express (an offshoot of Trainwreck and Thai) with East Coast Sour Diesel to create a power-packed punch that’s great for inspiring creativity.\nPineapple Express\nAh yes, everyone’s favorite movie-turned-famous-strain is known for its fruity sweet undertones. But did you know that it has roots in the speedy hybrid, Trainwreck? Pineapple Express is more than just a famous name, it combines Trainwreck and Hawaiian for a long-lasting energetic buzz and a sweet mango and pineapple citrus flavor that makes for one golden afternoon.\n\n  GSC (f.k.a Girl Scout Cookies)\nGSC (f.k.a Girl Scout Cookies) is the Genghis Khan of genetic stomp-arounds–these days, it seems like there are Cookies genetics in every new strain.\nSunset Sherbet\nSunset Sherbet is the heir apparent to the GSC throne. It’s known to have the heady, cerebral effects of GSC with an intoxicating boost from a heavy indica known as Pink Panties. Sunset Sherbet is so nicknamed due to its sweet, sherbet-like flavor, and tends to lean more heavily towards its indica roots than the standard GSC, so be prepared for a calm, relaxing high.\nMoon Cookies\nThis intergalactic herb crosses GSC (f.k.a Girl Scout Cookies) with another phenotype of itself to create a complex woody, earthy scent with some strong, heavy indica-leaning relaxation. These buds are hard, dense, resinous rocks that taste like cookie dough and will send you soaring up to the stars. But don’t consume too much Moon Cookies or you just might get lost in space.\n\n  Jack Herer\nOne of the most notorious cannabis activists spawned this world-renowned sativa, and Jack Herer‘s litany of offspring continues to expand with no end in sight.\nXJ-13\nWhat sounds like a top-secret government experiment is actually one of the most delightfully uplifting hybrids you can find. XJ-13 combines Jack Herer’s warm, fuzzy sativa genetics with the dreamy high of G13 Haze to create a stimulating and euphoric experience. It’s not heavy enough to make you feel asleep, but not stimulating enough to cause paranoia, giving consumers a perfectly balanced buzz that is high, happy, and carefree.\nDragon’s Breath\nThis sativa-dominant hybrid was born of two heavyweight strains, Jack Herer and Northern Lights. The name Dragon’s Breath is a reference to the spicy flavor and aroma accompanied by this hazy strain, but it won’t burn you out. Instead, you can expect a clear-headed, energetic, productive high. But be forewarned–too much of the Dragon may leave you feeling a bit paranoid.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/04/10154425/national-sibling-day.jpg",
            "title": "10 Strains You Might Not Know Are Siblings",
            "urlslug": "/news/strains-products/10-strains-might-not-know-siblings"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1488305017000)/",
            "id": "contentitems-19710",
            "text": "Some people choose a cannabis strain based on its name. Others by its THC content. Personally, I’m a sucker for aroma and flavor; whether it’s a flower, dabbable wax, or an oil cartridge, bad/bland/harsh flavor is a big turn-off. And with flavors ranging from sweet roses to earthy diesel, who wouldn’t want to explore the vast spectrum of tastes and smells cannabis has to offer?\n\nAlthough flavor has everything to do with how a product is grown, cured, stored, and processed, genetics play a role as well. Over the years, these strains have proven to be top contenders in the flavor game, consistently showing off rich terpene profiles that not only govern a strain’s smell, but enhance the strain’s effects as well.\n\nTangie is a citrus dream crafted by the masterminds at DNA Genetics. There’s no strain I’d sooner rely on for good flavor than this sativa; popping the lid of a jar of Tangie and filling your nose with the smell of fresh orange zest can be somewhat of a religious experience of wonderment. With the sweet smell of citrus and fruit medley, Tangie lets you drift upwards slowly and steadily into euphoria, where bad moods don’t stand a chance.\n\nDominated by gassy, diesel notes you might be surprised to enjoy, GG4 (f.k.a Gorilla Glue #4)’s aroma is balanced by sweet-and-sour skunk and refreshing pine. The smell of well-grown GG4 (f.k.a. Gorilla Glue #4) can completely conquer a room when opened, so if you’re practicing discretion, consider holding off on GG4 until you reach open air.\n\n\nKyle Kushman never would have guessed that the sad-looking clone he held in a paper bag would one day become the famous award-winning Strawberry Cough. But thank goodness he passed this one to his left and shared the strawberry goodness with all of us. This uplifting, creative sativa strain smells like it grew wild in a strawberry patch, radiating with the distinct aroma of ripe berries and rich earthy soil.\n\nSpeaking of strains that smell exactly like fruit, this list would never be complete without the mention of Blueberry. Without Blueberry, there would be no Blue Dream, no Blue Cheese, no Blue Cookies; “Blue” hybrids simply wouldn’t exist. You’ll notice all of these strains carry a blueberry-like smell, but few can match the original Blueberry’s uncanny resemblance to a bushel of overripe blueberries plucked straight from the branch.\n\n\nFlavors of lemon candy, sharp pine, and fresh herbs twist together to create the complex aroma of Dutch Treat. A budtender has never had to twist my arm when upselling Dutch Treat; it’s been hard to find a lackluster example of the flavorful strain after all these years. Beyond the obvious notes of citrus and pine, this strain endlessly offers subtle nuances of sage, mint, and pepper.\n\nBursting with flavors of lemon, lime, and pear, XJ-13 is a strain I can hardly ever turn down. Its aroma has a sour bite that seems to almost fizzle in your nose like a fruity spritzer on a hot summer day.\n\nLavender is a beautifully intricate indica strain that smells like – oh, you guessed it – lavender. Like an all-in-one bouquet, Lavender also offers up sweet accents of wildflower, rose, and violet underneath a layer of woody earthiness.\n\n\nGrapefruit is a fantastic wake-and-bake strain not only because of its awakening, high-energy high, it also tastes like a bowl of ripe red grapefruit sweetened with honey. I don’t often see it on dispensary shelves, but it’s a cherished rarity, especially when enjoyed on warm summer weekend mornings.\n\nRed Headed Stranger is a strain I’ve loved getting to know in both flower and oil form. Upon inhale, the palate is dowsed with sweet flavors that seem citrusy at first, but then you notice some of the quieter flavors of mint and pine giving the strain a fresh, herbaceous finish. Coupled with effects that soothe the body while letting the mind run unencumbered, Red Headed Stranger is a perfect afternoon smoke that can easily replace or enhance your favorite citrusy, hoppy beer.\n\n\nSchrom is somewhat of a local legend here in Seattle, but I simply can’t find it in my heart to neglect mentioning this glorious sativa strain that smells exactly like 7-Up. Herbal notes subtly underscore the pungent, unmistakable flavors of lemon-lime so strong, they monopolize the palate.\nThese are the strains that have been kindest to my nose, but what strains have a smell and/or flavor that make you swoon? Let me know what I’m missing out on in the comments section below!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/02/27165411/orange-cannabis.jpg",
            "title": "Leafly Staff Picks: The Best-Tasting Cannabis Strains",
            "urlslug": "/news/strains-products/best-tasting-and-smelling-marijuana-strains"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 21.360930735930737
        },
        {
            "name": "ADD/ADHD",
            "score": 11.797538880872214
        },
        {
            "name": "Anorexia",
            "score": 8.440556357223022
        },
        {
            "name": "PTSD",
            "score": 6.703944203944204
        },
        {
            "name": "PMS",
            "score": 6.3592271925605255
        }
    ],
    "description": "<p>XJ-13 is a sativa-dominant strain cherished for both its therapeutic potency and enjoyable euphoric buzz. This hybrid cross of <a href=\"http://www.leafly.com/sativa/jack-herer\">Jack Herer</a> and <a href=\"http://www.leafly.com/hybrid/g13-haze\">G13 Haze</a> induces unencumbered cerebral effects perfect for stimulating creativity and conversation. As if we needed another reason to love this lightweight sativa, XJ-13 consistently exhibits a strong citrus aroma accented by notes of earthy pine. Novice consumers looking for an easy, paranoia-free experience can depend on XJ-13 as a surefire way to relieve stress and mood-related symptoms.</p>\n\n<p>&nbsp;</p>\n",
    "descriptionPlain": "XJ-13 is a sativa-dominant strain cherished for both its therapeutic potency and enjoyable euphoric buzz. This hybrid cross of Jack Herer and G13 Haze induces unencumbered cerebral effects perfect for stimulating creativity and conversation. As if we needed another reason to love this lightweight sativa, XJ-13 consistently exhibits a strong citrus aroma accented by notes of earthy pine. Novice consumers looking for an easy, paranoia-free experience can depend on XJ-13 as a surefire way to relieve stress and mood-related symptoms.\n\n&nbsp;\n",
    "effects": [
        {
            "name": "Euphoric",
            "score": 63.77364919031585
        },
        {
            "name": "Happy",
            "score": 57.10377585377585
        },
        {
            "name": "Uplifted",
            "score": 48.6221340388007
        },
        {
            "name": "Relaxed",
            "score": 43.9824835658169
        },
        {
            "name": "Creative",
            "score": 42.696308321308315
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 35.05090588423922
        },
        {
            "name": "Pine",
            "score": 31.974506974506973
        },
        {
            "name": "Sweet",
            "score": 18.386744428411095
        },
        {
            "name": "Earthy",
            "score": 14.593354176687509
        },
        {
            "name": "Lemon",
            "score": 10.761884720218053
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": "Moderate",
        "environment": null,
        "floweringDays": 57,
        "growNotes": "",
        "height": "Tall",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1417835,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "When I open the jar to smell this XJ-13 it's almost as if little angels carrying baskets of citrus fruits are swirling past me, while a single pine tree stands center of the jar filled with peppermints, all the while a clan of gnomes lay below harvesting honey from the bee hives atop the pine tree... You get the picture.",
            "username": "killionstrains"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Pl-Y2_w7iIfXMq-susdCw64Abdk=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fZFL3vk8uSMmuki8G4w8c_old-school-purple.png",
            "id": 1634213,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/3/240",
            "text": "This is creep strain which for me isn't great because it's a cerebral creep.. awful for my PTSD. I had temporary pain relief due to that hint of indica but again a racy cerebal high with a slow come on is a no for me. It'll force you to be creative though makes you move so that's a plus",
            "username": "CannaCasted"
        }
    ],
    "id": 1512,
    "name": "XJ-13",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 21.105900272566938
        },
        {
            "name": "Anxious",
            "score": 13.654401154401153
        },
        {
            "name": "Dry Eyes",
            "score": 12.004469296135964
        },
        {
            "name": "Paranoid",
            "score": 6.167829084495751
        },
        {
            "name": "Headache",
            "score": 3.0458353375020044
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/jack-herer",
            "category": "Sativa",
            "name": "Jack Herer",
            "permalink": "https://mobileapi.leafly.com/sativa/jack-herer",
            "slug": "jack-herer",
            "subtitle": null,
            "symbol": "Jh"
        },
        {
            "applink": "leafly://strain/g13-haze",
            "category": "Hybrid",
            "name": "G13 Haze",
            "permalink": "https://mobileapi.leafly.com/hybrid/g13-haze",
            "slug": "g13-haze",
            "subtitle": null,
            "symbol": "13h"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/xj-13",
    "photoTotalCount": 141,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646319/b/xj-13__primary_1ab9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/xj-13_100x100_eed5.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/623187/b/xj-13__primary_4dac.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/xj-13_100x100_f221.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/599754/b/xj-13__primary_dd60.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/xj-13_100x100_ff9c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/597709/b/xj-13__primary_5034.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/xj-13_100x100_1beb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/591441/b/xj-13__primary_be3f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/xj-13_100x100_bf03.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/591314/b/xj-13__primary_da9f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/xj-13_100x100_fdc6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Los Angeles, CA",
        "Seattle, WA",
        "Las Vegas, NV",
        "Bend, OR",
        "Denver, CO",
        "Eugene, OR",
        "Spokane, WA",
        "Bellevue, WA",
        "Everett, WA"
    ],
    "rating": 4.29,
    "relatedStrains": [],
    "reviewCount": 754,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "xj-13",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.29177718832891/240",
    "subtitle": null,
    "symbol": "X13",
    "symptoms": [
        {
            "name": "Depression",
            "score": 41.170634920634924
        },
        {
            "name": "Stress",
            "score": 39.849386724386726
        },
        {
            "name": "Lack of Appetite",
            "score": 26.222041847041847
        },
        {
            "name": "Fatigue",
            "score": 22.41913179413179
        },
        {
            "name": "Pain",
            "score": 21.317340067340066
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
