{
    "aka": "Sin Mint Cookies, SinMint Cookie, Sin Mint Cookie, SMC",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Hannah Meadows",
            "category": null,
            "date": "/Date(1495146932000)/",
            "id": "contentitems-27515",
            "text": "Whether you’re planning to spend your summer weekends at festivals, weddings, or a combination of the two, there’s one accessory you need above all else—flower crowns, of course! These beautiful floral haloes embrace and enhance natural beauty, making them a perfect addition to any bridal party or music event.\nA crown of your favorite blossoms is lovely, but a crown that also showcases your favorite strain is even better. Coachella agrees—the fashion-forward music festival was dotted with this hot new headwear trend sparked in large part by California-based Lowell Herb Co., which ran a special offer on canna-crowns in advance of the fest.\n(Julia Sumpter/Leafly)\nBelow, we show you how to make an herb-accented version of the classic flower crown. The best part? Your cannabis will be right at your fingertips wherever you go—simply pop off a bud without losing the aesthetic of the accessory.\nHave you ever worked cannabis buds into your bouquets or flower crown creations? Tell us about it or drop your pictures in the comments below!\nDIY: How to Make a Cannabis Flower Crown\nYou’ll need:\n\nFloral wire\nFloral tape\nWire cutters\nFresh flowers\n2-4 grams cannabis of your choosing (we picked up some SinMint Cookies and Elphinstone from Oz. Recreational Cannabis)\n\n(Julia Sumpter/Leafly)\nTip: We stopped by the iconic Pike Place Market in Seattle to pick up two fresh bouquets, then headed to our local florist to nab the rest of our items (save the cannabis). We recommend visiting your local farmer’s market for some seasonal blooms.\n(Julia Sumpter/Leafly)\nDirections\n\nMeasure the floral wire around your head so that it will be big enough to fit, with 1–2 spare inches on either end for wrapping. Cut wire.\n\n\n\nForm your wire into a halo, wrapping the two ends together with floral tape.\n\n(Julia Sumpter/Leafly)\n\nContinue wrapping the tape around the entire crown (this adds a more natural feel and makes it easier to tape your flowers). Set aside.\n\n(Julia Sumpter/Leafly)\n\nCut the flower stems long enough to tape, but short enough to arrange on the crown (we recommend stems range from 1-2 inches in length).\n\n(Julia Sumpter/Leafly)\n\nBegin taping the stems to the crown whichever way your heart desires.\n\n(Julia Sumpter/Leafly)\n\nContinue adding flowers and buds until you’re satisfied with your creation (and don’t forget to snap an Instagram pic).\n\n(Julia Sumpter/Leafly)\nTip: Cannabis buds are a bit difficult to tape down due to their short stems. We recommend shaving off the bottom leaves of a cannabis bud in order to free up space on the stem. This will make the cannabis easier to work into your flower crown.\n(Julia Sumpter/Leafly)\nNow that your crown is finished, you’re ready for the big event, whether that be your own wedding or a chill night with friends in the backyard. Have fun!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/05/18133131/flower-crown-1.jpg",
            "title": "Cannabis Flower Crowns: The Perfect DIY Smokeable Accessory",
            "urlslug": "/news/lifestyle/how-to-diy-cannabis-flower-crowns"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1441987200000)/",
            "id": "contentitems-3251",
            "text": "New and trending strains have just been added to the Leafly strain Explorer! See any that look familiar? If so, we want to see those strain reviews pouring in. Otherwise, check out the links below to find out if any of these new strains are offered near you!\n \n 1. Cherry OG\n\nCherry OG by Emerald Triangle Seeds is a hybrid cannabis strain bred by combining Cherry Thai, Afghani, and Lost Coast OG genetics. A 50/50 hybrid, Cherry OG truly brings you the best of both sativa and indica worlds as it delivers full-body euphoria alongside high-flying cerebral lucidity. While its name sets expectations of a fruity cherry aroma, this strain can sometimes express more sour and diesel-like flavors.\n\nFind out which locations are currently carrying Cherry OG\n \n 2. WSU\n\nWSU is a Washington-grown rendition of the indica strain Chemo and it’s waiting for you on the shelves of recreational stores state-wide. Named in homage to Washington State University, don’t confuse this strain with the UW indica, whose name is derived from the rivaling University of Washington. Its effects are described as relaxed and spacey. Citrus and berry flavors invade the palate on the inhale, providing a flavorful introduction to WSU’s heavy indica effects.\n\nFind out which locations are currently carrying WSU\n \n 3. Tommy's Home Grown\n\nTommy’s Home Grown, or THG for short, is a balanced hybrid strain that falls under the “Chong Certified” label. Exclusively offered at Encanto Green Cross in Phoenix, THG delivers uplifting and energizing effects alongside a sweet tropical aroma. Comfortable and functional, Tommy’s Home Grown is a favorite for winding down after a long and stressful day.\n\nTommy's Home Grown is available at Encanto Green Cross in Phoenix, AZ\n \n 4. NL5 Haze Mist\n\nNL5 Haze Mist by Green House Seeds is a classic sativa-dominant strain that mixes genetics from Northern Lights #5, Haze, and Kali Mist. Though primarily cerebral in effect, NL5 Haze Mist also provides a light body buzz that eases muscles into relaxation. This sativa brings a newfound vibrancy to the senses, allowing you to unlock creativity and appreciation of your surroundings.\n\n \n 5. SinMint Cookies\n\nSinMint Cookies is Sin City Seeds’ signature hybrid cross between GSC (f.k.a Girl Scout Cookies) and Blue Power. Leaning slightly to the indica side, SinMint Cookies provides powerfully euphoric effects that let your mind float blissfully away from the day’s stresses. Its aroma is a subtle mix of earthy sweetness with a trace of sharp mint.\n\nFind out which locations are currently carrying SinMint Cookies\n \n 6. Training Day\n\nBred by DNA Genetics, Training Day is a 70% indica that combines parent strains Trainwreck and LA Confidential. This California native takes after its LA Confidential parent in aroma and delivers a pungent earthy and pine flavor. As demonstrated by its thick blanket of crystal resin, Training Day will put your THC tolerance to the test so novices should approach this strain with caution.\n\nFind out which locations are currently carrying Training Day\n \n 7. OG Chem\n\nOG Chem, also called Chem OG, is a sativa-dominant cross between two legendary strains, Chemdawg and OG Kush. The diesel notes of Chemdawg combine with the sour, piney scent of OG Kush to create a pungent skunky aroma that fills the room. Uplifting and euphoric, OG Chem invites the mind to indulge in its creative side while elevating the mood to a light and carefree state.\n\nFind out which locations are currently carrying OG Chem\n \nCheck out our other new strains recently added to the Leafly Explorer, or catch up on last week's New Strains Alert!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/09/12002025/new-strains-alert-cherry-og-wsu-tommy.png",
            "title": "New Strains Alert: Cherry OG, WSU, OG Chem, Tommy's Home Grown, and More",
            "urlslug": "/news/strains-products/new-strains-alert-cherry-og-wsu-tommy"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "PTSD",
            "score": 48.86363636363636
        },
        {
            "name": "Anxiety",
            "score": 47.878787878787875
        },
        {
            "name": "ADD/ADHD",
            "score": 43.48484848484848
        },
        {
            "name": "Bipolar Disorder",
            "score": 40.22727272727272
        },
        {
            "name": "Arthritis",
            "score": 11.515151515151516
        }
    ],
    "description": "<p>SinMint Cookies is Sin City Seeds&rsquo; signature hybrid cross between <a href=\"https://www.leafly.com/hybrid/girl-scout-cookie\">Girl Scout Cookies</a> and <a href=\"https://www.leafly.com/indica/blue-power\">Blue Power</a>. Leaning slightly to the indica side, SinMint Cookies provides powerfully euphoric effects that let your mind float blissfully away from the day&rsquo;s stresses. Its aroma is a subtle mix of earthy sweetness with a trace of sharp mint.&nbsp;</p>\n",
    "descriptionPlain": "SinMint Cookies is Sin City Seeds&rsquo; signature hybrid cross between Girl Scout Cookies and Blue Power. Leaning slightly to the indica side, SinMint Cookies provides powerfully euphoric effects that let your mind float blissfully away from the day&rsquo;s stresses. Its aroma is a subtle mix of earthy sweetness with a trace of sharp mint.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 104.77272727272727
        },
        {
            "name": "Happy",
            "score": 99.62121212121211
        },
        {
            "name": "Euphoric",
            "score": 95.75757575757575
        },
        {
            "name": "Hungry",
            "score": 52.12121212121212
        },
        {
            "name": "Uplifted",
            "score": 51.89393939393939
        }
    ],
    "flavors": [
        {
            "name": "Mint",
            "score": 53.78787878787878
        },
        {
            "name": "Spicy/Herbal",
            "score": 39.090909090909086
        },
        {
            "name": "Skunk",
            "score": 38.712121212121204
        },
        {
            "name": "Pungent",
            "score": 38.1060606060606
        },
        {
            "name": "Sweet",
            "score": 37.12121212121212
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 63,
        "growNotes": "\n\tYields about 300-500 grams per square meter\n\n",
        "height": "Medium",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1415969,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Hitting this again for the second time, high impacts of Euphoria, and pain numbing hits not only my joints but inside my bones. This is a veteran strain fer sure. If you need to be knocked out be pre-paired to be couch locked. Ultra top shelf nugs, these dank nuggeteers pack a powerful punch since blue power is crossed with this strain its incredibly heavy. Dry eyes more than mouth, but mega chill and social. Absolutely great wood and pungent earth taste sleepy effects are portrayed as well in this strain thanks to the heavy master kush. I would recommend this to those who have adhd, mood disorders, pms, ptsd, and nerve pain its a great coping strain!",
            "username": "Chill_Panda"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png",
            "id": 1565198,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I picked this up because of its consensus effects on pain and inflammation. I was not disappointed. I have severe osteoarthritis. Inflammation and sharp stabbing pains are a fact of life. This strain has proven to be a big help. It's not a daytime strain for active outdoor activities. It's a settle back in the evening, slip into restful sleep strain. It's not mind-clouding. It's more about letting go of stress and strain. Definitely worth picking up and keeping on hand.",
            "username": "EdnaF"
        }
    ],
    "id": 179023,
    "name": "SinMint Cookies",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 50.75757575757575
        },
        {
            "name": "Dry Eyes",
            "score": 20.151515151515152
        },
        {
            "name": "Headache",
            "score": 8.257575757575758
        },
        {
            "name": "Anxious",
            "score": 2.878787878787879
        },
        {
            "name": "Paranoid",
            "score": 1.893939393939394
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/girl-scout-cookie",
            "category": "Hybrid",
            "name": "Girl Scout Cookies",
            "permalink": "https://mobileapi.leafly.com/hybrid/girl-scout-cookie",
            "slug": "girl-scout-cookie",
            "subtitle": null,
            "symbol": "Gsc"
        },
        {
            "applink": "leafly://strain/blue-power",
            "category": "Indica",
            "name": "Blue Power",
            "permalink": "https://mobileapi.leafly.com/indica/blue-power",
            "slug": "blue-power",
            "subtitle": null,
            "symbol": "Bpw"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/sinmint-cookies",
    "photoTotalCount": 12,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/674283/b/sinmint-cookies__primary_11b9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sinmint-cookies_100x100_9508.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/590954/b/sinmint-cookies__primary_3294.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sinmint-cookies_100x100_60bb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503255/b/sinmint-cookies__primary_7f2f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sinmint-cookies_100x100_2f21.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/491246/b/sinmint-cookies__primary_1b2f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sinmint-cookies_100x100_743c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/490368/b/sinmint-cookies__primary_4c83.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sinmint-cookies_100x100_ff33.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/490830/b/sinmint-cookies__primary_00b0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sinmint-cookies_100x100_8954.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Detroit, MI",
        "Seattle, WA",
        "Bellevue, WA",
        "Spokane, WA",
        "Vancouver, WA",
        "Everett, WA",
        "Lynnwood, WA",
        "Mount Vernon, WA",
        "Airway Heights, WA",
        "Au Gres, MI"
    ],
    "rating": 4.59,
    "relatedStrains": [],
    "reviewCount": 70,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "sinmint-cookies",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.58571428571429/240",
    "subtitle": null,
    "symbol": "Smc",
    "symptoms": [
        {
            "name": "Stress",
            "score": 57.272727272727266
        },
        {
            "name": "Pain",
            "score": 55.378787878787875
        },
        {
            "name": "Nausea",
            "score": 50.22727272727272
        },
        {
            "name": "Insomnia",
            "score": 49.62121212121212
        },
        {
            "name": "Lack of Appetite",
            "score": 47.12121212121212
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
