{"sl_translate":"description,descriptionPlain,category","id":624,"slug":"j1","name":"J1","subtitle":null,"symbol":"J1","category":"Hybrid","description":"\u003cp\u003eJ1, or Jack One, is a high-end \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e strain that is gaining widespread popularity. Although a hybrid, the high-energy effects categorize the strain more on the \u003ca href=\"http://www.leafly.com/sativa\"\u003esativa\u003c/a\u003e end of the scale. J1 is a cross between two famous sativas, \u003ca href=\"http://www.leafly.com/sativa/skunk-1\" style=\"text-decoration:none;\"\u003eSkunk #1\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/sativa/jack-herer\" style=\"text-decoration:none;\"\u003eJack Herer\u003c/a\u003e, and is best known for its strong, \u003ca href=\"http://www.leafly.com/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e, clear-headed buzz that allows for mobility. The flowers are emerald green and frosty with a sweet aroma resembling the unmistakable Jack Herer pungency. This strain\u0026rsquo;s seemingly only flaw is the top-shelf price that tends to come with its exceptional quality.\u003c/p\u003e\n","descriptionPlain":"J1, or Jack One, is a high-end hybrid strain that is gaining widespread popularity. Although a hybrid, the high-energy effects categorize the strain more on the sativa end of the scale. J1 is a cross between two famous sativas, Skunk #1 and Jack Herer, and is best known for its strong, uplifting, clear-headed buzz that allows for mobility. The flowers are emerald green and frosty with a sweet aroma resembling the unmistakable Jack Herer pungency. This strain\u0026rsquo;s seemingly only flaw is the top-shelf price that tends to come with its exceptional quality.\n","aka":"J-1, j 1, Jack One, Jack 1","rating":4.46,"highlightedReviews":[{"id":1416544,"username":"Kinglui","text":"If you suffer from anxiety, this is the strain for you. I suffer from acute anxiety due to a condition named Dystonia. I have a mild case which means that I have a slight muscle problem and facial ticks. When I hit this (only 2 hits from a piece) I thought I was cured. I like this strain because I can focus and get things done and for once, have a normal conversation with people. No memory loss, just an overall calming and happy sensation.\r\nI’ve been looking for anxiety calming strains and this and Strawberry cough are the best I’ve tried. \r\n","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"},{"id":1638285,"username":"papanardo","text":"phenomenal","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-6025","title":"Cannabis Scents and Sensibility: Why Marijuana\u0027s Fragrance Is a Feast for the Nose","author":"Emily Grosvenor","category":null,"date":"\/Date(1459224000000)\/","text":"To make a truly informed cannabis-buying decision, you have to smell the product. And I don’t mean taking a dainty whiff. You’ve got get in there and really inhale, because smelling it — really focusing on the fragrance — may just be the best way to choose your cannabis.\n“Depending on what the scent is, it can make or break a strain for people,” said Tyson Dieter, a manager at the Southwest Portland outlet of Nectar, an Oregon cannabis retailer.\nI’m a home perfumer trained by a world-class nose. Years ago I trained at home using natural perfumer Mandy Aftel’s workbooks, and later I studied with her at her studio in Berkeley, Calif. For me scent is the ultimate in pleasure experiences. On a recent Tuesday morning, I stopped in at Nectar to talk scent and learn about the role it plays in the burgeoning cannabis industry.\nWhat Do Cannabis and Perfumes Have in Common?\nIt turns out perfume and pot have a lot in common.\nBoth products come with outlandish, sometimes arbitrary titles. Burberry Weekend, meet Blackberry Kush. Practically no one buys the product without smelling it first. (Where it’s allowed, that is. In Washington state, pre-purchase smelling for recreational cannabis is against the law.) We don’t talk about them using the same language, although that’s changing as consumers learn more about scent’s connection to the cannabis experience.\n\nAs I stepped through Nectar’s front door, the first thing I noticed was the air, which smelled lightly of sweet herb. The employees — perhaps the happiest service professionals I’ve ever encountered — were all eager to talk to me about their favorite-smelling strains.\nCommercial perfumes are composed of top notes, middle notes (also called heart notes) and base notes, so named based on their relative evaporation rates. A perfume with a top note of essential oil of bergamot (citrus) might be paired with a middle note of lavender oil and a base note of thick, resiny oakmoss. Together they make up the full scent experience of the perfume.\nIn the cannabis world, the language hasn’t yet evolved to describe the plant’s fragrance notes with such specificity. But budtenders and growers are expanding their vocabulary to describe the scent experience. So you may see two main, often contrasting odors: sweet and fruity paired with earthy, like in an Afgooey.\nAt Nectar the jars open dozens of times a day for olfactory sampling. Some strains are more fragrant than others. A Blackberry Kush may not remind anyone of blackberries, but it does have a subtle sweetness to balance the hashy, diesel-fume center it’s known for. GSC (f.k.a Girl Scout Cookies), another potent strain, smells oily and pungent in the middle and slightly sweet on top.\nAll cannabis strains carry their own scent signature, a fact that often surprises cannabis consumers who come to a shop for the first time.\n\n“First-timers generally know about THC content and little else,” Dieter said. “But then they usually stand there smelling all day to find a perfect match.”\nSome strains share some of their scent identity with the world of aromatherapy. An activating hybrid sativa like Orange Crush has much in common with a bitter orange essential oil — one often used by aromatherapists for energizing. In the same vein, the citrus-scented J1, a sativa hybrid, smells like a traditional fougère-style perfume, opening with a citrus note and moving into an herby heart.\nBecause scent is deeply personal, no one really agrees on which strains smell best. A savory, cheesy strain like OG99 might send some running for the hills, but for consumers who like to “smoke savory,” the associated mellow vibe is well worth it.\nOther consumers prefer the so-called “authentic-smelling” pot strains. For them, something like The Perps, which gives off the odor of a grape Jolly Rancher, might feel like spraying your face with Britney Spears’ Curious.\nWhy Consumption Methods Matter When It Comes to Scent Preservation\nWhen it comes to harnessing the scent of cannabis, consumption methods matter.\n\nA cannabis flower’s scent comes directly from its terpenes, volatile aromatic organic compounds found in the oils of all flowers. Terpenes in the cannabis flower evolved to attract pollinators or repel enemies. More than 100 possible terpenes are thought to exist in various strains of the cannabis flower.\nThe unique combination of terpenes in a particular strain produces its aromatic properties and, some believe, is thought to influence the body’s high. To heighten the experience of the terpenes, therefore, consumers should reach for consumption methods involving less combustion. The higher the burn temperature, the more likely the most volatile and aromatic terpenes will combust before being consumed.\nIn other words, to get the full scent experience, vape it, don’t smoke it.\n“When you have a vaping machine, it can hinder the effect of the flavor,” said Myles Hyde, a budtender at Nectar who specializes in medicinal use. For flower, Hyde suggested using a vaporizer in at least the $250 range. “With a lower-quality machine, you may end up smelling some of the machine itself.”\n\nThose who do want to smoke it would be advised to do it indoors, according to Hyde, where the scent lingers, affecting the high.\nOther methods, like using hash oil, produces a concentrated scent experience so aromatic it feels like smelling an aged perfume. Dieter pulled a Dogwalker resin with a smell reminiscent of jasmine concentrate: dirty, floral, even slightly fecal. In this way, fragrance obsessives are much like cheese hounds or any other aficionados who move with passion into a sensual pursuit — as they explore their olfactory world, they become more and more enamored with scents that might repel the layperson.\nEmphasizing Fragrance as Part of the Purchasing Decision\nThe importance of scent is beginning to take on a bigger role in the purchasing decision at some of Portland’s leading retail shops. During a recent visit to Oregon’s Finest, a store tucked into the city’s swanky Pearl District, manager Selena Toomey pulled flower-filled apothecary jars off a shelf for me.\n“Strains sell themselves based on their scent,” Toomey said. “It makes a huge difference in the experience.”\n\nPerfumers are taught to smell coffee beans between samples in order to cleanse their palates. Oregon’s Finest has adapted the practice for the cannabis connoisseur. Toomey invited me to sniff single-origin beans (this is Portland, after all) while passing between strain jars.\nToomey often suggests patients spend up to 10 minutes working the flower in their hands before smoking or vaping it. Doing so, she said, allows you to smell more of the terpenes and enhance the way it tastes when consumed.\n“The terpenoids and flavonoids play a huge part in opening up your receptors to all of the effects of the cannabis,” Toomey explained. “It’s like steaming in a hot shower before you moisturize.”\nScent scientists often talk about the cognitive barriers to talking about our often ignored fifth sense — that we don’t really practice the language needed to really discuss scent.\n\nWhen Toomey talks about scent to her customers, she sometimes avoids scent talk and focuses on taste, which offers a vocabulary more familiar to most consumers. She’ll speak of a strain like Dutch Treat as being like “mint chocolate chip ice cream.”\nToomey has been at Oregon’s Finest since its 2014 opening. She’s seen her customer base grow from curiosity to connoisseurship, even as the shop retains its focus on pot’s medicinal effects.\nShe sells individual terpenes as an additive to other marijuana products for medicinal users. Once you have enough experience to identify specific terpenes by smell alone, you can anticipate the associated high, she said.\n“If I’m in a dispensary, I can tell by the aroma if a strain will work with my body,” Toomey added. “The nose knows.”\nEmily Grosvenor is a writer and perfumer based in Oregon. You can follow her on Twitter.\nImage Source: Sara Dilley","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/03/29195541/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea.jpg","urlslug":"/news/cannabis-101/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea"},{"id":"contentitems-38365","title":"Tips for Growing J1 Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1503097358000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: J1, also called Jack One, is a cross between Jack Herer and Skunk #1. The strain is known for its elevating cerebral high that leaves you feeling calm and collected. The aroma is similar to Jack Herer: skunky, piney, and with sweet notes of citrus.\nGrow Techniques: Grow indoors or outdoors in complex healthy soils to keep the flavor of this strain as strong as possible. The buds are known to grow dense, which means you’ll need quality air circulation as well as protection from rain and humidity to prevent mold.\nFlowering Time: 8 to 9 weeks\nYield: Moderate\nGrow Difficulty: Moderate\nClimate: This strain prefers low humidity (40% RH) and temperatures between 68 and 80 degrees Fahrenheit.\nIndoor/Outdoor: Will thrive indoors or outdoors. If growing outdoors, J1 performs best in a Mediterranean climate.\nFeeding: Feed this strain carefully as it may be sensitive to overfeeding. Utilize amendments to make a healthy soil that will aid the production of its notable aroma.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/18155650/j1-strain.jpg","urlslug":"/news/growing/how-to-grow-j1-marijuana"}],"reviewCount":539,"flavors":[{"name":"Earthy","score":40.741935483870961},{"name":"Pungent","score":33.142473118279568},{"name":"Skunk","score":22.319892473118276},{"name":"Citrus","score":19.706989247311828},{"name":"Pine","score":14.89516129032258}],"effects":[{"name":"Happy","score":84.19086021505376},{"name":"Uplifted","score":75.02956989247312},{"name":"Energetic","score":59.865591397849464},{"name":"Relaxed","score":57.190860215053767},{"name":"Euphoric","score":57.0510752688172}],"symptoms":[{"name":"Stress","score":60.526881720430104},{"name":"Depression","score":57.978494623655919},{"name":"Fatigue","score":41.443548387096776},{"name":"Pain","score":25.951612903225808},{"name":"Nausea","score":22.279569892473116}],"conditions":[{"name":"Anxiety","score":25.862903225806452},{"name":"ADD/ADHD","score":18.940860215053764},{"name":"PTSD","score":11.36021505376344},{"name":"Migraines","score":3.10752688172043},{"name":"Bipolar Disorder","score":2.077956989247312}],"negatives":[{"name":"Dry Mouth","score":26.233870967741936},{"name":"Dry Eyes","score":16.271505376344084},{"name":"Dizzy","score":12.209677419354838},{"name":"Anxious","score":11.18010752688172},{"name":"Paranoid","score":10.209677419354836}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_a38b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002091/b/j1__primary_3648.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_0937.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002088/b/j1__primary_abb7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_b245.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/632842/b/j1__primary_6194.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_2e5d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/627117/b/j1__primary_c99f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_d4ed.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607342/b/j1__primary_978a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_08f5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/606251/b/j1__primary_6af9.jpg"}],"photoTotalCount":102,"popularCities":["Portland, OR","Los Angeles, CA","San Diego, CA","Phoenix, AZ","Seattle, WA","Eugene, OR","Salem, OR","Tucson, AZ","Beaverton, OR","Hayward, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/j1","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.46196660482375/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Jack Herer","subtitle":null,"slug":"jack-herer","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jack-herer","symbol":"Jh","applink":"leafly://strain/jack-herer"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":65,"outdoorFinish":null,"height":"Medium","averageYield":"Medium","environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":624,"slug":"j1","name":"J1","subtitle":null,"symbol":"J1","category":"Hybrid","description":"\u003cp\u003eJ1, or Jack One, is a high-end \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e strain that is gaining widespread popularity. Although a hybrid, the high-energy effects categorize the strain more on the \u003ca href=\"http://www.leafly.com/sativa\"\u003esativa\u003c/a\u003e end of the scale. J1 is a cross between two famous sativas, \u003ca href=\"http://www.leafly.com/sativa/skunk-1\" style=\"text-decoration:none;\"\u003eSkunk #1\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/sativa/jack-herer\" style=\"text-decoration:none;\"\u003eJack Herer\u003c/a\u003e, and is best known for its strong, \u003ca href=\"http://www.leafly.com/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e, clear-headed buzz that allows for mobility. The flowers are emerald green and frosty with a sweet aroma resembling the unmistakable Jack Herer pungency. This strain\u0026rsquo;s seemingly only flaw is the top-shelf price that tends to come with its exceptional quality.\u003c/p\u003e\n","descriptionPlain":"J1, or Jack One, is a high-end hybrid strain that is gaining widespread popularity. Although a hybrid, the high-energy effects categorize the strain more on the sativa end of the scale. J1 is a cross between two famous sativas, Skunk #1 and Jack Herer, and is best known for its strong, uplifting, clear-headed buzz that allows for mobility. The flowers are emerald green and frosty with a sweet aroma resembling the unmistakable Jack Herer pungency. This strain\u0026rsquo;s seemingly only flaw is the top-shelf price that tends to come with its exceptional quality.\n","aka":"J-1, j 1, Jack One, Jack 1","rating":4.46,"highlightedReviews":[{"id":1416544,"username":"Kinglui","text":"If you suffer from anxiety, this is the strain for you. I suffer from acute anxiety due to a condition named Dystonia. I have a mild case which means that I have a slight muscle problem and facial ticks. When I hit this (only 2 hits from a piece) I thought I was cured. I like this strain because I can focus and get things done and for once, have a normal conversation with people. No memory loss, just an overall calming and happy sensation.\r\nI’ve been looking for anxiety calming strains and this and Strawberry cough are the best I’ve tried. \r\n","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"},{"id":1638285,"username":"papanardo","text":"phenomenal","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-6025","title":"Cannabis Scents and Sensibility: Why Marijuana\u0027s Fragrance Is a Feast for the Nose","author":"Emily Grosvenor","category":null,"date":"\/Date(1459224000000)\/","text":"To make a truly informed cannabis-buying decision, you have to smell the product. And I don’t mean taking a dainty whiff. You’ve got get in there and really inhale, because smelling it — really focusing on the fragrance — may just be the best way to choose your cannabis.\n“Depending on what the scent is, it can make or break a strain for people,” said Tyson Dieter, a manager at the Southwest Portland outlet of Nectar, an Oregon cannabis retailer.\nI’m a home perfumer trained by a world-class nose. Years ago I trained at home using natural perfumer Mandy Aftel’s workbooks, and later I studied with her at her studio in Berkeley, Calif. For me scent is the ultimate in pleasure experiences. On a recent Tuesday morning, I stopped in at Nectar to talk scent and learn about the role it plays in the burgeoning cannabis industry.\nWhat Do Cannabis and Perfumes Have in Common?\nIt turns out perfume and pot have a lot in common.\nBoth products come with outlandish, sometimes arbitrary titles. Burberry Weekend, meet Blackberry Kush. Practically no one buys the product without smelling it first. (Where it’s allowed, that is. In Washington state, pre-purchase smelling for recreational cannabis is against the law.) We don’t talk about them using the same language, although that’s changing as consumers learn more about scent’s connection to the cannabis experience.\n\nAs I stepped through Nectar’s front door, the first thing I noticed was the air, which smelled lightly of sweet herb. The employees — perhaps the happiest service professionals I’ve ever encountered — were all eager to talk to me about their favorite-smelling strains.\nCommercial perfumes are composed of top notes, middle notes (also called heart notes) and base notes, so named based on their relative evaporation rates. A perfume with a top note of essential oil of bergamot (citrus) might be paired with a middle note of lavender oil and a base note of thick, resiny oakmoss. Together they make up the full scent experience of the perfume.\nIn the cannabis world, the language hasn’t yet evolved to describe the plant’s fragrance notes with such specificity. But budtenders and growers are expanding their vocabulary to describe the scent experience. So you may see two main, often contrasting odors: sweet and fruity paired with earthy, like in an Afgooey.\nAt Nectar the jars open dozens of times a day for olfactory sampling. Some strains are more fragrant than others. A Blackberry Kush may not remind anyone of blackberries, but it does have a subtle sweetness to balance the hashy, diesel-fume center it’s known for. GSC (f.k.a Girl Scout Cookies), another potent strain, smells oily and pungent in the middle and slightly sweet on top.\nAll cannabis strains carry their own scent signature, a fact that often surprises cannabis consumers who come to a shop for the first time.\n\n“First-timers generally know about THC content and little else,” Dieter said. “But then they usually stand there smelling all day to find a perfect match.”\nSome strains share some of their scent identity with the world of aromatherapy. An activating hybrid sativa like Orange Crush has much in common with a bitter orange essential oil — one often used by aromatherapists for energizing. In the same vein, the citrus-scented J1, a sativa hybrid, smells like a traditional fougère-style perfume, opening with a citrus note and moving into an herby heart.\nBecause scent is deeply personal, no one really agrees on which strains smell best. A savory, cheesy strain like OG99 might send some running for the hills, but for consumers who like to “smoke savory,” the associated mellow vibe is well worth it.\nOther consumers prefer the so-called “authentic-smelling” pot strains. For them, something like The Perps, which gives off the odor of a grape Jolly Rancher, might feel like spraying your face with Britney Spears’ Curious.\nWhy Consumption Methods Matter When It Comes to Scent Preservation\nWhen it comes to harnessing the scent of cannabis, consumption methods matter.\n\nA cannabis flower’s scent comes directly from its terpenes, volatile aromatic organic compounds found in the oils of all flowers. Terpenes in the cannabis flower evolved to attract pollinators or repel enemies. More than 100 possible terpenes are thought to exist in various strains of the cannabis flower.\nThe unique combination of terpenes in a particular strain produces its aromatic properties and, some believe, is thought to influence the body’s high. To heighten the experience of the terpenes, therefore, consumers should reach for consumption methods involving less combustion. The higher the burn temperature, the more likely the most volatile and aromatic terpenes will combust before being consumed.\nIn other words, to get the full scent experience, vape it, don’t smoke it.\n“When you have a vaping machine, it can hinder the effect of the flavor,” said Myles Hyde, a budtender at Nectar who specializes in medicinal use. For flower, Hyde suggested using a vaporizer in at least the $250 range. “With a lower-quality machine, you may end up smelling some of the machine itself.”\n\nThose who do want to smoke it would be advised to do it indoors, according to Hyde, where the scent lingers, affecting the high.\nOther methods, like using hash oil, produces a concentrated scent experience so aromatic it feels like smelling an aged perfume. Dieter pulled a Dogwalker resin with a smell reminiscent of jasmine concentrate: dirty, floral, even slightly fecal. In this way, fragrance obsessives are much like cheese hounds or any other aficionados who move with passion into a sensual pursuit — as they explore their olfactory world, they become more and more enamored with scents that might repel the layperson.\nEmphasizing Fragrance as Part of the Purchasing Decision\nThe importance of scent is beginning to take on a bigger role in the purchasing decision at some of Portland’s leading retail shops. During a recent visit to Oregon’s Finest, a store tucked into the city’s swanky Pearl District, manager Selena Toomey pulled flower-filled apothecary jars off a shelf for me.\n“Strains sell themselves based on their scent,” Toomey said. “It makes a huge difference in the experience.”\n\nPerfumers are taught to smell coffee beans between samples in order to cleanse their palates. Oregon’s Finest has adapted the practice for the cannabis connoisseur. Toomey invited me to sniff single-origin beans (this is Portland, after all) while passing between strain jars.\nToomey often suggests patients spend up to 10 minutes working the flower in their hands before smoking or vaping it. Doing so, she said, allows you to smell more of the terpenes and enhance the way it tastes when consumed.\n“The terpenoids and flavonoids play a huge part in opening up your receptors to all of the effects of the cannabis,” Toomey explained. “It’s like steaming in a hot shower before you moisturize.”\nScent scientists often talk about the cognitive barriers to talking about our often ignored fifth sense — that we don’t really practice the language needed to really discuss scent.\n\nWhen Toomey talks about scent to her customers, she sometimes avoids scent talk and focuses on taste, which offers a vocabulary more familiar to most consumers. She’ll speak of a strain like Dutch Treat as being like “mint chocolate chip ice cream.”\nToomey has been at Oregon’s Finest since its 2014 opening. She’s seen her customer base grow from curiosity to connoisseurship, even as the shop retains its focus on pot’s medicinal effects.\nShe sells individual terpenes as an additive to other marijuana products for medicinal users. Once you have enough experience to identify specific terpenes by smell alone, you can anticipate the associated high, she said.\n“If I’m in a dispensary, I can tell by the aroma if a strain will work with my body,” Toomey added. “The nose knows.”\nEmily Grosvenor is a writer and perfumer based in Oregon. You can follow her on Twitter.\nImage Source: Sara Dilley","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/03/29195541/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea.jpg","urlslug":"/news/cannabis-101/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea"},{"id":"contentitems-38365","title":"Tips for Growing J1 Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1503097358000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: J1, also called Jack One, is a cross between Jack Herer and Skunk #1. The strain is known for its elevating cerebral high that leaves you feeling calm and collected. The aroma is similar to Jack Herer: skunky, piney, and with sweet notes of citrus.\nGrow Techniques: Grow indoors or outdoors in complex healthy soils to keep the flavor of this strain as strong as possible. The buds are known to grow dense, which means you’ll need quality air circulation as well as protection from rain and humidity to prevent mold.\nFlowering Time: 8 to 9 weeks\nYield: Moderate\nGrow Difficulty: Moderate\nClimate: This strain prefers low humidity (40% RH) and temperatures between 68 and 80 degrees Fahrenheit.\nIndoor/Outdoor: Will thrive indoors or outdoors. If growing outdoors, J1 performs best in a Mediterranean climate.\nFeeding: Feed this strain carefully as it may be sensitive to overfeeding. Utilize amendments to make a healthy soil that will aid the production of its notable aroma.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/18155650/j1-strain.jpg","urlslug":"/news/growing/how-to-grow-j1-marijuana"}],"reviewCount":539,"flavors":[{"name":"Earthy","score":40.741935483870961},{"name":"Pungent","score":33.142473118279568},{"name":"Skunk","score":22.319892473118276},{"name":"Citrus","score":19.706989247311828},{"name":"Pine","score":14.89516129032258}],"effects":[{"name":"Happy","score":84.19086021505376},{"name":"Uplifted","score":75.02956989247312},{"name":"Energetic","score":59.865591397849464},{"name":"Relaxed","score":57.190860215053767},{"name":"Euphoric","score":57.0510752688172}],"symptoms":[{"name":"Stress","score":60.526881720430104},{"name":"Depression","score":57.978494623655919},{"name":"Fatigue","score":41.443548387096776},{"name":"Pain","score":25.951612903225808},{"name":"Nausea","score":22.279569892473116}],"conditions":[{"name":"Anxiety","score":25.862903225806452},{"name":"ADD/ADHD","score":18.940860215053764},{"name":"PTSD","score":11.36021505376344},{"name":"Migraines","score":3.10752688172043},{"name":"Bipolar Disorder","score":2.077956989247312}],"negatives":[{"name":"Dry Mouth","score":26.233870967741936},{"name":"Dry Eyes","score":16.271505376344084},{"name":"Dizzy","score":12.209677419354838},{"name":"Anxious","score":11.18010752688172},{"name":"Paranoid","score":10.209677419354836}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_a38b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002091/b/j1__primary_3648.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_0937.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002088/b/j1__primary_abb7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_b245.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/632842/b/j1__primary_6194.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_2e5d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/627117/b/j1__primary_c99f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_d4ed.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607342/b/j1__primary_978a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_08f5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/606251/b/j1__primary_6af9.jpg"}],"photoTotalCount":102,"popularCities":["Portland, OR","Los Angeles, CA","San Diego, CA","Phoenix, AZ","Seattle, WA","Eugene, OR","Salem, OR","Tucson, AZ","Beaverton, OR","Hayward, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/j1","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.46196660482375/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Jack Herer","subtitle":null,"slug":"jack-herer","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jack-herer","symbol":"Jh","applink":"leafly://strain/jack-herer"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":65,"outdoorFinish":null,"height":"Medium","averageYield":"Medium","environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":624,"slug":"j1","name":"J1","subtitle":null,"symbol":"J1","category":"Hybrid","description":"\u003cp\u003eJ1, or Jack One, is a high-end \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e strain that is gaining widespread popularity. Although a hybrid, the high-energy effects categorize the strain more on the \u003ca href=\"http://www.leafly.com/sativa\"\u003esativa\u003c/a\u003e end of the scale. J1 is a cross between two famous sativas, \u003ca href=\"http://www.leafly.com/sativa/skunk-1\" style=\"text-decoration:none;\"\u003eSkunk #1\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/sativa/jack-herer\" style=\"text-decoration:none;\"\u003eJack Herer\u003c/a\u003e, and is best known for its strong, \u003ca href=\"http://www.leafly.com/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e, clear-headed buzz that allows for mobility. The flowers are emerald green and frosty with a sweet aroma resembling the unmistakable Jack Herer pungency. This strain\u0026rsquo;s seemingly only flaw is the top-shelf price that tends to come with its exceptional quality.\u003c/p\u003e\n","descriptionPlain":"J1, or Jack One, is a high-end hybrid strain that is gaining widespread popularity. Although a hybrid, the high-energy effects categorize the strain more on the sativa end of the scale. J1 is a cross between two famous sativas, Skunk #1 and Jack Herer, and is best known for its strong, uplifting, clear-headed buzz that allows for mobility. The flowers are emerald green and frosty with a sweet aroma resembling the unmistakable Jack Herer pungency. This strain\u0026rsquo;s seemingly only flaw is the top-shelf price that tends to come with its exceptional quality.\n","aka":"J-1, j 1, Jack One, Jack 1","rating":4.46,"highlightedReviews":[{"id":1416544,"username":"Kinglui","text":"If you suffer from anxiety, this is the strain for you. I suffer from acute anxiety due to a condition named Dystonia. I have a mild case which means that I have a slight muscle problem and facial ticks. When I hit this (only 2 hits from a piece) I thought I was cured. I like this strain because I can focus and get things done and for once, have a normal conversation with people. No memory loss, just an overall calming and happy sensation.\r\nI’ve been looking for anxiety calming strains and this and Strawberry cough are the best I’ve tried. \r\n","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"},{"id":1638285,"username":"papanardo","text":"phenomenal","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-6025","title":"Cannabis Scents and Sensibility: Why Marijuana\u0027s Fragrance Is a Feast for the Nose","author":"Emily Grosvenor","category":null,"date":"\/Date(1459224000000)\/","text":"To make a truly informed cannabis-buying decision, you have to smell the product. And I don’t mean taking a dainty whiff. You’ve got get in there and really inhale, because smelling it — really focusing on the fragrance — may just be the best way to choose your cannabis.\n“Depending on what the scent is, it can make or break a strain for people,” said Tyson Dieter, a manager at the Southwest Portland outlet of Nectar, an Oregon cannabis retailer.\nI’m a home perfumer trained by a world-class nose. Years ago I trained at home using natural perfumer Mandy Aftel’s workbooks, and later I studied with her at her studio in Berkeley, Calif. For me scent is the ultimate in pleasure experiences. On a recent Tuesday morning, I stopped in at Nectar to talk scent and learn about the role it plays in the burgeoning cannabis industry.\nWhat Do Cannabis and Perfumes Have in Common?\nIt turns out perfume and pot have a lot in common.\nBoth products come with outlandish, sometimes arbitrary titles. Burberry Weekend, meet Blackberry Kush. Practically no one buys the product without smelling it first. (Where it’s allowed, that is. In Washington state, pre-purchase smelling for recreational cannabis is against the law.) We don’t talk about them using the same language, although that’s changing as consumers learn more about scent’s connection to the cannabis experience.\n\nAs I stepped through Nectar’s front door, the first thing I noticed was the air, which smelled lightly of sweet herb. The employees — perhaps the happiest service professionals I’ve ever encountered — were all eager to talk to me about their favorite-smelling strains.\nCommercial perfumes are composed of top notes, middle notes (also called heart notes) and base notes, so named based on their relative evaporation rates. A perfume with a top note of essential oil of bergamot (citrus) might be paired with a middle note of lavender oil and a base note of thick, resiny oakmoss. Together they make up the full scent experience of the perfume.\nIn the cannabis world, the language hasn’t yet evolved to describe the plant’s fragrance notes with such specificity. But budtenders and growers are expanding their vocabulary to describe the scent experience. So you may see two main, often contrasting odors: sweet and fruity paired with earthy, like in an Afgooey.\nAt Nectar the jars open dozens of times a day for olfactory sampling. Some strains are more fragrant than others. A Blackberry Kush may not remind anyone of blackberries, but it does have a subtle sweetness to balance the hashy, diesel-fume center it’s known for. GSC (f.k.a Girl Scout Cookies), another potent strain, smells oily and pungent in the middle and slightly sweet on top.\nAll cannabis strains carry their own scent signature, a fact that often surprises cannabis consumers who come to a shop for the first time.\n\n“First-timers generally know about THC content and little else,” Dieter said. “But then they usually stand there smelling all day to find a perfect match.”\nSome strains share some of their scent identity with the world of aromatherapy. An activating hybrid sativa like Orange Crush has much in common with a bitter orange essential oil — one often used by aromatherapists for energizing. In the same vein, the citrus-scented J1, a sativa hybrid, smells like a traditional fougère-style perfume, opening with a citrus note and moving into an herby heart.\nBecause scent is deeply personal, no one really agrees on which strains smell best. A savory, cheesy strain like OG99 might send some running for the hills, but for consumers who like to “smoke savory,” the associated mellow vibe is well worth it.\nOther consumers prefer the so-called “authentic-smelling” pot strains. For them, something like The Perps, which gives off the odor of a grape Jolly Rancher, might feel like spraying your face with Britney Spears’ Curious.\nWhy Consumption Methods Matter When It Comes to Scent Preservation\nWhen it comes to harnessing the scent of cannabis, consumption methods matter.\n\nA cannabis flower’s scent comes directly from its terpenes, volatile aromatic organic compounds found in the oils of all flowers. Terpenes in the cannabis flower evolved to attract pollinators or repel enemies. More than 100 possible terpenes are thought to exist in various strains of the cannabis flower.\nThe unique combination of terpenes in a particular strain produces its aromatic properties and, some believe, is thought to influence the body’s high. To heighten the experience of the terpenes, therefore, consumers should reach for consumption methods involving less combustion. The higher the burn temperature, the more likely the most volatile and aromatic terpenes will combust before being consumed.\nIn other words, to get the full scent experience, vape it, don’t smoke it.\n“When you have a vaping machine, it can hinder the effect of the flavor,” said Myles Hyde, a budtender at Nectar who specializes in medicinal use. For flower, Hyde suggested using a vaporizer in at least the $250 range. “With a lower-quality machine, you may end up smelling some of the machine itself.”\n\nThose who do want to smoke it would be advised to do it indoors, according to Hyde, where the scent lingers, affecting the high.\nOther methods, like using hash oil, produces a concentrated scent experience so aromatic it feels like smelling an aged perfume. Dieter pulled a Dogwalker resin with a smell reminiscent of jasmine concentrate: dirty, floral, even slightly fecal. In this way, fragrance obsessives are much like cheese hounds or any other aficionados who move with passion into a sensual pursuit — as they explore their olfactory world, they become more and more enamored with scents that might repel the layperson.\nEmphasizing Fragrance as Part of the Purchasing Decision\nThe importance of scent is beginning to take on a bigger role in the purchasing decision at some of Portland’s leading retail shops. During a recent visit to Oregon’s Finest, a store tucked into the city’s swanky Pearl District, manager Selena Toomey pulled flower-filled apothecary jars off a shelf for me.\n“Strains sell themselves based on their scent,” Toomey said. “It makes a huge difference in the experience.”\n\nPerfumers are taught to smell coffee beans between samples in order to cleanse their palates. Oregon’s Finest has adapted the practice for the cannabis connoisseur. Toomey invited me to sniff single-origin beans (this is Portland, after all) while passing between strain jars.\nToomey often suggests patients spend up to 10 minutes working the flower in their hands before smoking or vaping it. Doing so, she said, allows you to smell more of the terpenes and enhance the way it tastes when consumed.\n“The terpenoids and flavonoids play a huge part in opening up your receptors to all of the effects of the cannabis,” Toomey explained. “It’s like steaming in a hot shower before you moisturize.”\nScent scientists often talk about the cognitive barriers to talking about our often ignored fifth sense — that we don’t really practice the language needed to really discuss scent.\n\nWhen Toomey talks about scent to her customers, she sometimes avoids scent talk and focuses on taste, which offers a vocabulary more familiar to most consumers. She’ll speak of a strain like Dutch Treat as being like “mint chocolate chip ice cream.”\nToomey has been at Oregon’s Finest since its 2014 opening. She’s seen her customer base grow from curiosity to connoisseurship, even as the shop retains its focus on pot’s medicinal effects.\nShe sells individual terpenes as an additive to other marijuana products for medicinal users. Once you have enough experience to identify specific terpenes by smell alone, you can anticipate the associated high, she said.\n“If I’m in a dispensary, I can tell by the aroma if a strain will work with my body,” Toomey added. “The nose knows.”\nEmily Grosvenor is a writer and perfumer based in Oregon. You can follow her on Twitter.\nImage Source: Sara Dilley","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/03/29195541/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea.jpg","urlslug":"/news/cannabis-101/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea"},{"id":"contentitems-38365","title":"Tips for Growing J1 Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1503097358000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: J1, also called Jack One, is a cross between Jack Herer and Skunk #1. The strain is known for its elevating cerebral high that leaves you feeling calm and collected. The aroma is similar to Jack Herer: skunky, piney, and with sweet notes of citrus.\nGrow Techniques: Grow indoors or outdoors in complex healthy soils to keep the flavor of this strain as strong as possible. The buds are known to grow dense, which means you’ll need quality air circulation as well as protection from rain and humidity to prevent mold.\nFlowering Time: 8 to 9 weeks\nYield: Moderate\nGrow Difficulty: Moderate\nClimate: This strain prefers low humidity (40% RH) and temperatures between 68 and 80 degrees Fahrenheit.\nIndoor/Outdoor: Will thrive indoors or outdoors. If growing outdoors, J1 performs best in a Mediterranean climate.\nFeeding: Feed this strain carefully as it may be sensitive to overfeeding. Utilize amendments to make a healthy soil that will aid the production of its notable aroma.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/18155650/j1-strain.jpg","urlslug":"/news/growing/how-to-grow-j1-marijuana"}],"reviewCount":539,"flavors":[{"name":"Earthy","score":40.741935483870961},{"name":"Pungent","score":33.142473118279568},{"name":"Skunk","score":22.319892473118276},{"name":"Citrus","score":19.706989247311828},{"name":"Pine","score":14.89516129032258}],"effects":[{"name":"Happy","score":84.19086021505376},{"name":"Uplifted","score":75.02956989247312},{"name":"Energetic","score":59.865591397849464},{"name":"Relaxed","score":57.190860215053767},{"name":"Euphoric","score":57.0510752688172}],"symptoms":[{"name":"Stress","score":60.526881720430104},{"name":"Depression","score":57.978494623655919},{"name":"Fatigue","score":41.443548387096776},{"name":"Pain","score":25.951612903225808},{"name":"Nausea","score":22.279569892473116}],"conditions":[{"name":"Anxiety","score":25.862903225806452},{"name":"ADD/ADHD","score":18.940860215053764},{"name":"PTSD","score":11.36021505376344},{"name":"Migraines","score":3.10752688172043},{"name":"Bipolar Disorder","score":2.077956989247312}],"negatives":[{"name":"Dry Mouth","score":26.233870967741936},{"name":"Dry Eyes","score":16.271505376344084},{"name":"Dizzy","score":12.209677419354838},{"name":"Anxious","score":11.18010752688172},{"name":"Paranoid","score":10.209677419354836}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_a38b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002091/b/j1__primary_3648.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_0937.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002088/b/j1__primary_abb7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_b245.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/632842/b/j1__primary_6194.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_2e5d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/627117/b/j1__primary_c99f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_d4ed.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607342/b/j1__primary_978a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/j1_100x100_08f5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/606251/b/j1__primary_6af9.jpg"}],"photoTotalCount":102,"popularCities":["Portland, OR","Los Angeles, CA","San Diego, CA","Phoenix, AZ","Seattle, WA","Eugene, OR","Salem, OR","Tucson, AZ","Beaverton, OR","Hayward, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/j1","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.46196660482375/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Jack Herer","subtitle":null,"slug":"jack-herer","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jack-herer","symbol":"Jh","applink":"leafly://strain/jack-herer"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":65,"outdoorFinish":null,"height":"Medium","averageYield":"Medium","environment":null,"growNotes":""}}
