{
    "aka": "Dutch Berry",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1513710785000)/",
            "id": "contentitems-52310",
            "text": "Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis flower products of 2017. How many have you tried? What was your favorite flower of 2017? Share with us in the comments below!\n\nChocolope by Gabriel\nAvailable in: Washington\nChocolope’s bright and dreamy sativa effects are magnified by the exceptional grow practices laid out in Gabriel’s airtight facilities. Their cultivation rooms are sealed from the outside, offering perfect environmental control that is carefully manipulated to stimulate the growth of the best quality flower.\nAlso featured in:\n\nWhat Are You Smoking? Episode 15\nWashington’s Best Tasting Strains From Fall 2017\n\nKosher Kush by Santa Cruz Veteran’s Alliance\nAvailable in: California\nThe high-THC indica Kosher Kush is the perfect strain to crush symptoms of PTSD, and the Santa Cruz Veteran’s Alliance—owned and operated by military veterans—produces this pain-relieving strain for those suffering. We love that members are offered free cannabis grown by fellow veterans in rooms meant to exude peace as the cannabis flower blooms.\nAlso featured in: The VA Can’t Provide Cannabis to Veterans With PTSD, so This Group Gives It Out for Free\nDutchberry by Artizen\nAvailable in: Washington\nWith around 27% THC to 8% CBD, the cheerful hybrid Dutchberry boasts one of the highest cannabinoid contents of all time. To house such a powerhouse strain, Artizen moves in tandem with their flower from growth to packaging—and delivers some excellent buds. We love that they slow down and take a little time with their cannabis crops from start to finish.\n\nPineapple by Fire Bros.\nAvailable in: Washington\nA Seattle favorite, Fire Bros. works with their own phenotypes to produce the most effective cannabis flower for consumers. For an uplifting hybrid strain such as Pineapple, stress-relieving characteristics are an important facet enhanced by Fire Bros.’ hand-selection process.\nHybrid Blend by Lowell Farms\nAvailable in: California\nLowell Farms, which works exclusively with flower, offers seasonal blends of their best strains, and we can’t get enough of their hybrid pre-rolls. We appreciate that they’re thinking outside the box in focusing on balanced flower mixes rather than strain-specific products. Grown in organic fertilizer free of pesticides, Lowell takes pride in their dedication to all-natural cannabis as well as in providing good wages for their workers.\nAlso featured in: What Are You Smoking? Episode 3\nZkittlez by Royal Choice Farms\nAvailable in: Arizona\nArizona does not require pesticide testing for cannabis, so it’s all the more important to find a grower you can trust. Royal Choice Farms chose to be an all-organic operation built on a whole lot of love and no pesticides. By instating natural grow methods, Royal Choice keeps our minds at ease when we’re lighting up their sweet indica Zkittles.\n\nCBD Blue Shark by Marley Natural Red\nAvailable in: California, Oregon, Washington*\nWith a full cannabis operation dedicated to Jamaica’s rich culture, Marley Natural hits it out of the park with their hand-selected flower line—notably, the anti-inflammatory and CBD-rich hybrid CBD Blue Shark. Cultivated by independent growers, we love Marley Natural’s dedication to craft cannabis, their commitment to sustainable growing practices, and their RISE UP social justice program.\nBlack Cherry Soda by Royal Tree Gardens\nAvailable in: Washington\nHaving built a facility from the ground up, Washington’s Royal Tree Gardens is a company steeped in perseverance. Licensed since 2014, Royal Tree Farms has been producing fantastic cannabis ever since, and their sativa-dominant Black Cherry Soda is no exception. We’ve been packing our bowls with this strain for its potent relief, particularly for the medical patients among us.\nDo-Si-Dos by Matrix NV\nAvailable in: Nevada\nOne of the best in medical-grade cannabis production, Nevada’s Matrix NV keeps their focus on the people who will consume their products, and that’s why we love them. Their flower, including the deliciously heavy indica Do-Si-Dos, is cared for by a team of passionate people who use purified and organic products to cultivate their hand-trimmed flower collection.\nAlso featured in: Leafly TV’s Growers: Episode 101\n\nOrange Blossom by Falcanna\nAvailable in: Washington\nA small medical operation turned Tier III licensed producer, Falcanna has seen it all when comes to cannabis—from the garden to the shop. Their dedication to the herb started as a dream between founders Bethany and Justin Rondeau and turned into a full grow facility delivering exceptional cannabis across Washington State. Their bright, floral hybrid Orange Blossom is as tasty as it is elevating and provides a perfect example of their dedication to quality flower.\nWhite Tahoe Cookies by Archive Portland\nAvailable in: Oregon\nWith multiple awards under their belt, Archive Portland boasts a team of growers with over 35 years of collective cannabis growing experience. That dedication to quality trickles down to the buds, where the exceptional indica White Tahoe Cookies takes on a smooth sedative high that keeps us coming back for more.\nLemonder by Seattle’s Private Reserve\nAvailable in: Washington\nWe save Seattle’s Private Reserve flower for special occasions; grown in a facility that is tightly sealed and meticulously controlled, the euphoric hybrid Lemonder has found its way into our stash boxes and smoke circles throughout 2017. SPR’s rigorous testing of all their cannabis products lets us consume with full peace of mind.\nLead image by Nastasic/iStock\n*Editor’s note: Leafly and Marley Natural are owned by the same parent company. Also, Marley Natural Red is available in California, Oregon, and Washington but may be a different high-CBD strain in each market.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/19103646/leafly-faves-flower.jpg",
            "title": "Leafly’s Faves 2017: Flower",
            "urlslug": "/news/strains-products/leaflys-faves-2017-flower"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1513640241000)/",
            "id": "contentitems-52211",
            "text": "Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis strains of 2017. How many have you tried? What was your favorite strain of 2017? Share with us in the comments below!\n\nPlushberry\nAn introspective indica that won’t put you to sleep, Plushberry is the perfect strain for enjoying some peace and quiet. Relax with the aroma of lavender wrapped up in this cross of two more of our faves: Space Queen and Black Cherry Soda.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\n11 Unsung Cannabis Strains Worth Discovering\n\nLemonder\nFor a light, euphoric strain that offers bright flavors of lemon and pine, track down the balanced Seattle-native hybrid Lemonder. A cross between Lavender, Super Lemon Haze, and OG Kush, we love its mentally stimulating qualities that don’t overwhelm.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\nWhat Are You Smoking? Episode 18\nThe Top THC-Dominant Strains of Washington State in Fall 2017\n\nAllen Wrench\nA child of popular parents (Trainwreck and NYC Diesel), the sour sativa Allen Wrench packs a punch of upbeat energy. We love harnessing its powerful cerebral qualities and energy-boosting characteristics on busy days.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\n6 Cannabis Strains to Help You Stay Productive\nThese Cannabis Strains All Have Unique Cannabinoids\n\n\nDutchberry\nRinging in at around 8% CBD and 27% THC, the giggle-inducing hybrid Dutchberry takes on the best attributes of its Dutch Treat and DJ Short Blueberry parents. A particularly delicious strain, we can’t get enough of the berry and citrus flavors that accompany this happy high.\nAlso featured in: Smoke This, Play That Vol. 4\nSunset Sherbet\nThe potent hybrid Sunset Sherbet is a powerful, full-body strain that will take you to new heights with its cerebral stimulation. We’ve been filling our bongs with a hefty dose to melt away stress and bask in a richly euphoric high.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\nThe 10 Cannabis Strains You Must Try This Summer\nTop Trending Strains of 2015\nTips for Growing Sunset Sherbet Cannabis\n\nDark Side of the Moon\nInspired by the famous Pink Floyd album, Dark Side of The Moon is a sweet indica that we like to reserve for right before bedtime. For the perfect nightcap after a stressful day, we recommend packing your favorite pipe and slipping into an elevated slumber.\nAlso featured in: May the Fourth Be With You: The Best Strains to Celebrate the Galactic Star Wars Holiday\n\nSpace Queen\nWith sweet dessert aromas including notes of vanilla, cherry, and apple, the hybrid Space Queen helped us stay upbeat in 2017. Perfect for daytime use, Space Queen’s sativa qualities deliver a buzzy kick that will keep you going (despite its indica Romulan roots).\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\nCelebrate 10 Famous 4/20 Birthdays With These Strain Pairings\nWhich Cannabis Strain Pairs Best With your Zodiac Sign?\n7 ‘Eye Candy’ Movies to Pair With Your Favorite Strain\n\nWhite Tahoe Cookies\nThe strong indica that is White Tahoe Cookies was practically made for lazy days. With sedative effects that build with each hit, you’ll want to park somewhere comfortable and clear your schedule for a cozy day in (we’ve found White Tahoe Cookies to be very hyggelig).\nHarlequin\nThe CBD-rich sativa Harlequin delivers a stress-melting 5:2 CBD:THC ratio that expertly crushes anxiety and pain without the intoxicating effects. A Columbia Gold and Swiss landrace descendant, Harlequin is a preferred strain for those among us who are medical patients as well as the many of us who simply love CBD.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\nTips for Growing Harlequin Cannabis\n7 High-Energy Strains to Help You Get Active and Fight Fatigue\nHigh CBD Products for Medical Marijuana Patients\nWhat Are the Best Cannabis Stains for Pain?\n\n\nDancehall\nSuitable for social gatherings and celebratory occasions, the hybrid Dancehall is an aptly named energy-boosting strain. We’ve been loading up our vaporizers before concerts, parties, festivals, and all manner of exciting events.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\n11 Unsung Cannabis Strains Worth Discovering\n\nPurple Trainwreck\nBorn from the powerhouse combination of Trainwreck and Mendocino Purps, hybrid Purple Trainwreck is the go-to strain for laughing fits and cerebral stimulation. We’ve been keeping it on hand for its tasty notes of pine, lavender, and citrus.\nAlso featured in:\n\nTips for Growing Purple Trainwreck Cannabis\n10 Products to Pick Up Before 4/20\nThe 10 Cannabis Strains You Must Try This Summer\n\nLead image by Julia Sumpter/Leafly",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/18151942/leafly-faves-strains-2017.jpg",
            "title": "Leafly's Faves 2017: Strains",
            "urlslug": "/news/strains-products/leaflys-faves-2017-strains"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 29.297328687572588
        },
        {
            "name": "PTSD",
            "score": 8.115563298490128
        },
        {
            "name": "ADD/ADHD",
            "score": 7.505807200929152
        },
        {
            "name": "Migraines",
            "score": 7.200929152148664
        },
        {
            "name": "PMS",
            "score": 6.286295005807201
        }
    ],
    "description": "<p>Dutchberry is a 60/40 sativa-dominant hybrid strain from Artizen Cannabis in Lacey, WA. Combining <a href=\"https://www.leafly.com/hybrid/dutch-treat\">Dutch Treat</a> and <a href=\"https://www.leafly.com/indica/dj-short-blueberry\">DJ Short&rsquo;s Blueberry</a>, this hybrid is loaded with citrus and berry flavors that taste as good as it smells. With a chemical profile that falls around 27% THC and 8% <a href=\"https://www.leafly.com/news/cannabis-101/whats-the-deal-with-these-high-cbd-strains\">CBD</a>, Dutchberry has one of the highest <a href=\"https://www.leafly.com/news/cannabis-101/cannabinoids-101-what-makes-cannabis-medicine\">cannabinoid</a> contents available in the marketplace today. The high CBD content helps modify the extreme THC content to produce a happy, giggly high perfect for unwinding after a long day at work.</p>\n",
    "descriptionPlain": "Dutchberry is a 60/40 sativa-dominant hybrid strain from Artizen Cannabis in Lacey, WA. Combining Dutch Treat and DJ Short&rsquo;s Blueberry, this hybrid is loaded with citrus and berry flavors that taste as good as it smells. With a chemical profile that falls around 27% THC and 8% CBD, Dutchberry has one of the highest cannabinoid contents available in the marketplace today. The high CBD content helps modify the extreme THC content to produce a happy, giggly high perfect for unwinding after a long day at work.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 143.45238095238096
        },
        {
            "name": "Euphoric",
            "score": 86.80313588850173
        },
        {
            "name": "Creative",
            "score": 75.4500580720093
        },
        {
            "name": "Focused",
            "score": 63.545296167247386
        },
        {
            "name": "Uplifted",
            "score": 62.44192799070848
        }
    ],
    "flavors": [
        {
            "name": "Berry",
            "score": 64.57607433217188
        },
        {
            "name": "Sweet",
            "score": 34.36411149825784
        },
        {
            "name": "Blueberry",
            "score": 24.477351916376307
        },
        {
            "name": "Lemon",
            "score": 19.047619047619044
        },
        {
            "name": "Nutty",
            "score": 17.27642276422764
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1383404,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I definitely consider this top shelf bud when grown by Artizen. This is a great Sativa hybrid plenty of energy and focus mixed in with a little overall body relaxation and some pressure behind the eyes. The buds look absolutely amazing they're dense and frosty to the extreme also quite sticky and resinous. It smells sweet and citrus and when a put some in a grinder it is extremely pungent and skunky (like really good weed should). Deffinetly more of a get out and get things done kinda strain not so much the kick back and watch some Netflix kind, still perfect for during the work week. This is an awesome strain that can usually be picked up for around 50 bucks with the prices the way they are right now this is a great deal if you're looking for a Sativa hybrid. ",
            "username": "NSomniac"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sprevdc92bvNKojx0pps2BUvIVU=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fybBOy14QEGEFlO94pZSC_DH420logoNOBKG.png",
            "id": 1631048,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Rich and smooth scent and flavor, slight hint of berry.  Dreamy euphoric high.",
            "username": "DestinationHwy420"
        }
    ],
    "id": 213871,
    "name": "Dutchberry",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 29.239256678281066
        },
        {
            "name": "Dry Eyes",
            "score": 20.572009291521482
        },
        {
            "name": "Anxious",
            "score": 5.676538908246226
        },
        {
            "name": "Paranoid",
            "score": 3.90534262485482
        },
        {
            "name": "Dizzy",
            "score": 0.6097560975609756
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/dutch-treat",
            "category": "Hybrid",
            "name": "Dutch Treat",
            "permalink": "https://mobileapi.leafly.com/hybrid/dutch-treat",
            "slug": "dutch-treat",
            "subtitle": null,
            "symbol": "Dt"
        },
        {
            "applink": "leafly://strain/dj-short-blueberry",
            "category": "Indica",
            "name": "DJ Short Blueberry",
            "permalink": "https://mobileapi.leafly.com/indica/dj-short-blueberry",
            "slug": "dj-short-blueberry",
            "subtitle": null,
            "symbol": "Dsb"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/dutchberry",
    "photoTotalCount": 6,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/553294/b/dutchberry__primary_d55f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dutchberry_100x100_b400.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/529261/b/dutchberry__primary_969f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dutchberry_100x100_49e0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/493869/b/dutchberry__primary_b194.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dutchberry_100x100_ccdb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/493899/b/dutchberry__primary_004f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dutchberry_100x100_8bef.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/490571/b/dutchberry__primary_969f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dutchberry_100x100_d6e5.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/464021/b/dutchberry__primary_eef7.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dutchberry_100x100_cd0e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Lynnwood, WA",
        "Everett, WA",
        "Tacoma, WA",
        "Spokane Valley, WA",
        "Spokane, WA",
        "Airway Heights, WA",
        "Longview, WA",
        "Medford, OR",
        "Mount Vernon, WA"
    ],
    "rating": 4.52,
    "relatedStrains": [],
    "reviewCount": 84,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "dutchberry",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.52380952380952/240",
    "subtitle": null,
    "symbol": "Dby",
    "symptoms": [
        {
            "name": "Depression",
            "score": 47.12543554006968
        },
        {
            "name": "Stress",
            "score": 34.36411149825784
        },
        {
            "name": "Lack of Appetite",
            "score": 28.019744483159116
        },
        {
            "name": "Pain",
            "score": 27.163182346109174
        },
        {
            "name": "Headaches",
            "score": 14.953542392566781
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
