{"sl_translate":"description,descriptionPlain,category","id":245104,"slug":"blueberry-pie","name":"Blueberry Pie","subtitle":null,"symbol":"Bp","category":"Hybrid","description":"\u003cp\u003eBlueberry Pie is the indica-dominant hybrid of two famous strains, \u003ca href=\"https://www.leafly.com/hybrid/girl-scout-cookie\"\u003eGirl Scout Cookies\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of Girl Scout Cookies, amounting to a strain that shrugs off stress and mutes mild physical discomfort.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Blueberry Pie is the indica-dominant hybrid of two famous strains, Girl Scout Cookies and Blue Dream. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of Girl Scout Cookies, amounting to a strain that shrugs off stress and mutes mild physical discomfort.\u0026nbsp;\n\n\u0026nbsp;\n","aka":null,"rating":4.4,"highlightedReviews":[{"id":1415946,"username":"potprincess2000","text":"I\u0027m really surprised more people haven\u0027t reviewed this strain! Blue Dream x Girl Scout Cookies couldn\u0027t be a more perfect cross. It\u0027s super yummy too, leaving a noticeable sugary taste in your mouth.Two strains renowned for their pain reliving effects and euphoric happiness combine to create a powerhouse flower. This is one of those strains that makes you happy to be alive. Great for depression, stress, and pain. It finishes off with a pleasant drowsiness good for sleep and relaxation. The high at first however, can be a little intense (very strong parent strains) so probably not for inexperienced users.\nFollow me on insta @weedtalkmtl and @potprincess2000 for more cannabis content and reviews.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1631116,"username":"xgene84985x","text":"seriously great strain... highly recommend it for depression","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-34817","title":"5 Rustic Americana Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1500942707000)\/","text":"Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg","urlslug":"/news/lifestyle/americana-albums-listen-high"},{"id":"contentitems-7797","title":"New Strains Alert: Space Cream, Mother\u0027s Milk, Pink Lemonade, and More","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1474651043000)\/","text":"This week’s New Strains Alert is a full house of hybrid buds that reach toward indica or sativa dominance but don’t quite hit the mark. That’s not to say the effects of these strains are weak or without nuance, but rather an illustration of the middle ground they inhabit with their complementary mental and physical attributes. For example, Space Cream’s mental alertness and functional body buzz meld together to offer the best of both worlds, while Mother’s Milk is a situation-specific hybrid that is adaptable to the consumer’s activity by being equal parts heady and sedative. These are just a couple examples, but you too can craft your own hybrid “salad bowl” by mixing strains together.\n   Space Cream\nSpace Cream by Hotsause Genetics is an indica-dominant hybrid with surprisingly uplifting effects. This strain keeps the consumer alert, but hazy mental effects may make it difficult to articulate that alertness. In a way, it gives your mind couchlock while allowing the body to roam unencumbered. It is ideal for social settings and for patients seeking relief from mild pain, depression, and mood swings. Expect an odor of citrus blossom, pine, and hops which blend into a creamy sweetness on the exhale.\n   Mother’s Milk\nMother’s Milk is the sativa-dominant hybrid of Nepali OG and Appalachia. This potent strain smells of powdered milk and delicate earthy terpenes and is layered in a coat of sparkling trichomes. Its effects possess tranquil sedation that is also heady and functional, lending itself to either activity or relaxation. Indulge in Mother’s Milk to help curb minor physical pain, muscle spasms, and depression.\n   Pink Lemonade\nPink Lemonade is a tart sativa-dominant hybrid that adheres to its namesake in flavor and smell. This strain smells of fruity, mentholated tea and screams tart lemons and grapefruit on the exhale. The bud is coated in a generous layer of trichomes atop jade foliage and bronze pistils. Pink Lemonade instantly puts the mind into a haze and settles over the body with calming warmth. This all-day strain is ideal for consumers seeking a functional option to take the edge off repetitive tasks, stress, and depression.\n \n   Blueberry Pie\nBlueberry Pie is the indica-dominant hybrid of two famous strains, GSC (f.k.a Girl Scout Cookies) and Blue Dream. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of GSC (f.k.a Girl Scout Cookies), amounting to a strain that shrugs off stress and mutes mild physical discomfort.\n \n   White Sangria\nWhite Sangria is the functional indica-dominant hybrid cross of Tahoe Hydro OG and Gelato 45. This strain’s buds are bright green with facets of purple throughout and emanates an aroma of pine, citrus, and sweetness. The buzz is happy and uplifting while leaving the body cozy and collected. Its effects are perfect for patients seeking relief from depression, anxiety, and minor physical discomfort. However, with continued use, this strain can take on a semi-sedative quality and lead to more pervasive relaxation.\n \n   R-4\nR-4, also known as Cindy’s Solution, is a CBD-dominant strain with exceptional therapeutic benefits. With a THC/CBD ratio of 1:40, R-4 sits firmly in the medical category, catering to consumers seeking relief from muscle spasms, chronic physical pain, nausea, and a shortlist of other ailments dulled by high quantities of CBD. This strain smells of chocolate and earth intermixed with a gentle floral undertone. Enjoy R-4 at any time in the day as the psychoactive ingredients are kept to a minimum.\n \n   Aspen OG\nAspen OG by 303 Seeds is a testament to how rich the Rocky’s cannabis heritage really is. This Sour Cream and SFV OG cross “is sweet like Aspen in the summer and coated white like Aspen in the winter,” topped with glistening trichomes that shimmer like snow. Aspen OG combines physical elements from each parent to easily curb moderate pain and stimulate the appetite. Expect earthy flavors with a sweet berry undertone.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/23101610/new-strains-alert-9-23-2016.jpg","urlslug":"/news/strains-products/new-strains-alert-space-cream-mothers-milk-pink-lemonade"}],"reviewCount":55,"flavors":[{"name":"Blueberry","score":57.961538461538467},{"name":"Berry","score":44.769230769230774},{"name":"Sweet","score":25.884615384615387},{"name":"Pungent","score":20.384615384615387},{"name":"Tree Fruit","score":15.384615384615385}],"effects":[{"name":"Relaxed","score":90.34615384615384},{"name":"Happy","score":86.84615384615384},{"name":"Uplifted","score":65.461538461538467},{"name":"Euphoric","score":58.269230769230774},{"name":"Hungry","score":38.884615384615387}],"symptoms":[{"name":"Stress","score":46.07692307692308},{"name":"Pain","score":33.384615384615387},{"name":"Depression","score":25.884615384615387},{"name":"Insomnia","score":24.692307692307693},{"name":"Seizures","score":24.076923076923077}],"conditions":[{"name":"Anxiety","score":40.57692307692308},{"name":"PTSD","score":26.076923076923077},{"name":"Epilepsy","score":18.884615384615387},{"name":"Spinal Cord Injury","score":18.884615384615387},{"name":"ADD/ADHD","score":18.384615384615387}],"negatives":[{"name":"Dry Mouth","score":28.384615384615387},{"name":"Dry Eyes","score":26.384615384615387},{"name":"Dizzy","score":10.192307692307693},{"name":"Anxious","score":0.5}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_f25a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003404/b/blueberry-pie__primary_e16a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_930e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/635722/b/blueberry-pie__primary_0638.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_e394.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/631930/b/blueberry-pie__primary_06b3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_0190.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/619095/b/blueberry-pie__primary_21fd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_cce5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/595723/b/blueberry-pie__primary_ef08.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_7869.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/590258/b/blueberry-pie__primary_5936.jpg"}],"photoTotalCount":9,"popularCities":["Portland, OR","Detroit, MI","Eugene, OR","McMinnville, OR","Aberdeen, WA","Airway Heights, WA","Albany, OR","Brampton, ON","Calgary, AB","Denver, CO"],"permalink":"https://mobileapi.leafly.com/hybrid/blueberry-pie","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.4/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Girl Scout Cookies","subtitle":null,"slug":"girl-scout-cookie","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/girl-scout-cookie","symbol":"Gsc","applink":"leafly://strain/girl-scout-cookie"},{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":245104,"slug":"blueberry-pie","name":"Blueberry Pie","subtitle":null,"symbol":"Bp","category":"Hybrid","description":"\u003cp\u003eBlueberry Pie is the indica-dominant hybrid of two famous strains, \u003ca href=\"https://www.leafly.com/hybrid/girl-scout-cookie\"\u003eGirl Scout Cookies\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of Girl Scout Cookies, amounting to a strain that shrugs off stress and mutes mild physical discomfort.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Blueberry Pie is the indica-dominant hybrid of two famous strains, Girl Scout Cookies and Blue Dream. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of Girl Scout Cookies, amounting to a strain that shrugs off stress and mutes mild physical discomfort.\u0026nbsp;\n\n\u0026nbsp;\n","aka":null,"rating":4.4,"highlightedReviews":[{"id":1415946,"username":"potprincess2000","text":"I\u0027m really surprised more people haven\u0027t reviewed this strain! Blue Dream x Girl Scout Cookies couldn\u0027t be a more perfect cross. It\u0027s super yummy too, leaving a noticeable sugary taste in your mouth.Two strains renowned for their pain reliving effects and euphoric happiness combine to create a powerhouse flower. This is one of those strains that makes you happy to be alive. Great for depression, stress, and pain. It finishes off with a pleasant drowsiness good for sleep and relaxation. The high at first however, can be a little intense (very strong parent strains) so probably not for inexperienced users.\nFollow me on insta @weedtalkmtl and @potprincess2000 for more cannabis content and reviews.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1631116,"username":"xgene84985x","text":"seriously great strain... highly recommend it for depression","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-34817","title":"5 Rustic Americana Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1500942707000)\/","text":"Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg","urlslug":"/news/lifestyle/americana-albums-listen-high"},{"id":"contentitems-7797","title":"New Strains Alert: Space Cream, Mother\u0027s Milk, Pink Lemonade, and More","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1474651043000)\/","text":"This week’s New Strains Alert is a full house of hybrid buds that reach toward indica or sativa dominance but don’t quite hit the mark. That’s not to say the effects of these strains are weak or without nuance, but rather an illustration of the middle ground they inhabit with their complementary mental and physical attributes. For example, Space Cream’s mental alertness and functional body buzz meld together to offer the best of both worlds, while Mother’s Milk is a situation-specific hybrid that is adaptable to the consumer’s activity by being equal parts heady and sedative. These are just a couple examples, but you too can craft your own hybrid “salad bowl” by mixing strains together.\n   Space Cream\nSpace Cream by Hotsause Genetics is an indica-dominant hybrid with surprisingly uplifting effects. This strain keeps the consumer alert, but hazy mental effects may make it difficult to articulate that alertness. In a way, it gives your mind couchlock while allowing the body to roam unencumbered. It is ideal for social settings and for patients seeking relief from mild pain, depression, and mood swings. Expect an odor of citrus blossom, pine, and hops which blend into a creamy sweetness on the exhale.\n   Mother’s Milk\nMother’s Milk is the sativa-dominant hybrid of Nepali OG and Appalachia. This potent strain smells of powdered milk and delicate earthy terpenes and is layered in a coat of sparkling trichomes. Its effects possess tranquil sedation that is also heady and functional, lending itself to either activity or relaxation. Indulge in Mother’s Milk to help curb minor physical pain, muscle spasms, and depression.\n   Pink Lemonade\nPink Lemonade is a tart sativa-dominant hybrid that adheres to its namesake in flavor and smell. This strain smells of fruity, mentholated tea and screams tart lemons and grapefruit on the exhale. The bud is coated in a generous layer of trichomes atop jade foliage and bronze pistils. Pink Lemonade instantly puts the mind into a haze and settles over the body with calming warmth. This all-day strain is ideal for consumers seeking a functional option to take the edge off repetitive tasks, stress, and depression.\n \n   Blueberry Pie\nBlueberry Pie is the indica-dominant hybrid of two famous strains, GSC (f.k.a Girl Scout Cookies) and Blue Dream. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of GSC (f.k.a Girl Scout Cookies), amounting to a strain that shrugs off stress and mutes mild physical discomfort.\n \n   White Sangria\nWhite Sangria is the functional indica-dominant hybrid cross of Tahoe Hydro OG and Gelato 45. This strain’s buds are bright green with facets of purple throughout and emanates an aroma of pine, citrus, and sweetness. The buzz is happy and uplifting while leaving the body cozy and collected. Its effects are perfect for patients seeking relief from depression, anxiety, and minor physical discomfort. However, with continued use, this strain can take on a semi-sedative quality and lead to more pervasive relaxation.\n \n   R-4\nR-4, also known as Cindy’s Solution, is a CBD-dominant strain with exceptional therapeutic benefits. With a THC/CBD ratio of 1:40, R-4 sits firmly in the medical category, catering to consumers seeking relief from muscle spasms, chronic physical pain, nausea, and a shortlist of other ailments dulled by high quantities of CBD. This strain smells of chocolate and earth intermixed with a gentle floral undertone. Enjoy R-4 at any time in the day as the psychoactive ingredients are kept to a minimum.\n \n   Aspen OG\nAspen OG by 303 Seeds is a testament to how rich the Rocky’s cannabis heritage really is. This Sour Cream and SFV OG cross “is sweet like Aspen in the summer and coated white like Aspen in the winter,” topped with glistening trichomes that shimmer like snow. Aspen OG combines physical elements from each parent to easily curb moderate pain and stimulate the appetite. Expect earthy flavors with a sweet berry undertone.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/23101610/new-strains-alert-9-23-2016.jpg","urlslug":"/news/strains-products/new-strains-alert-space-cream-mothers-milk-pink-lemonade"}],"reviewCount":55,"flavors":[{"name":"Blueberry","score":57.961538461538467},{"name":"Berry","score":44.769230769230774},{"name":"Sweet","score":25.884615384615387},{"name":"Pungent","score":20.384615384615387},{"name":"Tree Fruit","score":15.384615384615385}],"effects":[{"name":"Relaxed","score":90.34615384615384},{"name":"Happy","score":86.84615384615384},{"name":"Uplifted","score":65.461538461538467},{"name":"Euphoric","score":58.269230769230774},{"name":"Hungry","score":38.884615384615387}],"symptoms":[{"name":"Stress","score":46.07692307692308},{"name":"Pain","score":33.384615384615387},{"name":"Depression","score":25.884615384615387},{"name":"Insomnia","score":24.692307692307693},{"name":"Seizures","score":24.076923076923077}],"conditions":[{"name":"Anxiety","score":40.57692307692308},{"name":"PTSD","score":26.076923076923077},{"name":"Epilepsy","score":18.884615384615387},{"name":"Spinal Cord Injury","score":18.884615384615387},{"name":"ADD/ADHD","score":18.384615384615387}],"negatives":[{"name":"Dry Mouth","score":28.384615384615387},{"name":"Dry Eyes","score":26.384615384615387},{"name":"Dizzy","score":10.192307692307693},{"name":"Anxious","score":0.5}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_f25a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003404/b/blueberry-pie__primary_e16a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_930e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/635722/b/blueberry-pie__primary_0638.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_e394.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/631930/b/blueberry-pie__primary_06b3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_0190.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/619095/b/blueberry-pie__primary_21fd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_cce5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/595723/b/blueberry-pie__primary_ef08.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_7869.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/590258/b/blueberry-pie__primary_5936.jpg"}],"photoTotalCount":9,"popularCities":["Portland, OR","Detroit, MI","Eugene, OR","McMinnville, OR","Aberdeen, WA","Airway Heights, WA","Albany, OR","Brampton, ON","Calgary, AB","Denver, CO"],"permalink":"https://mobileapi.leafly.com/hybrid/blueberry-pie","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.4/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Girl Scout Cookies","subtitle":null,"slug":"girl-scout-cookie","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/girl-scout-cookie","symbol":"Gsc","applink":"leafly://strain/girl-scout-cookie"},{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":245104,"slug":"blueberry-pie","name":"Blueberry Pie","subtitle":null,"symbol":"Bp","category":"Hybrid","description":"\u003cp\u003eBlueberry Pie is the indica-dominant hybrid of two famous strains, \u003ca href=\"https://www.leafly.com/hybrid/girl-scout-cookie\"\u003eGirl Scout Cookies\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of Girl Scout Cookies, amounting to a strain that shrugs off stress and mutes mild physical discomfort.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Blueberry Pie is the indica-dominant hybrid of two famous strains, Girl Scout Cookies and Blue Dream. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of Girl Scout Cookies, amounting to a strain that shrugs off stress and mutes mild physical discomfort.\u0026nbsp;\n\n\u0026nbsp;\n","aka":null,"rating":4.4,"highlightedReviews":[{"id":1415946,"username":"potprincess2000","text":"I\u0027m really surprised more people haven\u0027t reviewed this strain! Blue Dream x Girl Scout Cookies couldn\u0027t be a more perfect cross. It\u0027s super yummy too, leaving a noticeable sugary taste in your mouth.Two strains renowned for their pain reliving effects and euphoric happiness combine to create a powerhouse flower. This is one of those strains that makes you happy to be alive. Great for depression, stress, and pain. It finishes off with a pleasant drowsiness good for sleep and relaxation. The high at first however, can be a little intense (very strong parent strains) so probably not for inexperienced users.\nFollow me on insta @weedtalkmtl and @potprincess2000 for more cannabis content and reviews.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1631116,"username":"xgene84985x","text":"seriously great strain... highly recommend it for depression","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-34817","title":"5 Rustic Americana Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1500942707000)\/","text":"Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg","urlslug":"/news/lifestyle/americana-albums-listen-high"},{"id":"contentitems-7797","title":"New Strains Alert: Space Cream, Mother\u0027s Milk, Pink Lemonade, and More","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1474651043000)\/","text":"This week’s New Strains Alert is a full house of hybrid buds that reach toward indica or sativa dominance but don’t quite hit the mark. That’s not to say the effects of these strains are weak or without nuance, but rather an illustration of the middle ground they inhabit with their complementary mental and physical attributes. For example, Space Cream’s mental alertness and functional body buzz meld together to offer the best of both worlds, while Mother’s Milk is a situation-specific hybrid that is adaptable to the consumer’s activity by being equal parts heady and sedative. These are just a couple examples, but you too can craft your own hybrid “salad bowl” by mixing strains together.\n   Space Cream\nSpace Cream by Hotsause Genetics is an indica-dominant hybrid with surprisingly uplifting effects. This strain keeps the consumer alert, but hazy mental effects may make it difficult to articulate that alertness. In a way, it gives your mind couchlock while allowing the body to roam unencumbered. It is ideal for social settings and for patients seeking relief from mild pain, depression, and mood swings. Expect an odor of citrus blossom, pine, and hops which blend into a creamy sweetness on the exhale.\n   Mother’s Milk\nMother’s Milk is the sativa-dominant hybrid of Nepali OG and Appalachia. This potent strain smells of powdered milk and delicate earthy terpenes and is layered in a coat of sparkling trichomes. Its effects possess tranquil sedation that is also heady and functional, lending itself to either activity or relaxation. Indulge in Mother’s Milk to help curb minor physical pain, muscle spasms, and depression.\n   Pink Lemonade\nPink Lemonade is a tart sativa-dominant hybrid that adheres to its namesake in flavor and smell. This strain smells of fruity, mentholated tea and screams tart lemons and grapefruit on the exhale. The bud is coated in a generous layer of trichomes atop jade foliage and bronze pistils. Pink Lemonade instantly puts the mind into a haze and settles over the body with calming warmth. This all-day strain is ideal for consumers seeking a functional option to take the edge off repetitive tasks, stress, and depression.\n \n   Blueberry Pie\nBlueberry Pie is the indica-dominant hybrid of two famous strains, GSC (f.k.a Girl Scout Cookies) and Blue Dream. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of GSC (f.k.a Girl Scout Cookies), amounting to a strain that shrugs off stress and mutes mild physical discomfort.\n \n   White Sangria\nWhite Sangria is the functional indica-dominant hybrid cross of Tahoe Hydro OG and Gelato 45. This strain’s buds are bright green with facets of purple throughout and emanates an aroma of pine, citrus, and sweetness. The buzz is happy and uplifting while leaving the body cozy and collected. Its effects are perfect for patients seeking relief from depression, anxiety, and minor physical discomfort. However, with continued use, this strain can take on a semi-sedative quality and lead to more pervasive relaxation.\n \n   R-4\nR-4, also known as Cindy’s Solution, is a CBD-dominant strain with exceptional therapeutic benefits. With a THC/CBD ratio of 1:40, R-4 sits firmly in the medical category, catering to consumers seeking relief from muscle spasms, chronic physical pain, nausea, and a shortlist of other ailments dulled by high quantities of CBD. This strain smells of chocolate and earth intermixed with a gentle floral undertone. Enjoy R-4 at any time in the day as the psychoactive ingredients are kept to a minimum.\n \n   Aspen OG\nAspen OG by 303 Seeds is a testament to how rich the Rocky’s cannabis heritage really is. This Sour Cream and SFV OG cross “is sweet like Aspen in the summer and coated white like Aspen in the winter,” topped with glistening trichomes that shimmer like snow. Aspen OG combines physical elements from each parent to easily curb moderate pain and stimulate the appetite. Expect earthy flavors with a sweet berry undertone.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/23101610/new-strains-alert-9-23-2016.jpg","urlslug":"/news/strains-products/new-strains-alert-space-cream-mothers-milk-pink-lemonade"}],"reviewCount":55,"flavors":[{"name":"Blueberry","score":57.961538461538467},{"name":"Berry","score":44.769230769230774},{"name":"Sweet","score":25.884615384615387},{"name":"Pungent","score":20.384615384615387},{"name":"Tree Fruit","score":15.384615384615385}],"effects":[{"name":"Relaxed","score":90.34615384615384},{"name":"Happy","score":86.84615384615384},{"name":"Uplifted","score":65.461538461538467},{"name":"Euphoric","score":58.269230769230774},{"name":"Hungry","score":38.884615384615387}],"symptoms":[{"name":"Stress","score":46.07692307692308},{"name":"Pain","score":33.384615384615387},{"name":"Depression","score":25.884615384615387},{"name":"Insomnia","score":24.692307692307693},{"name":"Seizures","score":24.076923076923077}],"conditions":[{"name":"Anxiety","score":40.57692307692308},{"name":"PTSD","score":26.076923076923077},{"name":"Epilepsy","score":18.884615384615387},{"name":"Spinal Cord Injury","score":18.884615384615387},{"name":"ADD/ADHD","score":18.384615384615387}],"negatives":[{"name":"Dry Mouth","score":28.384615384615387},{"name":"Dry Eyes","score":26.384615384615387},{"name":"Dizzy","score":10.192307692307693},{"name":"Anxious","score":0.5}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_f25a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003404/b/blueberry-pie__primary_e16a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_930e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/635722/b/blueberry-pie__primary_0638.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_e394.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/631930/b/blueberry-pie__primary_06b3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_0190.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/619095/b/blueberry-pie__primary_21fd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_cce5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/595723/b/blueberry-pie__primary_ef08.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_7869.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/590258/b/blueberry-pie__primary_5936.jpg"}],"photoTotalCount":9,"popularCities":["Portland, OR","Detroit, MI","Eugene, OR","McMinnville, OR","Aberdeen, WA","Airway Heights, WA","Albany, OR","Brampton, ON","Calgary, AB","Denver, CO"],"permalink":"https://mobileapi.leafly.com/hybrid/blueberry-pie","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.4/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Girl Scout Cookies","subtitle":null,"slug":"girl-scout-cookie","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/girl-scout-cookie","symbol":"Gsc","applink":"leafly://strain/girl-scout-cookie"},{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":245104,"slug":"blueberry-pie","name":"Blueberry Pie","subtitle":null,"symbol":"Bp","category":"Hybrid","description":"\u003cp\u003eBlueberry Pie is the indica-dominant hybrid of two famous strains, \u003ca href=\"https://www.leafly.com/hybrid/girl-scout-cookie\"\u003eGirl Scout Cookies\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of Girl Scout Cookies, amounting to a strain that shrugs off stress and mutes mild physical discomfort.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Blueberry Pie is the indica-dominant hybrid of two famous strains, Girl Scout Cookies and Blue Dream. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of Girl Scout Cookies, amounting to a strain that shrugs off stress and mutes mild physical discomfort.\u0026nbsp;\n\n\u0026nbsp;\n","aka":null,"rating":4.4,"highlightedReviews":[{"id":1415946,"username":"potprincess2000","text":"I\u0027m really surprised more people haven\u0027t reviewed this strain! Blue Dream x Girl Scout Cookies couldn\u0027t be a more perfect cross. It\u0027s super yummy too, leaving a noticeable sugary taste in your mouth.Two strains renowned for their pain reliving effects and euphoric happiness combine to create a powerhouse flower. This is one of those strains that makes you happy to be alive. Great for depression, stress, and pain. It finishes off with a pleasant drowsiness good for sleep and relaxation. The high at first however, can be a little intense (very strong parent strains) so probably not for inexperienced users.\nFollow me on insta @weedtalkmtl and @potprincess2000 for more cannabis content and reviews.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1631116,"username":"xgene84985x","text":"seriously great strain... highly recommend it for depression","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-34817","title":"5 Rustic Americana Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1500942707000)\/","text":"Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg","urlslug":"/news/lifestyle/americana-albums-listen-high"},{"id":"contentitems-7797","title":"New Strains Alert: Space Cream, Mother\u0027s Milk, Pink Lemonade, and More","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1474651043000)\/","text":"This week’s New Strains Alert is a full house of hybrid buds that reach toward indica or sativa dominance but don’t quite hit the mark. That’s not to say the effects of these strains are weak or without nuance, but rather an illustration of the middle ground they inhabit with their complementary mental and physical attributes. For example, Space Cream’s mental alertness and functional body buzz meld together to offer the best of both worlds, while Mother’s Milk is a situation-specific hybrid that is adaptable to the consumer’s activity by being equal parts heady and sedative. These are just a couple examples, but you too can craft your own hybrid “salad bowl” by mixing strains together.\n   Space Cream\nSpace Cream by Hotsause Genetics is an indica-dominant hybrid with surprisingly uplifting effects. This strain keeps the consumer alert, but hazy mental effects may make it difficult to articulate that alertness. In a way, it gives your mind couchlock while allowing the body to roam unencumbered. It is ideal for social settings and for patients seeking relief from mild pain, depression, and mood swings. Expect an odor of citrus blossom, pine, and hops which blend into a creamy sweetness on the exhale.\n   Mother’s Milk\nMother’s Milk is the sativa-dominant hybrid of Nepali OG and Appalachia. This potent strain smells of powdered milk and delicate earthy terpenes and is layered in a coat of sparkling trichomes. Its effects possess tranquil sedation that is also heady and functional, lending itself to either activity or relaxation. Indulge in Mother’s Milk to help curb minor physical pain, muscle spasms, and depression.\n   Pink Lemonade\nPink Lemonade is a tart sativa-dominant hybrid that adheres to its namesake in flavor and smell. This strain smells of fruity, mentholated tea and screams tart lemons and grapefruit on the exhale. The bud is coated in a generous layer of trichomes atop jade foliage and bronze pistils. Pink Lemonade instantly puts the mind into a haze and settles over the body with calming warmth. This all-day strain is ideal for consumers seeking a functional option to take the edge off repetitive tasks, stress, and depression.\n \n   Blueberry Pie\nBlueberry Pie is the indica-dominant hybrid of two famous strains, GSC (f.k.a Girl Scout Cookies) and Blue Dream. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of GSC (f.k.a Girl Scout Cookies), amounting to a strain that shrugs off stress and mutes mild physical discomfort.\n \n   White Sangria\nWhite Sangria is the functional indica-dominant hybrid cross of Tahoe Hydro OG and Gelato 45. This strain’s buds are bright green with facets of purple throughout and emanates an aroma of pine, citrus, and sweetness. The buzz is happy and uplifting while leaving the body cozy and collected. Its effects are perfect for patients seeking relief from depression, anxiety, and minor physical discomfort. However, with continued use, this strain can take on a semi-sedative quality and lead to more pervasive relaxation.\n \n   R-4\nR-4, also known as Cindy’s Solution, is a CBD-dominant strain with exceptional therapeutic benefits. With a THC/CBD ratio of 1:40, R-4 sits firmly in the medical category, catering to consumers seeking relief from muscle spasms, chronic physical pain, nausea, and a shortlist of other ailments dulled by high quantities of CBD. This strain smells of chocolate and earth intermixed with a gentle floral undertone. Enjoy R-4 at any time in the day as the psychoactive ingredients are kept to a minimum.\n \n   Aspen OG\nAspen OG by 303 Seeds is a testament to how rich the Rocky’s cannabis heritage really is. This Sour Cream and SFV OG cross “is sweet like Aspen in the summer and coated white like Aspen in the winter,” topped with glistening trichomes that shimmer like snow. Aspen OG combines physical elements from each parent to easily curb moderate pain and stimulate the appetite. Expect earthy flavors with a sweet berry undertone.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/23101610/new-strains-alert-9-23-2016.jpg","urlslug":"/news/strains-products/new-strains-alert-space-cream-mothers-milk-pink-lemonade"}],"reviewCount":55,"flavors":[{"name":"Blueberry","score":57.961538461538467},{"name":"Berry","score":44.769230769230774},{"name":"Sweet","score":25.884615384615387},{"name":"Pungent","score":20.384615384615387},{"name":"Tree Fruit","score":15.384615384615385}],"effects":[{"name":"Relaxed","score":90.34615384615384},{"name":"Happy","score":86.84615384615384},{"name":"Uplifted","score":65.461538461538467},{"name":"Euphoric","score":58.269230769230774},{"name":"Hungry","score":38.884615384615387}],"symptoms":[{"name":"Stress","score":46.07692307692308},{"name":"Pain","score":33.384615384615387},{"name":"Depression","score":25.884615384615387},{"name":"Insomnia","score":24.692307692307693},{"name":"Seizures","score":24.076923076923077}],"conditions":[{"name":"Anxiety","score":40.57692307692308},{"name":"PTSD","score":26.076923076923077},{"name":"Epilepsy","score":18.884615384615387},{"name":"Spinal Cord Injury","score":18.884615384615387},{"name":"ADD/ADHD","score":18.384615384615387}],"negatives":[{"name":"Dry Mouth","score":28.384615384615387},{"name":"Dry Eyes","score":26.384615384615387},{"name":"Dizzy","score":10.192307692307693},{"name":"Anxious","score":0.5}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_f25a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003404/b/blueberry-pie__primary_e16a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_930e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/635722/b/blueberry-pie__primary_0638.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_e394.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/631930/b/blueberry-pie__primary_06b3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_0190.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/619095/b/blueberry-pie__primary_21fd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_cce5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/595723/b/blueberry-pie__primary_ef08.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pie_100x100_7869.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/590258/b/blueberry-pie__primary_5936.jpg"}],"photoTotalCount":9,"popularCities":["Portland, OR","Detroit, MI","Eugene, OR","McMinnville, OR","Aberdeen, WA","Airway Heights, WA","Albany, OR","Brampton, ON","Calgary, AB","Denver, CO"],"permalink":"https://mobileapi.leafly.com/hybrid/blueberry-pie","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.4/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Girl Scout Cookies","subtitle":null,"slug":"girl-scout-cookie","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/girl-scout-cookie","symbol":"Gsc","applink":"leafly://strain/girl-scout-cookie"},{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
