{
    "aka": "Flow, DJ Short Flo",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1465142400000)/",
            "id": "contentitems-3073",
            "text": "The fortitude demonstrated by cancer patients and survivors is truly remarkable. With numerous reviewers on Leafly using cannabis to combat the effects of various types of cancer, chemotherapy, and related medications, we’re constantly inspired by the positivity, bravery and determination that shines through their stories.\nWe honor these individuals by sharing a small sampling of the strains that have helped cancer patients deal with the physical, emotional, and psychological effects of their condition as they fight toward joining the ranks of hundreds of thousands of cancer survivors across the nation and around the world.\n\n AK-48\n“AK-48 has helped me in so many ways with respect to my cancer. My appetite has resumed as normal, I sleep GREAT, less depression, moments of bliss, less pain and increased level of hope for survival. It is, without a doubt, my personal favorite.” –Good-juju\n Ingrid\n“The first strain I tried for chemotherapy-induced nausea, vomiting and lack of appetite. After first use I went from nearly heaving at the thought of any food to craving – and eating – Mexican food (peppers and all).” –gobby\n ACDC\n“No brain fog, no paranoia, and doesn’t make me want to eat all of the things. I am in remission from cancer and this helps with remaining painful side effects.” –kamina\n Harlequin\n“This is, by far, one of my favorite medicinal strains…there is a complimentary THC content and effect that I find helpful as opposed to purely CBD strains. Mix it with some Sour Diesel (not enough to kill the CBD effects), vape away, and it’s my ‘morning coffee’ when on chemo.” –bravo2kilo\n Blueberry Kush\n“Every time I get this strain, I specifically save it for my friend with cancer. She says it’s her favorite for the pain.” –HebiMidori\n\n Flo\n“My left breast was diagnosed a couple months ago with breast cancer. Flo has me feeling better than I have in the two months…my body is relaxed. I did not realize how much tension I have been holding. The future looks better and easier at the moment. Wow.” –dataqueen11\n Mr. Nice\n“Using this for my back pain and for my golden retriever who has cancer. Works great for both of us!” –dyeager105\n Jack the Ripper\n“Absolutely fantastic sativa! One of the best strains I’ve had in the past 10 years. The high THC content will knock your socks off and the high lasts for 3-4 hours solid. I have brain cancer so I deal with different health issues…and this strain works extremely well controlling pain, nausea, and vertigo.” –jfu5129\n Blueberry\n“Super relaxing, pain relieving, joyful, floaty. I am a cancer survivor, have fibro, serious anxiety, and advanced degenerative disc disease and 17 herniated discs in my spine paired with scoliosis, and I feel like a carefree kid.” –DabaDharma\n \n Chemo\n“My mom is going through chemotherapy…She suffers from extreme appetite loss, nausea and abdominal discomfort from the chemotherapy. She says this strain is incredible for nausea, probably the best she has ever used and induced a great appetite for her instantly. I haven’t seen her in that much relief regarding nausea in ages.” –rachels95\n Black Jack\n“This strain has been like a little miracle in my life. Cancer treatment related pain keeps me from sleeping most nights. I literally was pain free for the entire evening allowing me to finally sleep for the first time in weeks. I’m grateful for Black Jack!!!” –karmagirl\n Sour Diesel\n“I love this strain a lot. I find myself in my own little creative world, giggling, always forgetting what I was doing then remembering…zoning out to music by Soundgarden (“Black Hole Sun”)…I always smoke with my dad because he gets real funny when he’s medicated. He has cancer so it’s better seeing him happy then depressed and in pain. Speaking of, I think he is lost in the kitchen wondering about which entrée he should devour next. I’m gonna go stop him before he eats us out of house and home, or most likely, I will end up eating a tub of ice cream along side him.” –Thecode007",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001531/celebrate-cancer-survivors-day-with-real-patients-go-to-strains.jpg",
            "title": "These Cancer Survivors Share Their Preferred Cannabis Strains",
            "urlslug": "/news/strains-products/celebrate-cancer-survivors-day-with-real-patients-go-to-strains"
        },
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1464998400000)/",
            "id": "contentitems-3249",
            "text": "Check out the new strains added to the Leafly database! This week’s batch hails from Colorado, bringing potency that will have you thinking you’re a mile high. Starting with his superior dankness, Chem Jong Ill, this dictatorial strain demands respect with a potency suited for pros. But if totalitarianism isn’t quite your speed, maybe tuck into some Blueberry Muffins, yielding fruit-forward fire that would make the Pillsbury Doughboy consider cannibalism. A strain named after America’s #1 single of 1976 couldn’t possibility be this potent, right? Wrong! As Afternoon Delight so aptly put it: “…Thinkin’ of you’s working up an appetite,” and then you eat the whole fridge (if you can get off the couch, that is).\nBut there’s more! Check out all our newly added strains and share your experiences in a review!\n \n   1. Chem Jong Ill\n\nThis sativa-dominant cross is for cannabis pros looking to take the top third of their head clean off! Chem Jong Ill is a powerful hybrid by Colorado Seed Inc. that was bred using Chemdawg #4 and Gupta Kush genetics. Built for potency and longevity, this strain is an excellent option for extended physical activity, offering an uplifted, airy high in the body that is easy on the joints. The aroma is thick with a chemical funk and floral notes typical to Kush varieties.\n\n \n   2. Afternoon Delight\n\nAfternoon Delight is a difficult strain to track down. Noted for its small, dense nuggets and an aroma of pine and pungent terpenes, Afternoon Delight is described as an indica-dominant hybrid with a hazy aura that engulfs the mind and body. But indulge with caution, as this hybrid has also been known for its potency.\n\n \n   3. Flo Limone\n\nFlo Limone is Colorado Seed’s twist on a cannabis classic. Flo, the 1996 Cannabis Cup winner known for its light and bright buzz, is crossed against Nina Limone (Super Lemon Haze x Rebel God Smoke) to create an outstanding, full-flavored sativa that is motivating without an aggressive raciness. The terpene profile has also been described as aroma therapeutic, with notes of citrus incense intermixed with Moroccan hash.\n\n \n   4. Blueberry Muffins\n\nBlueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains Afghani and Blueberry. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of — you guessed it — blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea.\n\n \n   5. Slazerbeam\n\nA sativa-dominant hybrid of Super Lemon Haze and Gupta Kush, Slazerbeam is loaded with dense, zesty buds. This combo is sweet and lemony while exhibiting hints of OG Kush on the inhale. The flower also packs potency, with an average THC content above 20%. Count on latent Haze and Kush effects that ground this 70% sativa with functionally heavy body effects.\n\n \n   6. Bootlegger\n\nBootlegger is a potent cross of AK-47 and Rugburn OG from Rare Dankness Seeds. The front-end parentage of AK-47 offers famous potency, but the addition of Rungburn OG (Ghost OG x Rare Dankness #1) improves bud growth and structure, leading to pungent, oily colas that mature in about 8 to 9 weeks. Expect a sweet, earthy aroma with effects distinct to hybrid crosses: creative, cerebral, and mood lifting, along with the functional sedation common among many OG strains.\n\n \n   7. Big Holy Nina\n\nBig Holy Nina from Helping Hands Herbal is a sativa-dominant cross of S.A.G.E. and Nina Limone (Super Lemon Haze x Rebel God Smoke). This stout sativa blend is infused with energy and will ignite your appetite and brighten your mind.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12002021/new-strains-alert-chem-jong-ill-afternoon-delight-slazerbeam-blue.png",
            "title": "New Strains Alert: Chem Jong Ill, Afternoon Delight, Slazerbeam, Blueberry Muffins, and More",
            "urlslug": "/news/strains-products/new-strains-alert-chem-jong-ill-afternoon-delight-slazerbeam-blue"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 34.490354622640695
        },
        {
            "name": "ADD/ADHD",
            "score": 21.04623363407985
        },
        {
            "name": "PTSD",
            "score": 15.831471133248728
        },
        {
            "name": "Arthritis",
            "score": 11.05583131213557
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 8.91839660959132
        }
    ],
    "description": "<p>This #1 rated Cannabis Cup winner of 1996 is the love child of <a href=\"http://www.leafly.com/sativa/purple-thai\">Purple Thai</a> and an <a href=\"http://www.leafly.com/indica/afghani\">Afghani</a> <a href=\"http://www.leafly.com/indica\">Indica</a>, bred by Dutch Passion and later propagated by DJ Short. The plant is described as having pear-shaped buds with purple <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\">calyxes</a>. Flo can potentially&nbsp;be harvested multiple times, creating a &quot;flo&quot; of buds. The effects are&nbsp;characterized as light and <a href=\"http://www.leafly.com/explore#!/explore/tags-energetic\">energetic</a>, allowing for clarity of thought.&nbsp;</p>\n",
    "descriptionPlain": "This #1 rated Cannabis Cup winner of 1996 is the love child of Purple Thai and an Afghani Indica, bred by Dutch Passion and later propagated by DJ Short. The plant is described as having pear-shaped buds with purple calyxes. Flo can potentially&nbsp;be harvested multiple times, creating a &quot;flo&quot; of buds. The effects are&nbsp;characterized as light and energetic, allowing for clarity of thought.&nbsp;\n",
    "effects": [
        {
            "name": "Euphoric",
            "score": 70.20585863082762
        },
        {
            "name": "Uplifted",
            "score": 69.09309169540671
        },
        {
            "name": "Relaxed",
            "score": 57.78640540939012
        },
        {
            "name": "Happy",
            "score": 54.69686369851728
        },
        {
            "name": "Energetic",
            "score": 47.24110118901355
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 42.12441134723069
        },
        {
            "name": "Sweet",
            "score": 39.114151660658486
        },
        {
            "name": "Pine",
            "score": 19.486610950025586
        },
        {
            "name": "Citrus",
            "score": 13.809598834402474
        },
        {
            "name": "Woody",
            "score": 13.03918280974916
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 45,
        "growNotes": "\n\tPrefers moderate amounts of fertilizer\n\tMay express fruity or diesel-smelling phenotypes\n\tTrains well as a multi-branched plant or with sea of green (SOG) operations\n\tAverage yield falls between 25-30 grams per plant\n\n",
        "height": null,
        "outdoorFinish": "End of September",
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1419007,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/3/240",
            "text": "I've suffered from a seizure disorder for about ten years now. About a year ago, I stopped taking the pills they were feeding me and got my Medical Marihuana Card. The majority of the cannabis that I've smoked since I quit taking pills and picked up the pipe has been Flo. It's been a year and I haven't had a seizure yet.",
            "username": "toadondrums"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1641045,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "tastes good and feels even better",
            "username": "klobsnack"
        }
    ],
    "id": 328,
    "name": "Flo",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 41.104079880433744
        },
        {
            "name": "Dizzy",
            "score": 16.61070430189901
        },
        {
            "name": "Dry Eyes",
            "score": 10.645255942899597
        },
        {
            "name": "Headache",
            "score": 9.605194309617625
        },
        {
            "name": "Paranoid",
            "score": 8.841355007125987
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/purple-thai",
            "category": "Sativa",
            "name": "Purple Thai",
            "permalink": "https://mobileapi.leafly.com/sativa/purple-thai",
            "slug": "purple-thai",
            "subtitle": null,
            "symbol": "Pth"
        },
        {
            "applink": "leafly://strain/afghani",
            "category": "Indica",
            "name": "Afghani",
            "permalink": "https://mobileapi.leafly.com/indica/afghani",
            "slug": "afghani",
            "subtitle": null,
            "symbol": "Afg"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/flo",
    "photoTotalCount": 139,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/flo/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/flo/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005395/b/flo__primary_62a2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/flo_100x100_d456.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/661611/b/flo__primary_2e69.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/flo_100x100_81bc.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/647051/b/flo__primary_a7b2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/flo_100x100_4b90.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/640560/b/flo__primary_3a1b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/flo_100x100_ae08.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/640243/b/flo__primary_6afc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/flo_100x100_0944.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636084/b/flo__primary_2cc0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/flo_100x100_a031.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Colorado Springs, CO",
        "Pueblo, CO",
        "Aurora, CO",
        "Boulder, CO",
        "De Beque, CO",
        "Rifle, CO",
        "Seattle, WA",
        "Aspen, CO",
        "Chicago, IL"
    ],
    "rating": 4.25,
    "relatedStrains": [],
    "reviewCount": 526,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "flo",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.25475285171103/240",
    "subtitle": null,
    "symbol": "Flo",
    "symptoms": [
        {
            "name": "Stress",
            "score": 50.85454025098506
        },
        {
            "name": "Depression",
            "score": 38.257876889542864
        },
        {
            "name": "Nausea",
            "score": 23.22218913785677
        },
        {
            "name": "Inflammation",
            "score": 21.610892208246486
        },
        {
            "name": "Pain",
            "score": 18.829516907234975
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
