{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1519851079000)/",
            "id": "contentitems-59186",
            "text": "Cannabidiol, or CBD, is becoming a mainstay in consumers’ medicine cabinets as it combats pain, inflammation, anxiety, and much more. However, even as CBD strains and products become more readily available, the price tag can often make one flinch. For this reason, it’s worth knowing which products will bring the best value based on CBD abundance.\n\nLooking at data from cannabis testing labs across Washington State, we compiled a list of strains that tend to produce significant amount of CBD. These numbers are derived from the testing samples of cannabis flowers and do not include CBD concentrates.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nIn the above graph, you’ll find the average cannabinoid contents of ten popular CBD-dominant strains. You’ll notice that many of these strains contain only trace amounts of THC, while others exhibit a more balanced CBD:THC ratio (which means they will be more euphoric in effect). This graph is based on datasets from multiple reliable testing labs across Washington State. However, it’s worth noting that the datasets from each individual lab differ slightly.\nTake a look at the cannabinoid data from one lab, and notice how the numbers shift slightly.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nMost strains maintain a CBD:THC ratio similar to that in the averaged dataset. However, you’ll also see deviations, like ACDC which exhibits a more balanced CBD:THC ratio according to this lab’s individual testing results.\nNow let’s see how the dataset of Lab A compares to a different lab, also represented in the larger, averaged dataset above.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nAs you can see, the CBD levels from Lab B are much higher on average than those from Lab A. There are a number of possible explanations for this. A lab may manufacture bloated cannabinoid profiles, as we’ve seen some labs do in the past. It could also be that Lab B simply tested samples from growers who achieved higher CBD levels in their harvest.\nThe main takeaway here is this: the cannabinoid profile printed on your product depends not only on the strain’s genetics and expertise of the grower, but also on the testing methods (and ethics) of the local lab that performed the chemical analysis. The Dancehall you bought on your last trip to the dispensary is likely to reflect the cannabinoid data illustrated in the above graphs–however, if you see deviation, the reason lies in the many layers of strain and data variability.\n\nCannabis Strains With High Levels of CBD\nWith this caveat in mind, let’s look at the strains that expressed the highest levels of CBD according to the above lab data.\n\nFind Dancehall Nearby\nDancehall is an upbeat and inspiring strain meant to lift your spirits while coercing creativity. With a CBD:THC ratio of nearly 20:1 on average, this strain delivers little to no euphoric effects that might distract focus or dampen cognition in THC-sensitive consumers.\n\nFind ACDC Nearby\nKnown for its keen ability to lift anxiety of all shades, ACDC is a godsend to consumers susceptible to the side effects of THC. This strain allows you to harness many of the desirable traits of cannabis, like light-footed physical relaxation and gentle mood elevation, without the cost of a clear, calm mind.\n\nFind Suzy Q Nearby\nSuzy Q is a CBD-dominant strain with an extremely modest amount of THC, making it another mellow strain with little to no high. The mild effects of this pine-scented strain help you shed anxious or demotivating mental blocks that stood in the way of creativity and productivity.\n\nFind Ringo’s Gift Nearby\nNamed in recognition of the CBD pioneer Lawrence Ringo, Ringo’s Gift imbues the consumer with a sense of wellbeing alongside steady relief in the body. Use this strain to take the edge off pain and stress, while allowing the mind to roam free without the shackles of paranoia or distracting euphoria.\n\nFind Charlotte’s Web Nearby\nCharlotte’s Web was the first CBD strain to receive media attention, and has achieved legendary status among CBD varieties ever since. Although its reputation is built upon its success in treating epilepsy, this strain has aided patients treating many other conditions including pain, anxiety, and inflammation. Charlotte’s Web is grown by CW Pharmaceuticals in Colorado.\n\nFind Remedy Nearby\nRemedy is a high-CBD strain that quietly ushers in easy relaxation without mental fog. For consumers seeking something a little more relaxing than a cup of tea, Remedy offers a solution with effects that rid the mind of anxiety while soothing aches, pains, and inflammation.\n\nFind Sour Tsunami Nearby\nSour Tsunami has become a household name among high-CBD strains. This variety tends to produce less than 1-2% of THC, so you can reap its medicinal benefits without the high. Sour Tsunami is fairly prolific, so keep an eye out for this strain at your next dispensary visit if you’re looking to quell pain or anxiety symptoms without the interference of THC.\n\nFind Hawaiian Dream Nearby\nIf you’re looking to harness the benefits of THC and CBD but wary of getting too high, Hawaiian Dream is the strain for you. With a THC content of around 5% and a CBD profile stretching between 5-10%, Hawaiian Dream can help abate symptoms with only mild, gentle euphoria. As an added bonus, this strain throws in a little tropical flavor to sweeten the experience.\n\nFind Dance World Nearby\nDance World is a CBD-dominant strain that almost achieves a balanced CBD:THC ratio, making it especially appropriate for consumers struggling with pain, depression, and lack of appetite. This synergy of THC and CBD helps to inspire positivity and more vibrant moods by handing you subdued euphoria on a leash.\n\nFind Nordle Nearby\nNordle offers a balanced abundance of both THC and CBD that makes it especially suitable for patients dealing with pain, insomnia, muscle spasms, and anxiety. If your symptoms are keeping you up at night, Nordle is a great nightcap solution for dialing down pain and worries so you can spend less time tossing and turning.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28121936/high-cbd-strains.jpg",
            "title": "Which Cannabis Strains Are Highest in CBD, According to Lab Data?",
            "urlslug": "/news/strains-products/high-cbd-marijuana-strains-according-to-lab-data"
        },
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1476380337000)/",
            "id": "contentitems-8593",
            "text": "Cannabidiol, or CBD, is the second most common cannabinoid found in cannabis. Unlike its psychoactive sister, THC (or tetrahydrocannabinol), CBD plays it cool, offering relaxing, non-intoxicating effects that lend themselves to a variety of personal and medicinal uses. Because CBD lacks the stoney side effects typical of high-THC strains, it’s a great choice for patients needing to keep a clear head while treating pain, nausea, headaches, stress, anxiety, muscle spasms, epilepsy, and more.\nBut with so many high-CBD strains hitting the market today, it can be difficult to choose one. These high-CBD strains are the most popular and easy-to-find based on Leafly user-submitted reviews. Just click the strain tile to check if a strain is available near you!\nHarlequin\n \nHarlequin is one of the most popular CBD strains available. Typically testing around the 5:2 CBD/THC ratio, it exhibits a sativa-dominant alertness with only mild euphoria. Harlequin has a happy bent that most will find enhances whatever activity they are engaged in.\nRingo’s Gift\n \nRingo’s Gift – named for activist, CBD specialist, and founder of SoHum Seeds, Lawrence Ringo – is a hybrid cross of Harle-Tsu and ACDC. It keeps on giving to patients seeking a nearly full-on CBD-driven strain, with an average ratio of 24:1 CBD/THC.\nSweet and Sour Widow\n \nSweet and Sour Widow lands in the middle ground with a 1:1 CBD/THC ratio. This even split offers first-time cannabis consumers an enjoyable entry point to both THC and CBD without sending them into orbit. It also makes for good medicine while being slightly euphoric and stoney.\nStephen Hawking Kush\n \nStephen Hawking Kush offers mild, relaxing effects while doling out a healthy dose of CBD, too. This indica-dominant strain is one of the more unique CBD cuts out there, offering both heady and soothing effects.\nACDC\n \nACDC is easily my favorite CBD strain. The cannabinoid content is usually heavily CBD-dominant, sitting on average at 20:1 in its CBD/THC ratio. An imperceptible amount of THC makes ACDC an outstanding companion for daily medicinal cannabis consumers seeking to relieve tension, pain, or anxiety.\nCannatonic\n \nCannatonic isn’t nearly as sedative as the name implies. This strain usually brings a smaller CBD/THC split, ranging from 5:1 down to 1:1. This even-keeled cannabinoid profile gives consumers a great deal of flexibility to use Cannatonic as medicine or as an enjoyable, mild mannered strain to unwind with.\nHarle-Tsu\n \nHarle-Tsu, one of a few lovingly handcrafted strains created by the late Lawrence Ringo, is an outstandingly functional CBD cut. By combining Harlequin and Sour Tsunami, Harle-Tsu achieves a pleasant disposition without encumbering the consumer with strong sedation.\nCanna-Tsu\n \nCanna-Tsu is a more balanced CBD/THC strain that offers a unique bouquet of smells. With aromas of citrus and sweet earth, Canna-Tsu gives the CBD enthusiast a complex palate of flavor and terpenes to enjoy.\nSour Tsunami\n \nCreated by the larger-than-life grower and activist Lawrence Ringo, Sour Tsunami was brought into being by combining Sour Diesel and NYC Diesel. This unlikely pair of stimulating plants bred the high-CBD phenotype that has since redefined the medicinal qualities of cannabis.\nPennywise\n \nPennywise certainly has the scariest of all the names that made this list, or at least it does for those familiar with the Stephen King book responsible for its namesake. But fear not, Pennywise truly gets its name from its genetic cross of Harlequin and Jack the Ripper. It synthesizes Jack the Ripper’s mental clarity and an even 1:1 CBD/THC to make a strain that is functional and enjoyable at almost any dose.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/10/23143140/cbd-week-7.jpg",
            "title": "The 10 Best CBD Cannabis Strains According to Leafly Users",
            "urlslug": "/news/strains-products/10-best-cbd-cannabis-strains-according-to-leafly-users"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 86.04696673189824
        },
        {
            "name": "ADD/ADHD",
            "score": 52.606001304631434
        },
        {
            "name": "PTSD",
            "score": 43.02348336594912
        },
        {
            "name": "Fibromyalgia",
            "score": 37.977821265492494
        },
        {
            "name": "Bipolar Disorder",
            "score": 31.950424005218526
        }
    ],
    "description": "<p>Ringo&rsquo;s Gift is a <a href=\"http://www.leafly.com/news/cannabis-101/whats-the-deal-with-these-high-cbd-strains\">high-CBD strain</a> that crosses <a href=\"http://www.leafly.com/hybrid/harle-tsu\">Harle-Tsu</a> and <a href=\"http://www.leafly.com/hybrid/acdc\">ACDC</a>. It is named for the late Lawrence Ringo, a cannabis activist and CBD pioneer. Ringo&rsquo;s Gift comes in several different <a href=\"https://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique/\">phenotypes</a> and ratios.&nbsp;The first of which is a &ldquo;one-for-one&rdquo; strain, meaning it has an equal ratio of <a href=\"http://www.leafly.com/news/health/high-cbd-products-for-medical-marijuana-patients-no-access-no-pro\">CBD</a> to <a href=\"http://www.leafly.com/news/cannabis-101/understanding-cannabis-testing\">THC</a>, but Ringo&#39;s Gift has seen ratios as steep at 24:1 CBD/THC. This strain has become a favorite in&nbsp;the cannabis clubs of&nbsp;Barcelona, providing a mellow mix of cerebral activity and soothing, full-body <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\">relaxation</a> without the &ldquo;couch lock&rdquo; effect.</p>\n",
    "descriptionPlain": "Ringo&rsquo;s Gift is a high-CBD strain that crosses Harle-Tsu and ACDC. It is named for the late Lawrence Ringo, a cannabis activist and CBD pioneer. Ringo&rsquo;s Gift comes in several different phenotypes and ratios.&nbsp;The first of which is a &ldquo;one-for-one&rdquo; strain, meaning it has an equal ratio of CBD to THC, but Ringo&#39;s Gift has seen ratios as steep at 24:1 CBD/THC. This strain has become a favorite in&nbsp;the cannabis clubs of&nbsp;Barcelona, providing a mellow mix of cerebral activity and soothing, full-body relaxation without the &ldquo;couch lock&rdquo; effect.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 101.2296151337247
        },
        {
            "name": "Happy",
            "score": 56.15133724722765
        },
        {
            "name": "Focused",
            "score": 50.46640574037834
        },
        {
            "name": "Uplifted",
            "score": 25.913242009132418
        },
        {
            "name": "Energetic",
            "score": 24.377038486627526
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 37.504892367906066
        },
        {
            "name": "Woody",
            "score": 20.998043052837573
        },
        {
            "name": "Sweet",
            "score": 20.358773646444877
        },
        {
            "name": "Tree Fruit",
            "score": 16.637312459230266
        },
        {
            "name": "Berry",
            "score": 15.655577299412915
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1412473,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "The Best CBD Rich Strain I've tried. I bought me some oil of this strain containing 78%CBD and let me tell you it'll knock out all your pain almost instantly. It's a great strain and should be everywhere but sadly its not. Its new and still hard to find. I highly recommend this to anyone with pain of any sort. This flower is true medicine and would love to share this with people in need. We need more growers of this strain asap!",
            "username": "micjay"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1624783,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I have Fibromyalgia and was looking for something that would take effect quicker than general CBD oil (I've been taking over 200mg with minimal results)I should also say I do not like smoking pot, at all, never liked it. It always made me paranoid and anxious.\n\nAnyways, back to review, I was advised to try a CBD heavy strain as it takes effect much quicker. After a lot of trial and error, I read about this strain and picked up a few pre-rolls to see. I love this strain! No throat hit or harshness. Takes away so much pain and leaves me alert and in a great mood! This has replaced all my scripts and is doing such a better job! Definitely recommend!!",
            "username": "Thatgirl1985"
        }
    ],
    "id": 137135,
    "name": "Ringo's Gift",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 10.091324200913242
        },
        {
            "name": "Dry Eyes",
            "score": 7.054794520547945
        },
        {
            "name": "Headache",
            "score": 3.3333333333333335
        },
        {
            "name": "Anxious",
            "score": 3.3333333333333335
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/harle-tsu",
            "category": "Hybrid",
            "name": "Harle-Tsu",
            "permalink": "https://mobileapi.leafly.com/hybrid/harle-tsu",
            "slug": "harle-tsu",
            "subtitle": null,
            "symbol": "Hts"
        },
        {
            "applink": "leafly://strain/acdc",
            "category": "Hybrid",
            "name": "ACDC",
            "permalink": "https://mobileapi.leafly.com/hybrid/acdc",
            "slug": "acdc",
            "subtitle": null,
            "symbol": "Acd"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/ringos-gift",
    "photoTotalCount": 5,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/615920/b/ringo-s-gift__primary_af91.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ringo-s-gift_100x100_a274.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/507054/b/ringo-s-gift__primary_ebf0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ringo-s-gift_100x100_3cf4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/402073/b/ringo-s-gift__primary_1aef.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ringo-s-gift_100x100_94b8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/307212/b/ringo-s-gift__primary_a850.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ringo-s-gift_100x100_da60.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/307128/b/ringo-s-gift__primary_db99.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ringo-s-gift_100x100_3e8a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Eugene, OR",
        "Seattle, WA",
        "Springfield, OR",
        "Ashland, OR",
        "Astoria, OR",
        "Auburn, WA",
        "Beaverton, OR",
        "Bellevue, WA",
        "Bellingham, WA"
    ],
    "rating": 4.68,
    "relatedStrains": [],
    "reviewCount": 91,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "ringos-gift",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.68131868131868/240",
    "subtitle": null,
    "symbol": "Rin",
    "symptoms": [
        {
            "name": "Pain",
            "score": 70.09458577951729
        },
        {
            "name": "Stress",
            "score": 58.79973907371168
        },
        {
            "name": "Inflammation",
            "score": 45.42074363992172
        },
        {
            "name": "Fatigue",
            "score": 37.977821265492494
        },
        {
            "name": "Muscle Spasms",
            "score": 37.3385518590998
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
