{
    "aka": "Ghost OG Kush",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1509387702000)/",
            "id": "contentitems-46226",
            "text": "The last several decades of cannabis breeding generated thousands upon thousands of strains, many with high levels of THC. This begs the question, “Which strain has the most THC?”\nThe answer, according to numbers pulled from Washington state’s I-502 data, might be Ghost OG. (Leafly filtered the data to remove suspicious outliers and avoid labs that may have inflated THC values.)\n\nAbout Ghost OG\nGhost OG is a hybrid strain with a mysterious origin story likely written only on the ancient walls of an online growing forum. However, it’s said to be a cut of the original OG Kush passed along from one breeder, ORGNKID, to another named “Ghost.”\nFind Ghost OG Nearby\nWhile its history is known by few, the name is known by many, preserved by a reputation built on numerous Cannabis Cup awards. Wearing a thick white sheet of crystal trichomes, Ghost OG can produce a predatory amount of resin best reserved for fearless cannabis heavyweights. Skillful gardeners can coerce loud aromas from this strain that reek of acrid lemon-pine cleaner and deep earthy goodness. Coveted Ghost OG genetics have been used to breed several other strain staples like Ghost Train Haze, Rare Dankness #1, and Banana Kush.\n\nHow Much THC Does Ghost OG Have?\nAdvances in cannabis lab testing have helped to put the terms like “strength” and “potency” in quantifiable terms—a percentage point that many consumers now primarily look to when choosing a strain. Though we now know that a strain’s subjective intensity is determined by a harmony of cannabinoids and terpenes, many people primarily focus on the THC content if looking for a powerful cannabis experience.\n\nThrough genetic selection and advancements in growing technology, cannabis plants can now produce over 25% THC by dry weight—a substantial increase from the single-digit figures strains touted in decades past.\nGhost OG’s average THC content, according to lab data, pushes past 28%, the highest figure in the dataset. Compare that to the average THC content of these popular strains:\n \nClick to enlarge. (Amy Phung/Leafly)\n\nBlue Dream: 18.4% THC\nGSC (f.k.a Girl Scout Cookies): 19.1% THC\nSour Diesel: 18.5% THC\nGG #4: 21.4% THC\nOG Kush: 19.4% THC\nGranddaddy Purple: 17.5% THC\n\nIf cut from the original OG Kush mother stock, why is Ghost OG’s average THC percentage so much higher? Could it be that these prized Ghost genetics fell into the hands of particularly talented propagators and cultivators, while the potency score of the widely proliferated “generic” OG Kush was skewed by more lackluster samples?\n\nSeveral other cannabis strains in our dataset fell slightly short of Ghost OG’s average THC content:\nClick to enlarge. (Amy Phung/Leafly)\n\nWappa: 26.6% THC\nOG Chem: 26.4% THC\nWhite Fire Alien OG: 24.9% THC\nHead Cheese: 24.7% THC\nBruce Banner: 24.6% THC\n\nMany of these runner-ups are cut from the same genetic cloth as Ghost OG with deep OG ancestry, but somewhere along the way, Ghost OG held its edge.\nBut I’ve Seen Plenty of Flower With More THC. What Gives?\nIt’s plausible you’ve come across strains that exceed the 28% THC benchmark. Given these figures are an average of measured THC profiles, it makes sense that you’d find individual samples on either end of the high-low spectrum.\nConsider also the credibility of cannabis testing labs and the possibility of THC inflation. Earlier this year in Washington state, for example, some labs were suspected of artificially inflating THC profiles to make clients’ samples appear more potent, perhaps to give them a competitive edge over other labs. Again, the dataset used here excludes questionable data sources.\n\nKeep in mind the biological limits of THC production. This chemical ceiling rests somewhere around 30% or so THC by dry weight, and if you see any strains pushing far past that, you have every reason to be skeptical.\nThe question of which strain packs the most THC in a single flower will almost certainly be a matter of ongoing debate as more data is collected and assessed. For now, it’s clear that Ghost OG stands out among the resin-packed queens of 2017, but which varieties will ascend to the throne next?\nFind Ghost OG Nearby\n \nhttps://www.instagram.com/p/BWi98rlFHeK/",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/10/26141236/iStock-656725650.jpg",
            "title": "What Cannabis Strain Has the Most THC, According to Lab Data?",
            "urlslug": "/news/strains-products/the-strongest-cannabis-strain-according-to-lab-data"
        },
        {
            "author": "Darren Harris",
            "category": null,
            "date": "/Date(1477504186000)/",
            "id": "contentitems-9531",
            "text": "Pac-Man, everyone’s favorite ravenous little yellow circle, debuted in Japan on May 20, 1980, and made its way to North America on October 26th that same year. Since then, Pac-Man (or “Puck-Man,” as it was originally called) has been honored as the most recognizable video game character and the most successful coin-operated game title by the Guinness Book of World Records.\nWe’ve all spent some time chasing dots and fruit while being chased by Inky, Blinky, Pinky, and Clyde, so in honor of Pac-Man, this products roundup features some fun Pac-Man-themed cannabis items that may strike your fancy.\nStoned Pac-Man Game\n\nWhat better way to honor the (Pac) man himself than by trying out this free stoner version of the classic game! Stoned Pac-Man will have you munching down cannabis leaves instead of pellets while also on the run from ghost law enforcement instead of the traditional multi-colored specters. This game is sure to entertain — just be on the lookout for those power-up bongs and joints!\nPrice: Free!\nGhost OG Hybrid Strain\n\nAnother good way to celebrate Pac-Man is to toke up on some Ghost OG. While this strain won’t turn you into a haunted spirit consumed with the urge to chase down and hunt Pac-Man, the citrus-smelling hybrid packs a punch that will leave you relaxed and upbeat — the perfect attitude to have for munching down on some power pellets. Other benefits of this strain include pain and insomnia relief, anxiety relief, and a regained appetite, so be sure to use our finder to locate some Ghost OG near you!\nPrice: Varies; check your local dispensary\nPac-Man Ghost Pendant Carb Cap\n\nThis glass ghost pendant carb cap of Blinky, leader of the ghosts and arch-enemy of Pac-Man, can serve as a nice, subtle nod to those cute but haunted figures from the game. Made by the people at M3boro Glass and available on BrothersWithGlass.com, there’s also an Inky carb cap available if the dark blue ghost suits your tastes better. Each carb cap fits 10mm domeless nails and would be a welcome addition for your rig.\nPrice: $40.00\nPac-Man Candy Ghost Sour Tin\n\nWhile this product isn’t made specifically with cannabis in mind, these Pac-Man candy ghost tins can serve as both munchies now and then a stash container later! These metal tins contain sour candies and also come designed in the shape and color of either the red ghost, Blinky, or the vulnerable blue ghosts the other ghosts turn into after Pac-Man consumes a power pellet. These tins make a great gift to any stoner (or regular) fan of Pac-Man.\nPrice: $5.86\nPac-Man Pothead T-Shirt\n\nA good way to stylishly show your stoner support for Pac-Man would be to pick up a Pac-Man Pothead t-shirt from Skreened. This quality tee is made from comfy black cotton and sports a graphic of our yellow hero chasing after his other favorite treat, cannabis leaves! The shirt has a clean look that will be sure to turn heads, so don’t miss out!\nPrice: $28.15",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/10/26104528/pac-man-products-strains-header.jpg",
            "title": "Bask in Pac-Man Nostalgia With These 5 Themed Strains and Products",
            "urlslug": "/news/strains-products/5-pac-man-themed-cannabis-products"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 31.004951157500336
        },
        {
            "name": "Spinal Cord Injury",
            "score": 10.026093938177437
        },
        {
            "name": "Fibromyalgia",
            "score": 8.042285561354209
        },
        {
            "name": "PTSD",
            "score": 7.803648690842589
        },
        {
            "name": "Bipolar Disorder",
            "score": 6.5379811766804945
        }
    ],
    "description": "<p>Ghost OG, a cut of&nbsp;<a href=\"http://leafly.com/hybrid/og-kush\">OG Kush</a>,&nbsp;is a hybrid strain loved for its balanced cerebral and body effects. Often described as simultaneously potent and non-intrusive, Ghost OG has won itself Cup awards and renown among consumers. Its strong citrus smell and crystal-covered buds hint at this strain&rsquo;s strong genetics and its ability to annihilate pain, insomnia, depression, and anxiety.&nbsp;</p>\n",
    "descriptionPlain": "Ghost OG, a cut of&nbsp;OG Kush,&nbsp;is a hybrid strain loved for its balanced cerebral and body effects. Often described as simultaneously potent and non-intrusive, Ghost OG has won itself Cup awards and renown among consumers. Its strong citrus smell and crystal-covered buds hint at this strain&rsquo;s strong genetics and its ability to annihilate pain, insomnia, depression, and anxiety.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 85.92042463981444
        },
        {
            "name": "Euphoric",
            "score": 64.12864088496364
        },
        {
            "name": "Happy",
            "score": 53.28181453231634
        },
        {
            "name": "Uplifted",
            "score": 35.53347606940542
        },
        {
            "name": "Creative",
            "score": 34.72166465944065
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 25.109282305187566
        },
        {
            "name": "Earthy",
            "score": 23.30389401846648
        },
        {
            "name": "Pungent",
            "score": 12.497212186092153
        },
        {
            "name": "Lemon",
            "score": 12.250769436638564
        },
        {
            "name": "Sweet",
            "score": 11.362014362817252
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1410766,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "The Ghost OG Marijuana strain is an Afghani hybrid strain. It has good balance between the traits of Indica and Sativa. The Ghost OG strain has won many awards and is know for being potent, but not so much that it will wreck your day. Also known for its solid body high and good euphoric effects. The Ghost OG strain smells fruity, and is great for treating pain, helping people sleep, and anxiety.",
            "username": "SonTarble"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1639498,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I have since crossed this with itself several times, making a super creeper strain that is REALLY HEAVY. Also for the record, I created this strain almost 20 years ago to the day.",
            "username": "GhostyGuy"
        }
    ],
    "id": 58160,
    "name": "Ghost OG",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 24.899638699317542
        },
        {
            "name": "Dry Eyes",
            "score": 18.796556492261026
        },
        {
            "name": "Anxious",
            "score": 10.191132521521922
        },
        {
            "name": "Dizzy",
            "score": 5.922431865828092
        },
        {
            "name": "Headache",
            "score": 4.687987867433873
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/og-kush",
            "category": "Hybrid",
            "name": "OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/og-kush",
            "slug": "og-kush",
            "subtitle": null,
            "symbol": "Ogk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/ghost-og",
    "photoTotalCount": 73,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000133/b/ghost-og__primary_33e3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ghost-og_100x100_1f93.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/644851/b/ghost-og__primary_7d82.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ghost-og_100x100_3d78.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639826/b/ghost-og__primary_5370.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ghost-og_100x100_f047.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639255/b/ghost-og__primary_a1bf.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ghost-og_100x100_1f11.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/633707/b/ghost-og__primary_edce.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ghost-og_100x100_253b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/609643/b/ghost-og__primary_7064.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ghost-og_100x100_aaa9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Los Angeles, CA",
        "Denver, CO",
        "Portland, OR",
        "Detroit, MI",
        "Eugene, OR",
        "Seattle, WA",
        "Bellingham, WA",
        "Bend, OR",
        "San Diego, CA",
        "San Francisco, CA"
    ],
    "rating": 4.48,
    "relatedStrains": [],
    "reviewCount": 454,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "ghost-og",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.48017621145374/240",
    "subtitle": null,
    "symbol": "Gok",
    "symptoms": [
        {
            "name": "Stress",
            "score": 39.953833801686066
        },
        {
            "name": "Pain",
            "score": 31.977340648557025
        },
        {
            "name": "Depression",
            "score": 26.48757750122664
        },
        {
            "name": "Insomnia",
            "score": 21.380302422052726
        },
        {
            "name": "Lack of Appetite",
            "score": 15.24822695035461
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
