{"sl_translate":"description,descriptionPlain,category","id":500531,"slug":"gummo","name":"Gummo","subtitle":null,"symbol":"Gum","category":"Hybrid","description":"\u003cp\u003eGummo by Gabriel Cannabis is a unique, fruity cross of flavorful genetics. It was created by crossing \u003ca href=\"https://www.leafly.com/hybrid/bubble-gum\"\u003eBubble Gum\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/hybrid/orange-bud\"\u003eOrange Bud\u003c/a\u003e, and emits a bouquet full of tart citrus and sweet fruit. This strain tastes like it smells with effects that are surprisingly laid back, even with the strain\u0026rsquo;s bright \u003ca href=\"https://www.leafly.com/news/cannabis-101/terpenes-the-flavors-of-cannabis-aromatherapy\"\u003eterpene profile\u003c/a\u003e. Anticipate calming physical effects that are juxtaposed against a happy and euphoric mental state. Enjoy Gummo throughout the day to elevate mood and tame pain.\u003c/p\u003e\n","descriptionPlain":"Gummo by Gabriel Cannabis is a unique, fruity cross of flavorful genetics. It was created by crossing Bubble Gum and Orange Bud, and emits a bouquet full of tart citrus and sweet fruit. This strain tastes like it smells with effects that are surprisingly laid back, even with the strain\u0026rsquo;s bright terpene profile. Anticipate calming physical effects that are juxtaposed against a happy and euphoric mental state. Enjoy Gummo throughout the day to elevate mood and tame pain.\n","aka":null,"rating":4.91,"highlightedReviews":[{"id":1506803,"username":"KendellSands","text":"Gummo is a very unique bud, especially the flavors! I opened the jar and the first thing I noticed was the smell of rubber. And the taste of gum that has lost its flavor.🤷That being said a very BEAUTIFUL bud as usual.. way to go Gabe and Co. This girl has my attention for sure!! Please right about this plant peeps I would love to compare notes. I\u0027m buying another 2g and Sunny-D is delicious.👍✌","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1639502,"username":"LunaDraconis","text":"For me, the high was slow to hit: approximately an hour before I felt much of anything. After it hit, though, it was absolutely marvelous. I had a hard time concentrating enough to watch a TV show and follow the plot, but this was a pleasant thing for me, as part of my anxiety is that it keeps an endless babble going in the back of my mind. The downside (not entirely unpleasant and minor, in my opinion) of this strain was that it made me slightly dizzy for a short amount of time, and that my ability to concentrate was very limited: I couldn\u0027t seem to stop moving. As the high progressed, this flipped, and I became very fixated on things; cleaning, researching, etc. I partook of this strain via a herbal vaporizer, and the flavor seemed very pine-y, bringing me back to pleasant days in the National Park near my hometown. Overall a great time. I felt fuzzy and tingly and happy for hours on end, and would love to use it again. Also, I\u0027m usually unmotivated and cloudy-headed the day after being high, but this was not the case with this strain.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/nXDMny3ziZYzAXTq72CnSk_ytNs=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2fymJiURN7YeKaxdGhZ5kI_TLTSX0%3d%2f120x120%2fhttps%253A%252F%252Fs3.amazonaws.com%252Fleafly%252Fbin%252FqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-53439","title":"5 Best-Smelling Cannabis Strains in Washington","author":"Will Hyde","category":null,"date":"\/Date(1514934606000)\/","text":"I’m a firm believer that quality cannabis should captivate all of the senses, starting with the nose. Aroma has always been an important characteristic when choosing a cannabis strain, and it’s generally the first thing that will attract you to a specific variety. A strain’s smell is a major indicator the flower’s flavor profile and gives you some semblance of what tastes can be expected when you inhale.\nMost connoisseurs will tell you that cannabis should be purchased with your nose, letting the natural harmony of terpenes guide your decision. One of the flaws with state regulations requiring pre-packaged cannabis is that it removes the nose from the equation and forces you to wait until you get home to find out how pungent the purchased flower may be. To help overcome this roadblock the legal cannabis market presents, I’ll share some of my favorite strains available in Washington that carry truly exceptional and complex aromas.\n\n#1 | Lemonder by Seattle’s Private Reserve\n\nLemonder from Seattle’s Private Reserve is a 91-point strain that was awarded the Best Aroma in Washington State using Leafly’s Cannabis Rating System. While somewhat wispy in appearance, it was the only qualifying strain that scored perfectly for its aroma. The strain is a hybrid of Super Lemon Haze, OG Kush, and Lavender, and it produces a sweet citrus aroma with the added pungent zest of fruit when ground up. Its flavor is a fruity, floral experience that reminds me of candied orange.\nFind Lemonder Nearby\nFrom the Tasting Notebook:\n “Lemon, cream, spice, and some middle savory note that is mellowing the lemon in an unexpected way.” –Jeremiah Wilhelm, Strain Researcher\n\n#2 | White Tahoe Cookies by Royal Tree Gardens\n\nRoyal Tree Gardens has a diverse mix of aromas and flavors coming from their flowering rooms. Their White Tahoe Cookies is a prime example of the quality and consistency their garden produces. A 94-point strain overall, White Tahoe Cookies’ aroma is a compelling mix of its parent genetics, The White, Tahoe OG, and an unspecified GSC cut. This flower has a grape and berry sweetness that blends with notes of musky mint, pine, and skunky earth to complete its enchanting bouquet.\nFind White Tahoe Cookies Nearby\nFrom the Tasting Notebook:\n“Robust grape and berry notes charged with a hint of dank, musky Kush and a sweet finish. Aromas of mint, eucalyptus, and pine forest erupt when this bud is broken down into shake.” –Will Hyde, Cannabis Expert\n\n#3 | Gummo by Gabriel Cannabis\n\nGummo from Gabriel Cannabis is an irresistible 92-point strain that crosses the sweetness of Bubble Gum with the intricate citrus aroma of Orange Bud. The tight buds covered in fiery orange hairs emit an intense citrus sour with soft floral sweetness. The flavor follows suit with a sharper, spiced finish reminiscent of cinnamon and sandalwood. The resulting effects are immediate, heady, and introspective.\nFind Gummo Nearby\nFrom the Tasting Notebook:\n“Loud, ripe berry aroma that expands into a sweet citrus medley of mandarin and tangerine.” –Bailey Rahn, Strains \u0026 Products Editor\n\nGummo grown by Gabriel Cannabis.\n#4 | Blueberry Pancakes by Nebula Gardens\n\nA truly amazing flower with a captivating, nuanced, and unique terpene profile, Blueberry Pancakes from Nebula Gardens really does emulate its namesake: a mix of berry notes that finish with a creamy touch of citrus, evoking memories of fresh baked muffins. Scoring 89 points overall and near perfect for its aroma, Blueberry Pancakes provides soothing effects that pair nicely with its pungent essence.\nFind Blueberry Pancakes Nearby\nFrom the Tasting Notebook:\n“Bright strawberry, wildflower, and sweet pine with doughy vanilla. Its aroma feels clarifying with diverse nuance.”–Bailey Rahn, Strains \u0026 Products Editor\n\n#5 | Golden Ticket by Khush Kush\n\nAn 87-point strain overall, Golden Ticket from Khush Kush is a flower with fragrant fruity notes of citrus and subtle undertones of tropical flowers. The nuanced smells of Golden Ticket were just a couple points shy of a perfect aroma score. Its complex smell gives way to fresh pine and spearmint flavors with just a touch of sharp lime upon exhale.\nFind Golden Ticket Nearby\nFrom the Tasting Notebook:\n“Sweet, floral, and sort of tropical like a papaya\u2028. Reminds me of a Trainwreck\u2028 cross. When I grind it up, the aroma is even sweeter like a sour green apple or an overripe pineapple\u2028.” –Will Hyde, Cannabis Expert","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/02145135/lemonader-macro.jpg","urlslug":"/news/strains-products/best-smelling-strains-in-washington-fall-2017"}],"reviewCount":11,"flavors":[{"name":"Citrus","score":33.333333333333329},{"name":"Earthy","score":31.25},{"name":"Sweet","score":14.583333333333332},{"name":"Orange","score":14.583333333333332},{"name":"Flowery","score":14.583333333333332}],"effects":[{"name":"Relaxed","score":68.75},{"name":"Happy","score":60.416666666666671},{"name":"Euphoric","score":52.083333333333329},{"name":"Uplifted","score":37.5},{"name":"Energetic","score":31.25}],"symptoms":[{"name":"Stress","score":56.25},{"name":"Depression","score":47.916666666666671},{"name":"Insomnia","score":47.916666666666671},{"name":"Pain","score":39.583333333333329},{"name":"Lack of Appetite","score":25}],"conditions":[{"name":"Anxiety","score":39.583333333333329},{"name":"PTSD","score":31.25},{"name":"Arthritis","score":22.916666666666664},{"name":"Fibromyalgia","score":22.916666666666664},{"name":"Migraines","score":22.916666666666664}],"negatives":[{"name":"Dry Mouth","score":29.166666666666664},{"name":"Dry Eyes","score":16.666666666666664},{"name":"Dizzy","score":8.3333333333333321}],"articlesAvailable":true,"articleTotalCount":1,"photos":[],"photoTotalCount":0,"popularCities":["Seattle, WA","Shoreline, WA","Bellevue, WA","Everett, WA","Lynnwood, WA","Spokane, WA","Tacoma, WA","Walla Walla, WA","Bothell, WA","Bremerton, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/gummo","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.90909090909091/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Bubble Gum","subtitle":null,"slug":"bubble-gum","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/bubble-gum","symbol":"Bg","applink":"leafly://strain/bubble-gum"},{"name":"Orange Bud","subtitle":null,"slug":"orange-bud","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/orange-bud","symbol":"Orb","applink":"leafly://strain/orange-bud"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
