{"sl_translate":"description,descriptionPlain,category","id":156,"slug":"orange-crush","name":"Orange Crush","subtitle":null,"symbol":"Oc","category":"Hybrid","description":"\u003cp\u003eOrange Crush is a sativa-dominant cannabis strain with a super sweet tangy flavor and aroma.\u0026nbsp;Bred by BC Growers Association with \u003ca href=\"http://www.leafly.com/hybrid/california-orange\"\u003eCalifornia\u0026nbsp;Orange\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/blueberry\"\u003eBlueberry\u003c/a\u003e for parents, Orange Crush produces a powerful cerebral sensation\u0026nbsp;that can last up to two hours. It has small, dense buds that contain\u0026nbsp;a large amount of trichomes and many orange pistils. Orange Crush\u0026nbsp;has a flowering time of 7-9 weeks and a THC content of up to 15%.\u003c/p\u003e\n","descriptionPlain":"Orange Crush is a sativa-dominant cannabis strain with a super sweet tangy flavor and aroma.\u0026nbsp;Bred by BC Growers Association with California\u0026nbsp;Orange and Blueberry for parents, Orange Crush produces a powerful cerebral sensation\u0026nbsp;that can last up to two hours. It has small, dense buds that contain\u0026nbsp;a large amount of trichomes and many orange pistils. Orange Crush\u0026nbsp;has a flowering time of 7-9 weeks and a THC content of up to 15%.\n","aka":null,"rating":4.19,"highlightedReviews":[{"id":1413676,"username":"ContinentalKush","text":"Wow. This strain is crazy. It tastes of citrus very strongly and I love it.  It also smells really potent; it\u0027s almost like a dense citrus smell. The high was very exciting for my mind which made me laugh at the slightest out-of-place comments and at the same time was making my head heavy. I also note that I had the halo-head affect which is great. All in all, its a very conversational friendly high which stimulates the brain and at the end of the day puts you sound to sleep. One of my favorites, so far. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1631697,"username":"FunWaysToHeal","text":"Tried my first Oc today. It tasted sweet, which I liked but it didn’t have the citrusy orange taste that I expected. It wasn’t a great looking batch but the price was right. The smoke was mild in my mouth and it made my tongue tingle. Kind of the way it does when you eat citrus fruit. I enjoyed the light sweet scent it left in the air. I’ve been struggling with a lack of energy and fibro fog so I thought I’d give Orange Crush (Orange Cali X Blueberry) a go first thing in the morning. Whenever I’m trying a new cannabis strain for the first time, I always start off with a little because I have no idea how it’s going to affect me. Turns out, a little nug in a bong was just right for starting my day.  It took a few minutes but before I knew it my energy had picked up slightly and my mood sky rocketed.  I was feeling uplifted, brainy, and happy. And, I realized that I was totally stress free. I didn’t experience any bad side effects, not even dry mouth. I’m surprised at how long the effects lasted from such a small amount. Can’t wait to try a better batch of Orange Crush, pretty sure it’ll be a five.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/IrM8gHUbXY3itR-O7G2Vjy3BwbY=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2fXuvJ4Whz3Ap6XVvvxVCiu9oHQQc%3d%2f120x120%2fhttps%253A%252F%252Fs3-us-west-2.amazonaws.com%252Fleafly-images%252Fuser-profile%252Fy1ivlzR3TNqzsqS0h6XD_IMG_6354.jpg"}],"relatedStrains":[],"articles":[{"id":"contentitems-15444","title":"Taste the \u0027Strainbow\u0027 With These Colorful Cannabis Pairings","author":"Hannah Meadows","category":null,"date":"\/Date(1484171120000)\/","text":"For every color in the rainbow there is a complementing strain ready to match each individual’s absolute favorite hue. Only drink out of blue cups? Wear a lot of purple?  Refuse to eat something that isn’t orange-tinted? Pair your number one color with a little bit of green! Below we list a strain pairing that goes hand in hand with each letter in ROYGBIV.\nRed\n\nFiery, passionate, sensual – red is a power color that tends to allure the sexes and could possibly give you a promotion. Pair this magnetic color with the “speedy and intense” Panama Red, a full sativa that will match that flash of red lipstick or vibrant watch band.\nOrange\n\nThis warm and fizzy hue can only pair best with a warm and fizzy strain. Enter Orange Crush – its sweet and tangy flavor perfectly complements its twin color.\nYellow\n\nIn the dead of winter, yellow reminisces sunny days and lemonade. Try Lemon Haze to melt the frost – it’s a citrusy sativa whose buds appear green and yellow. The lemony taste will bring back your sunny disposition through these chilly months.\nGreen\n\nWith 2017’s color of the year being “greenery,” the hybrid Green Dream is an excellent addition to any green stash.\nBlue\n\nBlue has always been a fan favorite and possibly the most popular color of the rainbow – it’s calming, tranquil, and makes one think of the sky and the sea. The hybrid ArcticBlue pairs well with this peaceful color and its anti-anxiety effects.\nHonorable mention goes to the hybrid Blue Dream, a strain that has become just as popular as the color itself.\nIndigo\n\nIndigo is the in-between of purple and blue – a deep, gorgeous hue that can only be complemented by the hybrid strain Blurple. It’s the best mix of Blue Dream and Mendocino Purps, just as indigo is the best mix of purple and blue, aka “blurple.”\nViolet\n\nA color that received its name from the violet flower, it’s only logical to pair this beautiful hue with the hybrid strain Violet Delight. It releases a strong floral flavor that will have you dreaming in shades of purple.\nIf your favorite color is outside of the rainbow spectrum, we have a couple of honorary mentions for you to pick up.\n\nPink\n\nThough pink is not technically a color of the rainbow, we couldn’t leave out this bubblegum pop favorite. Pair that Pepto-Bismol toned jacket that’s been collecting dust in your closet with the sweet and fruity indica Pink Berry.\nBlack\n\nFor those who live and breathe in waves of black, don’t pass up the indica Black Domina. It’s a strain designed for late night, so grab your best black pajamas, black slippers, black robe, and pull in this heavy strain deep into the night.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/25130741/rainbow.jpg","urlslug":"/news/strains-products/rainbow-marijuana-strains"},{"id":"contentitems-6025","title":"Cannabis Scents and Sensibility: Why Marijuana\u0027s Fragrance Is a Feast for the Nose","author":"Emily Grosvenor","category":null,"date":"\/Date(1459224000000)\/","text":"To make a truly informed cannabis-buying decision, you have to smell the product. And I don’t mean taking a dainty whiff. You’ve got get in there and really inhale, because smelling it — really focusing on the fragrance — may just be the best way to choose your cannabis.\n“Depending on what the scent is, it can make or break a strain for people,” said Tyson Dieter, a manager at the Southwest Portland outlet of Nectar, an Oregon cannabis retailer.\nI’m a home perfumer trained by a world-class nose. Years ago I trained at home using natural perfumer Mandy Aftel’s workbooks, and later I studied with her at her studio in Berkeley, Calif. For me scent is the ultimate in pleasure experiences. On a recent Tuesday morning, I stopped in at Nectar to talk scent and learn about the role it plays in the burgeoning cannabis industry.\nWhat Do Cannabis and Perfumes Have in Common?\nIt turns out perfume and pot have a lot in common.\nBoth products come with outlandish, sometimes arbitrary titles. Burberry Weekend, meet Blackberry Kush. Practically no one buys the product without smelling it first. (Where it’s allowed, that is. In Washington state, pre-purchase smelling for recreational cannabis is against the law.) We don’t talk about them using the same language, although that’s changing as consumers learn more about scent’s connection to the cannabis experience.\n\nAs I stepped through Nectar’s front door, the first thing I noticed was the air, which smelled lightly of sweet herb. The employees — perhaps the happiest service professionals I’ve ever encountered — were all eager to talk to me about their favorite-smelling strains.\nCommercial perfumes are composed of top notes, middle notes (also called heart notes) and base notes, so named based on their relative evaporation rates. A perfume with a top note of essential oil of bergamot (citrus) might be paired with a middle note of lavender oil and a base note of thick, resiny oakmoss. Together they make up the full scent experience of the perfume.\nIn the cannabis world, the language hasn’t yet evolved to describe the plant’s fragrance notes with such specificity. But budtenders and growers are expanding their vocabulary to describe the scent experience. So you may see two main, often contrasting odors: sweet and fruity paired with earthy, like in an Afgooey.\nAt Nectar the jars open dozens of times a day for olfactory sampling. Some strains are more fragrant than others. A Blackberry Kush may not remind anyone of blackberries, but it does have a subtle sweetness to balance the hashy, diesel-fume center it’s known for. GSC (f.k.a Girl Scout Cookies), another potent strain, smells oily and pungent in the middle and slightly sweet on top.\nAll cannabis strains carry their own scent signature, a fact that often surprises cannabis consumers who come to a shop for the first time.\n\n“First-timers generally know about THC content and little else,” Dieter said. “But then they usually stand there smelling all day to find a perfect match.”\nSome strains share some of their scent identity with the world of aromatherapy. An activating hybrid sativa like Orange Crush has much in common with a bitter orange essential oil — one often used by aromatherapists for energizing. In the same vein, the citrus-scented J1, a sativa hybrid, smells like a traditional fougère-style perfume, opening with a citrus note and moving into an herby heart.\nBecause scent is deeply personal, no one really agrees on which strains smell best. A savory, cheesy strain like OG99 might send some running for the hills, but for consumers who like to “smoke savory,” the associated mellow vibe is well worth it.\nOther consumers prefer the so-called “authentic-smelling” pot strains. For them, something like The Perps, which gives off the odor of a grape Jolly Rancher, might feel like spraying your face with Britney Spears’ Curious.\nWhy Consumption Methods Matter When It Comes to Scent Preservation\nWhen it comes to harnessing the scent of cannabis, consumption methods matter.\n\nA cannabis flower’s scent comes directly from its terpenes, volatile aromatic organic compounds found in the oils of all flowers. Terpenes in the cannabis flower evolved to attract pollinators or repel enemies. More than 100 possible terpenes are thought to exist in various strains of the cannabis flower.\nThe unique combination of terpenes in a particular strain produces its aromatic properties and, some believe, is thought to influence the body’s high. To heighten the experience of the terpenes, therefore, consumers should reach for consumption methods involving less combustion. The higher the burn temperature, the more likely the most volatile and aromatic terpenes will combust before being consumed.\nIn other words, to get the full scent experience, vape it, don’t smoke it.\n“When you have a vaping machine, it can hinder the effect of the flavor,” said Myles Hyde, a budtender at Nectar who specializes in medicinal use. For flower, Hyde suggested using a vaporizer in at least the $250 range. “With a lower-quality machine, you may end up smelling some of the machine itself.”\n\nThose who do want to smoke it would be advised to do it indoors, according to Hyde, where the scent lingers, affecting the high.\nOther methods, like using hash oil, produces a concentrated scent experience so aromatic it feels like smelling an aged perfume. Dieter pulled a Dogwalker resin with a smell reminiscent of jasmine concentrate: dirty, floral, even slightly fecal. In this way, fragrance obsessives are much like cheese hounds or any other aficionados who move with passion into a sensual pursuit — as they explore their olfactory world, they become more and more enamored with scents that might repel the layperson.\nEmphasizing Fragrance as Part of the Purchasing Decision\nThe importance of scent is beginning to take on a bigger role in the purchasing decision at some of Portland’s leading retail shops. During a recent visit to Oregon’s Finest, a store tucked into the city’s swanky Pearl District, manager Selena Toomey pulled flower-filled apothecary jars off a shelf for me.\n“Strains sell themselves based on their scent,” Toomey said. “It makes a huge difference in the experience.”\n\nPerfumers are taught to smell coffee beans between samples in order to cleanse their palates. Oregon’s Finest has adapted the practice for the cannabis connoisseur. Toomey invited me to sniff single-origin beans (this is Portland, after all) while passing between strain jars.\nToomey often suggests patients spend up to 10 minutes working the flower in their hands before smoking or vaping it. Doing so, she said, allows you to smell more of the terpenes and enhance the way it tastes when consumed.\n“The terpenoids and flavonoids play a huge part in opening up your receptors to all of the effects of the cannabis,” Toomey explained. “It’s like steaming in a hot shower before you moisturize.”\nScent scientists often talk about the cognitive barriers to talking about our often ignored fifth sense — that we don’t really practice the language needed to really discuss scent.\n\nWhen Toomey talks about scent to her customers, she sometimes avoids scent talk and focuses on taste, which offers a vocabulary more familiar to most consumers. She’ll speak of a strain like Dutch Treat as being like “mint chocolate chip ice cream.”\nToomey has been at Oregon’s Finest since its 2014 opening. She’s seen her customer base grow from curiosity to connoisseurship, even as the shop retains its focus on pot’s medicinal effects.\nShe sells individual terpenes as an additive to other marijuana products for medicinal users. Once you have enough experience to identify specific terpenes by smell alone, you can anticipate the associated high, she said.\n“If I’m in a dispensary, I can tell by the aroma if a strain will work with my body,” Toomey added. “The nose knows.”\nEmily Grosvenor is a writer and perfumer based in Oregon. You can follow her on Twitter.\nImage Source: Sara Dilley","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/03/29195541/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea.jpg","urlslug":"/news/cannabis-101/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea"}],"reviewCount":435,"flavors":[{"name":"Citrus","score":55.725723226472255},{"name":"Orange","score":50.29961050634175},{"name":"Sweet","score":31.215419954059723},{"name":"Earthy","score":15.026798495289457},{"name":"Lemon","score":11.11438463331003}],"effects":[{"name":"Uplifted","score":69.568227970305273},{"name":"Energetic","score":67.2885249176071},{"name":"Happy","score":67.248077499250968},{"name":"Euphoric","score":39.705216551815973},{"name":"Relaxed","score":37.430839908119445}],"symptoms":[{"name":"Fatigue","score":40.764339691734079},{"name":"Stress","score":39.657778221645195},{"name":"Depression","score":34.962215786144675},{"name":"Pain","score":16.476746895702256},{"name":"Insomnia","score":15.785811778021905}],"conditions":[{"name":"Anxiety","score":24.014281434135626},{"name":"PTSD","score":6.7337461300309593},{"name":"Fibromyalgia","score":5.4269449715370017},{"name":"ADD/ADHD","score":5.0742368254602344},{"name":"Bipolar Disorder","score":4.4575385332401209}],"negatives":[{"name":"Dry Mouth","score":21.003195845400981},{"name":"Dry Eyes","score":13.821032657545192},{"name":"Headache","score":12.228769266620061},{"name":"Anxious","score":12.086454276107727},{"name":"Paranoid","score":7.8929058890109527}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/orange-crush/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/orange-crush/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_8440.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/670890/b/orange-crush__primary_49f9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_ec51.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/660787/b/orange-crush__primary_670a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_ca89.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630161/b/orange-crush__primary_de75.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_4176.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617172/b/orange-crush__primary_fc7e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_632b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/602897/b/orange-crush__primary_dcc8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_aa0e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/587915/b/orange-crush__primary_794c.jpg"}],"photoTotalCount":159,"popularCities":["Portland, OR","Vancouver, BC","Montréal, QC","Spokane, WA","Toronto, ON","Calgary, AB","Edmonton, AB","Eugene, OR","Vancouver, WA","Victoria, BC"],"permalink":"https://mobileapi.leafly.com/hybrid/orange-crush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.18620689655172/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"California Orange","subtitle":null,"slug":"california-orange","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/california-orange","symbol":"Cal","applink":"leafly://strain/california-orange"},{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"\n\tHigh calyx-to-leaf ratio makes for easy trimming\n\tGrows best as a multi-branch plant\n\tDoes well with moderate to heavy nutrients\n\tYields typically fall between 400-500g/m\u0026sup2;\n\n"}}
{"sl_translate":"description,descriptionPlain,category","id":156,"slug":"orange-crush","name":"Orange Crush","subtitle":null,"symbol":"Oc","category":"Hybrid","description":"\u003cp\u003eOrange Crush is a sativa-dominant cannabis strain with a super sweet tangy flavor and aroma.\u0026nbsp;Bred by BC Growers Association with \u003ca href=\"http://www.leafly.com/hybrid/california-orange\"\u003eCalifornia\u0026nbsp;Orange\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/blueberry\"\u003eBlueberry\u003c/a\u003e for parents, Orange Crush produces a powerful cerebral sensation\u0026nbsp;that can last up to two hours. It has small, dense buds that contain\u0026nbsp;a large amount of trichomes and many orange pistils. Orange Crush\u0026nbsp;has a flowering time of 7-9 weeks and a THC content of up to 15%.\u003c/p\u003e\n","descriptionPlain":"Orange Crush is a sativa-dominant cannabis strain with a super sweet tangy flavor and aroma.\u0026nbsp;Bred by BC Growers Association with California\u0026nbsp;Orange and Blueberry for parents, Orange Crush produces a powerful cerebral sensation\u0026nbsp;that can last up to two hours. It has small, dense buds that contain\u0026nbsp;a large amount of trichomes and many orange pistils. Orange Crush\u0026nbsp;has a flowering time of 7-9 weeks and a THC content of up to 15%.\n","aka":null,"rating":4.19,"highlightedReviews":[{"id":1413676,"username":"ContinentalKush","text":"Wow. This strain is crazy. It tastes of citrus very strongly and I love it.  It also smells really potent; it\u0027s almost like a dense citrus smell. The high was very exciting for my mind which made me laugh at the slightest out-of-place comments and at the same time was making my head heavy. I also note that I had the halo-head affect which is great. All in all, its a very conversational friendly high which stimulates the brain and at the end of the day puts you sound to sleep. One of my favorites, so far. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1631697,"username":"FunWaysToHeal","text":"Tried my first Oc today. It tasted sweet, which I liked but it didn’t have the citrusy orange taste that I expected. It wasn’t a great looking batch but the price was right. The smoke was mild in my mouth and it made my tongue tingle. Kind of the way it does when you eat citrus fruit. I enjoyed the light sweet scent it left in the air. I’ve been struggling with a lack of energy and fibro fog so I thought I’d give Orange Crush (Orange Cali X Blueberry) a go first thing in the morning. Whenever I’m trying a new cannabis strain for the first time, I always start off with a little because I have no idea how it’s going to affect me. Turns out, a little nug in a bong was just right for starting my day.  It took a few minutes but before I knew it my energy had picked up slightly and my mood sky rocketed.  I was feeling uplifted, brainy, and happy. And, I realized that I was totally stress free. I didn’t experience any bad side effects, not even dry mouth. I’m surprised at how long the effects lasted from such a small amount. Can’t wait to try a better batch of Orange Crush, pretty sure it’ll be a five.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/IrM8gHUbXY3itR-O7G2Vjy3BwbY=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2fXuvJ4Whz3Ap6XVvvxVCiu9oHQQc%3d%2f120x120%2fhttps%253A%252F%252Fs3-us-west-2.amazonaws.com%252Fleafly-images%252Fuser-profile%252Fy1ivlzR3TNqzsqS0h6XD_IMG_6354.jpg"}],"relatedStrains":[],"articles":[{"id":"contentitems-15444","title":"Taste the \u0027Strainbow\u0027 With These Colorful Cannabis Pairings","author":"Hannah Meadows","category":null,"date":"\/Date(1484171120000)\/","text":"For every color in the rainbow there is a complementing strain ready to match each individual’s absolute favorite hue. Only drink out of blue cups? Wear a lot of purple?  Refuse to eat something that isn’t orange-tinted? Pair your number one color with a little bit of green! Below we list a strain pairing that goes hand in hand with each letter in ROYGBIV.\nRed\n\nFiery, passionate, sensual – red is a power color that tends to allure the sexes and could possibly give you a promotion. Pair this magnetic color with the “speedy and intense” Panama Red, a full sativa that will match that flash of red lipstick or vibrant watch band.\nOrange\n\nThis warm and fizzy hue can only pair best with a warm and fizzy strain. Enter Orange Crush – its sweet and tangy flavor perfectly complements its twin color.\nYellow\n\nIn the dead of winter, yellow reminisces sunny days and lemonade. Try Lemon Haze to melt the frost – it’s a citrusy sativa whose buds appear green and yellow. The lemony taste will bring back your sunny disposition through these chilly months.\nGreen\n\nWith 2017’s color of the year being “greenery,” the hybrid Green Dream is an excellent addition to any green stash.\nBlue\n\nBlue has always been a fan favorite and possibly the most popular color of the rainbow – it’s calming, tranquil, and makes one think of the sky and the sea. The hybrid ArcticBlue pairs well with this peaceful color and its anti-anxiety effects.\nHonorable mention goes to the hybrid Blue Dream, a strain that has become just as popular as the color itself.\nIndigo\n\nIndigo is the in-between of purple and blue – a deep, gorgeous hue that can only be complemented by the hybrid strain Blurple. It’s the best mix of Blue Dream and Mendocino Purps, just as indigo is the best mix of purple and blue, aka “blurple.”\nViolet\n\nA color that received its name from the violet flower, it’s only logical to pair this beautiful hue with the hybrid strain Violet Delight. It releases a strong floral flavor that will have you dreaming in shades of purple.\nIf your favorite color is outside of the rainbow spectrum, we have a couple of honorary mentions for you to pick up.\n\nPink\n\nThough pink is not technically a color of the rainbow, we couldn’t leave out this bubblegum pop favorite. Pair that Pepto-Bismol toned jacket that’s been collecting dust in your closet with the sweet and fruity indica Pink Berry.\nBlack\n\nFor those who live and breathe in waves of black, don’t pass up the indica Black Domina. It’s a strain designed for late night, so grab your best black pajamas, black slippers, black robe, and pull in this heavy strain deep into the night.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/25130741/rainbow.jpg","urlslug":"/news/strains-products/rainbow-marijuana-strains"},{"id":"contentitems-6025","title":"Cannabis Scents and Sensibility: Why Marijuana\u0027s Fragrance Is a Feast for the Nose","author":"Emily Grosvenor","category":null,"date":"\/Date(1459224000000)\/","text":"To make a truly informed cannabis-buying decision, you have to smell the product. And I don’t mean taking a dainty whiff. You’ve got get in there and really inhale, because smelling it — really focusing on the fragrance — may just be the best way to choose your cannabis.\n“Depending on what the scent is, it can make or break a strain for people,” said Tyson Dieter, a manager at the Southwest Portland outlet of Nectar, an Oregon cannabis retailer.\nI’m a home perfumer trained by a world-class nose. Years ago I trained at home using natural perfumer Mandy Aftel’s workbooks, and later I studied with her at her studio in Berkeley, Calif. For me scent is the ultimate in pleasure experiences. On a recent Tuesday morning, I stopped in at Nectar to talk scent and learn about the role it plays in the burgeoning cannabis industry.\nWhat Do Cannabis and Perfumes Have in Common?\nIt turns out perfume and pot have a lot in common.\nBoth products come with outlandish, sometimes arbitrary titles. Burberry Weekend, meet Blackberry Kush. Practically no one buys the product without smelling it first. (Where it’s allowed, that is. In Washington state, pre-purchase smelling for recreational cannabis is against the law.) We don’t talk about them using the same language, although that’s changing as consumers learn more about scent’s connection to the cannabis experience.\n\nAs I stepped through Nectar’s front door, the first thing I noticed was the air, which smelled lightly of sweet herb. The employees — perhaps the happiest service professionals I’ve ever encountered — were all eager to talk to me about their favorite-smelling strains.\nCommercial perfumes are composed of top notes, middle notes (also called heart notes) and base notes, so named based on their relative evaporation rates. A perfume with a top note of essential oil of bergamot (citrus) might be paired with a middle note of lavender oil and a base note of thick, resiny oakmoss. Together they make up the full scent experience of the perfume.\nIn the cannabis world, the language hasn’t yet evolved to describe the plant’s fragrance notes with such specificity. But budtenders and growers are expanding their vocabulary to describe the scent experience. So you may see two main, often contrasting odors: sweet and fruity paired with earthy, like in an Afgooey.\nAt Nectar the jars open dozens of times a day for olfactory sampling. Some strains are more fragrant than others. A Blackberry Kush may not remind anyone of blackberries, but it does have a subtle sweetness to balance the hashy, diesel-fume center it’s known for. GSC (f.k.a Girl Scout Cookies), another potent strain, smells oily and pungent in the middle and slightly sweet on top.\nAll cannabis strains carry their own scent signature, a fact that often surprises cannabis consumers who come to a shop for the first time.\n\n“First-timers generally know about THC content and little else,” Dieter said. “But then they usually stand there smelling all day to find a perfect match.”\nSome strains share some of their scent identity with the world of aromatherapy. An activating hybrid sativa like Orange Crush has much in common with a bitter orange essential oil — one often used by aromatherapists for energizing. In the same vein, the citrus-scented J1, a sativa hybrid, smells like a traditional fougère-style perfume, opening with a citrus note and moving into an herby heart.\nBecause scent is deeply personal, no one really agrees on which strains smell best. A savory, cheesy strain like OG99 might send some running for the hills, but for consumers who like to “smoke savory,” the associated mellow vibe is well worth it.\nOther consumers prefer the so-called “authentic-smelling” pot strains. For them, something like The Perps, which gives off the odor of a grape Jolly Rancher, might feel like spraying your face with Britney Spears’ Curious.\nWhy Consumption Methods Matter When It Comes to Scent Preservation\nWhen it comes to harnessing the scent of cannabis, consumption methods matter.\n\nA cannabis flower’s scent comes directly from its terpenes, volatile aromatic organic compounds found in the oils of all flowers. Terpenes in the cannabis flower evolved to attract pollinators or repel enemies. More than 100 possible terpenes are thought to exist in various strains of the cannabis flower.\nThe unique combination of terpenes in a particular strain produces its aromatic properties and, some believe, is thought to influence the body’s high. To heighten the experience of the terpenes, therefore, consumers should reach for consumption methods involving less combustion. The higher the burn temperature, the more likely the most volatile and aromatic terpenes will combust before being consumed.\nIn other words, to get the full scent experience, vape it, don’t smoke it.\n“When you have a vaping machine, it can hinder the effect of the flavor,” said Myles Hyde, a budtender at Nectar who specializes in medicinal use. For flower, Hyde suggested using a vaporizer in at least the $250 range. “With a lower-quality machine, you may end up smelling some of the machine itself.”\n\nThose who do want to smoke it would be advised to do it indoors, according to Hyde, where the scent lingers, affecting the high.\nOther methods, like using hash oil, produces a concentrated scent experience so aromatic it feels like smelling an aged perfume. Dieter pulled a Dogwalker resin with a smell reminiscent of jasmine concentrate: dirty, floral, even slightly fecal. In this way, fragrance obsessives are much like cheese hounds or any other aficionados who move with passion into a sensual pursuit — as they explore their olfactory world, they become more and more enamored with scents that might repel the layperson.\nEmphasizing Fragrance as Part of the Purchasing Decision\nThe importance of scent is beginning to take on a bigger role in the purchasing decision at some of Portland’s leading retail shops. During a recent visit to Oregon’s Finest, a store tucked into the city’s swanky Pearl District, manager Selena Toomey pulled flower-filled apothecary jars off a shelf for me.\n“Strains sell themselves based on their scent,” Toomey said. “It makes a huge difference in the experience.”\n\nPerfumers are taught to smell coffee beans between samples in order to cleanse their palates. Oregon’s Finest has adapted the practice for the cannabis connoisseur. Toomey invited me to sniff single-origin beans (this is Portland, after all) while passing between strain jars.\nToomey often suggests patients spend up to 10 minutes working the flower in their hands before smoking or vaping it. Doing so, she said, allows you to smell more of the terpenes and enhance the way it tastes when consumed.\n“The terpenoids and flavonoids play a huge part in opening up your receptors to all of the effects of the cannabis,” Toomey explained. “It’s like steaming in a hot shower before you moisturize.”\nScent scientists often talk about the cognitive barriers to talking about our often ignored fifth sense — that we don’t really practice the language needed to really discuss scent.\n\nWhen Toomey talks about scent to her customers, she sometimes avoids scent talk and focuses on taste, which offers a vocabulary more familiar to most consumers. She’ll speak of a strain like Dutch Treat as being like “mint chocolate chip ice cream.”\nToomey has been at Oregon’s Finest since its 2014 opening. She’s seen her customer base grow from curiosity to connoisseurship, even as the shop retains its focus on pot’s medicinal effects.\nShe sells individual terpenes as an additive to other marijuana products for medicinal users. Once you have enough experience to identify specific terpenes by smell alone, you can anticipate the associated high, she said.\n“If I’m in a dispensary, I can tell by the aroma if a strain will work with my body,” Toomey added. “The nose knows.”\nEmily Grosvenor is a writer and perfumer based in Oregon. You can follow her on Twitter.\nImage Source: Sara Dilley","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/03/29195541/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea.jpg","urlslug":"/news/cannabis-101/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea"}],"reviewCount":435,"flavors":[{"name":"Citrus","score":55.725723226472255},{"name":"Orange","score":50.29961050634175},{"name":"Sweet","score":31.215419954059723},{"name":"Earthy","score":15.026798495289457},{"name":"Lemon","score":11.11438463331003}],"effects":[{"name":"Uplifted","score":69.568227970305273},{"name":"Energetic","score":67.2885249176071},{"name":"Happy","score":67.248077499250968},{"name":"Euphoric","score":39.705216551815973},{"name":"Relaxed","score":37.430839908119445}],"symptoms":[{"name":"Fatigue","score":40.764339691734079},{"name":"Stress","score":39.657778221645195},{"name":"Depression","score":34.962215786144675},{"name":"Pain","score":16.476746895702256},{"name":"Insomnia","score":15.785811778021905}],"conditions":[{"name":"Anxiety","score":24.014281434135626},{"name":"PTSD","score":6.7337461300309593},{"name":"Fibromyalgia","score":5.4269449715370017},{"name":"ADD/ADHD","score":5.0742368254602344},{"name":"Bipolar Disorder","score":4.4575385332401209}],"negatives":[{"name":"Dry Mouth","score":21.003195845400981},{"name":"Dry Eyes","score":13.821032657545192},{"name":"Headache","score":12.228769266620061},{"name":"Anxious","score":12.086454276107727},{"name":"Paranoid","score":7.8929058890109527}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/orange-crush/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/orange-crush/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_8440.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/670890/b/orange-crush__primary_49f9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_ec51.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/660787/b/orange-crush__primary_670a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_ca89.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630161/b/orange-crush__primary_de75.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_4176.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617172/b/orange-crush__primary_fc7e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_632b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/602897/b/orange-crush__primary_dcc8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_aa0e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/587915/b/orange-crush__primary_794c.jpg"}],"photoTotalCount":159,"popularCities":["Portland, OR","Vancouver, BC","Montréal, QC","Spokane, WA","Toronto, ON","Calgary, AB","Edmonton, AB","Eugene, OR","Vancouver, WA","Victoria, BC"],"permalink":"https://mobileapi.leafly.com/hybrid/orange-crush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.18620689655172/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"California Orange","subtitle":null,"slug":"california-orange","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/california-orange","symbol":"Cal","applink":"leafly://strain/california-orange"},{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"\n\tHigh calyx-to-leaf ratio makes for easy trimming\n\tGrows best as a multi-branch plant\n\tDoes well with moderate to heavy nutrients\n\tYields typically fall between 400-500g/m\u0026sup2;\n\n"}}
{"sl_translate":"description,descriptionPlain,category","id":156,"slug":"orange-crush","name":"Orange Crush","subtitle":null,"symbol":"Oc","category":"Hybrid","description":"\u003cp\u003eOrange Crush is a sativa-dominant cannabis strain with a super sweet tangy flavor and aroma.\u0026nbsp;Bred by BC Growers Association with \u003ca href=\"http://www.leafly.com/hybrid/california-orange\"\u003eCalifornia\u0026nbsp;Orange\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/blueberry\"\u003eBlueberry\u003c/a\u003e for parents, Orange Crush produces a powerful cerebral sensation\u0026nbsp;that can last up to two hours. It has small, dense buds that contain\u0026nbsp;a large amount of trichomes and many orange pistils. Orange Crush\u0026nbsp;has a flowering time of 7-9 weeks and a THC content of up to 15%.\u003c/p\u003e\n","descriptionPlain":"Orange Crush is a sativa-dominant cannabis strain with a super sweet tangy flavor and aroma.\u0026nbsp;Bred by BC Growers Association with California\u0026nbsp;Orange and Blueberry for parents, Orange Crush produces a powerful cerebral sensation\u0026nbsp;that can last up to two hours. It has small, dense buds that contain\u0026nbsp;a large amount of trichomes and many orange pistils. Orange Crush\u0026nbsp;has a flowering time of 7-9 weeks and a THC content of up to 15%.\n","aka":null,"rating":4.19,"highlightedReviews":[{"id":1413676,"username":"ContinentalKush","text":"Wow. This strain is crazy. It tastes of citrus very strongly and I love it.  It also smells really potent; it\u0027s almost like a dense citrus smell. The high was very exciting for my mind which made me laugh at the slightest out-of-place comments and at the same time was making my head heavy. I also note that I had the halo-head affect which is great. All in all, its a very conversational friendly high which stimulates the brain and at the end of the day puts you sound to sleep. One of my favorites, so far. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1631697,"username":"FunWaysToHeal","text":"Tried my first Oc today. It tasted sweet, which I liked but it didn’t have the citrusy orange taste that I expected. It wasn’t a great looking batch but the price was right. The smoke was mild in my mouth and it made my tongue tingle. Kind of the way it does when you eat citrus fruit. I enjoyed the light sweet scent it left in the air. I’ve been struggling with a lack of energy and fibro fog so I thought I’d give Orange Crush (Orange Cali X Blueberry) a go first thing in the morning. Whenever I’m trying a new cannabis strain for the first time, I always start off with a little because I have no idea how it’s going to affect me. Turns out, a little nug in a bong was just right for starting my day.  It took a few minutes but before I knew it my energy had picked up slightly and my mood sky rocketed.  I was feeling uplifted, brainy, and happy. And, I realized that I was totally stress free. I didn’t experience any bad side effects, not even dry mouth. I’m surprised at how long the effects lasted from such a small amount. Can’t wait to try a better batch of Orange Crush, pretty sure it’ll be a five.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/IrM8gHUbXY3itR-O7G2Vjy3BwbY=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2fXuvJ4Whz3Ap6XVvvxVCiu9oHQQc%3d%2f120x120%2fhttps%253A%252F%252Fs3-us-west-2.amazonaws.com%252Fleafly-images%252Fuser-profile%252Fy1ivlzR3TNqzsqS0h6XD_IMG_6354.jpg"}],"relatedStrains":[],"articles":[{"id":"contentitems-15444","title":"Taste the \u0027Strainbow\u0027 With These Colorful Cannabis Pairings","author":"Hannah Meadows","category":null,"date":"\/Date(1484171120000)\/","text":"For every color in the rainbow there is a complementing strain ready to match each individual’s absolute favorite hue. Only drink out of blue cups? Wear a lot of purple?  Refuse to eat something that isn’t orange-tinted? Pair your number one color with a little bit of green! Below we list a strain pairing that goes hand in hand with each letter in ROYGBIV.\nRed\n\nFiery, passionate, sensual – red is a power color that tends to allure the sexes and could possibly give you a promotion. Pair this magnetic color with the “speedy and intense” Panama Red, a full sativa that will match that flash of red lipstick or vibrant watch band.\nOrange\n\nThis warm and fizzy hue can only pair best with a warm and fizzy strain. Enter Orange Crush – its sweet and tangy flavor perfectly complements its twin color.\nYellow\n\nIn the dead of winter, yellow reminisces sunny days and lemonade. Try Lemon Haze to melt the frost – it’s a citrusy sativa whose buds appear green and yellow. The lemony taste will bring back your sunny disposition through these chilly months.\nGreen\n\nWith 2017’s color of the year being “greenery,” the hybrid Green Dream is an excellent addition to any green stash.\nBlue\n\nBlue has always been a fan favorite and possibly the most popular color of the rainbow – it’s calming, tranquil, and makes one think of the sky and the sea. The hybrid ArcticBlue pairs well with this peaceful color and its anti-anxiety effects.\nHonorable mention goes to the hybrid Blue Dream, a strain that has become just as popular as the color itself.\nIndigo\n\nIndigo is the in-between of purple and blue – a deep, gorgeous hue that can only be complemented by the hybrid strain Blurple. It’s the best mix of Blue Dream and Mendocino Purps, just as indigo is the best mix of purple and blue, aka “blurple.”\nViolet\n\nA color that received its name from the violet flower, it’s only logical to pair this beautiful hue with the hybrid strain Violet Delight. It releases a strong floral flavor that will have you dreaming in shades of purple.\nIf your favorite color is outside of the rainbow spectrum, we have a couple of honorary mentions for you to pick up.\n\nPink\n\nThough pink is not technically a color of the rainbow, we couldn’t leave out this bubblegum pop favorite. Pair that Pepto-Bismol toned jacket that’s been collecting dust in your closet with the sweet and fruity indica Pink Berry.\nBlack\n\nFor those who live and breathe in waves of black, don’t pass up the indica Black Domina. It’s a strain designed for late night, so grab your best black pajamas, black slippers, black robe, and pull in this heavy strain deep into the night.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/25130741/rainbow.jpg","urlslug":"/news/strains-products/rainbow-marijuana-strains"},{"id":"contentitems-6025","title":"Cannabis Scents and Sensibility: Why Marijuana\u0027s Fragrance Is a Feast for the Nose","author":"Emily Grosvenor","category":null,"date":"\/Date(1459224000000)\/","text":"To make a truly informed cannabis-buying decision, you have to smell the product. And I don’t mean taking a dainty whiff. You’ve got get in there and really inhale, because smelling it — really focusing on the fragrance — may just be the best way to choose your cannabis.\n“Depending on what the scent is, it can make or break a strain for people,” said Tyson Dieter, a manager at the Southwest Portland outlet of Nectar, an Oregon cannabis retailer.\nI’m a home perfumer trained by a world-class nose. Years ago I trained at home using natural perfumer Mandy Aftel’s workbooks, and later I studied with her at her studio in Berkeley, Calif. For me scent is the ultimate in pleasure experiences. On a recent Tuesday morning, I stopped in at Nectar to talk scent and learn about the role it plays in the burgeoning cannabis industry.\nWhat Do Cannabis and Perfumes Have in Common?\nIt turns out perfume and pot have a lot in common.\nBoth products come with outlandish, sometimes arbitrary titles. Burberry Weekend, meet Blackberry Kush. Practically no one buys the product without smelling it first. (Where it’s allowed, that is. In Washington state, pre-purchase smelling for recreational cannabis is against the law.) We don’t talk about them using the same language, although that’s changing as consumers learn more about scent’s connection to the cannabis experience.\n\nAs I stepped through Nectar’s front door, the first thing I noticed was the air, which smelled lightly of sweet herb. The employees — perhaps the happiest service professionals I’ve ever encountered — were all eager to talk to me about their favorite-smelling strains.\nCommercial perfumes are composed of top notes, middle notes (also called heart notes) and base notes, so named based on their relative evaporation rates. A perfume with a top note of essential oil of bergamot (citrus) might be paired with a middle note of lavender oil and a base note of thick, resiny oakmoss. Together they make up the full scent experience of the perfume.\nIn the cannabis world, the language hasn’t yet evolved to describe the plant’s fragrance notes with such specificity. But budtenders and growers are expanding their vocabulary to describe the scent experience. So you may see two main, often contrasting odors: sweet and fruity paired with earthy, like in an Afgooey.\nAt Nectar the jars open dozens of times a day for olfactory sampling. Some strains are more fragrant than others. A Blackberry Kush may not remind anyone of blackberries, but it does have a subtle sweetness to balance the hashy, diesel-fume center it’s known for. GSC (f.k.a Girl Scout Cookies), another potent strain, smells oily and pungent in the middle and slightly sweet on top.\nAll cannabis strains carry their own scent signature, a fact that often surprises cannabis consumers who come to a shop for the first time.\n\n“First-timers generally know about THC content and little else,” Dieter said. “But then they usually stand there smelling all day to find a perfect match.”\nSome strains share some of their scent identity with the world of aromatherapy. An activating hybrid sativa like Orange Crush has much in common with a bitter orange essential oil — one often used by aromatherapists for energizing. In the same vein, the citrus-scented J1, a sativa hybrid, smells like a traditional fougère-style perfume, opening with a citrus note and moving into an herby heart.\nBecause scent is deeply personal, no one really agrees on which strains smell best. A savory, cheesy strain like OG99 might send some running for the hills, but for consumers who like to “smoke savory,” the associated mellow vibe is well worth it.\nOther consumers prefer the so-called “authentic-smelling” pot strains. For them, something like The Perps, which gives off the odor of a grape Jolly Rancher, might feel like spraying your face with Britney Spears’ Curious.\nWhy Consumption Methods Matter When It Comes to Scent Preservation\nWhen it comes to harnessing the scent of cannabis, consumption methods matter.\n\nA cannabis flower’s scent comes directly from its terpenes, volatile aromatic organic compounds found in the oils of all flowers. Terpenes in the cannabis flower evolved to attract pollinators or repel enemies. More than 100 possible terpenes are thought to exist in various strains of the cannabis flower.\nThe unique combination of terpenes in a particular strain produces its aromatic properties and, some believe, is thought to influence the body’s high. To heighten the experience of the terpenes, therefore, consumers should reach for consumption methods involving less combustion. The higher the burn temperature, the more likely the most volatile and aromatic terpenes will combust before being consumed.\nIn other words, to get the full scent experience, vape it, don’t smoke it.\n“When you have a vaping machine, it can hinder the effect of the flavor,” said Myles Hyde, a budtender at Nectar who specializes in medicinal use. For flower, Hyde suggested using a vaporizer in at least the $250 range. “With a lower-quality machine, you may end up smelling some of the machine itself.”\n\nThose who do want to smoke it would be advised to do it indoors, according to Hyde, where the scent lingers, affecting the high.\nOther methods, like using hash oil, produces a concentrated scent experience so aromatic it feels like smelling an aged perfume. Dieter pulled a Dogwalker resin with a smell reminiscent of jasmine concentrate: dirty, floral, even slightly fecal. In this way, fragrance obsessives are much like cheese hounds or any other aficionados who move with passion into a sensual pursuit — as they explore their olfactory world, they become more and more enamored with scents that might repel the layperson.\nEmphasizing Fragrance as Part of the Purchasing Decision\nThe importance of scent is beginning to take on a bigger role in the purchasing decision at some of Portland’s leading retail shops. During a recent visit to Oregon’s Finest, a store tucked into the city’s swanky Pearl District, manager Selena Toomey pulled flower-filled apothecary jars off a shelf for me.\n“Strains sell themselves based on their scent,” Toomey said. “It makes a huge difference in the experience.”\n\nPerfumers are taught to smell coffee beans between samples in order to cleanse their palates. Oregon’s Finest has adapted the practice for the cannabis connoisseur. Toomey invited me to sniff single-origin beans (this is Portland, after all) while passing between strain jars.\nToomey often suggests patients spend up to 10 minutes working the flower in their hands before smoking or vaping it. Doing so, she said, allows you to smell more of the terpenes and enhance the way it tastes when consumed.\n“The terpenoids and flavonoids play a huge part in opening up your receptors to all of the effects of the cannabis,” Toomey explained. “It’s like steaming in a hot shower before you moisturize.”\nScent scientists often talk about the cognitive barriers to talking about our often ignored fifth sense — that we don’t really practice the language needed to really discuss scent.\n\nWhen Toomey talks about scent to her customers, she sometimes avoids scent talk and focuses on taste, which offers a vocabulary more familiar to most consumers. She’ll speak of a strain like Dutch Treat as being like “mint chocolate chip ice cream.”\nToomey has been at Oregon’s Finest since its 2014 opening. She’s seen her customer base grow from curiosity to connoisseurship, even as the shop retains its focus on pot’s medicinal effects.\nShe sells individual terpenes as an additive to other marijuana products for medicinal users. Once you have enough experience to identify specific terpenes by smell alone, you can anticipate the associated high, she said.\n“If I’m in a dispensary, I can tell by the aroma if a strain will work with my body,” Toomey added. “The nose knows.”\nEmily Grosvenor is a writer and perfumer based in Oregon. You can follow her on Twitter.\nImage Source: Sara Dilley","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/03/29195541/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea.jpg","urlslug":"/news/cannabis-101/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea"}],"reviewCount":435,"flavors":[{"name":"Citrus","score":55.725723226472255},{"name":"Orange","score":50.29961050634175},{"name":"Sweet","score":31.215419954059723},{"name":"Earthy","score":15.026798495289457},{"name":"Lemon","score":11.11438463331003}],"effects":[{"name":"Uplifted","score":69.568227970305273},{"name":"Energetic","score":67.2885249176071},{"name":"Happy","score":67.248077499250968},{"name":"Euphoric","score":39.705216551815973},{"name":"Relaxed","score":37.430839908119445}],"symptoms":[{"name":"Fatigue","score":40.764339691734079},{"name":"Stress","score":39.657778221645195},{"name":"Depression","score":34.962215786144675},{"name":"Pain","score":16.476746895702256},{"name":"Insomnia","score":15.785811778021905}],"conditions":[{"name":"Anxiety","score":24.014281434135626},{"name":"PTSD","score":6.7337461300309593},{"name":"Fibromyalgia","score":5.4269449715370017},{"name":"ADD/ADHD","score":5.0742368254602344},{"name":"Bipolar Disorder","score":4.4575385332401209}],"negatives":[{"name":"Dry Mouth","score":21.003195845400981},{"name":"Dry Eyes","score":13.821032657545192},{"name":"Headache","score":12.228769266620061},{"name":"Anxious","score":12.086454276107727},{"name":"Paranoid","score":7.8929058890109527}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/orange-crush/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/orange-crush/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_8440.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/670890/b/orange-crush__primary_49f9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_ec51.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/660787/b/orange-crush__primary_670a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_ca89.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630161/b/orange-crush__primary_de75.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_4176.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617172/b/orange-crush__primary_fc7e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_632b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/602897/b/orange-crush__primary_dcc8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-crush_100x100_aa0e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/587915/b/orange-crush__primary_794c.jpg"}],"photoTotalCount":159,"popularCities":["Portland, OR","Vancouver, BC","Montréal, QC","Spokane, WA","Toronto, ON","Calgary, AB","Edmonton, AB","Eugene, OR","Vancouver, WA","Victoria, BC"],"permalink":"https://mobileapi.leafly.com/hybrid/orange-crush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.18620689655172/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"California Orange","subtitle":null,"slug":"california-orange","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/california-orange","symbol":"Cal","applink":"leafly://strain/california-orange"},{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"\n\tHigh calyx-to-leaf ratio makes for easy trimming\n\tGrows best as a multi-branch plant\n\tDoes well with moderate to heavy nutrients\n\tYields typically fall between 400-500g/m\u0026sup2;\n\n"}}
