{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1474398818000)/",
            "id": "contentitems-7785",
            "text": "Compared to most other cocktails and mocktails, punches are easy-peasy – combine all ingredients, stir, chill, and serve. In lieu of extensive preparation, the best punches are simply made by layering complementary flavors, and terpene-laden cannabis adds one more element of both flavor and effect, augmenting the overall experience of classic fall punch drinks.\nThe following autumnal drink recipes are adapted to accommodate the addition of cannabis tinctures. While any infused tincture you have on hand will do, we’ve recommended a few specific strains whose terpenes amplify each elixir. If you don’t have any tinctures handy, you can make your own, or check the menus of your favorite local dispensaries to find a place where you can pick one up.\n\nMix up a batch of one of the following, pop the pitcher in your fridge, and enjoy an extra-chill punch at your leisure. Cheers to fall!\nSparkling Sativa-Pear Punch\n\nThis pretty pink punch is ideal for the last few semi-sunny fall afternoons on the patio or porch. Whether you’re expecting company or cozied up on your own, keep plenty on hand so you’re ready whenever autumn calls for something to sip.\n\n2 parts pear nectar or pear juice\n2 parts Prosecco (make this a non-alcoholic punch with sparkling cider or lemon-lime soda)\n1 part cranberry juice\n10 mg-worth of cannabis tincture (suggested strains: sweet Candy Jack, tart Vortex, or floral Alice in Wonderland)\nGarnish: pear slice and/or freshly grated nutmeg\n\nAdapted from Sparking Pear-Prosecco Punch by Delish.\nCanna-Pome-Grapefruit Punch\n\nThis fruity pomegranate-grapefruit concoction marries your cannabis tincture with bright citrus notes and deep dark pomegranate colors and characteristics. It’s bold, beautiful, and guaranteed to put a smile on your face.\n\n2 parts pomegranate juice\n1 part grapefruit vodka (try Deep Eddy, Smirnoff, or Absolut – or omit the alcohol by subbing in soda water)\n1 part fresh-squeezed grapefruit juice\n10 mg-worth of cannabis tincture (suggested strains: fruit-punchy Dream Berry, grapefruit-orangey Citrix, or the descriptively-named Grapefruit)\nGarnish: pomegranate seeds or a grapefruit wheel\n\nAdapted from Pomegranate Grapefruit Punch by A Simple Pantry.\nAutumn Apple Indica Punch\n\nThis non-alcoholic apple punch is bona-fide fall in a glass: at once crisp, cool, juicy, and refreshing, it’s ratcheted up a notch by the addition of an indica-infused tincture. What better way to melt seasonal stress away?\n\n3 parts apple cider\n2 parts cranberry juice\n1 part ginger beer\n10 mg-worth of cannabis tincture (suggested strains: apple-vanilla Butter OG, honeyed Cream Caramel, or rich, sweet Love Potion #9)\nSqueeze of fresh lime juice\nGarnish: fresh cranberries and a cinnamon stick\n\nAdapted from Apple Orchard Punch by Allrecipes.\nNote: Always imbibe both cannabis and alcohol responsibly, and never drive after consuming either. When in doubt on the potency of your tincture, start with a small amount and work up – you can always add more, but you can’t add less.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/20132059/fruit-punch-header.jpg",
            "title": "Try These Cannabis-Infused Fall Punch Recipes That Use Fruity Strains",
            "urlslug": "/news/lifestyle/recipes-for-cannabis-fall-fruit-punch-drinks"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1438963200000)/",
            "id": "contentitems-3255",
            "text": "New strains have just been added to the Leafly strain database, and if you're the type of person who appreciates flavor, we suggest you bee line it to one of the dispensaries/shops listed below. Lemon Marmalade, Lemon Alien Dawg, Citrix, Gelato…we've got your fruity fix covered. Now go forth and leave some strain reviews for all the ones you've already experienced!\n \n 1. Citrix\n\nCitrix is a hybrid cannabis strain that draws its genetics from a flavorful Grapefruit mother and a resinous LA Confidential male. Named for its intense orange aroma, Citrix entices the senses before drawing you into its active, clear-headed euphoria. If Citrix makes it into your garden, the telltale signs of a good phenotype include a pungent aroma, disease resistance, heavy yields, rapid vegetative growth, and a dense bud structure.\n\nClick here for a full list of dispensaries and recreational shops carrying Citrix\n \n 2. DelaHaze\n\nDelaHaze by Paradise Seeds is a 70% sativa strain bred from Mango Haze and California Lemon Skunk genetics. To the delight of commercial growers, DelaHaze has the energetic effect profile of a Haze sativa while still offering sizeable yields and a moderate flowering time. Mango and citrus notes express themselves loudly and bring a sweet overtone to the strain's earthy, spicy aroma. Staying true to its Haze genetics, this sativa delivers uplifting cerebral energy that fuels creativity, focus, and happiness, and then tapers into calm relaxation in time.\n\nDelaHaze is currently available at Seattle Cannabis Co. (Recreational — Seattle, WA) and Local Roots Marijuana (Recreational — Bothell, WA)\n \n 3. CannaSutra\n\nCannaSutra by Delta 9 Labs is a 70/30 indica-dominant cannabis strain parented by Reclining Buddha and Sensi Star. Appropriately derived from the Sanskrit love guide Kama Sutra, this strain is said to sharpen the senses for enhanced romantic encounters. Mellow and functional enough to leave mental acuity intact, CannaSutra is an excellent indica for daytime indulgence. Its flavor is comparable to that of incense, with sweet hashy accents that leave you feeling relaxed and peaceful as you exhale.\n\nCannaSutra is currently available at Natural Green Medicine (Medical — Seattle, WA)\n \n 4. Gelato\n\nGelato is another tantalizing hybrid cannabis strain from Cookie Fam Genetics, following in the footsteps of its parents Sunset Sherbet and Thin Mint GSC (f.k.a Girl Scout Cookies). This Bay Area, California native gets its name from the fruity, dessert-like aroma, a common genetic thread among the Cookie family. Her buds tend to bloom in dark purple hues illuminated by fiery orange hairs and a shining white coat of crystal resin. Novice consumers may want to approach this THC powerhouse with caution, but those armed with a high tolerance will delight in Gelato’s heavy-handed euphoria. Physical relaxation comes on strong, but many find themselves still mentally agile enough to stay productive and creative when enjoying Gelato during the day.\n\nClick here for a full list of dispensaries and recreational shops carrying Gelato\n \n 5. White Buffalo\n\nWhite Buffalo is an 80/20 sativa-dominant cannabis strain that descends from a Romulan and a Blackberry Kush/Bay 11 hybrid. Like the sacred animal of Native American tradition, this White Buffalo is a cherished rarity that may only seldom migrate to your stash jar. Sweetly sour in flavor and covered in a snowy coat of crystal trichomes, White Buffalo provides a powerful blast of euphoria that may surprise any consumer expecting an active and uplifting sativa experience.\n\nClick here for a full list of dispensaries and recreational shops carrying White Buffalo\n \n 6. Lemon Alien Dawg\n\nLemon Alien Dawg comes from Alien Genetics, who crossbred an Alien Dawg female with Lemon Kush to create this pungent hybrid cannabis strain. Large chunky buds radiate with sweet and sour fruity notes dominated by the zesty scent of lemon. Leaning slightly to the indica side of the genetic spectrum, Lemon Alien Dawg lets your body sink into deep relaxation while the mind floats away to happy escapes.\n\nClick here for a full list of dispensaries and recreational shops carrying Lemon Alien Dawg\n \n 7. Lemon Marmalade\n\nLemon Marmalade is potent hybrid from Washington State, bred by Platinum Extracts. The strain was developed by crossing Deadhead OG with Cookie Dough, a select phenotype of GSC (f.k.a Girl Scout Cookies). Caked with trichomes and radiating citrus and diesel fumes, Lemon Marmalade creates a complex flavor mix of lemon and piney Kush with subtle fruit undertones. Lemon Marmalade took home the prize for Best BHO – THC at the 2015 DOPE Cup in Seattle and rumor has it the flower has tested upwards of 30% THC. The effects from Lemon Marmalade come on quick with a euphoric burst of heady energy that quickly levels off into a more relaxing full-bodied experience.\n\n ",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/08/12002031/new-strains-alert-citrix-cannasutra-gelato-lemon-alien-dawg-and-m.jpg",
            "title": "New Strains Alert: Citrix, CannaSutra, Gelato, Lemon Alien Dawg, and More",
            "urlslug": "/news/strains-products/new-strains-alert-citrix-cannasutra-gelato-lemon-alien-dawg-and-m"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 41.22077922077922
        },
        {
            "name": "PTSD",
            "score": 34.298701298701296
        },
        {
            "name": "Fibromyalgia",
            "score": 27.324675324675326
        },
        {
            "name": "PMS",
            "score": 27.324675324675326
        },
        {
            "name": "Migraines",
            "score": 6.974025974025974
        }
    ],
    "description": "<p>Citrix is a hybrid cannabis strain that draws its genetics from a flavorful <a href=\"https://www.leafly.com/sativa/grapefruit\">Grapefruit</a> mother and a resinous <a href=\"https://www.leafly.com/indica/la-confidential\">LA Confidential</a> male. Named for its intense orange aroma, Citrix entices the senses before drawing you into its active, clear-headed euphoria. If Citrix makes it into your garden, the telltale signs of a good <a href=\"https://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\">phenotype</a> include a pungent aroma, disease resistance, heavy yields, rapid vegetative growth, and a dense bud structure.</p>\n",
    "descriptionPlain": "Citrix is a hybrid cannabis strain that draws its genetics from a flavorful Grapefruit mother and a resinous LA Confidential male. Named for its intense orange aroma, Citrix entices the senses before drawing you into its active, clear-headed euphoria. If Citrix makes it into your garden, the telltale signs of a good phenotype include a pungent aroma, disease resistance, heavy yields, rapid vegetative growth, and a dense bud structure.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 76.71428571428571
        },
        {
            "name": "Energetic",
            "score": 68.81818181818181
        },
        {
            "name": "Tingly",
            "score": 58.5974025974026
        },
        {
            "name": "Uplifted",
            "score": 50.09090909090909
        },
        {
            "name": "Relaxed",
            "score": 47.16883116883117
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 103.06493506493507
        },
        {
            "name": "Lime",
            "score": 50.97402597402598
        },
        {
            "name": "Grapefruit",
            "score": 41.81818181818182
        },
        {
            "name": "Lemon",
            "score": 37.922077922077925
        },
        {
            "name": "Orange",
            "score": 33.54545454545455
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": "Moderate",
        "environment": null,
        "floweringDays": 74,
        "growNotes": "\n\tRapid vegetative growth\n\tMay be pinched or topped during vegetative period for improved yields\n\n",
        "height": "Tall",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1416418,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "My first hit via bubbler was truly unique. the flavor of grapefruit was overpoweringly delicious, followed by the robust undertone from the resinous LA confidential. the high was pleasant. helped both my many physical/ mental ailments. the terpene profiling was one that gave a very positive, engaging, focused feeling. making me ready for anything the day had to offer, so if your feeling down and out, and need that pain stopping, uplifting, motivator Id recommend this strain to you. ",
            "username": "makis88"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1599412,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "smells just like citrus, taste like sprite with hints of orange.. I really like the purple and blue buds with the brught lime green...made me energetic,  so i wouldnt recommend for late night toking.",
            "username": "MRacuzi98"
        }
    ],
    "id": 173937,
    "name": "Citrix",
    "negatives": [
        {
            "name": "Dry Eyes",
            "score": 6.64935064935065
        },
        {
            "name": "Dry Mouth",
            "score": 6.272727272727273
        },
        {
            "name": "Anxious",
            "score": 5.298701298701299
        },
        {
            "name": "Headache",
            "score": 2.324675324675325
        },
        {
            "name": "Paranoid",
            "score": 0.3246753246753247
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/grapefruit",
            "category": "Sativa",
            "name": "Grapefruit",
            "permalink": "https://mobileapi.leafly.com/sativa/grapefruit",
            "slug": "grapefruit",
            "subtitle": null,
            "symbol": "Grf"
        },
        {
            "applink": "leafly://strain/la-confidential",
            "category": "Indica",
            "name": "LA Confidential",
            "permalink": "https://mobileapi.leafly.com/indica/la-confidential",
            "slug": "la-confidential",
            "subtitle": null,
            "symbol": "La"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/citrix",
    "photoTotalCount": 19,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/462975/b/citrix__primary_e965.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/citrix_100x100_51c2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/459523/b/citrix__primary_a516.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/citrix_100x100_fc1f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/428178/b/citrix__primary_f884.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/citrix_100x100_5576.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/416236/b/citrix__primary_b9bc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/citrix_100x100_3e1c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/416171/b/citrix__primary_5321.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/citrix_100x100_5d7f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/415725/b/citrix__primary_c813.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/citrix_100x100_468e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Chicago, IL",
        "Phoenix, AZ",
        "Tucson, AZ",
        "Addison, IL",
        "Effingham, IL",
        "Elmwood Park, IL",
        "Englewood, CO",
        "Fountain Hills, AZ",
        "Gunnison, CO",
        "Homewood, IL"
    ],
    "rating": 4.25,
    "relatedStrains": [],
    "reviewCount": 81,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "citrix",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.24691358024691/240",
    "subtitle": null,
    "symbol": "Ctx",
    "symptoms": [
        {
            "name": "Depression",
            "score": 71.1948051948052
        },
        {
            "name": "Fatigue",
            "score": 59.246753246753244
        },
        {
            "name": "Stress",
            "score": 50.51948051948052
        },
        {
            "name": "Pain",
            "score": 45.27272727272727
        },
        {
            "name": "Headaches",
            "score": 6.64935064935065
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
