{
    "aka": "white siberian",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1511383998000)/",
            "id": "contentitems-49637",
            "text": "A lot of people think of alcohol as the classic social lubricant. For some of us, it is. Alcohol can loosen us up, make us chatty and animated, and wash away social anxiety. It’s also often readily available at social occasions. Meanwhile, many people avoid cannabis use during social events—for one thing, it’s generally not served, and for another, many can recall a time cannabis made them paranoid or sleepy at a party, and don’t want to have that happen again.\n\nLuckily, with the right strains you can avoid the unwanted effects mentioned above. We used the advanced filters in Leafly’s strain explorer to get started, sorting to include strains with the happiest, most talkative highs, and to exclude any strains that make users anxious, paranoid, or sleepy. (If only alcohol’s drawbacks were so easy to filter out, am I right?)\nWe’ve curated the resultant list with our in-house expertise, vetting all suggestions against our own experiences and ensuring there’s a pick for every type of party. Attendees heading to any social occasion will find something below.\nAnd the awards for the best party cannabis strains go to…\nChocolope\nStrain type: Sativa\nBest for: All occasions.\nDNA Genetics developed Chocolope by crossing Chocolate Thai with Cannalope Haze to create their homage to the super-popular Chocolate strains of the 1980s. The hefty sativa buds give earthy, sweet coffee flavors that provide a dreamy, cerebral effect. It’s known around the Leafly office as “the party strain,” and for good reason—it’s basically impossible to be unhappy or introverted with such a feel-good high.\n\nWhite Russian\nStrain type: Hybrid\nBest for: Dinner parties.\nOriginally created by Dutch breeders Serious Seeds, White Russian is a cross of two legendary strains, White Widow and AK-47. An indica-dominant hybrid, it won the High Times Cannabis Cup “Best Overall” in 1996. White Russian is an extremely fragrant plant, and with a flavor that is smooth and spicy with undertones of skunk and earth, and its high is quite cerebral (especially for an indica-dominant strain), making it great for conversation with those around you.\nTangie\nStrain type: Sativa\nBest for: Cocktail parties.\nAnother fave among the Leafly crew, particularly for group gatherings after work, Tangie is a fantastic offering from DNA Genetics in Amsterdam. This strain is a remake of sorts of the popular version of Tangerine Dream that was sought-after in the 1990s, with genetics derived from a cross of California Orange and a Skunk hybrid. Its citrus heritage is the most evident in its refreshing tangerine aroma.\nBlue Goo\nStrain type: Hybrid\nBest for: Friends and family gatherings.\nBlue Goo is a sativa-dominant hybrid that’s a cross between the famous hybrid Blue Dream and indica Afgoo. A moderate to high potency yields uplifting effects that are standard for sativas, but not excessively energetic thanks to Afgoo’s contribution as well as the mellow nature of Blue Dream. This strain is appropriate for day or nighttime consumption and provides smooth smoke and berry flavor.\n\nSour Lemon OG\nStrain type: Hybrid\nBest for: Birthday parties.\nBred by Emerald Triangle Seeds, Sour Lemon OG is a sativa-dominant hybrid cross between California Sour and Lemon OG. This 65% sativa strain is named after its aromatic sour smell with recognizable notes of lemon, lime, and apple. Sour Lemon OG elevates the mind and body simultaneously, making this a natural go-to strain for celebrations, social engagements, or even just a busy day.\nBlue Diesel\nStrain type: Hybrid\nBest for: Happy hour.\nDaughter of indica-dominant Blueberry and sativa-dominant NYC Diesel, Blue Diesel (also known as Blue City Diesel) falls slightly on the indica side of things with a pleasant, moderate- to long-lasting body buzz (perfect if you want to extend the happy for more than an hour). Thanks to its Blueberry genetics, this flower emanates a light berry aroma that is smooth, expansive, and fast-acting. This strain is optimal for daytime use, and relaxes the consumer in social settings without putting you to sleep.\nPez\nStrain type: Indica\nBest for: Cannabis-focused parties.\nPez is an indica daughter of Afghani and Pakistani strains. These sweet, frosty buds offer the relaxation typical of indicas without the drowsiness, making the strain great for daytime use. We recommend this one as a shareable contribution to any 420-friendly gathering—it’s also on our list of the Top 100 Must-Try Strains, meaning it will be a particularly popular addition to any event with open cannabis consumption.\n\nOrange Bud\nStrain type: Hybrid\nBest for: Hosting.\nMatching plenty of social energy with a dose of subtle relaxation, this strain is perfect for gatherings where you’re in charge and want to stay upbeat and level-headed. First bred in 1980s by Dutch Passion, Orange Bud is a combination of two members of the 100% Skunk family. With bright orange hairs coating the surface, it showcases scents of orange and nectarine.\nBlueberry Headband\nStrain type: Hybrid\nBest for: Parties you don’t want to attend.\nSeveral renditions of the Blueberry Headband hybrid are known to exist, but the original Blueberry Headband from NorCal’s Emerald Triangle Seeds is the most well-known. It’s a 50/50 indica-sativa hybrid that smells of diesel, berries and pepper, and it produces a perfectly balanced high with a nice cerebral rush and relaxing body effects. This is great for staying sufficiently present while mentally floating high above any social event you wish you didn’t have to attend (think work parties, baby showers, and so on).\nBanana Kush\nStrain type: Hybrid\nBest for: Potlucks.\nThis legendary West Coast strain crosses Ghost OG and Skunk Haze to create an indica-dominant hybrid that tastes and smells like a bushel of fresh bananas (and will whet your appetite if there’s food around). Although it leans towards an indica genetically, the effects are balanced by the Haze’s mellow sativa buzz that provides a relaxed sense of euphoria. Banana Kush also help its consumers remain talkative in social settings.\n\nDurban Cookies\nStrain type: Sativa\nBest for: Loud parties.\nDurban Cookies is the Durban Poison-dominant phenotype of GSC. Known for its invigorating mental energy and body buzz, Durban Cookies offers a more energizing experience, making this sativa-dominant strain a top choice throughout the day and into the evening, particularly if you’re headed to a high-energy event where you’ll be surrounded by music, people, and movement.\nBubblegum Kush\nStrain type: Indica\nBest for: Low-key get-togethers.\nThis strain is for laid-back social situations; it’ll leave you relaxed and comfy on any given couch, but also chatty and ready to hang with whoever sits down next to you. An 80% indica strain from Bulldog Seeds in the Netherlands, Bubblegum Kush is a cross between Bubble Gum and an undisclosed Kush, and has a satisfyingly sour smell and flavor.\nStrawberry\nStrain type: Sativa\nBest for: Being a plus-one.\nOriginally bred in the Netherlands, Strawberry is a mostly sativa cannabis strain with a pungent fruity scent and uplifting effects. Consumers prone to anxiety choose Strawberry for its stress-relieving qualities without the jarring paranoia common among high-THC strains (which makes it great for small talk with people you don’t know). Comfortable and relaxing, Strawberry brings with it a hearty dose of physical and mental ease.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/22124021/best-cannabis-strains-for-parties.jpg",
            "title": "The 13 Best Cannabis Strains for Parties",
            "urlslug": "/news/strains-products/the-13-best-cannabis-strains-for-parties"
        },
        {
            "author": "Kayla Williams",
            "category": null,
            "date": "/Date(1395349200000)/",
            "id": "contentitems-2969",
            "text": "After a brutal winter that ravaged most of the United States, many of you are probably thrilled that the first day of spring is finally upon us. To celebrate the arrival of an extra hour of sunlight, blossoming flowers, and warmer weather, here are 10 strains that come in like a lion but stick with you like a lamb.\nPeach Spice\n\nStrain combination: Cotton Candy Kush and Green Queen\n\nThe sweet pear flavor in Cotton Candy Kush is balanced wonderfully by the spicy, nutty character of Green Queen.\nCherry Creamsicle\n\nStrain combination: Vanilla Kush and Cherry Bomb\n\nThe heavier, smooth Vanilla Kush is beautifully complemented by the sweet cherry flavor of the lighter Cherry Bomb.\nStrawberry Mojito\n\nStrain combination: Strawberry Kush and Thin Mint\n\nThe unmistakable Thin Mint flavor and hybrid effects are perfectly balanced by the more physical Strawberry Kush.\nBerry Tartlet\n\nStrain combination: Blackberry Kush and Lemon Haze\n\nThese two strong flavors coupled with contrasting effects provide a balanced, memorable experience.\nBanana Brush\n\nStrain combination: Banana Kush and Durban Poison\n\nThe distinct sweetness of Banana Kush could only be matched with an earthy, uplifting flower like Durban Poison.\nBlue Bayou\n\nStrain combination: Blue Cheese and Blue Haze\n\nBlue cheese and peppered pear is the name of the game with these two acclaimed hybrids.\nWaldorf\n\nStrain combination: SAGE and Island Sweet Skunk\n\nThe spicy sandalwood and earthy flavors of SAGE combined with Island Sweet Skunk’s buttery apple taste creates a pairing reminiscent of a classic Waldorf salad.\nRubies ‘n Roses\n\nStrain combination: White Russian and Grapefruit\n\nIn a happy synthesis of citrus, floral, and earthy undertones, this pair provides a pleasant, invigorating lift.\nTropical Vacation\n\nStrain combination: Pineapple Express and Cannalope Haze\n\nLet this fruity coalescence of sweet pineapple, mango, and berry take you far, far away.\nChocolate Peel\n\nStrain combination: Orange Kush and Chocolope\n\nOrange and chocolate, with additional sweet and earthy undertones, make this pair a no-brainer.\nPhoto credits: header strawberry mint, pear blue cheese, grapefruit, blackberry lemon, cherry vanilla, banana pine, chocolate orange, peach and spices, mango pineapple, apple sage ",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/03/12001233/10-strains-to-help-you-celebrate-spring.jpg",
            "title": "10 Strain Pairings to Help You Celebrate Spring",
            "urlslug": "/news/strains-products/10-strains-to-help-you-celebrate-spring"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 33.178650029194515
        },
        {
            "name": "Migraines",
            "score": 19.994263175301842
        },
        {
            "name": "PTSD",
            "score": 17.118909472497947
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 14.791616477957117
        },
        {
            "name": "PMS",
            "score": 14.707299445916645
        }
    ],
    "description": "<p>Originally created by Dutch breeders Serious Seeds, White Russian is a cross of two legendary strains, <a href=\"https://www.leafly.com/hybrid/white-widow\">White Widow</a> and <a href=\"https://www.leafly.com/hybrid/ak-47\">AK-47</a>. An indica-dominant hybrid, it won the <em>High Times</em> Cannabis Cup &quot;Best Overall&quot;&nbsp;in 1996 and was for a time considered the strongest strain in the world at 22% THC. Presenting remarkable homogeneity for an f1 hybrid, White Russian is an extremely fragrant plant, smelling of sweet fruit and skunk even in its vegetative cycle. With a flavor that is smooth and spicy with undertones of skunk and earth, White Russian&rsquo;s high is quite cerebral (especially for an indica), but can lead to couchlock when over-indulged.</p>\n",
    "descriptionPlain": "Originally created by Dutch breeders Serious Seeds, White Russian is a cross of two legendary strains, White Widow and AK-47. An indica-dominant hybrid, it won the High Times Cannabis Cup &quot;Best Overall&quot;&nbsp;in 1996 and was for a time considered the strongest strain in the world at 22% THC. Presenting remarkable homogeneity for an f1 hybrid, White Russian is an extremely fragrant plant, smelling of sweet fruit and skunk even in its vegetative cycle. With a flavor that is smooth and spicy with undertones of skunk and earth, White Russian&rsquo;s high is quite cerebral (especially for an indica), but can lead to couchlock when over-indulged.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 78.863577900363
        },
        {
            "name": "Happy",
            "score": 72.93474310866485
        },
        {
            "name": "Euphoric",
            "score": 61.66484286000106
        },
        {
            "name": "Uplifted",
            "score": 50.22089837449828
        },
        {
            "name": "Talkative",
            "score": 41.434777815433485
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 35.67978310311176
        },
        {
            "name": "Woody",
            "score": 18.05068413165706
        },
        {
            "name": "Pine",
            "score": 16.86595837637653
        },
        {
            "name": "Skunk",
            "score": 12.817822129852313
        },
        {
            "name": "Earthy",
            "score": 11.831027034531191
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 60,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1417459,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "When I was a mere lad, my father warned me of the dangers of marijuana. He told me, \"If I catch you stealing any of MY pot, I'll kick your scrawny little ass!\" My father was an angry drunk with Vietnam flashbacks. He could have used some White Russian. However, with Russian in the name, he would have thought it was some kind of Commie plot to steal his ditchweed. But he'd have been wrong: White Russian is a fluffy little cloud of THC goodness populated by ponies and  Care Bears and other cute anthropomorphic animals that Furrys furiously masturbate to. This strain has a smooth take off and a high that is mellow, relaxing and creativity-inspiring. Hell, I took three hits of that shit before I wrote this and you're still reading it! So remember, White Russian: It's not just the cocktail you order to impress your gay friends anymore.",
            "username": "StukaFox"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1641485,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I bought a 1 gram distillate oil cartridge of this strain, grown by Green Haven LLC (which is an amazing source actually) and sold at 2020 Solutions in Bellingham, WA. \n\nI'll keep it short and sweet to say that this fits the indica-hybrid description well. Very relaxing but didn't knock me out... 10/10 would recommend XD",
            "username": "Evan360"
        }
    ],
    "id": 29,
    "name": "White Russian",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 37.87968184101033
        },
        {
            "name": "Dry Eyes",
            "score": 25.15475135662634
        },
        {
            "name": "Dizzy",
            "score": 17.877762760862197
        },
        {
            "name": "Paranoid",
            "score": 16.18713481333883
        },
        {
            "name": "Headache",
            "score": 0.927487352445194
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/white-widow",
            "category": "Hybrid",
            "name": "White Widow",
            "permalink": "https://mobileapi.leafly.com/hybrid/white-widow",
            "slug": "white-widow",
            "subtitle": null,
            "symbol": "Ww"
        },
        {
            "applink": "leafly://strain/ak-47",
            "category": "Hybrid",
            "name": "AK-47",
            "permalink": "https://mobileapi.leafly.com/hybrid/ak-47",
            "slug": "ak-47",
            "subtitle": null,
            "symbol": "Ak"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/white-russian",
    "photoTotalCount": 162,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/667594/b/white-russian__primary_7ae7.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/white-russian_100x100_794d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/640783/b/white-russian__primary_5971.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/white-russian_100x100_eae6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/595980/b/white-russian__primary_e556.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/white-russian_100x100_4c6b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/584586/b/white-russian__primary_ba5b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/white-russian_100x100_8457.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/582251/b/white-russian__primary_7389.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/white-russian_100x100_8db8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/579955/b/white-russian__primary_009e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/white-russian_100x100_e78a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Vancouver, BC",
        "Montréal, QC",
        "Toronto, ON",
        "Edmonton, AB",
        "Calgary, AB",
        "Ottawa, ON",
        "Spokane, WA",
        "Winnipeg, MB",
        "Hamilton, ON"
    ],
    "rating": 4.34,
    "relatedStrains": [],
    "reviewCount": 454,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "white-russian",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.34140969162996/240",
    "subtitle": null,
    "symbol": "Whr",
    "symptoms": [
        {
            "name": "Stress",
            "score": 43.19257356814163
        },
        {
            "name": "Depression",
            "score": 33.65096831884496
        },
        {
            "name": "Insomnia",
            "score": 26.45829675512129
        },
        {
            "name": "Pain",
            "score": 24.98182998583147
        },
        {
            "name": "Headaches",
            "score": 16.65087848956143
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
