{"sl_translate":"description,descriptionPlain,category","id":80111,"slug":"mothers-helper","name":"Mother’s Helper","subtitle":null,"symbol":"Mh","category":"Hybrid","description":"\u003cp\u003eMother\u0026rsquo;s Helper is a \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e cross between the \u003ca href=\"http://leafly.com/sativa\"\u003esativa\u003c/a\u003e \u003ca href=\"http://www.leafly.com/sativa/chocolope\"\u003eChocolope\u003c/a\u003e and a \u003ca href=\"http://www.leafly.com/hybrid/northern-lights--5\"\u003eNorthern Lights #5\u003c/a\u003e \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e. Combining these polar opposite genetics results in a variety of \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\"\u003ephenotypes\u003c/a\u003e that lean to either side of the indica-sativa spectrum. Mother\u0026rsquo;s Helper tends to make consumers feel \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-happy\"\u003ehappy\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-creative\"\u003ecreative\u003c/a\u003e,\u0026nbsp;and \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e, and offers medical benefits to patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-anxiety\"\u003eanxiety\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\"\u003enausea\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-migraines\"\u003emigraines\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"Mother\u0026rsquo;s Helper is a hybrid cross between the sativa Chocolope and a Northern Lights #5 indica. Combining these polar opposite genetics results in a variety of phenotypes that lean to either side of the indica-sativa spectrum. Mother\u0026rsquo;s Helper tends to make consumers feel happy, creative,\u0026nbsp;and uplifting, and offers medical benefits to patients treating pain, stress, anxiety, nausea, and migraines.\n","aka":"Mothers Helper","rating":4.64,"highlightedReviews":[{"id":1414304,"username":"Dastomba","text":"Bought this from Nature\u0027s Wonder, and it was marked as 25.4% THC.  N.W. rarely puts % on any of their flowers, so I got some and, DAMN!  I took 2 hits off the pipe and almost immediately felt the effects.  Pain gone, able to do the work that needs doing.  Pleasant mood, no paranoia, no couch-lock.  Be careful with this if you are new to MM, it could be a little much.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png"},{"id":1290821,"username":"Tbone_Az","text":"I would give this 4.5 stars if possible but not so much 5. Affects are really good, a little more focused I think. In and Ex hale are smooth, skunky\u0027ish, good flavor. No issues about doing it right before bed, nice peaceful sleep. \nMunchie level - This definitely is an Ice Cream and Cookies and Milk kind of after effect.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-50645","title":"5 Modern Psychedelic Rock Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1512431652000)\/","text":"Psychedelic rock was born out of 1960s psychedelia culture that embraced mind-altering hallucinogens in an increasingly globalized world. The resulting music was eclectic, experimental, and mentally stimulating—the kind of music that is candy for the mind.\n\nToday, these influences continue to thrive in the music of modern psychedelic rock musicians, who often incorporate other genres such as world, jazz, electronic, and pop for a fresher feel. Enjoy the following psychedelic rock albums with a loaded pipe in hand and get lost in a groovy mind-altering experience.\nSpace Is Still the Place by The Bright Light Social Hour\n(Courtesy of The Bright Light Social Hour)\nStrain Pairing Recommendation: Headband\nSpace Is Still the Place, released in 2015, is The Bright Light Social Hour’s latest album and an excellent illustration of their modern psychedelic sound. Hailing from Austin, Texas, the band features bass, guitar, synth, drums, and two vocalists: Together, they create a landscape of tight beats and instrumentation that veers into the otherworldly. The album invites you to explore different dimensions with a touch of grunge, a little grime, and lots of spacey, psychedelic mind-melting sounds.\n\nSketches of Brunswick East by King Gizzard \u0026 The Lizard Wizard\n(Courtesy of King Gizzard \u0026 The Lizard Wizard)\nStrain Pairing Recommendation: Cherry Pie\nKing Gizzard \u0026 The Lizard Wizard is an eclectic psychedelic rock band with a wide range of sounds and genres represented in their extensive catalogue of music (in 2017 alone, the band released four distinct concept albums). Of those, Sketches of Brunswick East stands out for its jazzy space themes. The vocals are light and airy, and whispered harmonies flow into each other, creating a musical journey that grabs the listener and pulls them swiftly along a river of psychedelic tunes. If there’s one album from the King Gizzard collection to give a listen, Sketches of Brunswick East is it.\nHarsh Toke by Earthless\n(Courtesy of Earthless)\nStrain Pairing Recommendation: Kushberry\nHarsh Toke features only two songs, but combined they present listeners with a half hour of mostly instrumental psychedelic rock. The first track, “Acid Crusher,” starts off slow—the melodic tune takes its time to build and bend. Its trance-like vibes encourage a surrendering to the music; close your eyes and you’ll feel as if you’re drifting away. The second track, “Mount Swan,” picks up a heavier rock feel and vocals before plunging into an eclectic space and then back into trance-like homeostasis. In its journey through the soundscape, Harsh Toke is sure to delight all the senses.\n\nThe Desaturating Seven by Primus\n(Courtesy of Primus)\nStrain Pairing Recommendation: Sour Alien\nPrimus’s 2017 album The Desaturating Seven hits hard with Les Claypool’s famous brand of psychedelic rock. The album features Claypool’s distinctive bass and vocals at its epicenter, snatching the listener up before pulling them down the rabbit hole like Alice on her way to Wonderland. The tight grooves encourage movement and emotional release that is unique to bands creating a heavier rock tone. Claypool once described Primus as “psychedelic polka,” and The Desaturating Seven is a keen example of this description, as well as an example of Primus’s unique niche in the musical world.\nPainting With by Animal Collective\n(Courtesy of Animal Collective)\nStrain Pairing Recommendation: Mother’s Helper\nPainting With, released in 2016, is the latest album by Animal Collective. As per their unique style, Painting With is a distinctive representation of psychedelic rock, featuring elements of pop, indie, and experimental music combined for an eclectic listening experience. Working with a wide array of instruments from synthesizers to drums, the band creates an intensely rich sound that listeners can practically swim in. Rising above the wildly intricate instrumentation are shifting harmonies by all four band members, their voices as bubbly, playful, and trippy as their music. Overall, Painting With provides a soundscape that takes the listener on an experimental journey worth the ride.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/04151802/psychedelic-album-while-high-header.jpg","urlslug":"/news/lifestyle/psychedelic-rock-albums-listen-while-high"},{"id":"contentitems-3619","title":"Which Cannabis Strain Pairs Best With Your Zodiac Sign?","author":"Lisa Rough","category":null,"date":"\/Date(1445788800000)\/","text":"Some people take astrology more seriously than others, but regardless of your level of obsession with all things zodiac, you at least know your star sign. That said, have you ever wondered which cannabis strain best reflects your astrological sign? We were curious so we took it upon ourselves to pair up the best strains that complement each personality type based on their horoscope sign.\nWhether you’re as stubborn as a ram, as dramatic as a lion, or as balanced as a scale, we’ve got a strain for you! So sit back, relax, and watch your stars and strains align.\nAries\n\nDates: \nMarch 21 – April 19\nCharacteristics: \nEnthusiastic, Energetic, Independent\nCannabis Strain: \n\nThis sativa-dominant strain will quell any unpleasant feelings with a soothing euphoric boost. Double Dream also offers relaxation with a creative focus and uplifting haziness to let you concentrate on the task at hand, awash in a warm wave of euphoria.\nTaurus\n\nDates: \nApril 20 – May 20\nCharacteristics: \nPractical, Loyal, Dependable\nStrain:\n\nThis sativa-dominant hybrid will uplift your spirit and instill a magical sense of euphoria. Your body will be buzzing and you’ll be tickled Orange Haze with laughter. Resistance is futile, Taurus, so don’t resist the joy and energy of this sweet citrus strain.\nGemini\n\nDates: \nMay 21 – June 20\nCharacteristics: \nEnergetic, Imaginative, Witty\nStrain:\n\nOne of the great and illustrious beginnings for cannabis comes in the form of Haze, a California sativa that will lift you up with focus and creativity, but will also soothe any restlessness with a happy, imaginative buzz that will leave you spinning webs of inspiration.\nCancer\n\nDates: \nJune 21 – July 22\nCharacteristics:\nTenacious, Adaptable, Loyal\nStrain:\n\nThis strain favorite will be your new best friend. A hybrid blend, GSC (f.k.a Girl Scout Cookies) (and its many descendants) are sure to put a smile on your face and bring you peace and relaxation. This is the strain you’ll want for when you’re looking to laugh until you giggle-snort (and then laugh some more).\nLeo\n\nDates: \nJuly 23 – August 22\nCharacteristics: \nConfident, Dramatic, Enthusiastic\nStrain:\n\nAdmittedly, you’re a drama queen, but this strain is guaranteed to lessen the drama and up the ante with joy. Your verbal skills fall dormant and allow someone else to take the spotlight for a change, while you will find yourself quietly in awe at the beauty of the world. Pineapple Express is a freight train that runs on euphoria – all aboard!\nVirgo\n\nDates: \nAugust 23 – September 22\nCharacteristics: \nAnalytical, Observant, Loyal\nStrain:\n\nFor the quietly observant Virgo, Space Queen is a hybrid that will help you out of your shell and make you feel relaxed and comfortable. This is a particularly good choice for those with social anxiety, as it’s a highly fun, sociable strain that elicits easy conversation.\nLibra\n\nDates: \nSeptember 23 – October 22\nCharacteristics: \nPeaceful, Kind, Idealistic\nStrain:\n\nFor the peaceful Libra, nothing suits you better than a high-CBD strain. This sativa-dominant option offers a clear-headed focus that will allow you to get your tasks done with a warm smile on your face. Harlequin is also a wonderful meditation aid, offering relaxation without sedation. Namaste!\nScorpio\n\nDates: \nOctober 23 – November 21\nCharacteristics: \nPassionate, Intense, Observant\nStrain:\n\nThis hybrid is chock full of euphoric happiness. Lemon Skunk also tends to dissipate stress and allow your mind to wander freely through a mellow field of lemony goodness. This strain works whether you’re feeling sociable or flying solo, and you may find yourself feeling some verbose inspiration.\nSagittarius\n\nDates: \nNovember 22 – December 21\nCharacteristics: \nAdventurous, Independent, Conversational\nStrain:\n\nAlien Asshat is as fantastic and ridiculous as it sounds. A perfect match for your adventurous soul, this strain rocks a super high THC content that will blow you out of this world and gear you up for a cosmic journey through space and time (or maybe just an epic hike).\nCapricorn\n\nDates: \nDecember 22 – January 19\nCharacteristics: \nResourceful, Organized, Disciplined\nStrain:\n\nMother’s Helper is perfect for your inner coordinator as it swirls creativity through your mind. Your organizational urges will be appeased with a supremely satisfying sativa burst of energy, followed by a happy mellow cool-down as you survey your accomplishments with pride.\nAquarius\n\nDates:\nJanuary 20 – February 18\nCharacteristics: \nWitty, Clever, Inventive\nStrain: \n\nBlue Diamond will help you exercise your funny bone, with happy giggles and witty repartee galore. You’ll be the life of the party, albeit from the luxurious comfort of a reclined position on a comfy couch. You get the best of both worlds with a soothing dose of pain relief to boot.\nPisces\n\nDates:\nFebruary 9 – March 20\nCharacteristics: \nCompassionate, Imaginative, Escapist\nStrain:\n\nThis strain is one of the best for bonding with friends. Pure Power Plant offers a warm, clear-headed euphoria that’s both uplifting and relaxing. Any leftover stress from your day will dissolve into psychedelic giggles and get you grooving to the music. Keep your eye drops handy, though – red eyes abound!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12003018/which-cannabis-strain-pairs-best-with-your-zodiac-sign.jpg","urlslug":"/news/strains-products/which-cannabis-strain-pairs-best-with-your-zodiac-sign"}],"reviewCount":106,"flavors":[{"name":"Earthy","score":2.8625954198473282},{"name":"Sweet","score":2.4809160305343512},{"name":"Citrus","score":1.5267175572519083},{"name":"Flowery","score":1.3358778625954197},{"name":"Berry","score":0.76335877862595414}],"effects":[{"name":"Energetic","score":12.404580152671755},{"name":"Uplifted","score":9.9236641221374047},{"name":"Happy","score":9.16030534351145},{"name":"Focused","score":8.015267175572518},{"name":"Creative","score":7.8244274809160315}],"symptoms":[{"name":"Pain","score":6.4885496183206106},{"name":"Stress","score":5.1526717557251906},{"name":"Depression","score":4.9618320610687023},{"name":"Fatigue","score":4.1984732824427482},{"name":"Headaches","score":4.1984732824427482}],"conditions":[{"name":"Anxiety","score":4.1984732824427482},{"name":"Migraines","score":2.4809160305343512},{"name":"ADD/ADHD","score":1.9083969465648856},{"name":"PTSD","score":1.5267175572519083},{"name":"Arthritis","score":1.3358778625954197}],"negatives":[{"name":"Dry Mouth","score":3.0534351145038165},{"name":"Dry Eyes","score":0.5725190839694656},{"name":"Anxious","score":0.38167938931297707},{"name":"Headache","score":0.19083969465648853}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/mother-s-helper_100x100_3637.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/427226/b/mother-s-helper__primary_de7a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/mother-s-helper_100x100_2d43.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/392312/b/mother-s-helper__primary_24fe.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/mother-s-helper_100x100_f240.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/367912/b/mother-s-helper__primary_1f6b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/mother-s-helper_100x100_c093.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/336586/b/mother-s-helper__primary_3007.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/mother-s-helper_100x100_bb06.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/316428/b/mother-s-helper__primary_e1e6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/mother-s-helper_100x100_bd15.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/286128/b/mother-s-helper__primary_c697.jpg"}],"photoTotalCount":7,"popularCities":["Vancouver, BC"],"permalink":"https://mobileapi.leafly.com/hybrid/mothers-helper","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.64150943396226/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Chocolope","subtitle":null,"slug":"chocolope","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/chocolope","symbol":"Chc","applink":"leafly://strain/chocolope"},{"name":"Northern Lights #5","subtitle":null,"slug":"northern-lights--5","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/northern-lights--5","symbol":"N5","applink":"leafly://strain/northern-lights--5"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
