{
    "aka": "Tahoe OG",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1511894705000)/",
            "id": "contentitems-49877",
            "text": "As we explored recently with our list of 9 Most Overhyped Cannabis Strains, a few of the best-known cannabis varieties on the market are a little overrated. Correspondingly, it’s no surprise that there are some underrated cannabis strains out there, too.\n\nThe following represent 11 varieties of cannabis that we think get less love than they deserve, based on Leafly review data, regional availability, and the personal experiences of our cannabis expert team. This is far from an exhaustive list—with thousands of strains available in the world, it’s virtually impossible to give all of them the attention we wish we could. Nevertheless, take the following as just a few recommendations of lesser-known types you should keep an eye out for—who knows? You just might find your new favorite strain among them.\nTahoe OG Kush\nStrain type: Hybrid\nParent strains: OG Kush, SFV OG Kush\nWhy it’s underrated: “Tahoe OG isn’t underrated in the traditional sense of the word. In fact, most people I know who’ve come across this select OG Kush phenotype will share their excitement for the pungent, piney sweetness and the strain’s dynamic mix of deep relaxation and profound euphoria. However, when I think of the OG family tree, the Tahoe cut doesn’t seem to get quite the same notoriety that some of its relatives. The SFV, Larry, and Fire OGs manage to capture a lot of the buzz, while other cuts, like the Ghost and WiFi OGs, have somewhat cult followings. This leaves room for Tahoe OG to stand on its own, which is OK by me. I love its dank, complex aroma and the sedating effects, so the less hype there is for Tahoe OG, the more of this delicious strain is available for me!” —Will Hyde\n\nLodi Dodi\nStrain type: Hybrid\nParent strains: Undisclosed\nWhy it’s underrated: “This strain is a mainstay in the Pacific Northwest, but still flies beneath the radar outside the region. Sativa-dominant in effect, this unknown cultivar has been propagated throughout the Evergreen State for decades. Lodi Dodi’s airy physical lightness and uplifting mental buzz allow the consumer to metaphorically levitate two inches above their problems and their pain. I personally enjoy working out after consuming this strain for its stimulating aura and a mental haze that allows me to fade into my headphones and run forever. It’s equally satisfying on the dancefloor or in the bedroom, as long as you mind your dosage. Lodi Dodi came to party—it don’t cause trouble or bother nobody.” —Jeremiah Wilhelm\nChocolope Kush\nStrain type: Hybrid\nParent strains:  Chocolope, Kosher Kush\nWhy it’s underrated: “This is, weirdly, one of the lowest-rated strains on Leafly (yep, a four-star rating is on the low end—Leafly reviewers give most cannabis pretty high marks), but riddle me this: How can a marriage of superstars like Chocolope and Kosher Kush possibly be bad? Those parent strains are two of our all-time faves (in fact, both landed on our Top 100 Strains list) and given that the apple rarely falls far from the tree, this super-low rating for Chocolate Kush is undeserved.” —Brett Konen\n\nDancehall\nStrain type: Hybrid\nParent strains: Juanita La Lagrimosa, Kalijah\nWhy it’s underrated: “Dancehall is an exceptional CBD-dominant strain that doesn’t get much recognition by comparison to CBD hallmarks like Harlequin, ACDC, Charlotte’s Web, and Cannatonic. With a near 21:1 CBD:THC ratio, Dancehall delivers soothing, easygoing effects with just enough sativa-dominant influence to elevate mood, which makes it a constant companion for consumers who like to stay level and clearheaded while enjoying cannabis. The terpene profile also offers deeper, skunkier notes than the usual grassy, hay-like aroma CBD strains are known for. Whether you’re enjoying it for what it is, or blending with your THC-dominant strains, Dancehall adds something special and drastically underappreciate to any joint or bowl.” —Jeremiah Wilhelm\nBay Dream\nStrain type: Sativa\nParent strains: Blue Dream, Bay 11\nWhy it’s underrated: “Bay Dream is an uplifting strain with sharp citrus notes and subtle earthiness. It seems to be overlooked because of its polarizing parent strain, Blue Dream, but in combination with the sweet, skunky flavors and focused headspace of Bay 11 the mix is a pleasant surprise. I appreciate that Bay Dream trades some of Blue Dream’s fruit notes for a deeper, more poignant Kush-like palate of flavors. So, if you’re in the ‘Blue Dream is overrated’ crowd, don’t shy away from Bay Dream—you might be amazed by how much this strain expresses its individuality.” —Will Hyde\n\nSour Urkle\nStrain type: Hybrid\nParent strains: Sour Diesel, Purple Urkle\nWhy it’s underrated: “Sour Urkle is the potent union of pungent, polar opposites. Created from Sour Diesel and Purple Urkle, this funky and surprisingly affordable bud packs the best of both strains into one frosty package. This strain emits an odd floral and chemical aroma that is contrasted against a latent but tangible sweetness brought forth by the fruitiness of Purple Urkle. This flavor profile can be challenging for some, but the effects are undeniably heady while draping the body in a soothing, mellow aura.” —Jeremiah Wilhelm\nPresidential Kush\nStrain type: Indica\nParent strains: Bubble Gum, OG Kush\nWhy it’s underrated: “Easily one of the more picturesque strains I’ve come across, Presidential Kush (also known as Presidential OG) expresses itself with deep green and purple hues. A thick blanket of trichomes adds another dimension to the strain’s aesthetic, but PK is so much more than just a pretty flower. It’s a potent, complex, and flavorful experience that only takes a puff or two before you feel the comforting weight of deep relaxation wash over you. The piney, diesel flavors make it hard to put down, and I still find myself embarking on epic journeys just to track down this beautiful bud. In my opinion, genetics this compelling should be easier to find and should be garnering more attention in the cannabis community, so for that reason, I’d like to encourage more growers to add this strain to their stable, and if you find it at your local dispensary as a consumer, definitely do not overlook it!” —Will Hyde\n\nDurban Poison\nStrain type: Sativa\nParent strains: African\nWhy it’s underrated: “Landrace strains, including Durban Poison, are hard to find and often faked. As such, many people have had a less-enjoyable-than-average experience with a strain they believed, mistakenly, to be the landrace advertised on the packaging. Durban Poison is a fantastic pure sativa that many people, including myself, loved at first smoke, so if Durban Poison didn’t wow you the first time around, give it another chance—that first batch might have been something else that was merely masquerading as this iconic strain.” —Brett Konen\nApple Jack\nStrain type: Hybrid\nParent strains: Jack Herer, White Widow\nWhy it’s underrated: “Apple Jack hasn’t gained much in the way of ratings on Leafly, but that doesn’t mean it’s a dud. It blends two well-known cuts together (Jack Herer x White Widow) to create something greater than the sum of its parts. Apple Jack’s initially clear-headed high relieves stress while elevating the mind and encouraging creativity. The happy effects and accessible THC concentration make it a friendly flower for consumers of all potency levels. And even though its flavor doesn’t always live up the name, Apple Jack’s sweet, earthy terpene profile still offers satisfying flavors alongside a productive buzz.” —Jeremiah Wilhelm\n\nPlushberry\nStrain type: Indica\nParent strains: Black Cherry Soda, Space Queen\nWhy it’s underrated: “Plushberry is an incredible strain that’s underrated simply because it hasn’t appeared to travel beyond the Pacific Northwest. Wrapped in beautiful lavender foliage, it smells like sweet wildflowers and mixed berries, and if you have the chance to try it while you’re in the area, Plushberry is a strain you won’t soon forget.” —Bailey Rahn\nSkunk No. 1\nStrain type: Hybrid\nParent strains: Afghani, Acapulco Gold, Colombian Gold\nWhy it’s underrated: “Even if you don’t love the flavor of the flower itself, you’ve got to respect a strain that’s given us so many of our favorites on the market—I’m talking Green Crack, Island Sweet Skunk, Amnesia, Pineapple Chunk, UK Cheese, and so many more. Skunk No. 1 is a true original among cannabis strains, and while its skunky flavor is an acquired taste, you’re smoking a piece of history with Skunk No. 1—so respect your elders.” —Brett Konen",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/28103218/most-underrated-cannabis-strains.jpg",
            "title": "11 Unsung Cannabis Strains Worth Discovering",
            "urlslug": "/news/strains-products/11-underrated-marijuana-strains"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1498758922000)/",
            "id": "contentitems-32796",
            "text": "Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Tahoe OG Kush is a potent phenotype of OG Kush popularly used for relaxation and sleep. With a sweet earthy flavor, Tahoe OG Kush delivers heavy-handed effects that are best paired with lazy evenings in.\nGrow Techniques: Indoors, Tahoe OG Kush performs well with the SOG (sea of green) method. Hydroponically, you can grow beautiful buds with unbelievable resin production. Prune the lower canopy for good airflow and keep humidity levels down when the plants begin to show density in the buds.\nFlowering Time: 9-10 weeks\nYield: Moderate to high\nGrow Difficulty: Moderate\nClimate: Ideally kept between 65-80 degrees Fahrenheit. Tahoe OG Kush needs good ventilation and lower humidity levels as it begins to flower (30-40% RH).\nIndoor/Outdoor: In the right climate, Tahoe OG Kush will produce large, quality yields indoors or out.\nFeeding: Feed heavily. Calcium, magnesium, and nitrogen are recommended for Tahoe OG Kush.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/29105156/tahoe-og-kush.jpg",
            "title": "Tips for Growing Tahoe OG Kush Cannabis",
            "urlslug": "/news/growing/how-to-grow-tahoe-og-kush-marijuana"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 39.6250148862689
        },
        {
            "name": "PTSD",
            "score": 18.711355245921162
        },
        {
            "name": "ADD/ADHD",
            "score": 17.964302727164462
        },
        {
            "name": "Migraines",
            "score": 14.646748838871025
        },
        {
            "name": "Bipolar Disorder",
            "score": 12.525336429677266
        }
    ],
    "description": "<p>Tahoe OG is the perfect rainy day strain. Strong and fast-acting, you may not want to use this strain when you&rsquo;re planning to leave the house. Great for those suffering from <a href=\"http://www.leafly.com/explore#!/explore/symptoms-insomnia\">insomnia</a>, <a href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\">pain</a>, or <a href=\"http://www.leafly.com/explore#!/explore/symptoms-lack-of-appetite\">lack of appetite</a>, Tahoe OG has made a name for itself among other indicas. A top nighttime strain, it provides an extremely lazy, heavy body sensation. Due to superb breeding, Tahoe OG embodies all of the typical indica effects with an added <a href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\">euphoric</a>, sativa-like kick. This strain features an <a href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\">earthy</a>, <a href=\"http://www.leafly.com/explore#!/explore/flavors-lemon\">lemon</a>&nbsp;taste, and is a phenotype of <a href=\"http://www.leafly.com/hybrid/og-kush\">OG Kush</a>. Maturing at around 10 weeks, Tahoe OG is a must-try for those looking for a great night&rsquo;s sleep.</p>\n",
    "descriptionPlain": "Tahoe OG is the perfect rainy day strain. Strong and fast-acting, you may not want to use this strain when you&rsquo;re planning to leave the house. Great for those suffering from insomnia, pain, or lack of appetite, Tahoe OG has made a name for itself among other indicas. A top nighttime strain, it provides an extremely lazy, heavy body sensation. Due to superb breeding, Tahoe OG embodies all of the typical indica effects with an added euphoric, sativa-like kick. This strain features an earthy, lemon&nbsp;taste, and is a phenotype of OG Kush. Maturing at around 10 weeks, Tahoe OG is a must-try for those looking for a great night&rsquo;s sleep.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 101.46644634988687
        },
        {
            "name": "Sleepy",
            "score": 68.41493985947362
        },
        {
            "name": "Happy",
            "score": 65.19387876622604
        },
        {
            "name": "Euphoric",
            "score": 59.617393116589255
        },
        {
            "name": "Hungry",
            "score": 49.803888293438135
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 30.586310587114443
        },
        {
            "name": "Lemon",
            "score": 22.362242467547933
        },
        {
            "name": "Pine",
            "score": 19.326545194712395
        },
        {
            "name": "Pungent",
            "score": 16.515213766821482
        },
        {
            "name": "Skunk",
            "score": 11.537126354650471
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": "Moderate",
        "environment": null,
        "floweringDays": 60,
        "growNotes": "",
        "height": "Medium",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1416046,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This is without a doubt the strongest OG Kush I have ever tried. This is a very heavy, very potent strain of OG. It has the classic OG high but it's markedly stronger than any OG I've had in recent memory.\r\n\r\nThe smell is the classic OG smell, piney and fresh. Just inhaling this weed lets you know it's dank. You almost cough smelling the buds, the aroma is so potent.\r\n\r\nThe buds are covered in thick orange hairs and trichomes. The buds are dense, but not uber dense, like AK-47. The buds looks like pine cones or artichokes. Very aethetically pleasing stuff.\r\n\r\nThe smoke is dank in the lungs. If you hold it in you'll get a good cough. The taste is the classic OG taste, fresh, piney (as opposed to earthy or fruity).\r\n\r\nThe high comes on really quick, and it's blasting from there on. Very potent. Very strong effect. Very pronounced body high that comes on with an oomph. Strong OG sedative and analgesic effect. Potent head high, you definitely don't concentrate on the present moment in this high, it causes your mind to wander, you drift into thought, daydreaming and imagining.\r\n\r\nThe effect last for a very long time, a couple hours. The effect was so strong at first that it was almost a little too strong. For a few minutes at the peak was very, very high. I would recommend taking only one good hit of this before you know how strong it is. I took three full loads and the effect was very strong. \r\n\r\nIn conclusion, this is currently the most potent OG I know of right now. This is a classic, prototypical OG strain, and anyone who wants to know what OG is or wants to try OG, this is the definitive OG, at least in Los Angeles, right now.",
            "username": "Krshna"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1642429,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I enjoyed this strain because it provided a nice calm effect that doesn’t put you out it’s a nice daytime, nighttime or even all day smoke but it’s does lean ultimately towards indica effects even though it’s a hybrid ",
            "username": "Zmo1093"
        }
    ],
    "id": 3288,
    "name": "Tahoe OG Kush",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 42.33187447898059
        },
        {
            "name": "Dry Eyes",
            "score": 21.671668453018935
        },
        {
            "name": "Dizzy",
            "score": 13.465047040609742
        },
        {
            "name": "Paranoid",
            "score": 5.033553650113135
        },
        {
            "name": "Headache",
            "score": 3.4145528164820766
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/og-kush",
            "category": "Hybrid",
            "name": "OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/og-kush",
            "slug": "og-kush",
            "subtitle": null,
            "symbol": "Ogk"
        },
        {
            "applink": "leafly://strain/sfv-og-kush",
            "category": "Indica",
            "name": "SFV OG Kush",
            "permalink": "https://mobileapi.leafly.com/indica/sfv-og-kush",
            "slug": "sfv-og-kush",
            "subtitle": null,
            "symbol": "Sfk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/tahoe-og",
    "photoTotalCount": 270,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002802/b/tahoe-og-kush__primary_b2b7.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tahoe-og-kush_100x100_b15a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002801/b/tahoe-og-kush__primary_dc71.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tahoe-og-kush_100x100_fa5a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/661938/b/tahoe-og-kush__primary_9180.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tahoe-og-kush_100x100_8fa4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/652778/b/tahoe-og-kush__primary_e3b6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tahoe-og-kush_100x100_a817.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648534/b/tahoe-og-kush__primary_8582.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tahoe-og-kush_100x100_e057.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648470/b/tahoe-og-kush__primary_2076.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tahoe-og-kush_100x100_d090.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Los Angeles, CA",
        "Seattle, WA",
        "Denver, CO",
        "Phoenix, AZ",
        "Detroit, MI",
        "Spokane, WA",
        "Eugene, OR",
        "Bend, OR",
        "China"
    ],
    "rating": 4.43,
    "relatedStrains": [],
    "reviewCount": 1086,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "tahoe-og",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.42909760589319/240",
    "subtitle": null,
    "symbol": "Tok",
    "symptoms": [
        {
            "name": "Stress",
            "score": 39.62435989043706
        },
        {
            "name": "Insomnia",
            "score": 35.81618435155413
        },
        {
            "name": "Pain",
            "score": 31.0329284268191
        },
        {
            "name": "Depression",
            "score": 22.893235679409315
        },
        {
            "name": "Lack of Appetite",
            "score": 20.743747767059663
        }
    ],
    "testGraph": "https://leafly.s3.amazonaws.com/strains/testing/sh9K0O2T16ZgqRUjfp5Y_tahoe-og.png",
    "videoUrl": null,
    "weakDescription": false
}
