{"sl_translate":"description,descriptionPlain,category","id":818,"slug":"killer-queen","name":"Killer Queen","subtitle":null,"symbol":"Kq","category":"Hybrid","description":"\u003cp\u003eA British Columbia native, Killer Queen is the outcome of an imaginative cross between \u003ca href=\"http://www.leafly.com/indica/g-13\" style=\"text-decoration:none;\"\u003eG13\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/cinderella-99\" style=\"text-decoration:none;\"\u003eCinderella 99\u003c/a\u003e. Uplifting and thought-provoking, this hybrid is great for the workaholic who would like some daytime relief. The effects of this strain are felt most heavily in the face, eyes, and forehead, evidencing the sativa aspects of this hybrid. Upon first taste, Killer Queen takes up the fruity characteristics of Cinderella 99. The tropical flavor, however, is quickly followed by an earthy, herbal tone. If you are searching for an energizing strain that allows you to focus, Killer Queen may be just the perfect match.\u003c/p\u003e\n","descriptionPlain":"A British Columbia native, Killer Queen is the outcome of an imaginative cross between G13 and Cinderella 99. Uplifting and thought-provoking, this hybrid is great for the workaholic who would like some daytime relief. The effects of this strain are felt most heavily in the face, eyes, and forehead, evidencing the sativa aspects of this hybrid. Upon first taste, Killer Queen takes up the fruity characteristics of Cinderella 99. The tropical flavor, however, is quickly followed by an earthy, herbal tone. If you are searching for an energizing strain that allows you to focus, Killer Queen may be just the perfect match.\n","aka":null,"rating":4.31,"highlightedReviews":[{"id":1369519,"username":"pdoane","text":"Killer Queen hits your head, forehead and eyes very hard.  Your arms and body will likely pulse with a euphoric rush.  Increased auditory focus.  Able to write and follow thought patterns/instructions physically – mind and body are still connected.  The soothing cerebral effects give way to heavy eyelids and a slight draining feeling towards the end.  This is a moderate come down.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1621858,"username":"belulah","text":"This strain puts me in such a good mood! I’m usually more a fan of staying in with a heavy indica, but this stuff is the best before going out, going to work, socializing, etc. I was DREADING work this morning, but after smoking, I’m FEELING IT. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2971","title":"13 Cannabis Strains and Their Scary Movie Pairings","author":"Rebecca Kelley","category":null,"date":"\/Date(1402677600000)\/","text":"Whether you want to properly celebrate Friday the 13th or are simply in the mood for some elevated frights, here are 13 strains that each have an appropriate scary movie to pair. Enjoy, and remember, that creaking noise you hear coming from the creepy corner of the house is nothing more than a figment of your imagination…\n1. Killer Queen / Carrie\n\nSkip the remake and go with the original 1976 adaptation of the Stephen King novel about an unpopular teenage girl with an overbearing mom. Typical high school angst, right? Not when the teenage girl is telekinetic and a wee bit unstable.\nYou probably don’t want to pull a mean prank on her during the prom—instead, offer her some Killer Queen, a hybrid that yields happy, uplifting effects. Sounds like a match made in sticky, bloody heaven.\n2. Pennywise / It\n\nYou have the option to cue up the original It TV miniseries or check out the 2017 film adaptation of the Stephen King novel. Either way, you’ll be confronted with one of the scariest horror movie villains you’ll peek through your fingers to catch a glimpse of.\nClowns are creepy enough on their own, but a sewer-dwelling razor-teethed clown that eats children will provide enough nightmare fuel that you might need some of the indica Pennywise strain to relax you back down into a state where you aren’t likely to pee yourself at any given moment. Just remember, they all float down here…\n\n3. Jack the Ripper / The Shining\n\nI know that the historic Jack the Ripper went after prostitutes in ye olde timey London, but when I think of a scary Jack, only one man comes to mind: Mr. Torrance from yet another Stephen King novel-turned-movie, The Shining.\nIt may be a little less unnerving to watch the family man become unhinged as a brutal winter keeps his wife and son held captive inside the sinister Overlook Hotel if you pair the experience with the happiness-inducing Jack the Ripper hybrid. Better yet, chase that strain with some appropriately-named Jack Frost once the axe-wielding papa succumbs to that tricky hedge maze.\n4. Alien OG – Alien\n\nFinally, an entry that didn’t come from the warped mind of Stephen King! This Ridley Scott classic boasts impressive special effects and the clever tagline, “In space, no one can hear you scream.”\nSure, Alien practically invented the “What’s that scary rustling in the corner? Oh, it’s just the damn cat OH CRAP A MONSTER’S TRYING TO EAT ME” horror movie trope, but it’s still a top entry in my book mainly because Ellen Ripley is one of the most bad-ass female protagonists in movie history. Celebrate her victory over the drooling, acid-blooded behemoth with a little Alien OG, a hybrid strain with earthy and pine flavors that will make you relieved you’re save and sound back here on Earth.\n\n5. Little Devil / The Exorcist\n\nFrom the iconic creepy-sounding score to the “you’ll never look at pea soup the same again” projectile vomiting, The Exorcist is a horror movie classic. A poor little girl gets possessed by the devil and promptly behaves like the Antichrist (or like those girls on My Super Sweet Sixteen).\nAfter you watch her spider-crawl down the stairs, you might want to chase that scene with some high-THC Little Devil to bring your heart rate back down to a normal range.\n6. Ghost OG / Poltergeist\n\n“You just moved the headstones! You didn’t move the bodies!!” Poltergeist is a cautionary tale as to why you should avoid buying houses built over ancient Indian burial grounds no matter how sweet the deal may seem.\nPair this spooky ghost thriller with the hybrid Ghost OG for a sweet counterbalance to all of the sour supernatural events that plague the Freeling family. Just make sure you peace out if your TV turns on by itself and is all staticky (and whatever you do, don’t go into the light).\n\n7. Zombie OG / Night of the Living Dead\n\nIf you’re going to enjoy some Zombie OG, it’s only fitting to pair the earthy indica with the 1968 classic that kicked off over 45 years of zombie mania, George Romero’s Night of the Living Dead. The black and white film doesn’t bother with happy endings, just wave after wave of undead citizens keen on taking a bite out of anyone within a rotted arm’s reach.\nIf you want to extend your movie marathon, I recommend following up the original with the iconic Dawn of the Dead, a cheeky wink at our society’s zombie-like consumerist ways, and Day of the Dead, which takes the horror underground to a military bunker.\n8. Killing Fields / The Texas Chainsaw Massacre\n\nThe 1974 horror classic The Texas Chainsaw Massacre was so unsettling, some people actually thought it was a real snuff film. What’s remarkable about the movie is that it isn’t gory at all—the creepy family and the film’s realistic, grimy feel mess with your head and make you think it’s more grisly than it actually is.\nWhile watching, partake in the sativa Killing Fields so you’ll have some energy to sprint across a field if Leatherface bursts through your door wielding a gas-powered killing apparatus.\n\n9. Pandora’s Box / Hellraiser\n\nThis ’80’s horror offering is a cautionary tale for anyone who comes across a mysterious puzzle box in a creepy knickknacks shop. Stop, put down the box, and buy a snow globe instead; otherwise, you might accidentally summon some nasty-looking dudes who are all-too keen on dragging you to hell.\nPair Hellraiser with the sweet, grapefruity Pandora’s Box for a little juxtaposition as you watch a dude with pins in his face rip a guy apart with some rusty chains.\n10. Kali Mist / The Mist\n\nHere’s one more Stephen King entry for your horror movie marathon. The Mist is a surprisingly good film from 2007 that follows a man and his son as they struggle to survive against the evils of both otherworldly creatures and mankind after a mysterious mist rolls through a small town. The ending is bleak and if you opt to watch the black and white version, it’ll seem even more eerie.\nHelp clear your mood afterwards with some Kali Mist, which delivers happy, uplifting effects to counterbalance the dread you experience while watching this bummerfest.\n\n11. Mother’s Finest / Psycho\n\nYou think you’ve got mommy issues? This iconic Hitchcock film is the ultimate example of “This dude needs therapy and a hug.” Stay far, far away from the pointless Gus Van Sant remake and opt for the original 1960 classic.\nExperience Psycho with the sweet sativa Mother’s Finest and make sure to lock the bathroom door before you hop into the shower.\n12. OG Shark / Jaws\n\nThe original summer blockbuster that made millions of people afraid to dip a toe into the ocean, Jaws is one of my all-time favorite movies. Given how every other classic horror movie has suffered through an inferior remake, it says a lot about this Steven Spielberg offering that nobody has dared to touch this masterpiece since it first debuted.\nPartake in the hybrid OG Shark and bask in its diesel flavor when Brody shouts “Smile, you son of a bitch!” and blows the massive great white shark to smithereens.\n\n13. Funky Monkey / Dead Alive\n\nOkay, admittedly this warped film from Peter Jackson is more funny-gross than scary, but Dead Alive is still a classic in its own right and a cautionary example of why you shouldn’t mess with rabid Sumatran rat-monkeys.\nEnjoy some of the indica Funky Monkey and giggle it up while you watch a priest kick ass for the Lord and an unlikely protagonist wield a lawnmower against a room full of nasty undeads.\nWhat are some of your favorite movies you can’t wait to watch tonight? Share in the comments and we’ll think of strain pairings to go with them!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/06/12001235/13-strains-and-their-scary-movie-pairings-to-celebrate-friday-the.jpg","urlslug":"/news/strains-products/13-strains-and-their-scary-movie-pairings-to-celebrate-friday-the"},{"id":"contentitems-2973","title":"24 Strains to Prepare You for the Game of Thrones Season 4 Premiere","author":"Rebecca Kelley","category":null,"date":"\/Date(1396641600000)\/","text":"We’re big fans of Game of Thrones here at Leafly and the crew is super stoked for the season 4 debut this Sunday on HBO. If you’re planning on hosting a viewing party to kick off the premiere of one of the best shows on television, why not pick up some of these Game of Thrones-themed strains to properly celebrate?\nHere are 24 strains (some standing solo, some paired together) we feel tie in with the Game of Thrones universe perfectly (spoilers below if you aren’t caught up to season 4 by now). Yes, 24. That’s how much we love both our strains and this show. Even though All Men Must Die, their memories will live on thanks to this list of green.\n1. Mad Dawg \n\nThis earthy hybrid is in honor of Mad King Aerys II Targaryen, the kooky ruler who started this whole mess in the first place. Dude, all you had to do was not murder a bunch of people and threaten to burn down King’s Landing and we wouldn’t even have a Game of Thrones battle royale waging. If only he had a little stash of Mad Dawg to keep him feeling euphoric and relaxed.\n2. 3 Kings\n\nThe hybrid 3 Kings strain may be a fusion of Headband, Sour Diesel, and OG Kush, but it also signifies the three kings currently left standing in Game of Thrones at the start of season 4: Joffrey Lannister (aka The Worst Person Ever), Stannis Baratheon (aka “Stannis the Mannis,” self-proclaimed King of the Andals), and Balon Greyjoy (aka World’s Not-Greatest Dad), king of the Iron Islands. Maybe this pungent strain will clear some of the crazy out of their sinuses.\n3. Permafrost\n\nBecause, as House Stark constantly reminds us, “Winter is coming,” so you might as well hunker down and wait for it to arrive with some piney Permafrost.\nSpeaking of House Stark…\n4. Northern Lights\n\nThe North remembers, and though their numbers are dwindling and the Starks are constantly having George R. R. Martin take a never-ending dump on them, there are still a few scrappy surviving members who have a glimmer of hope shining, however dimly at the moment. Northern Lights is good for combating stress, and I’m guessing the Starks are feeling a little overwhelmed right about now.\n5. Lions Gate\n\nThis royal purple indica is in honor of the proud and wealthy Lannisters, who happen to use a lion as their sigil. The Lannisters appear to be sitting pretty right now – they rule the Seven Kingdoms, Jamie’s been returned (mostly intact), Tywin’s only been moderately cranky – but we’ll see if their good luck streak will continue in season 4. They’ll need the focus that the Lions Gate strain brings.\n6. Richie Rich + Power Kush \n\nSpeaking of Tywin Lannister, if you combine the hybrid Richie Rich with the indica Power Kush, you’ll have a father who loves to play the game more than he loves his own family. I bet he’s sneering in every family portrait that’s been commissioned – it’s the ye olde equivalent of blinking in photos.\n7. Killer Queen + Sour Power \n\nSticking with the Lannisters, let’s shift gears to Cersei, former queen of Westeros and current queen of the “Who farted?” face. A Killer Queen willing to do whatever it takes to get as close to the Iron Throne as possible, this icy blonde beauty has felt her power go a little sour once she realized that her turd of a son can’t be controlled. Talk about a disappointed parent. She really takes after her father, doesn’t she?\n8. Little Devil + Abusive OG\n\nUgh, Joffrey is the worst. We can’t think of a better pairing for the little pissant than the hybrid Little Devil and the indica Abusive OG. If ever King Joffrey’s horrible ways feel a little too heavy for your tastes, just remember that he got b-slapped by the best character ever:\n\nSpeaking of which…\n9. Royal Dwarf \n\nTyrion Lannister is rumored to be one of the characters George R. R. Martin’s wife made him promise he would never kill off. I think every Game of Thrones fan can agree – even though he’s a Lannister, he’s still a Royal Dwarf and one of the best characters on the show.\nAnother favorite character?\n10. Jane Doe + Odyssey \n\nFierce little Arya Stark has seen many of her family members fall victim to the Game of Thrones and now she’s out for blood. This pint-sized warrior in the making has abandoned her identity and gone all Jane Doe in an attempt to take out the people on her shit list. How will her revenge Odyssey pan out?\n11. Critical Mass\n\nSticking with the Starks, we’ve never had a drastic shift in character sympathy than for poor Sansa. Sure, she was a naive, stuck-up teenager in season 1, but she’s had most of her family murdered, been held prisoner, and was nearly forced to marry a psychopath Lannister before being forced to marry another Lannister. Tyrion’s been kind to her so far but honestly, how much more suffering do you have in store for Sansa, George R. R. Martin? She seems to be at Critical Mass right now and could use a little of the happy effects this indica brings.\nKnow who else is feeling a little blue?\n12. Blue Bastard \n\nOh, Jon Snow. The bastard son of Ned Stark has been on his own Odyssey but he can’t seem to make up his mind as to what he wants (maybe he really does know “nuthing”). Is it revenge for the Starks? Does he want to protect the Night’s Watch or defect from them? Or maybe he wants to catch a glimpse of another Ogre with Ygritte (although “Jon Snuhhhh” isn’t exactly in her good graces right now). It’s been a depressing journey for him thus far – good thing Blue Bastard is good for relieving depression.\n13. White Zombie + Snow Monster\n\nWe’ve already seen a few of the horrors that lie north of the Wall, including a White Zombie who looked like a frigid Iggy Pop. Can Jon Snow protect the Seven Kingdoms from the Snow Monsters that are advancing?\n14. Super Sour Widow \n\nPoor Catelyn Stark. Even though she could never love the bastard Jon Snow, she still didn’t deserve to have her entire family either murdered or scattered across the Seven Kingdoms. Talk about a Super Sour Widow.\nAnd to make matters worse…\n15. Red Haze \n\nThat Red Wedding was effed up, yo. Like seriously. After watching that episode, you probably felt as amped up as the effects the sativa Red Haze can bring (and you were likely in a Red Haze of your own once “The Rains of Castamere” started playing).\n16. Blackwater + Green Haze\n\nAnother iconic moment in Game of Thrones, this event was less heart-breaking than the Red Wedding and more awe-inspiring. The Battle of the Blackwater has been the biggest battle in the War of the Five Kings so far. Tyrion’s use of wildfire put Stannis’ army in a Green Haze and protected King’s Landing from being overrun. By combining the indica Blackwater and the sativa Green Haze, you’re creating quite the explosive hybrid strain yourself.\n17. Cherry Bomb\n\nCherry Bomb continue to deliver (both literally and figuratively), or will her influence over him go up in flames?\n \n18. Anesthesia\n\nA little something both Jaime Lannister and Theon Greyjoy could have used throughout season 3, amirite guys? The indica Anesthesia is widely used for pain management, making it an appropriate option for these two whipping boys.\n19. Lifesaver\n\nJaime owes you one, Brienne of Tarth. Why not have him pick up this euphoric hybrid Lifesaver strain while you two bathe and reminisce about the time you both faced off against a friggin’ grizzly bear?\n20. Brains Damage\n\nWhat better way to celebrate the possibly brain-damaged but entertainingly verbose Hodor with this Hodor, I mean hybrid strain that brings sleepiness, Hodor, and Hodor Hodor.\n21. Bordello\n\nAny Game of Thrones viewer is all-too familiar with the show’s numerous “sexposition” scenes that occur in a brothel or during sex scenes to spruce up an otherwise boring plot advancement. Take a taste of the hybrid Bordello whenever a sexposition scene pops up and you’ll feel so relaxed, you’ll forget how shamelessly (and entertainingly) gratuitous these parts actually are.\n22. True OG \n\nWho will end up winning the Game of Thrones? Who do you feel is the rightful ruler of the Seven Kingdoms? Partake in this relaxing indica while you ponder who you feel the “True OG” should be.\nWill it be…\n23. Dream Queen + Triple Diesel\n\nMany Game of Thrones fans are rooting for their “Dream Queen,” Daenerys Targaryen, who’s using her Triple Diesel dragons to kick ass, free slaves, and chew bubblegum (and she’s all out of bubblegum).\nAnd finally…\n24. F*cking Incredible\n\nWhich is exactly what this show is. Happy watching!\nImage credits: mad king, House Lannister","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12001238/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie.jpg","urlslug":"/news/strains-products/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie"}],"reviewCount":110,"flavors":[{"name":"Sweet","score":85.213032581453618},{"name":"Tropical","score":67.418546365914779},{"name":"Citrus","score":35.0250626566416},{"name":"Pungent","score":35.0250626566416},{"name":"Earthy","score":34.649122807017541}],"effects":[{"name":"Happy","score":91.416040100250612},{"name":"Creative","score":90.476190476190453},{"name":"Talkative","score":87.65664160401},{"name":"Euphoric","score":74.749373433583955},{"name":"Uplifted","score":74.561403508771917}],"symptoms":[{"name":"Fatigue","score":69.862155388471166},{"name":"Pain","score":56.203007518796987},{"name":"Stress","score":56.203007518796987},{"name":"Depression","score":54.511278195488714},{"name":"Insomnia","score":52.819548872180441}],"conditions":[{"name":"Anxiety","score":72.493734335839591},{"name":"Migraines","score":18.170426065162903},{"name":"Asthma","score":17.418546365914786},{"name":"Bipolar Disorder","score":17.418546365914786},{"name":"ADD/ADHD","score":1.8796992481203008}],"negatives":[{"name":"Dry Mouth","score":54.699248120300744},{"name":"Dry Eyes","score":35.588972431077693},{"name":"Paranoid","score":1.3157894736842104},{"name":"Dizzy","score":1.1278195488721803},{"name":"Headache","score":0.93984962406015038}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_6856.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/599702/b/killer-queen__primary_f8a9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_eeda.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/525972/b/killer-queen__primary_480d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_2aca.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500178/b/killer-queen__primary_5df7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_bece.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/459507/b/killer-queen__primary_9c5c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_eeea.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/432084/b/killer-queen__primary_c35c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_2655.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/431636/b/killer-queen__primary_1065.jpg"}],"photoTotalCount":27,"popularCities":["Denver, CO","Albany, OR","Boulder, CO","Bozeman, MT","Colorado Springs, CO","Glenwood Springs, CO","Helena, MT","Medford, OR","Missoula, MT","Pueblo West, CO"],"permalink":"https://mobileapi.leafly.com/hybrid/killer-queen","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.30909090909091/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"G13","subtitle":null,"slug":"g-13","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/g-13","symbol":"G13","applink":"leafly://strain/g-13"},{"name":"Cinderella 99","subtitle":null,"slug":"cinderella-99","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/cinderella-99","symbol":"C99","applink":"leafly://strain/cinderella-99"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":818,"slug":"killer-queen","name":"Killer Queen","subtitle":null,"symbol":"Kq","category":"Hybrid","description":"\u003cp\u003eA British Columbia native, Killer Queen is the outcome of an imaginative cross between \u003ca href=\"http://www.leafly.com/indica/g-13\" style=\"text-decoration:none;\"\u003eG13\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/cinderella-99\" style=\"text-decoration:none;\"\u003eCinderella 99\u003c/a\u003e. Uplifting and thought-provoking, this hybrid is great for the workaholic who would like some daytime relief. The effects of this strain are felt most heavily in the face, eyes, and forehead, evidencing the sativa aspects of this hybrid. Upon first taste, Killer Queen takes up the fruity characteristics of Cinderella 99. The tropical flavor, however, is quickly followed by an earthy, herbal tone. If you are searching for an energizing strain that allows you to focus, Killer Queen may be just the perfect match.\u003c/p\u003e\n","descriptionPlain":"A British Columbia native, Killer Queen is the outcome of an imaginative cross between G13 and Cinderella 99. Uplifting and thought-provoking, this hybrid is great for the workaholic who would like some daytime relief. The effects of this strain are felt most heavily in the face, eyes, and forehead, evidencing the sativa aspects of this hybrid. Upon first taste, Killer Queen takes up the fruity characteristics of Cinderella 99. The tropical flavor, however, is quickly followed by an earthy, herbal tone. If you are searching for an energizing strain that allows you to focus, Killer Queen may be just the perfect match.\n","aka":null,"rating":4.31,"highlightedReviews":[{"id":1369519,"username":"pdoane","text":"Killer Queen hits your head, forehead and eyes very hard.  Your arms and body will likely pulse with a euphoric rush.  Increased auditory focus.  Able to write and follow thought patterns/instructions physically – mind and body are still connected.  The soothing cerebral effects give way to heavy eyelids and a slight draining feeling towards the end.  This is a moderate come down.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1621858,"username":"belulah","text":"This strain puts me in such a good mood! I’m usually more a fan of staying in with a heavy indica, but this stuff is the best before going out, going to work, socializing, etc. I was DREADING work this morning, but after smoking, I’m FEELING IT. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2971","title":"13 Cannabis Strains and Their Scary Movie Pairings","author":"Rebecca Kelley","category":null,"date":"\/Date(1402677600000)\/","text":"Whether you want to properly celebrate Friday the 13th or are simply in the mood for some elevated frights, here are 13 strains that each have an appropriate scary movie to pair. Enjoy, and remember, that creaking noise you hear coming from the creepy corner of the house is nothing more than a figment of your imagination…\n1. Killer Queen / Carrie\n\nSkip the remake and go with the original 1976 adaptation of the Stephen King novel about an unpopular teenage girl with an overbearing mom. Typical high school angst, right? Not when the teenage girl is telekinetic and a wee bit unstable.\nYou probably don’t want to pull a mean prank on her during the prom—instead, offer her some Killer Queen, a hybrid that yields happy, uplifting effects. Sounds like a match made in sticky, bloody heaven.\n2. Pennywise / It\n\nYou have the option to cue up the original It TV miniseries or check out the 2017 film adaptation of the Stephen King novel. Either way, you’ll be confronted with one of the scariest horror movie villains you’ll peek through your fingers to catch a glimpse of.\nClowns are creepy enough on their own, but a sewer-dwelling razor-teethed clown that eats children will provide enough nightmare fuel that you might need some of the indica Pennywise strain to relax you back down into a state where you aren’t likely to pee yourself at any given moment. Just remember, they all float down here…\n\n3. Jack the Ripper / The Shining\n\nI know that the historic Jack the Ripper went after prostitutes in ye olde timey London, but when I think of a scary Jack, only one man comes to mind: Mr. Torrance from yet another Stephen King novel-turned-movie, The Shining.\nIt may be a little less unnerving to watch the family man become unhinged as a brutal winter keeps his wife and son held captive inside the sinister Overlook Hotel if you pair the experience with the happiness-inducing Jack the Ripper hybrid. Better yet, chase that strain with some appropriately-named Jack Frost once the axe-wielding papa succumbs to that tricky hedge maze.\n4. Alien OG – Alien\n\nFinally, an entry that didn’t come from the warped mind of Stephen King! This Ridley Scott classic boasts impressive special effects and the clever tagline, “In space, no one can hear you scream.”\nSure, Alien practically invented the “What’s that scary rustling in the corner? Oh, it’s just the damn cat OH CRAP A MONSTER’S TRYING TO EAT ME” horror movie trope, but it’s still a top entry in my book mainly because Ellen Ripley is one of the most bad-ass female protagonists in movie history. Celebrate her victory over the drooling, acid-blooded behemoth with a little Alien OG, a hybrid strain with earthy and pine flavors that will make you relieved you’re save and sound back here on Earth.\n\n5. Little Devil / The Exorcist\n\nFrom the iconic creepy-sounding score to the “you’ll never look at pea soup the same again” projectile vomiting, The Exorcist is a horror movie classic. A poor little girl gets possessed by the devil and promptly behaves like the Antichrist (or like those girls on My Super Sweet Sixteen).\nAfter you watch her spider-crawl down the stairs, you might want to chase that scene with some high-THC Little Devil to bring your heart rate back down to a normal range.\n6. Ghost OG / Poltergeist\n\n“You just moved the headstones! You didn’t move the bodies!!” Poltergeist is a cautionary tale as to why you should avoid buying houses built over ancient Indian burial grounds no matter how sweet the deal may seem.\nPair this spooky ghost thriller with the hybrid Ghost OG for a sweet counterbalance to all of the sour supernatural events that plague the Freeling family. Just make sure you peace out if your TV turns on by itself and is all staticky (and whatever you do, don’t go into the light).\n\n7. Zombie OG / Night of the Living Dead\n\nIf you’re going to enjoy some Zombie OG, it’s only fitting to pair the earthy indica with the 1968 classic that kicked off over 45 years of zombie mania, George Romero’s Night of the Living Dead. The black and white film doesn’t bother with happy endings, just wave after wave of undead citizens keen on taking a bite out of anyone within a rotted arm’s reach.\nIf you want to extend your movie marathon, I recommend following up the original with the iconic Dawn of the Dead, a cheeky wink at our society’s zombie-like consumerist ways, and Day of the Dead, which takes the horror underground to a military bunker.\n8. Killing Fields / The Texas Chainsaw Massacre\n\nThe 1974 horror classic The Texas Chainsaw Massacre was so unsettling, some people actually thought it was a real snuff film. What’s remarkable about the movie is that it isn’t gory at all—the creepy family and the film’s realistic, grimy feel mess with your head and make you think it’s more grisly than it actually is.\nWhile watching, partake in the sativa Killing Fields so you’ll have some energy to sprint across a field if Leatherface bursts through your door wielding a gas-powered killing apparatus.\n\n9. Pandora’s Box / Hellraiser\n\nThis ’80’s horror offering is a cautionary tale for anyone who comes across a mysterious puzzle box in a creepy knickknacks shop. Stop, put down the box, and buy a snow globe instead; otherwise, you might accidentally summon some nasty-looking dudes who are all-too keen on dragging you to hell.\nPair Hellraiser with the sweet, grapefruity Pandora’s Box for a little juxtaposition as you watch a dude with pins in his face rip a guy apart with some rusty chains.\n10. Kali Mist / The Mist\n\nHere’s one more Stephen King entry for your horror movie marathon. The Mist is a surprisingly good film from 2007 that follows a man and his son as they struggle to survive against the evils of both otherworldly creatures and mankind after a mysterious mist rolls through a small town. The ending is bleak and if you opt to watch the black and white version, it’ll seem even more eerie.\nHelp clear your mood afterwards with some Kali Mist, which delivers happy, uplifting effects to counterbalance the dread you experience while watching this bummerfest.\n\n11. Mother’s Finest / Psycho\n\nYou think you’ve got mommy issues? This iconic Hitchcock film is the ultimate example of “This dude needs therapy and a hug.” Stay far, far away from the pointless Gus Van Sant remake and opt for the original 1960 classic.\nExperience Psycho with the sweet sativa Mother’s Finest and make sure to lock the bathroom door before you hop into the shower.\n12. OG Shark / Jaws\n\nThe original summer blockbuster that made millions of people afraid to dip a toe into the ocean, Jaws is one of my all-time favorite movies. Given how every other classic horror movie has suffered through an inferior remake, it says a lot about this Steven Spielberg offering that nobody has dared to touch this masterpiece since it first debuted.\nPartake in the hybrid OG Shark and bask in its diesel flavor when Brody shouts “Smile, you son of a bitch!” and blows the massive great white shark to smithereens.\n\n13. Funky Monkey / Dead Alive\n\nOkay, admittedly this warped film from Peter Jackson is more funny-gross than scary, but Dead Alive is still a classic in its own right and a cautionary example of why you shouldn’t mess with rabid Sumatran rat-monkeys.\nEnjoy some of the indica Funky Monkey and giggle it up while you watch a priest kick ass for the Lord and an unlikely protagonist wield a lawnmower against a room full of nasty undeads.\nWhat are some of your favorite movies you can’t wait to watch tonight? Share in the comments and we’ll think of strain pairings to go with them!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/06/12001235/13-strains-and-their-scary-movie-pairings-to-celebrate-friday-the.jpg","urlslug":"/news/strains-products/13-strains-and-their-scary-movie-pairings-to-celebrate-friday-the"},{"id":"contentitems-2973","title":"24 Strains to Prepare You for the Game of Thrones Season 4 Premiere","author":"Rebecca Kelley","category":null,"date":"\/Date(1396641600000)\/","text":"We’re big fans of Game of Thrones here at Leafly and the crew is super stoked for the season 4 debut this Sunday on HBO. If you’re planning on hosting a viewing party to kick off the premiere of one of the best shows on television, why not pick up some of these Game of Thrones-themed strains to properly celebrate?\nHere are 24 strains (some standing solo, some paired together) we feel tie in with the Game of Thrones universe perfectly (spoilers below if you aren’t caught up to season 4 by now). Yes, 24. That’s how much we love both our strains and this show. Even though All Men Must Die, their memories will live on thanks to this list of green.\n1. Mad Dawg \n\nThis earthy hybrid is in honor of Mad King Aerys II Targaryen, the kooky ruler who started this whole mess in the first place. Dude, all you had to do was not murder a bunch of people and threaten to burn down King’s Landing and we wouldn’t even have a Game of Thrones battle royale waging. If only he had a little stash of Mad Dawg to keep him feeling euphoric and relaxed.\n2. 3 Kings\n\nThe hybrid 3 Kings strain may be a fusion of Headband, Sour Diesel, and OG Kush, but it also signifies the three kings currently left standing in Game of Thrones at the start of season 4: Joffrey Lannister (aka The Worst Person Ever), Stannis Baratheon (aka “Stannis the Mannis,” self-proclaimed King of the Andals), and Balon Greyjoy (aka World’s Not-Greatest Dad), king of the Iron Islands. Maybe this pungent strain will clear some of the crazy out of their sinuses.\n3. Permafrost\n\nBecause, as House Stark constantly reminds us, “Winter is coming,” so you might as well hunker down and wait for it to arrive with some piney Permafrost.\nSpeaking of House Stark…\n4. Northern Lights\n\nThe North remembers, and though their numbers are dwindling and the Starks are constantly having George R. R. Martin take a never-ending dump on them, there are still a few scrappy surviving members who have a glimmer of hope shining, however dimly at the moment. Northern Lights is good for combating stress, and I’m guessing the Starks are feeling a little overwhelmed right about now.\n5. Lions Gate\n\nThis royal purple indica is in honor of the proud and wealthy Lannisters, who happen to use a lion as their sigil. The Lannisters appear to be sitting pretty right now – they rule the Seven Kingdoms, Jamie’s been returned (mostly intact), Tywin’s only been moderately cranky – but we’ll see if their good luck streak will continue in season 4. They’ll need the focus that the Lions Gate strain brings.\n6. Richie Rich + Power Kush \n\nSpeaking of Tywin Lannister, if you combine the hybrid Richie Rich with the indica Power Kush, you’ll have a father who loves to play the game more than he loves his own family. I bet he’s sneering in every family portrait that’s been commissioned – it’s the ye olde equivalent of blinking in photos.\n7. Killer Queen + Sour Power \n\nSticking with the Lannisters, let’s shift gears to Cersei, former queen of Westeros and current queen of the “Who farted?” face. A Killer Queen willing to do whatever it takes to get as close to the Iron Throne as possible, this icy blonde beauty has felt her power go a little sour once she realized that her turd of a son can’t be controlled. Talk about a disappointed parent. She really takes after her father, doesn’t she?\n8. Little Devil + Abusive OG\n\nUgh, Joffrey is the worst. We can’t think of a better pairing for the little pissant than the hybrid Little Devil and the indica Abusive OG. If ever King Joffrey’s horrible ways feel a little too heavy for your tastes, just remember that he got b-slapped by the best character ever:\n\nSpeaking of which…\n9. Royal Dwarf \n\nTyrion Lannister is rumored to be one of the characters George R. R. Martin’s wife made him promise he would never kill off. I think every Game of Thrones fan can agree – even though he’s a Lannister, he’s still a Royal Dwarf and one of the best characters on the show.\nAnother favorite character?\n10. Jane Doe + Odyssey \n\nFierce little Arya Stark has seen many of her family members fall victim to the Game of Thrones and now she’s out for blood. This pint-sized warrior in the making has abandoned her identity and gone all Jane Doe in an attempt to take out the people on her shit list. How will her revenge Odyssey pan out?\n11. Critical Mass\n\nSticking with the Starks, we’ve never had a drastic shift in character sympathy than for poor Sansa. Sure, she was a naive, stuck-up teenager in season 1, but she’s had most of her family murdered, been held prisoner, and was nearly forced to marry a psychopath Lannister before being forced to marry another Lannister. Tyrion’s been kind to her so far but honestly, how much more suffering do you have in store for Sansa, George R. R. Martin? She seems to be at Critical Mass right now and could use a little of the happy effects this indica brings.\nKnow who else is feeling a little blue?\n12. Blue Bastard \n\nOh, Jon Snow. The bastard son of Ned Stark has been on his own Odyssey but he can’t seem to make up his mind as to what he wants (maybe he really does know “nuthing”). Is it revenge for the Starks? Does he want to protect the Night’s Watch or defect from them? Or maybe he wants to catch a glimpse of another Ogre with Ygritte (although “Jon Snuhhhh” isn’t exactly in her good graces right now). It’s been a depressing journey for him thus far – good thing Blue Bastard is good for relieving depression.\n13. White Zombie + Snow Monster\n\nWe’ve already seen a few of the horrors that lie north of the Wall, including a White Zombie who looked like a frigid Iggy Pop. Can Jon Snow protect the Seven Kingdoms from the Snow Monsters that are advancing?\n14. Super Sour Widow \n\nPoor Catelyn Stark. Even though she could never love the bastard Jon Snow, she still didn’t deserve to have her entire family either murdered or scattered across the Seven Kingdoms. Talk about a Super Sour Widow.\nAnd to make matters worse…\n15. Red Haze \n\nThat Red Wedding was effed up, yo. Like seriously. After watching that episode, you probably felt as amped up as the effects the sativa Red Haze can bring (and you were likely in a Red Haze of your own once “The Rains of Castamere” started playing).\n16. Blackwater + Green Haze\n\nAnother iconic moment in Game of Thrones, this event was less heart-breaking than the Red Wedding and more awe-inspiring. The Battle of the Blackwater has been the biggest battle in the War of the Five Kings so far. Tyrion’s use of wildfire put Stannis’ army in a Green Haze and protected King’s Landing from being overrun. By combining the indica Blackwater and the sativa Green Haze, you’re creating quite the explosive hybrid strain yourself.\n17. Cherry Bomb\n\nCherry Bomb continue to deliver (both literally and figuratively), or will her influence over him go up in flames?\n \n18. Anesthesia\n\nA little something both Jaime Lannister and Theon Greyjoy could have used throughout season 3, amirite guys? The indica Anesthesia is widely used for pain management, making it an appropriate option for these two whipping boys.\n19. Lifesaver\n\nJaime owes you one, Brienne of Tarth. Why not have him pick up this euphoric hybrid Lifesaver strain while you two bathe and reminisce about the time you both faced off against a friggin’ grizzly bear?\n20. Brains Damage\n\nWhat better way to celebrate the possibly brain-damaged but entertainingly verbose Hodor with this Hodor, I mean hybrid strain that brings sleepiness, Hodor, and Hodor Hodor.\n21. Bordello\n\nAny Game of Thrones viewer is all-too familiar with the show’s numerous “sexposition” scenes that occur in a brothel or during sex scenes to spruce up an otherwise boring plot advancement. Take a taste of the hybrid Bordello whenever a sexposition scene pops up and you’ll feel so relaxed, you’ll forget how shamelessly (and entertainingly) gratuitous these parts actually are.\n22. True OG \n\nWho will end up winning the Game of Thrones? Who do you feel is the rightful ruler of the Seven Kingdoms? Partake in this relaxing indica while you ponder who you feel the “True OG” should be.\nWill it be…\n23. Dream Queen + Triple Diesel\n\nMany Game of Thrones fans are rooting for their “Dream Queen,” Daenerys Targaryen, who’s using her Triple Diesel dragons to kick ass, free slaves, and chew bubblegum (and she’s all out of bubblegum).\nAnd finally…\n24. F*cking Incredible\n\nWhich is exactly what this show is. Happy watching!\nImage credits: mad king, House Lannister","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12001238/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie.jpg","urlslug":"/news/strains-products/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie"}],"reviewCount":110,"flavors":[{"name":"Sweet","score":85.213032581453618},{"name":"Tropical","score":67.418546365914779},{"name":"Citrus","score":35.0250626566416},{"name":"Pungent","score":35.0250626566416},{"name":"Earthy","score":34.649122807017541}],"effects":[{"name":"Happy","score":91.416040100250612},{"name":"Creative","score":90.476190476190453},{"name":"Talkative","score":87.65664160401},{"name":"Euphoric","score":74.749373433583955},{"name":"Uplifted","score":74.561403508771917}],"symptoms":[{"name":"Fatigue","score":69.862155388471166},{"name":"Pain","score":56.203007518796987},{"name":"Stress","score":56.203007518796987},{"name":"Depression","score":54.511278195488714},{"name":"Insomnia","score":52.819548872180441}],"conditions":[{"name":"Anxiety","score":72.493734335839591},{"name":"Migraines","score":18.170426065162903},{"name":"Asthma","score":17.418546365914786},{"name":"Bipolar Disorder","score":17.418546365914786},{"name":"ADD/ADHD","score":1.8796992481203008}],"negatives":[{"name":"Dry Mouth","score":54.699248120300744},{"name":"Dry Eyes","score":35.588972431077693},{"name":"Paranoid","score":1.3157894736842104},{"name":"Dizzy","score":1.1278195488721803},{"name":"Headache","score":0.93984962406015038}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_6856.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/599702/b/killer-queen__primary_f8a9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_eeda.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/525972/b/killer-queen__primary_480d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_2aca.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500178/b/killer-queen__primary_5df7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_bece.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/459507/b/killer-queen__primary_9c5c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_eeea.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/432084/b/killer-queen__primary_c35c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_2655.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/431636/b/killer-queen__primary_1065.jpg"}],"photoTotalCount":27,"popularCities":["Denver, CO","Albany, OR","Boulder, CO","Bozeman, MT","Colorado Springs, CO","Glenwood Springs, CO","Helena, MT","Medford, OR","Missoula, MT","Pueblo West, CO"],"permalink":"https://mobileapi.leafly.com/hybrid/killer-queen","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.30909090909091/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"G13","subtitle":null,"slug":"g-13","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/g-13","symbol":"G13","applink":"leafly://strain/g-13"},{"name":"Cinderella 99","subtitle":null,"slug":"cinderella-99","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/cinderella-99","symbol":"C99","applink":"leafly://strain/cinderella-99"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":818,"slug":"killer-queen","name":"Killer Queen","subtitle":null,"symbol":"Kq","category":"Hybrid","description":"\u003cp\u003eA British Columbia native, Killer Queen is the outcome of an imaginative cross between \u003ca href=\"http://www.leafly.com/indica/g-13\" style=\"text-decoration:none;\"\u003eG13\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/cinderella-99\" style=\"text-decoration:none;\"\u003eCinderella 99\u003c/a\u003e. Uplifting and thought-provoking, this hybrid is great for the workaholic who would like some daytime relief. The effects of this strain are felt most heavily in the face, eyes, and forehead, evidencing the sativa aspects of this hybrid. Upon first taste, Killer Queen takes up the fruity characteristics of Cinderella 99. The tropical flavor, however, is quickly followed by an earthy, herbal tone. If you are searching for an energizing strain that allows you to focus, Killer Queen may be just the perfect match.\u003c/p\u003e\n","descriptionPlain":"A British Columbia native, Killer Queen is the outcome of an imaginative cross between G13 and Cinderella 99. Uplifting and thought-provoking, this hybrid is great for the workaholic who would like some daytime relief. The effects of this strain are felt most heavily in the face, eyes, and forehead, evidencing the sativa aspects of this hybrid. Upon first taste, Killer Queen takes up the fruity characteristics of Cinderella 99. The tropical flavor, however, is quickly followed by an earthy, herbal tone. If you are searching for an energizing strain that allows you to focus, Killer Queen may be just the perfect match.\n","aka":null,"rating":4.31,"highlightedReviews":[{"id":1369519,"username":"pdoane","text":"Killer Queen hits your head, forehead and eyes very hard.  Your arms and body will likely pulse with a euphoric rush.  Increased auditory focus.  Able to write and follow thought patterns/instructions physically – mind and body are still connected.  The soothing cerebral effects give way to heavy eyelids and a slight draining feeling towards the end.  This is a moderate come down.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1621858,"username":"belulah","text":"This strain puts me in such a good mood! I’m usually more a fan of staying in with a heavy indica, but this stuff is the best before going out, going to work, socializing, etc. I was DREADING work this morning, but after smoking, I’m FEELING IT. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2971","title":"13 Cannabis Strains and Their Scary Movie Pairings","author":"Rebecca Kelley","category":null,"date":"\/Date(1402677600000)\/","text":"Whether you want to properly celebrate Friday the 13th or are simply in the mood for some elevated frights, here are 13 strains that each have an appropriate scary movie to pair. Enjoy, and remember, that creaking noise you hear coming from the creepy corner of the house is nothing more than a figment of your imagination…\n1. Killer Queen / Carrie\n\nSkip the remake and go with the original 1976 adaptation of the Stephen King novel about an unpopular teenage girl with an overbearing mom. Typical high school angst, right? Not when the teenage girl is telekinetic and a wee bit unstable.\nYou probably don’t want to pull a mean prank on her during the prom—instead, offer her some Killer Queen, a hybrid that yields happy, uplifting effects. Sounds like a match made in sticky, bloody heaven.\n2. Pennywise / It\n\nYou have the option to cue up the original It TV miniseries or check out the 2017 film adaptation of the Stephen King novel. Either way, you’ll be confronted with one of the scariest horror movie villains you’ll peek through your fingers to catch a glimpse of.\nClowns are creepy enough on their own, but a sewer-dwelling razor-teethed clown that eats children will provide enough nightmare fuel that you might need some of the indica Pennywise strain to relax you back down into a state where you aren’t likely to pee yourself at any given moment. Just remember, they all float down here…\n\n3. Jack the Ripper / The Shining\n\nI know that the historic Jack the Ripper went after prostitutes in ye olde timey London, but when I think of a scary Jack, only one man comes to mind: Mr. Torrance from yet another Stephen King novel-turned-movie, The Shining.\nIt may be a little less unnerving to watch the family man become unhinged as a brutal winter keeps his wife and son held captive inside the sinister Overlook Hotel if you pair the experience with the happiness-inducing Jack the Ripper hybrid. Better yet, chase that strain with some appropriately-named Jack Frost once the axe-wielding papa succumbs to that tricky hedge maze.\n4. Alien OG – Alien\n\nFinally, an entry that didn’t come from the warped mind of Stephen King! This Ridley Scott classic boasts impressive special effects and the clever tagline, “In space, no one can hear you scream.”\nSure, Alien practically invented the “What’s that scary rustling in the corner? Oh, it’s just the damn cat OH CRAP A MONSTER’S TRYING TO EAT ME” horror movie trope, but it’s still a top entry in my book mainly because Ellen Ripley is one of the most bad-ass female protagonists in movie history. Celebrate her victory over the drooling, acid-blooded behemoth with a little Alien OG, a hybrid strain with earthy and pine flavors that will make you relieved you’re save and sound back here on Earth.\n\n5. Little Devil / The Exorcist\n\nFrom the iconic creepy-sounding score to the “you’ll never look at pea soup the same again” projectile vomiting, The Exorcist is a horror movie classic. A poor little girl gets possessed by the devil and promptly behaves like the Antichrist (or like those girls on My Super Sweet Sixteen).\nAfter you watch her spider-crawl down the stairs, you might want to chase that scene with some high-THC Little Devil to bring your heart rate back down to a normal range.\n6. Ghost OG / Poltergeist\n\n“You just moved the headstones! You didn’t move the bodies!!” Poltergeist is a cautionary tale as to why you should avoid buying houses built over ancient Indian burial grounds no matter how sweet the deal may seem.\nPair this spooky ghost thriller with the hybrid Ghost OG for a sweet counterbalance to all of the sour supernatural events that plague the Freeling family. Just make sure you peace out if your TV turns on by itself and is all staticky (and whatever you do, don’t go into the light).\n\n7. Zombie OG / Night of the Living Dead\n\nIf you’re going to enjoy some Zombie OG, it’s only fitting to pair the earthy indica with the 1968 classic that kicked off over 45 years of zombie mania, George Romero’s Night of the Living Dead. The black and white film doesn’t bother with happy endings, just wave after wave of undead citizens keen on taking a bite out of anyone within a rotted arm’s reach.\nIf you want to extend your movie marathon, I recommend following up the original with the iconic Dawn of the Dead, a cheeky wink at our society’s zombie-like consumerist ways, and Day of the Dead, which takes the horror underground to a military bunker.\n8. Killing Fields / The Texas Chainsaw Massacre\n\nThe 1974 horror classic The Texas Chainsaw Massacre was so unsettling, some people actually thought it was a real snuff film. What’s remarkable about the movie is that it isn’t gory at all—the creepy family and the film’s realistic, grimy feel mess with your head and make you think it’s more grisly than it actually is.\nWhile watching, partake in the sativa Killing Fields so you’ll have some energy to sprint across a field if Leatherface bursts through your door wielding a gas-powered killing apparatus.\n\n9. Pandora’s Box / Hellraiser\n\nThis ’80’s horror offering is a cautionary tale for anyone who comes across a mysterious puzzle box in a creepy knickknacks shop. Stop, put down the box, and buy a snow globe instead; otherwise, you might accidentally summon some nasty-looking dudes who are all-too keen on dragging you to hell.\nPair Hellraiser with the sweet, grapefruity Pandora’s Box for a little juxtaposition as you watch a dude with pins in his face rip a guy apart with some rusty chains.\n10. Kali Mist / The Mist\n\nHere’s one more Stephen King entry for your horror movie marathon. The Mist is a surprisingly good film from 2007 that follows a man and his son as they struggle to survive against the evils of both otherworldly creatures and mankind after a mysterious mist rolls through a small town. The ending is bleak and if you opt to watch the black and white version, it’ll seem even more eerie.\nHelp clear your mood afterwards with some Kali Mist, which delivers happy, uplifting effects to counterbalance the dread you experience while watching this bummerfest.\n\n11. Mother’s Finest / Psycho\n\nYou think you’ve got mommy issues? This iconic Hitchcock film is the ultimate example of “This dude needs therapy and a hug.” Stay far, far away from the pointless Gus Van Sant remake and opt for the original 1960 classic.\nExperience Psycho with the sweet sativa Mother’s Finest and make sure to lock the bathroom door before you hop into the shower.\n12. OG Shark / Jaws\n\nThe original summer blockbuster that made millions of people afraid to dip a toe into the ocean, Jaws is one of my all-time favorite movies. Given how every other classic horror movie has suffered through an inferior remake, it says a lot about this Steven Spielberg offering that nobody has dared to touch this masterpiece since it first debuted.\nPartake in the hybrid OG Shark and bask in its diesel flavor when Brody shouts “Smile, you son of a bitch!” and blows the massive great white shark to smithereens.\n\n13. Funky Monkey / Dead Alive\n\nOkay, admittedly this warped film from Peter Jackson is more funny-gross than scary, but Dead Alive is still a classic in its own right and a cautionary example of why you shouldn’t mess with rabid Sumatran rat-monkeys.\nEnjoy some of the indica Funky Monkey and giggle it up while you watch a priest kick ass for the Lord and an unlikely protagonist wield a lawnmower against a room full of nasty undeads.\nWhat are some of your favorite movies you can’t wait to watch tonight? Share in the comments and we’ll think of strain pairings to go with them!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/06/12001235/13-strains-and-their-scary-movie-pairings-to-celebrate-friday-the.jpg","urlslug":"/news/strains-products/13-strains-and-their-scary-movie-pairings-to-celebrate-friday-the"},{"id":"contentitems-2973","title":"24 Strains to Prepare You for the Game of Thrones Season 4 Premiere","author":"Rebecca Kelley","category":null,"date":"\/Date(1396641600000)\/","text":"We’re big fans of Game of Thrones here at Leafly and the crew is super stoked for the season 4 debut this Sunday on HBO. If you’re planning on hosting a viewing party to kick off the premiere of one of the best shows on television, why not pick up some of these Game of Thrones-themed strains to properly celebrate?\nHere are 24 strains (some standing solo, some paired together) we feel tie in with the Game of Thrones universe perfectly (spoilers below if you aren’t caught up to season 4 by now). Yes, 24. That’s how much we love both our strains and this show. Even though All Men Must Die, their memories will live on thanks to this list of green.\n1. Mad Dawg \n\nThis earthy hybrid is in honor of Mad King Aerys II Targaryen, the kooky ruler who started this whole mess in the first place. Dude, all you had to do was not murder a bunch of people and threaten to burn down King’s Landing and we wouldn’t even have a Game of Thrones battle royale waging. If only he had a little stash of Mad Dawg to keep him feeling euphoric and relaxed.\n2. 3 Kings\n\nThe hybrid 3 Kings strain may be a fusion of Headband, Sour Diesel, and OG Kush, but it also signifies the three kings currently left standing in Game of Thrones at the start of season 4: Joffrey Lannister (aka The Worst Person Ever), Stannis Baratheon (aka “Stannis the Mannis,” self-proclaimed King of the Andals), and Balon Greyjoy (aka World’s Not-Greatest Dad), king of the Iron Islands. Maybe this pungent strain will clear some of the crazy out of their sinuses.\n3. Permafrost\n\nBecause, as House Stark constantly reminds us, “Winter is coming,” so you might as well hunker down and wait for it to arrive with some piney Permafrost.\nSpeaking of House Stark…\n4. Northern Lights\n\nThe North remembers, and though their numbers are dwindling and the Starks are constantly having George R. R. Martin take a never-ending dump on them, there are still a few scrappy surviving members who have a glimmer of hope shining, however dimly at the moment. Northern Lights is good for combating stress, and I’m guessing the Starks are feeling a little overwhelmed right about now.\n5. Lions Gate\n\nThis royal purple indica is in honor of the proud and wealthy Lannisters, who happen to use a lion as their sigil. The Lannisters appear to be sitting pretty right now – they rule the Seven Kingdoms, Jamie’s been returned (mostly intact), Tywin’s only been moderately cranky – but we’ll see if their good luck streak will continue in season 4. They’ll need the focus that the Lions Gate strain brings.\n6. Richie Rich + Power Kush \n\nSpeaking of Tywin Lannister, if you combine the hybrid Richie Rich with the indica Power Kush, you’ll have a father who loves to play the game more than he loves his own family. I bet he’s sneering in every family portrait that’s been commissioned – it’s the ye olde equivalent of blinking in photos.\n7. Killer Queen + Sour Power \n\nSticking with the Lannisters, let’s shift gears to Cersei, former queen of Westeros and current queen of the “Who farted?” face. A Killer Queen willing to do whatever it takes to get as close to the Iron Throne as possible, this icy blonde beauty has felt her power go a little sour once she realized that her turd of a son can’t be controlled. Talk about a disappointed parent. She really takes after her father, doesn’t she?\n8. Little Devil + Abusive OG\n\nUgh, Joffrey is the worst. We can’t think of a better pairing for the little pissant than the hybrid Little Devil and the indica Abusive OG. If ever King Joffrey’s horrible ways feel a little too heavy for your tastes, just remember that he got b-slapped by the best character ever:\n\nSpeaking of which…\n9. Royal Dwarf \n\nTyrion Lannister is rumored to be one of the characters George R. R. Martin’s wife made him promise he would never kill off. I think every Game of Thrones fan can agree – even though he’s a Lannister, he’s still a Royal Dwarf and one of the best characters on the show.\nAnother favorite character?\n10. Jane Doe + Odyssey \n\nFierce little Arya Stark has seen many of her family members fall victim to the Game of Thrones and now she’s out for blood. This pint-sized warrior in the making has abandoned her identity and gone all Jane Doe in an attempt to take out the people on her shit list. How will her revenge Odyssey pan out?\n11. Critical Mass\n\nSticking with the Starks, we’ve never had a drastic shift in character sympathy than for poor Sansa. Sure, she was a naive, stuck-up teenager in season 1, but she’s had most of her family murdered, been held prisoner, and was nearly forced to marry a psychopath Lannister before being forced to marry another Lannister. Tyrion’s been kind to her so far but honestly, how much more suffering do you have in store for Sansa, George R. R. Martin? She seems to be at Critical Mass right now and could use a little of the happy effects this indica brings.\nKnow who else is feeling a little blue?\n12. Blue Bastard \n\nOh, Jon Snow. The bastard son of Ned Stark has been on his own Odyssey but he can’t seem to make up his mind as to what he wants (maybe he really does know “nuthing”). Is it revenge for the Starks? Does he want to protect the Night’s Watch or defect from them? Or maybe he wants to catch a glimpse of another Ogre with Ygritte (although “Jon Snuhhhh” isn’t exactly in her good graces right now). It’s been a depressing journey for him thus far – good thing Blue Bastard is good for relieving depression.\n13. White Zombie + Snow Monster\n\nWe’ve already seen a few of the horrors that lie north of the Wall, including a White Zombie who looked like a frigid Iggy Pop. Can Jon Snow protect the Seven Kingdoms from the Snow Monsters that are advancing?\n14. Super Sour Widow \n\nPoor Catelyn Stark. Even though she could never love the bastard Jon Snow, she still didn’t deserve to have her entire family either murdered or scattered across the Seven Kingdoms. Talk about a Super Sour Widow.\nAnd to make matters worse…\n15. Red Haze \n\nThat Red Wedding was effed up, yo. Like seriously. After watching that episode, you probably felt as amped up as the effects the sativa Red Haze can bring (and you were likely in a Red Haze of your own once “The Rains of Castamere” started playing).\n16. Blackwater + Green Haze\n\nAnother iconic moment in Game of Thrones, this event was less heart-breaking than the Red Wedding and more awe-inspiring. The Battle of the Blackwater has been the biggest battle in the War of the Five Kings so far. Tyrion’s use of wildfire put Stannis’ army in a Green Haze and protected King’s Landing from being overrun. By combining the indica Blackwater and the sativa Green Haze, you’re creating quite the explosive hybrid strain yourself.\n17. Cherry Bomb\n\nCherry Bomb continue to deliver (both literally and figuratively), or will her influence over him go up in flames?\n \n18. Anesthesia\n\nA little something both Jaime Lannister and Theon Greyjoy could have used throughout season 3, amirite guys? The indica Anesthesia is widely used for pain management, making it an appropriate option for these two whipping boys.\n19. Lifesaver\n\nJaime owes you one, Brienne of Tarth. Why not have him pick up this euphoric hybrid Lifesaver strain while you two bathe and reminisce about the time you both faced off against a friggin’ grizzly bear?\n20. Brains Damage\n\nWhat better way to celebrate the possibly brain-damaged but entertainingly verbose Hodor with this Hodor, I mean hybrid strain that brings sleepiness, Hodor, and Hodor Hodor.\n21. Bordello\n\nAny Game of Thrones viewer is all-too familiar with the show’s numerous “sexposition” scenes that occur in a brothel or during sex scenes to spruce up an otherwise boring plot advancement. Take a taste of the hybrid Bordello whenever a sexposition scene pops up and you’ll feel so relaxed, you’ll forget how shamelessly (and entertainingly) gratuitous these parts actually are.\n22. True OG \n\nWho will end up winning the Game of Thrones? Who do you feel is the rightful ruler of the Seven Kingdoms? Partake in this relaxing indica while you ponder who you feel the “True OG” should be.\nWill it be…\n23. Dream Queen + Triple Diesel\n\nMany Game of Thrones fans are rooting for their “Dream Queen,” Daenerys Targaryen, who’s using her Triple Diesel dragons to kick ass, free slaves, and chew bubblegum (and she’s all out of bubblegum).\nAnd finally…\n24. F*cking Incredible\n\nWhich is exactly what this show is. Happy watching!\nImage credits: mad king, House Lannister","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12001238/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie.jpg","urlslug":"/news/strains-products/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie"}],"reviewCount":110,"flavors":[{"name":"Sweet","score":85.213032581453618},{"name":"Tropical","score":67.418546365914779},{"name":"Citrus","score":35.0250626566416},{"name":"Pungent","score":35.0250626566416},{"name":"Earthy","score":34.649122807017541}],"effects":[{"name":"Happy","score":91.416040100250612},{"name":"Creative","score":90.476190476190453},{"name":"Talkative","score":87.65664160401},{"name":"Euphoric","score":74.749373433583955},{"name":"Uplifted","score":74.561403508771917}],"symptoms":[{"name":"Fatigue","score":69.862155388471166},{"name":"Pain","score":56.203007518796987},{"name":"Stress","score":56.203007518796987},{"name":"Depression","score":54.511278195488714},{"name":"Insomnia","score":52.819548872180441}],"conditions":[{"name":"Anxiety","score":72.493734335839591},{"name":"Migraines","score":18.170426065162903},{"name":"Asthma","score":17.418546365914786},{"name":"Bipolar Disorder","score":17.418546365914786},{"name":"ADD/ADHD","score":1.8796992481203008}],"negatives":[{"name":"Dry Mouth","score":54.699248120300744},{"name":"Dry Eyes","score":35.588972431077693},{"name":"Paranoid","score":1.3157894736842104},{"name":"Dizzy","score":1.1278195488721803},{"name":"Headache","score":0.93984962406015038}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_6856.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/599702/b/killer-queen__primary_f8a9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_eeda.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/525972/b/killer-queen__primary_480d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_2aca.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500178/b/killer-queen__primary_5df7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_bece.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/459507/b/killer-queen__primary_9c5c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_eeea.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/432084/b/killer-queen__primary_c35c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/killer-queen_100x100_2655.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/431636/b/killer-queen__primary_1065.jpg"}],"photoTotalCount":27,"popularCities":["Denver, CO","Albany, OR","Boulder, CO","Bozeman, MT","Colorado Springs, CO","Glenwood Springs, CO","Helena, MT","Medford, OR","Missoula, MT","Pueblo West, CO"],"permalink":"https://mobileapi.leafly.com/hybrid/killer-queen","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.30909090909091/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"G13","subtitle":null,"slug":"g-13","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/g-13","symbol":"G13","applink":"leafly://strain/g-13"},{"name":"Cinderella 99","subtitle":null,"slug":"cinderella-99","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/cinderella-99","symbol":"C99","applink":"leafly://strain/cinderella-99"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
