{"sl_translate":"description,descriptionPlain,category","id":3692,"slug":"sfv-og","name":"SFV OG","subtitle":null,"symbol":"Sfv","category":"Hybrid","description":"\u003cp\u003eSFV OG by Cali Connection\u0026nbsp;is a \u003ca href=\"http://leafly.com/sativa\"\u003esativa\u003c/a\u003e-dominant \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e that is great for patients who need strong pain relief but don\u0026rsquo;t want to be stuck on the couch. As the name indicates, this \u003ca href=\"http://leafly.com/hybrid/og-kush\"\u003eOG Kush\u003c/a\u003e relative\u0026nbsp;originates from California\u0026rsquo;s San Fernando Valley. Although their names are barely distinguishable, \u003ca href=\"http://leafly.com/indica/sfv-og-kush\"\u003eSFV OG Kush\u003c/a\u003e is actually the \u003ca href=\"http://leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e-crossed\u0026nbsp;child to SFV OG.\u0026nbsp;\u003cspan style=\"line-height: 1.6em;\"\u003eThe flowers will stay fairly small and may not look super impressive, but what it lacks in looks it makes up for in smell. The pine and lemon earthiness that SFV exudes can be a bit harsh and bitter if smoked, so this strain is one to save for the vaporizer if consuming directly. Its indica body effects take a little longer to feel than the initial head haziness, but once they do, everything will feel fine.\u003c/span\u003e\u003c/p\u003e\n","descriptionPlain":"SFV OG by Cali Connection\u0026nbsp;is a sativa-dominant hybrid that is great for patients who need strong pain relief but don\u0026rsquo;t want to be stuck on the couch. As the name indicates, this OG Kush relative\u0026nbsp;originates from California\u0026rsquo;s San Fernando Valley. Although their names are barely distinguishable, SFV OG Kush is actually the Afghani-crossed\u0026nbsp;child to SFV OG.\u0026nbsp;The flowers will stay fairly small and may not look super impressive, but what it lacks in looks it makes up for in smell. The pine and lemon earthiness that SFV exudes can be a bit harsh and bitter if smoked, so this strain is one to save for the vaporizer if consuming directly. Its indica body effects take a little longer to feel than the initial head haziness, but once they do, everything will feel fine.\n","aka":"SFV OG, San Fernando Valley OG","rating":4.39,"highlightedReviews":[{"id":1417957,"username":"KindGoddess420","text":"🌲..My new hybrid wake \u0027n bake  LuvBud!..she\u0027s soo UpCalmEuphoricFocusedRelaxed..no aches or pain this AM!..Feeling Motivated \u0026 Energetic, ready to Go!!💚..\u0026Amazing relief for my Chronic Fatigue..A lovely Sativa-Start with a Very Kind, Indica-Ideal Finish!..Luv the piney-pungent taste..A Perfect Daytime Buzz I recommend to All my Canna-Friends😍..Enjoy!!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"},{"id":1642584,"username":"BarnesM","text":"There are plenty of og\u0027s around but this particular og is ONE of the stronger ones around,I must say,so many different flavors and the high just hits you so hard,and then again hits much harder, becomes sedating to the point were to much puts you in a cloudy state of bliss....Dam!!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-52939","title":"The Avid Dabber: Best Dabs at the 2017 Emerald Cup","author":"Will Hyde","category":null,"date":"\/Date(1514487873000)\/","text":"Welcome back to another edition of The Avid Dabber. This week I’m sharing some of the best dabs I encountered on my trip to the Emerald Cup earlier this month. The Emerald Cup is an annual competition and festival held in Santa Rosa, California to celebrate the autumn cannabis harvest in the Emerald Triangle. Some of NorCal’s best growers and hash makers enter their creations for a chance to claim the prize as a cup winner. The party kicks into full gear once the sun sets, giving way to performances from artists like The Roots, Portugal The Man, Gramatik, and many more.\nBrowse Dabbing Products\nIf you’re curious about what all goes on at the Emerald Cup, check out the recap video at the bottom of this page and stay tuned for my exclusive interview with Emerald Cup founder Tim Blake on Leafly’s “What Are You Smoking?” podcast. But for now, let’s get to the dabs!\n \nhttps://www.instagram.com/p/Bch5VuOBdry/?taken-by=the.avid.dabber\nPurple Starburst Hash Rosin by Voodoo Melts\nThis might have been the best hash I dabbed all weekend. But to be fair, I’m a little biased. Voodoo Melts is a close friend of mine and a top-notch hash maker. His six-star hash rosin always has such amazing clarity and a phenomenal terpene profile no matter what strain he’s working with. This Purple Starburst did not disappoint. With such a sweet mix of fruity terps, you can understand how it got its name. The dab was smooth and left a candied coating in my mouth long after the vapor dissipated.\n \nhttps://www.instagram.com/p/BciuOSVBW8L/?taken-by=raw_garden\nRaspberry Purple Punch Sauce by Raw Garden\nIn my opinion, the Sauce from Raw Garden was second to none at this year’s cup as far as hydrocarbon extracts go. They had a diverse lineup of fruity and gassy flavors available as both solventless live rosin and a golden sauce extract that was gooey in the best possible way. The flavor from Raspberry Purple Punch is an intricate balance of sweet fruit flavors and subtle earthy undertones.\n \nhttps://www.instagram.com/p/Bck6U_TnAMS/?taken-by=ahtihash\nPink Lemonade Hash Rosin by Ahti Hash\nThere’s no way I can leave out the much-deserved, cup-winning solventless hash from Ahti Hash. I dabbed their Pink Lemonade as a pressed rosin, and it was an amazing mix of sweet fruit and tart citrus flavors. Beautiful color, soaring effects, and its robust and complex flavor profile helped this dab take home the prize as the Top Solventless Hash at the 2017 Emerald Cup.\n \nhttps://www.instagram.com/p/BcXmstjllyG/?taken-by=gas_house\nGas House OG Live Resin by Gas House\nGas House submitted many different strains of their sauce at the cup. All carried such pungent terpene profiles that it was a hard decision when it came time to drop some in a hot banger. They shared a few different OG cuts, and I chose their Gas House OG live resin and was not disappointed. The fuely, diesel terps provided such a strong flavor, they lingered on my tongue for the better part of the afternoon.\n \nhttps://www.instagram.com/p/BcaiddiFc–/?taken-by=thelegionofbloomca\nSFV OG Live Resin by Legion of Bloom\nSFV has always been one of my favorite strains, so when I stepped up to the Legion of Bloom booth for a dab, I zoned in on their SFV OG live resin right away. It was an exclusive offering at the cup this year, and I was glad I had a chance to dab it before it was gone. The terpene profile on this live resin was a spectacular blend of piney earthiness and pungent skunk that created a pleasant swirl of kushy flavor. Legion of Bloom had a lot of other awesome dabs at their booth, but I kept coming back for another taste of their SFV.\n\nAvid Dab of the Week\nThis week I simply haven’t been able to put down this amazing Limonata six-star hash rosin grown, washed, and pressed by Voodoo Melts.\n \nhttps://www.instagram.com/p/Bck3uDbB0A3/?taken-by=the.avid.dabber\nLimonata is a cross that mixes the gassy profile of Grease Monkey with the sweet citrus notes of Clementine. The resulting combination is a candied lemon flavor that leaves your mouth watering for more.\nThe Emerald Cup 2017 Recap Video\nhttps://www.youtube.com/watch?v=IBGfFz8JM8Y\nHave you ever been to the Emerald Cup or any cannabis competition before? Share your experiences in the comments below, or share your favorite dabs with me on Instagram using #aviddabber. Check back next week and I’ll show you my rig set up I use for daily dabbing. Until then, ONLY DAB THE BEST!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/28110822/will-hyde-avid-dabber-4.jpg","urlslug":"/news/strains-products/the-avid-dabber-best-dabs-emerald-cup"},{"id":"contentitems-19993","title":"5 of the Hardest Cannabis Strains to Grow","author":"Trevor Hennings","category":null,"date":"\/Date(1488564927000)\/","text":"As you develop your farming craft and become more comfortable in your cannabis garden, you might find yourself looking for a new challenge. One option is to explore strains that are regarded as difficult to grow. If growing for personal use, you may try to conquer strains that are not popular among commercial farms because of their long flowering periods, low yields, and specific feeding requirements. Large grow operations tend to avoid tackling difficult or risky strains because they’re often not worth the additional time, money, and labor.\n\nGenerally, growers tackle these issues by crossbreeding plants for high yields, short flowering cycles, and low-maintenance feeding requirements. For this reason, many strains that are regarded as difficult to grow are landrace strains. “Landrace” refers to feral strains that have long grown in one geographic location without hybridization. These varieties often have varying and specific needs, making them some of the more complicated plants to grow. However, plenty of modern hybrids can prove to be challenging as well.\n\nHere are five examples of hard-to-grow strains that ambitious growers may consider if they’re looking for a challenge.\nColombian Gold\nColombian Gold is a landrace sativa hailing from the Santa Marta mountains of Colombia. Made famous over the century as a high-quality cannabis export to the United States, it made a comeback when its genetics were used in the creation of Skunk #1.\n\nWhat makes Colombian Gold a difficult strain to grow is its large stature and long flowering periods. To produce this strain indoors, you must be on top of your pruning game; its growth takes off and will quickly overrun your space. The lengthy flowering cycle also increases the chance of error, but if you can bridle this strain, you will be rewarded with a classic quality landrace strain with an exceptional high that electrifies the senses.\nSan Fernando Valley OG\nA beautiful California native, the SFV OG hybrid can be a tricky strain to tame. It has specific feeding needs and a flowering period that extends longer than normal.\nOG genetics often require heavy feeding – specifically, they’re known for consuming large amounts of calcium and magnesium (also known as “Cal Mag”). You need to be able to read the plant deficiencies to ensure you don’t over or underfeed this strain. Additionally, SFV OG is a dense plant that will benefit from pruning and topping at an early age. If successful, you will be rewarded with dense, beautiful colas that offer a pungent taste and powerful high.\n\nDr. Grinspoon\nThis landrace sativa strain is named after longtime cannabis advocate and professor at Harvard, Dr. Grinspoon. The genetics are held by Barney’s Farm in Amsterdam and are well known amongst connoisseurs for its cerebral effects and quality of flavor. It is also known for its strange bud structure.\nDr. Grinspoon is difficult to grow because of this bud structure. It can take ages for it to flower and for the airy buds to develop any weight. “When mature, the colas resemble compact green and reddish brown beads,” Barney’s describes. “These loosely hang on thin stems.” The stems and buds are brittle, but the end product is something you will rarely ever see.\n\nChocolate Thai\nThai landrace genetics are being kept alive by a breeder in California by the name of DarwoH, and Chocolate Thai is a nostalgic strain commonly associated with the famed Thai sticks of the 1970s and 80s. Cannabis from this region of the world has always been celebrated and cherished for its unique cerebral effects.\nThe difficulty of this strain can be attributed to its lengthy flowering cycle. Similar to all southeast Asian landrace strains, flowering may take up to 14 weeks. If you have the space, time, and skill to produce a decently yielding Chocolate Thai or any other southeast Asian landrace strain, you have something to be very proud of and will be sure to impress anyone who fondly remembers days spent with Thai sticks.\nHeadband\nHeadband has become a very popular strain in the past years. With its high-THC content, Headband provides relaxing effects while holding onto the flavors of its parents OG Kush and Sour Diesel.\nWhat makes Headband difficult to produce is its bud structure. Where OG strains are commonly known for their dense, large colas, Headband produces smaller buds that blanket the plant. Because of this, getting a decent yield with consistent quality can be difficult. Being able to use the SCROG (screen of green) method can help overcome this obstacle.\n\nWhich cannabis strains have you had difficulty growing? Leave your stories and tips below so other growers can benefit!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/03/02151756/hardest-strains-to-grow.jpg","urlslug":"/news/growing/hardest-marijuana-strains-to-grow"}],"reviewCount":523,"flavors":[{"name":"Earthy","score":43.885445713485367},{"name":"Woody","score":25.191788583724872},{"name":"Pine","score":21.624759667417909},{"name":"Pungent","score":18.339047200682479},{"name":"Citrus","score":15.618991685447625}],"effects":[{"name":"Happy","score":73.814810216840471},{"name":"Relaxed","score":66.995253829405243},{"name":"Uplifted","score":58.76648904338083},{"name":"Euphoric","score":54.487454957535938},{"name":"Focused","score":41.805454753810309}],"symptoms":[{"name":"Stress","score":42.882654035677454},{"name":"Pain","score":38.680574124298104},{"name":"Depression","score":38.124705552796769},{"name":"Insomnia","score":15.452270904159821},{"name":"Fatigue","score":14.823904656403988}],"conditions":[{"name":"Anxiety","score":28.862192342462787},{"name":"ADD/ADHD","score":14.599488139348331},{"name":"Bipolar Disorder","score":11.097715089702941},{"name":"PTSD","score":10.836771203381845},{"name":"Migraines","score":10.213418516113425}],"negatives":[{"name":"Dry Mouth","score":33.118625615951721},{"name":"Dry Eyes","score":23.39502400142608},{"name":"Dizzy","score":8.2114958554566631},{"name":"Headache","score":6.9636763563670634},{"name":"Anxious","score":3.5511128512675549}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sfv-og_100x100_4236.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003030/b/sfv-og__primary_eda7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sfv-og_100x100_6eb4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001071/b/sfv-og__primary_53bc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sfv-og_100x100_1629.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001039/b/sfv-og__primary_63bd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sfv-og_100x100_0881.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000383/b/sfv-og__primary_f99e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sfv-og_100x100_fbd2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/647862/b/sfv-og__primary_84b9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sfv-og_100x100_d557.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/644015/b/sfv-og__primary_6a6a.jpg"}],"photoTotalCount":124,"popularCities":["Portland, OR","Los Angeles, CA","Eugene, OR","San Francisco, CA","Salem, OR","Denver, CO","Medford, OR","Detroit, MI","China","Oakland, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/sfv-og","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.38814531548757/240","testGraph":"https://leafly.s3.amazonaws.com/strains/testing/wcQEOzmxRnaYUTAjH6Al_sfv-og.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":56,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"\n\tRequires a dry outdoor climate\n\tBest results when plants are grown large and not confined to pots\n\tFour phenotypes, three of which typically express sativa influence while the fourth exhibits more indica-like characteristics\n\n"}}
