{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1434128400000)/",
            "id": "contentitems-3283",
            "text": "New strains are here just in time for the weekend! Settle down with a Face Off OG indica and pair it with the ridiculous(ly awesome) Nic Cage movie, Face/Off. Or maybe David Lynch is more your speed, and you want to enjoy Blue Velvet while you enjoy Blue Velvet. And for the Willie Nelson fans out there, we assure you the Red Headed Stranger sativa is just the thing to go with that 1975 classic album. You get the point, so get out there, find 'em, rate 'em, and review 'em.\n \n   1. Face Off OG\n\nThe story of Face Off OG begins in the late 1990s in California when Archive Seeds was gifted with the seeds of an exceptional OG Kush phenotype. This 70/30 indica-dominant hybrid shares its name with the 1997 movie in which Nicholas Cage and John Travolta literally swap faces (“I want to take his face…off!”), and the experience this strain has to offer could arguably be compared to losing your face. Dizzying euphoria goes straight to the head in an intensely psychoactive experience best reserved for veteran consumers. Its crushing full-body effects make this strain a great choice for resolving severe pain or for relaxing on a lazy weekend.\n\n \n   2. Red Headed Stranger\n\nRed Headed Stranger is an energizing sativa strain named in homage to the 1975 album by Willie Nelson. A cross between Tom Hill’s Haze and William’s Wonder, Red Headed Stranger offers a jolt of cerebral vigor that fuels creativity and focus. True to its Haze heritage, Red Headed Stranger takes on a sharp spicy aroma with subtle herbal notes.\n\n \n   3. Blue Velvet\n\nBlue Velvet, also known as Blueberry Thai, is a 50/50 hybrid strain that is named for the lush appearance of its plants. Bred by DJ Short, Blue Velvet is a cross between Purple Thai and Afghani. Its long branches bloom with large red-purple buds that take on a sweet fruity and floral aroma. Invigorating euphoria blankets the mind while the body finds light relaxation, and its functional effects make it easy to either explore creativity or socialize with friends.\n\n \n   4. Fruity Chronic Juice\n\nFruity Chronic Juice, bred by Delicious Seeds, is an indica-dominant cross of White Widow and Chronic that is short in stature but can stretch tall when given enough room for the roots to spread. It expresses itself with an array of citrus flavors, like orange and grapefruit, that give way to subtle undertones of pine and hash on exhale. The potent effects balance between physical relaxation and cerebral energy to create a well-rounded buzz that is both calming and creative.\n\n \n   5. Maui Haole\n\nMaui Haole is a balanced hybrid that combines the sweet, tropical flavors of Maui Waui with Romulan’s full-bodied relaxation. Bred by Pua Mana 1st Hawaiian Pakalōlō Seed Bank, Maui Haole takes powerful influence from the original Romulan Joe cut of Romulan. Its uplifting sativa influence stems from Maui Waui genetics sourced from the Lower Nāhiku region of Hawaii. Haole is a Hawaiian term for a foreigner or someone that is not native to Hawaii, and Romulan is an alien race from the legendary sci-fi series Star Trek. Thus, the combination of the two leaves us with Maui Haole, or \"Hawaiian Alien.\"\n \n\n   6. Big White\n\nBig White is an indica-dominant hybrid that combines The White with Big Bud genetics. Bred by La Plata Labs, this strain began as an F1 hybrid created by Eclectic Genetics. La Plata Labs then refined and stabilized the genetics through generations of breeding and phenotype selection. This strain is known to produce large yields of sweet, sugary buds that express themselves in a variety of colors and carry a unique maple syrup flavor.\nThere is another known hybrid by the name of Big White. It is bred by Breeder’s Choice and its lineage is a combination of Power Plant and Chronic genetics.\n\n \n   7. Cherry Skunk\n\nCherry Skunk is an indica-dominant hybrid that combines genetics from Skunk Dawg and Poppa Cherry. Blissful, euphoric effects settle in to help dissolve stress and bad moods, while its calming qualities encourage rest and relaxation. This strain also provides a burst of cerebral energy and expands the mind to feed creativity and introspection.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/06/12002110/new-strains-alert-face-off-og-red-headed-stranger-blue-velvet-big.png",
            "title": "New Strains Alert: Face Off OG, Red Headed Stranger, Blue Velvet, Big White, and More",
            "urlslug": "/news/strains-products/new-strains-alert-face-off-og-red-headed-stranger-blue-velvet-big"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 10.416666666666668
        },
        {
            "name": "ADD/ADHD",
            "score": 6.25
        },
        {
            "name": "Hypertension",
            "score": 6.25
        },
        {
            "name": "Phantom Limb Pain",
            "score": 4.166666666666666
        },
        {
            "name": "PMS",
            "score": 4.166666666666666
        }
    ],
    "description": "<p>Maui Haole is a balanced <a href=\"http://www.leafly.com/explore/category-hybrid\">hybrid</a> that combines the <a href=\"http://www.leafly.com/explore/flavors-sweet\">sweet</a>, <a href=\"http://www.leafly.com/explore/flavors-tropical\">tropical</a> flavors of <a href=\"https://www.leafly.com/sativa/maui-wowie\">Maui Wowie</a>&nbsp;with <a href=\"https://www.leafly.com/indica/romulan\">Romulan&rsquo;s</a> full-bodied <a href=\"http://www.leafly.com/explore/tags-relaxed\">relaxation</a>. Bred by Pua Mana 1st Hawaiian Pakalōlō Seed Bank, Maui Haole takes powerful influence from the original Romulan Joe cut of Romulan. Its <a href=\"http://www.leafly.com/explore/tags-uplifted\">uplifting </a><a href=\"http://www.leafly.com/explore/category-sativa\">sativa</a> influence stems from Maui Wowie&nbsp;genetics sourced from the Lower Nāhiku region of Hawaii. <a href=\"https://www.leafly.com/hybrid/haole\">Haole</a> is a Hawaiian term for a foreigner or someone that is not native to Hawaii, and&nbsp;Romulan is an alien race from the legendary sci-fi series Star Trek. Thus, the combination of the two leaves us with Maui Haole, or &quot;Hawaiian Alien.&quot;</p>\n",
    "descriptionPlain": "Maui Haole is a balanced hybrid that combines the sweet, tropical flavors of Maui Wowie&nbsp;with Romulan&rsquo;s full-bodied relaxation. Bred by Pua Mana 1st Hawaiian Pakalōlō Seed Bank, Maui Haole takes powerful influence from the original Romulan Joe cut of Romulan. Its uplifting sativa influence stems from Maui Wowie&nbsp;genetics sourced from the Lower Nāhiku region of Hawaii. Haole is a Hawaiian term for a foreigner or someone that is not native to Hawaii, and&nbsp;Romulan is an alien race from the legendary sci-fi series Star Trek. Thus, the combination of the two leaves us with Maui Haole, or &quot;Hawaiian Alien.&quot;\n",
    "effects": [
        {
            "name": "Happy",
            "score": 60.41666666666667
        },
        {
            "name": "Creative",
            "score": 58.33333333333333
        },
        {
            "name": "Euphoric",
            "score": 58.33333333333333
        },
        {
            "name": "Aroused",
            "score": 54.166666666666664
        },
        {
            "name": "Sleepy",
            "score": 8.333333333333332
        }
    ],
    "flavors": [
        {
            "name": "Pungent",
            "score": 58.33333333333333
        },
        {
            "name": "Tropical",
            "score": 56.25
        },
        {
            "name": "Earthy",
            "score": 56.25
        },
        {
            "name": "Sweet",
            "score": 54.166666666666664
        },
        {
            "name": "Pineapple",
            "score": 54.166666666666664
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1191591,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Fire good put me to sleep",
            "username": "trial"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1516121,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Maui Haole is a Hawaiian Hybrid of dakine legendary sativa strain Maui Wowie and one of da most requested medical strains for pain - Romulan...When flying da friendly skies with Maui Haole one can expect an incredible medible-esq lift off lingering long into a strong sedated state of cannabis bliss...In layman's terms: Maui Haole is dakine!!!",
            "username": "PuaManaOhana"
        }
    ],
    "id": 164083,
    "name": "Maui Haole",
    "negatives": [
        {
            "name": "Dizzy",
            "score": 2.083333333333333
        },
        {
            "name": "Dry Mouth",
            "score": 2.083333333333333
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/romulan",
            "category": "Indica",
            "name": "Romulan",
            "permalink": "https://mobileapi.leafly.com/indica/romulan",
            "slug": "romulan",
            "subtitle": null,
            "symbol": "Rom"
        },
        {
            "applink": "leafly://strain/maui-wowie",
            "category": "Sativa",
            "name": "Maui Wowie",
            "permalink": "https://mobileapi.leafly.com/sativa/maui-wowie",
            "slug": "maui-wowie",
            "subtitle": null,
            "symbol": "Mw"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/maui-haole",
    "photoTotalCount": 1,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/419374/b/maui-haole__primary_9c80.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/maui-haole_100x100_458d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [],
    "rating": 4.64,
    "relatedStrains": [],
    "reviewCount": 11,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "maui-haole",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.63636363636364/240",
    "subtitle": null,
    "symbol": "Mha",
    "symptoms": [
        {
            "name": "Depression",
            "score": 8.333333333333332
        },
        {
            "name": "Muscle Spasms",
            "score": 8.333333333333332
        },
        {
            "name": "Stress",
            "score": 8.333333333333332
        },
        {
            "name": "Pain",
            "score": 6.25
        },
        {
            "name": "Seizures",
            "score": 6.25
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
