{
    "aka": "Nepal Jam",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1454097600000)/",
            "id": "contentitems-3237",
            "text": "It's time to kick off the weekend with some cannabis strains you've maybe never tried before. We've just added some new varieties to the Leafly Explorer — go check them out and see if any are in stock at a shop near you! Remember to leave a review if you've tried any of these so the rest of us know what to expect!\n \n   1. Boss Hogg\n\nBoss Hogg by Cali Connection is an indica-dominant hybrid cross between two early classics, Chemdawg 91 and Pre-98 Bubba Kush. In a show of its OG Kush heritage, Boss Hogg carries a strong earthy, hashy aroma that mixes with the funky sour diesel notes of its Chemdawg parent. This true hybrid delivers a balance of mind and body effects that ease the body into relaxation while the mind is lifted to a happy, euphoric state. Despite its heavy body effects, Boss Hogg is cerebrally stimulating and sharpens the senses to help you stay engaged and creative.\n\nClick here for a full list of locations currently carrying Boss Hogg\n \n   2. Kerala Krush\n\nKerala Krush by Flying Dutchmen is an 85% sativa strain that unites genetics from Skunk #1 and a South Indian sativa. This uplifting sativa delivers a very smooth, clear cerebral buzz with flavors of mango fruit and warm spice. Patients may gravitate to this strain for relief of menstrual cramps and nausea.\n\nClick here for a full list of locations currently carrying Kerala Krush\n \n   3. Caramella\n\nCaramella is an 80/20 indica-dominant strain recommended for late nights out with friends as it provides an uplifting and social high. This robust strain produces long colas, deep green leaves, and sticky resin scattered around the plant like fairy dust. This easy-to-grow indica finishes flowering in about 8 to 9 weeks.\n\n \n   4. Brian Berry Cough\n\nBrian Berry Cough from TGA Genetics is a balanced 50/50 hybrid strain that crosses Strawberry Cough and Space Queen. Bred for flavor as well as potency, this strain inherits a loud strawberry and cherry aroma with traces of candied fruit. Its powerful, high-velocity effects center themselves cerebrally at first and then quickly spread to relax the rest of the body. Knots of lavender and green calyxes burst from the tall plants, crowned with deep purple-tipped fan leaves.\n\nClick here for a full list of locations currently carrying Brian Berry Cough\n \n   5. Oregon Pinot Noir\n\nThis Hawaiian Purple Kush and Pitbull cross was bred among the grapes of a respected Pinot Noir vineyard in Oregon. Taking its name from the breeding location and its deep purple buds, this versatile plant gives off the taste of sweet grapes with a spicy hint of Haze. Though a 80/20 sativa-dominant strain, Oregon Pinot Noir gives the effects of a couch-locking indica, providing a noticeable body high best served for nighttime consumption.\n\nClick here for a full list of locations currently carrying Oregon Pinot Noir \n \n   6. Kiwiskunk\n\nIn the late 1980s, the Skunk invasion landed on New Zealand’s shores. Kiwiskunk was introduced when a New Zealand Skunk variety met NYC Diesel, adding a little something extra to its flavor profile. This 75/25 indica-dominant strain gives off a very potent skunky smell with sweet and citrus flavor. You’ll likely be left with a happy but couch-locked feeling best enjoyed while curling up to a comedy movie.\n\n \n   7. Nepalese Jam\n\nBred by ACE Seeds, a Nepalese female plant was crossed with a Jamaican ’85 male to create this hybrid, Nepalese Jam. If you’re looking for a strain that provides a long-lasting buzz without too much mental fogginess, Nepalese Jam is the hybrid for you. With good resistance to mold, fungus, and adverse weather conditions, Nepalese Jam requires only 9 weeks of flowering to produce dense and resinous buds.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12002002/new-strains-alert-boss-hogg-brian-berry-cough-kerala-krush-kiwisk.png",
            "title": "New Strains Alert: Boss Hogg, Brian Berry Cough, Kerala Krush, Kiwiskunk, and More",
            "urlslug": "/news/strains-products/new-strains-alert-boss-hogg-brian-berry-cough-kerala-krush-kiwisk"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [],
    "description": "<p>Bred by Ace&nbsp;Seeds, a <a href=\"https://www.leafly.com/sativa/nepalese\">Nepalese</a> female plant was crossed with a <a href=\"https://www.leafly.com/sativa/jamaican\">Jamaican</a> &rsquo;85 male to create this hybrid, Nepalese Jam. If you&rsquo;re looking for a strain that provides a long-lasting buzz without too much mental fogginess, Nepalese Jam is the hybrid for you. With good resistance to mold, fungus, and adverse weather conditions, Nepalese Jam requires only 9 weeks of flowering to produce dense and resinous buds.</p>\n",
    "descriptionPlain": "Bred by Ace&nbsp;Seeds, a Nepalese female plant was crossed with a Jamaican &rsquo;85 male to create this hybrid, Nepalese Jam. If you&rsquo;re looking for a strain that provides a long-lasting buzz without too much mental fogginess, Nepalese Jam is the hybrid for you. With good resistance to mold, fungus, and adverse weather conditions, Nepalese Jam requires only 9 weeks of flowering to produce dense and resinous buds.\n",
    "effects": [],
    "flavors": [],
    "growInfo": {
        "averageYield": "High",
        "difficulty": null,
        "environment": null,
        "floweringDays": 77,
        "growNotes": "",
        "height": null,
        "outdoorFinish": "Late September",
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1241276,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Dreadlock buds(foxtails) slight chemy licorice anise with a touch of lime and spice flavor.  light tasting.  very mellow yet uppity buzz sorta like the front end of bluedream with less blueberry ending.  The more ya smoke the more my sample headed in the Nepalese direction.  the more ya smoke the more nepalese temple balls hash flavor comes into play and a heavier overall feeling takes over.",
            "username": "GhostOfJack"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1347012,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Underrated strain - smokes and tastes and reacts like a landrace. Far better genetics than your average hybrid sativa these days. Mountain strain meets Jamaica - match made in heaven. ",
            "username": "KannaKingdom"
        }
    ],
    "id": 204656,
    "name": "Nepalese Jam",
    "negatives": [],
    "parents": [
        {
            "applink": "leafly://strain/nepalese",
            "category": "Sativa",
            "name": "Nepalese",
            "permalink": "https://mobileapi.leafly.com/sativa/nepalese",
            "slug": "nepalese",
            "subtitle": null,
            "symbol": "Np"
        },
        {
            "applink": "leafly://strain/jamaican",
            "category": "Sativa",
            "name": "Jamaican",
            "permalink": "https://mobileapi.leafly.com/sativa/jamaican",
            "slug": "jamaican",
            "subtitle": null,
            "symbol": "Jam"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/nepalese-jam",
    "photoTotalCount": 0,
    "photos": [],
    "popularCities": [
        "Nunica, MI"
    ],
    "rating": 4,
    "relatedStrains": [],
    "reviewCount": 3,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "nepalese-jam",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
    "subtitle": null,
    "symbol": "Npj",
    "symptoms": [],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
