{"sl_translate":"description,descriptionPlain,category","id":89809,"slug":"middlefork","name":"Middlefork","subtitle":null,"symbol":"Mfk","category":"Hybrid","description":"\u003cp\u003eMiddlefork is a sativa-dominant\u0026nbsp;\u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e\u0026nbsp;strain bred from\u0026nbsp;\u003ca href=\"http://www.leafly.com/hybrid/dutch-treat\"\u003eDutch Treat\u003c/a\u003e. Created\u0026nbsp;in Washington state just outside the city of Bellingham, Middlefork has become a local staple for its potent buzz which may assist some consumers with \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-anxiety\"\u003eanxiety\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-muscle-spasms\"\u003espasms\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\"\u003enausea\u003c/a\u003e. \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-creative\"\u003eCreativity\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergy\u003c/a\u003e are ushered in by \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-berry\"\u003eberry\u003c/a\u003e and tangy \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-citrus\"\u003ecitrus\u003c/a\u003e notes inherited from the strain\u0026rsquo;s Dutch Treat parent.\u003c/p\u003e\n","descriptionPlain":"Middlefork is a sativa-dominant\u0026nbsp;hybrid\u0026nbsp;strain bred from\u0026nbsp;Dutch Treat. Created\u0026nbsp;in Washington state just outside the city of Bellingham, Middlefork has become a local staple for its potent buzz which may assist some consumers with anxiety, pain, spasms, and nausea. Creativity and energy are ushered in by sweet berry and tangy citrus notes inherited from the strain\u0026rsquo;s Dutch Treat parent.\n","aka":"Middle Fork","rating":4.64,"highlightedReviews":[{"id":1380650,"username":"col4bin","text":"Middlefork Review - 43.5/50\nApril 14, 2016\n\nSummary: This is the Haziest Haze of all the Hazes I\u0027ve ever Hazed! A pleasantly assertive combination of lime, blueberry, and sweet basil leaf aromas bless the nose - with the lime and sweet basil prominent in the mouth. Expect a SOARING, mildly psychedelic sativa elevation to last for four-plus hours. \n\nNOTE: Middlefork genetics are said to be Dutch Treat crossed with DJ Short\u0027s blueberry. Somehow, it seems the haze genetics in the Dutch Treat surfaced as VERY dominant in this sample - and I for one want to personally thank the breeders for this amazing flower. Thank you!\n\n\nBrand: Royal Tree Gardens \nWeight: 3.5 grams\nHarvest Date: 2/29/2016\nPackaging Date: unknown\nTotal THC (\u003cTHCA * .877\u003e + THC): 23.60%\nTotal CBD: 0.25%\n\n\nEye: 9.5/10\nThese loosely-structured, ginormous buds are built from tiny, Japanese eggplant-shaped, medium khaki-green calyxes with light orange overtones, a confetti party of bright amber-orange pistils, and are glistening like disco balls with a range of clear to milky to amber trichomes. These gems were clearly lovingly hand trimmed, probably more than once. This is museum-quality cannabis. \n\n\nNose (\u003cAromatic Intensity + Aromatic Quality\u003e/2): 9/10\n\nAromatic Intensity: 9/10\nAromatic Quality (subjective to my palate): 9/10\nNotes: Among the most intense and intoxicating aromas I\u0027ve ever encountered. At first, the typical, familiar aromas of a classic haze fill my nostrils: heavy lime, mild pepper, sweet, mild basil. But then the lime picks up additional intensity and is joined by the sweet, tart aromas of an unmistakeable, juicy blueberry getting squished between my thumb and pointer, purple sticky liquid oozing down my palm (alright, I\u0027m a little high as I write this :) ). The  nose ends with a fine, exotic melange of all the notes that preceded. A terpene profile for the ages. \n\n\nTongue (\u003cFlavor Intensity + Flavor Quality\u003e/2): 9/10\n\nFlavor Intensity: 8.5/10\nFlavor Quality: 9.5/10\nNotes: All of the aromas are present in the mouth. Every time I take a rip of this, it tastes like I\u0027m drinking a virgin blueberry-lime Rickey with muddled basil and sugar perfectly incorporated. Fucking out of this world delicious. On a side note - is there a bartender somewhere here in Seattle who will mix me a virgin blueberry-lime Rickey with muddled basil and sugar perfectly incorporated? Mmmmmmmm!\n\n\nHead: 9.5/10\nNotes: A buzzy, high-intensity mind-shift and sense-heightening are accompanied by mildly psychedelic yet (mostly) functional focus. \n\n\nBody: 6.5/10\nNotes: a mild-intensity energy boost is not accompanied by any dulling of my pain. This is a variety for the head. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1582643,"username":"NW710","text":"This is one of y new favorite strains. So far I have picked up 2 grams of some Killer Midlefork concentrate. I know it says it\u0027s a sativa dominant hybrid. But this stuff gets me super baked, insane couch lock and wikid cottonmouth. I will for sure try out The flower as soon as  I can find it, or remember to ask for it.. This is  must try.\nStay Lifted stoners.. \nPeace..\nLove\nWeed.....","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-51835","title":"Washington’s Best-Tasting Strains From Fall 2017","author":"Bailey Rahn","category":null,"date":"\/Date(1513365385000)\/","text":"A strain may have an incredible aroma, but it doesn’t always translate well to flavor. The intricacies of its aroma may fall apart under the heat of combustion. An imperfect cure, flush, or growing environment can also lead to a harsher smoke. But a well-grown flower with amazing flavor is something to truly revel in.\nThese Washington state strains exhibit flavors that can stand the test of heat, delivering well-preserved terpene profiles when smoked or vaporized. Whether you like sour strains that reek of diesel or sweet varieties that taste just like fruit medley, dig in and find the one for you.\n\nSherbet by Gabriel Cannabis\n\nVoted “Best Flavor” in this season’s Top THC-Dominant Strains in Washington, Sherbet by Gabriel Cannabis embodies a harmony of sweet-smelling terpenes. Its aroma is sugary and dessert-like but opens up into flavors of deep grape and marionberry. The exhale leaves behind an earthy, herbal taste much like spicy echinacea tea.\nFind Sherbet Nearby\nGhost Train Haze by Sweet As!\n\nGhost Train Haze is known to pack a spice rack of different flavors, which Sweet As! captures masterfully in its own rendition. Upon opening the container, your nose is immediately met with an overpowering aroma of overripe oranges, sour citrus, and pine oil cleaner. Its flavor shape-shifts into what feels like an entirely new palate of tastes, including clean mint, lavender, and rich sandalwood.\nFind Ghost Train Haze Nearby\n\nMiddlefork by Royal Tree Gardens\n\nIt should come as no surprise that the first place winner of this season’s Top THC-Dominant Strains in Washington delivered a standout experience of flavor. Royal Tree’s Middlefork carries an overwhelming diversity of fruity, dessert-like flavors that can range from lemon-blueberry muffins to vanilla chai, citrus tea, or candied oranges with a slightly sour fizz. The smooth exhale leaves these flavors lingering a moment before its dreamy, euphoric effects take the wheel.\nFind Middlefork Nearby\nChocolope by Gabriel Cannabis\n\nTraditionally, Chocolope is an earthy strain with subtle flavors of spice and coffee. Gabriel’s Chocolope, however, delivers an altogether different experience—one that is nuanced with bright flavors of lime, tropical fruit, and warm pine dancing together on the exhale. Its flavor is an undisturbed reflection of its aroma, which bursts from the jar with loud notes of sour candied citrus.\nFind Chocolope Nearby\nSour Diesel by Nebula Gardens\n\nSour Diesel has long been a household name, known by its sting of sour fuel and acrid gas. Nebula’s hand at Sour Diesel is impressive in both aroma and flavor, preserving these legacy attributes with an earthy, minty finish. Hints of rosemary and spearmint are detectable in a vaporizer, whereas smoking this strain brings more of a sweet, hashy taste like burnt sage.\nFind Sour Diesel Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/14154638/sweet-as-ghost-train-haze-macro_web.jpg","urlslug":"/news/strains-products/washingtons-best-flavored-strains-from-fall-2017"},{"id":"contentitems-50073","title":"The Top THC-Dominant Strains of Washington State in Fall 2017","author":"Leafly Staff","category":null,"date":"\/Date(1512081671000)\/","text":"This fall, Leafly set out on a quest to find the very best cannabis in Washington state, and we came back with ten standout strains from talented growers on both sides of the Cascade Mountains.\nUsing a point-based method that rates cannabis by its aroma, flavor, appearance, cure, and overall experience, each of these strains received a 1-to-100 score (which you can read more about here). In this feature, we take a look at some of the best THC-dominant strains in Washington, but stay tuned for more product ratings in Washington and beyond.\nThese 10 strains—and their growers—each offered something unique among the sea of cannabis available throughout the state of Washington.\n(Click to enlarge)\nAll strains evaluated in this round have a THC-dominant cannabinoid profile, meaning its THC-to-CBD ratio is at least 5:1. Presidential Kush, which weighed in at just over 17% THC, demonstrates that quality is not measured by this one chemical alone. A diverse and compelling terpene profile—which the curing process can make or break—is often the key to a consumer’s heart, as terpenes augment the overall experience.\n(Click to enlarge)\nOur tasting panel draws experience from all corners of the industry, from budtending to cultivation. Avid curiosity and deep appreciation of cannabis products forms our common foundation, from which extends our individual preferences and experiences.\n#1 | Middlefork by Royal Tree Gardens\n\nPrice: $15-17.00/gram\nThe unanimous favorite among our three tasters was Royal Tree’s Middlefork, a true Washington native born just outside the city of Bellingham. Perfected over years from Dutch Treat parent genetics, it’s no surprise that its aroma and flavor stole our hearts: Effervescent citrus and fresh-cut pine linger on the exhale in an impressive translation of aroma to flavor. Middlefork is ruggedly attractive, growing fuzzy buds that are absolutely packed with sticky, enticing trichomes. Meanwhile, its effects are commanding in strength, bolting all three of us to our seats in stunned satisfaction.\nFind Middlefork Nearby\nFrom the Tasting Notebook:\n“Very attractive scent of sweet candied citrus fizz…I am definitely stoned.” –Will\n“Kind of tastes like vanilla chai mixed with orange spice creamsicle. After a few hits from the vaporizer, my eyes fell into crescents, and I was hopelessly glued to the couch in a state of bliss.” –Bailey\n#2 | Sherbet by Gabriel\n\nPrice: $45/eighth\nGabriel’s Sherbet weighed in as our panel’s second place flower, tying with Middlefork in its overall score but falling just inches short after calculating each panelist’s individual scoring. With Sherbet, we couldn’t help but obsess over the knotting of purple, blue, and green hues underneath the thick coat of trichomes and fiery orange hairs. Its aroma mimics that of a berry pie, from buttery crust to its fruity center, creating a unique bouquet that isn’t often captured by a single cannabis bud. Considering its price-to-quality ratio, Sherbet by Gabriel is among the best value on this list (plus, it’s pesticide-free).\nFind Gabriel Sherbet Nearby\nFrom the Tasting Notebook:\n“Beautiful bud with highly expressive features. Provides a heady, happy buzz with relaxing physical effects.” –Jeremiah\n“Its color is variated and intricate with a dessert-like aroma of sugary dough, sweet berry, and deep grape.” –Bailey \n#3 | Presidential Kush by Fifty Fold\n\nPrice: $50/eighth\nPresidential Kush by Fifty Fold is beauty in a bag, showing off a thick layer of frosty trichomes against its dark, cosmic purple coloration. The buds bloom with perfect conic uniformity, like a Christmas tree covered in luminescent white bulbs. Its aroma is full and nuanced, expressing sweet and sour notes of fruit and berry, but these delicate fragrances are lost with heat. Though its exceptional aroma and appearance tied its overall score up with our two frontrunners, Presidential Kush’s muted earthy flavor left some room for improvement.\nFind Presidential Kush Nearby\nFrom the Tasting Notebook:\n“Very complex and enticing smell of funky dankness and sweet sugary notes that keep me coming back to this bud. This was easily one of my favorite flowers in the whole lot.” –Will\n“Beautiful frosted buds with uniform shape, but the flavor left much to be desired after its wonderful aroma.” –Jeremiah\n#4 | Alien Dawg by NEBULA\n\nPrice: $48/eighth\nNebula Gardens is known for its bulky, resinous buds—and Alien Dawg is no exception thanks to its enormous, bulbous buds that build up off of each other to create an otherworldly mass of trichome-covered foliage. Gassy diesel aromas evaporate off the monolithic buds, intermixing with notes of pine and tangy fruit. This aroma translates well to flavor that carries hints of sweet earth, sandalwood, and herbs. The diversity of flavors and aromas combined with its commanding cerebral high made Alien Dawg a standout strain, especially among our tasters with a penchant for funky, gassy strains. It’s also pesticide-free.\nFind Alien Dawg Nearby\nFrom the Tasting Notebook:\n“Sweet and sour aroma with overripe tree fruit and fresh soil. Its effects are cerebrally stimulating without feeling too top-heavy.” –Bailey\n“It has the pungent funkiness of many other strains, but with a bright and peppery sweetness at the center.” –Jeremiah\n#5 | Lemonder by Seattle’s Private Reserve\n\nPrice: $45/eighth\nLemonder by Seattle’s Private Reserve leaves an immediate impression with an aroma that smells like fresh-squeezed lemons and flowering herbs. The soft lime-green buds crack open easily, filling the nose with a diversity of funky, floral, and citrus aromas inherited from its parent genetics: Lavender, OG Kush, and Super Lemon Haze. Its intricate but fragile flavor profile collapses with heat, delivering fleeting hints of candied lemon. This flavor is refreshing but subdued compared to its impeccable lemon astringent aroma. Anyone with a sweet tooth for lemon-loaded strains should not walk, but run to the nearest dispensary stocking Lemonder.\nFind Lemonder Nearby\nFrom the Tasting Notebook:\n“This is the best aroma I have smelled so far. Lemon, cream, spice, and a middle savory note that mellows the lemon in a weird way.” –Jeremiah\n“Very healthy-looking lime green coloration and incredible lemon astringent aroma. It’s easy to focus in the stillness of its pleasant effects.” –Bailey\n#6 | GG4 by North Coast Growers\n\nPrice: $50-63.00/eighth\nSticky, euphoric, and reeking of sour fuel, GG4 (formerly known as GG4 (f.k.a Gorilla Glue #4)) is easy to pick out of a crowd. This particular rendition from North Coast Growers was a polarizing force among our tasters, but the consensus brought this strain to #6 on our list. The close shave of the trim and subtlety of aroma and flavor were, for some, a miss. But others favored the trim and aroma, admiring its poignant odor of gas and pine. Hints of sweet white tea and aged sour cheese hit the palate on the exhale, a divisive but unique flavor that lacked somewhat in strength.\nFind GG4 Nearby\nFrom the Tasting Notebook:\n“Its flavor is sharp pine with a hint of parmesan funk. Really deep and complex earthy notes that finish sweet with a tingle of citrus.” –Will\n“This one has a deep herbal and pine aroma with a light skunky gas note. The onset of effects is jarring and intense—deeply euphoric and trippy.” –Bailey\n#7 | Jet Fuel by Sweet As!\n\nPrice: $36/eighth\nThis take on Jet Fuel by Sweet As! is decidedly one of the best values when its quality-to-price ratio is considered. The strain has immediate bag appeal, showing off fuzzy, healthy green buds under a coat of gluey resin. Sweet and earthy aromas fill the nose, hinting at a spice rack of different terpenes. Jet Fuel scored well across the board, proving to be an all-around solid choice for those seeking a potent strain with a moderate offering of fragrances and flavors.\nFind Jet Fuel Nearby\nFrom the Tasting Notebook:\n“It has a sweet, skunky zest with a funky sour aroma that opens up with bright intensity. When smoked, it tastes like turpentine.” –Bailey\n“Sweet, fresh, earthy aroma with subtle hints of spice and licorice when ground up. Effects are thought-provoking with cerebral energy out the gate.” –Will\n#8 | GG4 by From the Soil\n\nPrice: $50/eighth\nFrom the Soil’s GG4 (formerly known as GG4 (f.k.a Gorilla Glue #4)) is yet another solid take on the sticky, stinky favorite. The aroma of this strain was somewhat muted in the jar, but when ground up, the strain shares its fragrant secret in full: stinging fuel, sharp pine, and a whisper of sweet lemon. Its exhaled flavor is dampened by heat, giving rise to vague earthy flavors with a slight tinge of mint best preserved by a vaporizer. The effects rest neatly in the head, singing away stress and tension with warm euphoria.\nFrom the Tasting Notebook:\n“Buds offer little on the nose until broken up, but once cracked open, there’s a pleasant, funky aroma. Its swampy, earthy flavor sticks to the tongue but fades away pretty quickly.” –Jeremiah\n“Smells earthy, woody, and muted as a nug. When cracked open, it exposes a loud fuel/gas scent reminiscent of Kush. Smells fantastic when ground up!” –Will \nFind GG4 Nearby\n\n#9 | Golden Ticket by Khush Kush\n\nPrice: $50-65/eighth\nGolden Ticket from Khush Kush offers an alluring but subtle harmony of sweet flavors that dance lightly across the palate, charming you with notes of tropical fruit, lemon spearmint, and fresh pine. Its aroma carries similar traits, but with dialed-up citrus and orange blossom notes. The flower itself is a beautiful twisting of green, purple, and fire-orange hairs hiding under a brilliant coat of trichomes. A few minor flaws in the buds and a somewhat faint flavor profile knocked a few points off this strain’s score, but it’s definitely a catch for low-temp vaping.\nFind Golden Ticket Nearby\nFrom the Tasting Notebook:\n“Aroma is sweet, floral and sort of tropical. Ground up, it gets even sweeter, like a sour green apple or overripe pineapple. Flavor falls off a little compared to the smell, but is still sweet and tropical.” –Will\n“It has a sharp lemon-lime aroma with sweet pine and herbs, and a light, summery lime flavor.” –Bailey \n#10 | MK Ultra by Virginia Co.\n\nPrice: $50-65/eighth\nMK Ultra from Virginia Co. is a gorgeous flower that expresses itself with weaving hues of dark and light green under glittering trichomes. The aroma is complex but not super pungent. Where it catches your attention is in its unusual scent that can only be described as a compost bin full of overripe fruit and cheese rind. Its flavor releases a spicy, peppery essence with a touch of sweet flower. As for effects, the onset is immediate and intoxicating, favoring those with a stubborn tolerance to THC.\nFind MK Ultra Nearby\nFrom the Tasting Notebook:\n“Great bud structure with resinous knots that show off the flower’s unique shape. Peppery hashy taste that’s smooth on the inhale; some slight harshness on the exhale.” –Bailey\n“Aroma is pungent and smells a bit like rotten earth, skunk, and some lemon. The flavor is much more mellow than the smell: earthy, floral, and a touch of funk.” –Jeremiah","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/29155113/gabriel-sherbet-macro.jpg","urlslug":"/news/strains-products/best-thc-strains-washington-state-fall-2017"}],"reviewCount":119,"flavors":[{"name":"Lemon","score":104.92034517092598},{"name":"Pine","score":103.89147029538667},{"name":"Pungent","score":102.55559243279124},{"name":"Citrus","score":102.29007633587786},{"name":"Earthy","score":9.1934948556256213}],"effects":[{"name":"Euphoric","score":129.48888151344175},{"name":"Happy","score":126.47693328908065},{"name":"Relaxed","score":124.95021573182875},{"name":"Sleepy","score":104.46398937935612},{"name":"Hungry","score":103.2442748091603}],"symptoms":[{"name":"Pain","score":13.466644540325257},{"name":"Stress","score":11.02721539993362},{"name":"Headaches","score":9.7660139395950871},{"name":"Depression","score":8.1646199800862931},{"name":"Nausea","score":7.0195818121473614}],"conditions":[{"name":"Anxiety","score":13.08496515101228},{"name":"PTSD","score":8.0484566876866914},{"name":"Bipolar Disorder","score":5.4928642548954532},{"name":"PMS","score":4.53866578161301},{"name":"ADD/ADHD","score":4.4639893793561232}],"negatives":[{"name":"Dry Mouth","score":105.03650846332559},{"name":"Dry Eyes","score":3.5097909060736807},{"name":"Anxious","score":2.9372718221042149},{"name":"Dizzy","score":2.5555924327912378},{"name":"Paranoid","score":2.1739130434782608}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/middlefork_100x100_b76b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002504/b/middlefork__primary_40f1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/middlefork_100x100_b60f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/668051/b/middlefork__primary_f722.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/middlefork_100x100_ff34.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/512503/b/middlefork__primary_0c66.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/middlefork_100x100_b517.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/457147/b/middlefork__primary_2a75.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/middlefork_100x100_02c8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/375473/b/middlefork__primary_73c3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/middlefork_100x100_eed1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/372237/b/middlefork__primary_43ed.jpg"}],"photoTotalCount":11,"popularCities":["Seattle, WA","Bellingham, WA","Spokane, WA","Everett, WA","Bellevue, WA","Bremerton, WA","Airway Heights, WA","Bothell, WA","Gold Bar, WA","Puyallup, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/middlefork","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.63865546218487/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Dutch Treat","subtitle":null,"slug":"dutch-treat","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/dutch-treat","symbol":"Dt","applink":"leafly://strain/dutch-treat"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
