{"sl_translate":"description,descriptionPlain,category","id":65624,"slug":"white-fire-og","name":"White Fire OG","subtitle":null,"symbol":"Wif","category":"Hybrid","description":"\u003cp class=\"p1\"\u003eWhite Fire OG, also known as WiFi OG, is a 60% sativa hybrid with uplifting and comfortable cerebrally focused effects. This strain combines the best features of its parent strains: the sour, earthy, diesel aroma of \u003ca href=\"http://www.leafly.com/hybrid/fire-og\"\u003eFire OG\u003c/a\u003e and the high resin production of \u003ca href=\"http://www.leafly.com/hybrid/the-white\"\u003eThe White\u003c/a\u003e that leaves the plants covered in a dusty snowfall of crystals. Many phenotypes of White Fire OG exist, some with dense, barrel-like buds and others with pointed, conic formations. Daytime use of this strain won\u0026rsquo;t leave the consumer drowsy, making it a good choice for social and creative activities. White Fire OG is often chosen by patients to treat anxiety and depression, cancer, glaucoma, pain, and appetite loss. Growers of White Fire OG can raise their high-yielding plants outdoors or inside with a 65-day flowering period.\u003c/p\u003e\n","descriptionPlain":"White Fire OG, also known as WiFi OG, is a 60% sativa hybrid with uplifting and comfortable cerebrally focused effects. This strain combines the best features of its parent strains: the sour, earthy, diesel aroma of Fire OG and the high resin production of The White that leaves the plants covered in a dusty snowfall of crystals. Many phenotypes of White Fire OG exist, some with dense, barrel-like buds and others with pointed, conic formations. Daytime use of this strain won\u0026rsquo;t leave the consumer drowsy, making it a good choice for social and creative activities. White Fire OG is often chosen by patients to treat anxiety and depression, cancer, glaucoma, pain, and appetite loss. Growers of White Fire OG can raise their high-yielding plants outdoors or inside with a 65-day flowering period.\n","aka":"White Fire, WiFi, Whitefire, WiFi OG, WiFi Kush, Wi-Fi OG, Wi-Fi O.G.","rating":4.54,"highlightedReviews":[{"id":1415440,"username":"RobRobRob","text":"I\u0027ve been with cannabjs for 15 years; this is the best ever! I was so so so so so so happy and uplifted that I wanted to CREATE! It started off with an airy, ethereal, open, earthy philosophical consciousness. It unfolded into sky. I laughed, I created music, It imbibed enlightened thought and expansive euphoria of mind and a mellow \"surfer-sage\" outlook proceeding a heavenly euphoria felt throughout the body. My body is uber relaxed and \"tingly\"-- I think it might  float away. I feel like a balloon free in the sky. The euphoria persists for a long time. There is no paranoia. My senses are very heightened, I was seeing little flashes of light like you see on the THC coating the leaves in white and burnt-orange hairs. The \"cone-down\" is smooth and mellow with butterflies tingly in my stomach four hours later! This is pharmaceutical-grade, sweet, luscious cannabis. It\u0027s ability to target sadness makes this one a great antidepressant and mood stabilizer. Excellent for muscle spasms, hypertension, spasticity, PTSD, anxiety, OCD and pain. This is a wonderful strain that should be picked up right away in large amounts of you are very lucky to find it! Nameste! ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1640703,"username":"21Rowan21","text":"very distinct smell, very good body high","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-29132","title":"The 6 Best Documentaries to Watch While High","author":"Hannah Meadows","category":null,"date":"\/Date(1497189652000)\/","text":"Firing up a documentary whilst high is hardly a new idea, but it’s usually a good one (hello, Planet Earth). There’s so much to learn and explore via films that showcase unique and mind-bending experiences—especially with a little help from a well-packed bowl. Additionally, the truthfulness of documentaries comes as a breath of fresh air amid the throngs of lowbrow comedies and overly intense dramas that tend to flood the average Netflix queue.\n\nTo elevate this classic cannabis-enhanced activity, we mined the opinions of the staff at the Leafly office and compiled a list of the best documentaries to watch while high. In narrowing from a list that included scores of suggestions, I personally vetted the top picks to bring you the following finalists. From explorations of history to non-verbal spectaculars, there’s a bit of something for everyone below. Spark up a pre-roll or bake a batch of edibles, then get comfortable on the couch and press play—we’re willing to bet you’ll discover a new favorite.\nRecently watched a noteworthy documentary? Tell us about it in the comments below!\nCave of Forgotten Dreams\n\nFamed documentary director Werner Herzog knocked it out of the park—yet again—with his video exploration of the Chauvet Cave of Southern France. Discovered by three explorers in 1994, the cave houses ancient paintings that are the oldest ever recorded in human history, dating back between 28,000 and 35,000 years. The paintings are perfectly preserved—along with the bones of long extinct animals—having never been touched by natural light or exposure to the elements.\nBefore watching this film, I lit up some Blue Dream and even through a small computer screen (I, uh…don’t own a TV), the paintings, their meanings, and Herzog’s beautifully crafted narrative combined to create a film that was truly breathtaking. Long after the film ended, I thought about the person or people who made these, the gods they may have worshipped, the natural world in which they lived, and the ancient culture to which they belonged.\nI doubt sober thoughts would have gravitated toward the essence and deeper meaning these paintings hold in regard to human life and the history of mankind like my Blue Dream-induced thoughts did. I recommend this documentary for the music, the art, the history, the curiosity—everything about it.\nGoing Clear: Scientology and the Prison of Belief\n\nDocumentaries exploring religious sects or cults are my bread and butter. Documentaries exploring religions that are widely regarded as cults are even better—the extra-sweet jam to that bread and butter. Enter Going Clear, an eye-opening expose of L. Ron Hubbard and his imaginative, interwoven ideals of science fiction and religion that ultimately led to the creation of the Church of Scientology.\nIn this documentary, we hear stories from ex-Scientologists. These aren’t just “tried it out for a week and left” Scientologists—these people were indoctrinated into the religion for years, even decades, before getting out. Some moved up to the highest levels of the religion before calling it quits.\nSober, this is an interesting journey down the rabbit hole of Scientology. High, this documentary will open your thoughts to science, religion, and how people respond to both in a whole new light. Load a bowl of the buzzy White Fire OG before pressing play.\nSamsara\n\nNonverbal and utterly breathtaking, Samsara is the younger sister to the popular 1992 documentary Baraka (the previous nonverbal narrative exploration of nature and human life). Like Bakara, Samsara was directed by Mond Russell and produced by Mark Magidson, so the quality and feel stay true to the original.\nSamsara will leave you in awe of its gorgeous, lingering landscapes, and rich visions of people from all over the world. This colossal documentary took five years to film and spanned about 25 countries.\nThroughout this entire spectacular, cannabis will keep your eyes peeled and your mind enamored with this hour-and-a-half film of explosive color and life. Creative strains such as Pineapple Trainwreck or Berry White will let your mind completely soak in this remarkable film.\nFor an extra boost, check out the classic Koyaanisqatsi which pre-dates Samsara by about 20 years. The score is done by the famous composer Philip Glass with cinematography by Ron Fricke (who also worked on Samsara and Baraka). Though Koyaanisqatsi may not be as visually crisp as Samasara or Baraka, it was the core inspiration for both stunning films.\n\nBeware of Mr. Baker\n\nThe colorful life of Ginger Baker, legendary drummer of the popular rock bands Cream and Blind Faith, is front and center in this exploratory documentary. Rock legends laud him as the greatest drummer who ever lived, but the “behind the scenes” of Baker’s life shows a volatile man with a short fuse and passionate air.\nHe’s a true character in every sense of the word, having traveled the world and experienced a life that only one in a billion could mirror. Though hard drug use and angry outbursts (mostly fueled by said hard drug use) clouded his legend, his life story remains remarkable in every way.\nRegardless of whether or not you know who Ginger Baker is, this film is fascinating and will appeal to everyone—especially lovers of rock music. I recommend lighting up a little Durban Poison as you watch this film.\nInto the Inferno\n\nWerner Herzog makes another appearance on this list with his relatively new Netflix documentary Into the Inferno. Much like Cave of Forgotten Dreams, Into the Inferno touches on the history of human life. After delving into the world of volcanic activity, Herzog explores the religions that have developed across cultures greatly influenced by local volcanic eruptions.\nIn true Herzog style, the documentary approaches these subjects with both historical and artistic flair. Some of the most touching and beautiful points in the film are the sweeping shots of erupting volcanoes punctuated with classical or operatic music.\nJuxtaposed with these beautiful shots are scenes of ceremonial activities conducted by worshippers who believe certain volcanoes house spirits of long-dead loved ones and mighty gods. Also wrapped up with all this is the discovery of an ancient human fossil as well as the recounting of the lives of two famous volcano photographers. In short, Herzog does quite a lot with this film, and it’s all compelling.\nYet another amazing documentary that, when paired with cannabis, leaves you contemplating it days after the credits roll. Reach for some Stardawg to pair with this incredible film.\nTickled\n\nFor something well off the beaten path in terms of documentaries, I suggest you sit down and watch Tickled. It starts off innocently enough, with the director, David Farrier, simply wanting to explore an interesting subject: the world of endurance tickling. Sure, it’s an odd sport to most, but why not get a feel for something a bit different? No harm … right?\n…Right?\nWell, much to the filmmakers’ surprise—as well as my own—there is a bit of harm in exploring the unknown. Not to give too much away, the endurance competitions held by professional ticklers are more than just a good laugh.\nYou’ll be on the edge of your seat while Farrier dives down the deep and twisty hole that goes straight to the mystifying and sometimes terrifying underworld of tickling competitions. To really get into this film, you’ll want to have some Permafrost close at hand—its effects will help take the edge off the strangeness in this documentary.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/09155343/best-documentaries-to-watch-while-high.jpg","urlslug":"/news/lifestyle/best-high-documentaries"},{"id":"contentitems-3605","title":"What Are the Strongest Cannabis Strains?","author":"Bailey Rahn","category":null,"date":"\/Date(1445554800000)\/","text":"Updated 02/20/2018\nLooking for a cannabis strain that will challenge your tolerance or stand up to stubborn medical symptoms? Readers ask us all the time which strains are the potent, and while that depends on a variety of factors from growing techniques to phenotypic variation, we’ve put together a list of strains that tend to deliver potent euphoric effects thanks to strong genetics and selective breeding.\nWhile THC is the main driver of potency, it’s important to understand the important role terpenes play in enhancing and shaping the strain’s high. Terpenes like myrcene, linalool, and limonene refer to aromatic compounds that lend cannabis its unique array of smells, and a cannabis strain rich in both terpenes and THC often delivers a more remarkable experience than a product that lacks chemical diversity.\n\nA Selection of the Strongest Cannabis Strains\nBelow are the mean THC levels of a few cannabis strains featured in this list. Note that these represent their average potency across several testing labs; you’ll undoubtedly come across samples with higher or lower THC levels in your own strain exploration, but this gives you a baseline idea of how these strains compare.\nNote: You can filter “potent strains” on dispensary menus to see if any of these recommendations are available near you.\nPotency data derived from six of the largest testing labs in Washington State. Click to enlarge. (Elysse Feigenblatt/Leafly)\nGSC (f.k.a. Girl Scout Cookies)\n\n\nFind GSC Nearby\nGSC (f.k.a Girl Scout Cookies) hauled its way up the ladder of fame in recent years, and it isn’t hard to see why. The genetics in this hybrid are strong, with a THC content that regularly tests above 20%. Expect a crushing wave of blissful euphoria that enshrouds both mind and body with warm relaxation for hours.\nLeafly User Review:\n“Incredible jelly foot. Very nice body pudding. Creativity mixed with amazing peaks of HD colors.” –herbknight\nKosher Kush\n\nFind Kosher Kush Nearby\nKosher Kush first blessed the world with its presence in 2010 and has been nabbing Cannabis Cup awards ever since. Its genetic background may be a mystery, but this indica’s keepers at DNA Genetics have refined a champion strain that consistently breaches 20% THC. Wrapped in a thick blanket of crystalline resin, you’ll hardly need a closer look to see that this tranquilizing indica is not one for the novices.\nLeafly User Review:\n“I can’t feel my face… or my arms, or my feet, or anything for that matter. It’s as though I’m a weightless entity with a somewhat foggy-consciousness, floating on the patio.” –ricegrain\nGhost OG\n\nFind Ghost OG Nearby\nHiding in a white cloak of crystal resin, Ghost OG is a strain that is bred for its high-octane euphoria. Said to be a cut off the original OG Kush, Ghost OG’s potency is toned by a symphony of terpenes that fuel this strain’s powerful THC engine. Find a comfy seat and prepare to be swept into a powerful, euphoric current perfect for relaxing.\nBruce Banner\n\n\nFind Bruce Banner Nearby\nBruce Banner, appropriately named after the Hulk’s alter ego, is a heavy-duty hybrid with a staggering THC content. Rated the strongest strain in 2014 by High Times following its victory in the 2013 Denver Cannabis Cup, Bruce Banner has since carved itself quite the reputation. Powered by OG Kush and Strawberry Diesel genetics, Bruce Banner delivers a dizzying punch of euphoria that anchors your body in deep relaxation.\nGhost Train Haze\n\nFind Ghost Train Haze Nearby\nIn the last few years, the Cannabis Cup leaderboards saw a new rising star: the lively and vigorous sativa known as Ghost Train Haze. Bred by Rare Dankness Seeds, Ghost Train Haze had the highest THC content of any 2011 Cannabis Cup submissions, weighing in at 25.5% THC. Inheriting genetics from Ghost OG and Neville’s Wreck, this sativa’s potency takes form in a jolt of euphoric energy that goes straight to the head, feeding focus and creativity.\nLeafly User Review:\n“My initial response was yelling. It’s almost unreasonably potent. Smooth and citrusy too, but potent. Did I mention it was potent? It was potent. A next-level sativa. Made me feel like a marijuana n00b up until now. CAREFUL, it’s potent.” –thepiginzen\nChemdawg\n\nFind Chemdawg Nearby\nChemdawg is a classic strain whose unforgettable potency keeps a vice grip on its fan base. Ripe with the scent of acrid fuel, Chemdawg delivers an unforgettable flavor profile alongside its invigorating euphoria, inviting creativity alongside firm stress relief.\nLeafly User Review:\n“I feel like I’m in gravy and it’s a real good time.” –powwow31\nGG4 (f.k.a. Gorilla Glue #4)\n\nFind GG4 Nearby\nGG4 (f.k.a. Gorilla Glue #4) is named for the stickiness of its resinous buds, and this hybrid certainly lives up to her name. It isn’t rare for GG4 to hit the mid- to upper-twenties in a potency analysis, and she’s got multiple Cannabis Cup awards to back that claim up. But we doubt you’ll need the proof when this hybrid’s got you gorilla-glued to the couch in stupefied contentment.\nThe White\n\nFind The White Nearby\nNamed for the whiteout of crystal resin cloaking her buds, The White has become a godsend for breeders looking to improve the potency of their genetics. Routinely testing between 20-28% THC, The White delivers a disorienting blizzard of euphoric delirium that commands relaxation.\nDeath Star\n\nFind Death Star Nearby\nWith a THC profile that typically dances between 20-24%, Death Star will surely wreak as much havoc as the Galactic Empire. Using its great psychoactive forces, this Sensi Star and Sour Diesel hybrid commands you to chill out as it imposes powerfully euphoric and sedating effects.\nLeafly User Review:\n“There’s no hiding the high with Death Star. We went Christmas tree shopping in the bitter cold. It took us about 45 minutes to pick out a tree…it ended up being the very first tree we saw. Then went to a bar and I confused a mirror for a window.” –hoobear\nWhite Fire OG\n\nFind White Fire OG Nearby\nBorn from The White and Fire OG, White Fire OG (also known as WiFi OG) is a force not to be trifled with. Testing data shows the impressive THC potential of this hybrid, with average levels falling between 22-29%. Its uplifting effects launch your mood into the clouds, an elevated feeling that will shake creativity and happiness wide awake.\nExplore More Potent Cannabis Strains\nCan’t get enough potent, high-THC strains for your stash jar? Here are a few more heavy-hitters for you to seek out at your next dispensary visit.\n\nKimbo Kush\nHeadband\nCherry Pie\nBubba Kush\nSFV OG\nLA Confidential\nTriangle Kush\n\nWhich other heavy-handed strains belong on this list? Tell us about them in the comments section!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002953/what-are-the-strongest-cannabis-strains.jpg","urlslug":"/news/strains-products/what-are-the-strongest-cannabis-strains"}],"reviewCount":732,"flavors":[{"name":"Earthy","score":20.745464670332602},{"name":"Pungent","score":16.5029811380819},{"name":"Sweet","score":16.339204394379507},{"name":"Skunk","score":12.351587302673197},{"name":"Pine","score":9.7022442111465779}],"effects":[{"name":"Happy","score":69.53201855862784},{"name":"Euphoric","score":64.251951661460566},{"name":"Relaxed","score":63.541283278125377},{"name":"Uplifted","score":60.973509305538258},{"name":"Focused","score":40.643985571592694}],"symptoms":[{"name":"Depression","score":29.35456410803701},{"name":"Stress","score":28.626131580543632},{"name":"Pain","score":24.704805075574004},{"name":"Fatigue","score":16.213441550948886},{"name":"Lack of Appetite","score":14.382982177934242}],"conditions":[{"name":"Anxiety","score":32.827123636162959},{"name":"PTSD","score":13.785500353686619},{"name":"ADD/ADHD","score":11.053949637397103},{"name":"Bipolar Disorder","score":10.782174194422286},{"name":"Migraines","score":10.59630058847433}],"negatives":[{"name":"Dry Mouth","score":16.345384218598856},{"name":"Dry Eyes","score":11.596508558942524},{"name":"Anxious","score":6.8298687551279995},{"name":"Dizzy","score":4.4240244201112908},{"name":"Paranoid","score":4.1452140111893581}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/white-fire-og/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/white-fire-og/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/white-fire-og_100x100_4089.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003151/b/white-fire-og__primary_4d06.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/white-fire-og_100x100_f148.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002552/b/white-fire-og__primary_9285.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/white-fire-og_100x100_c773.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002551/b/white-fire-og__primary_81d7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/white-fire-og_100x100_3bf8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645268/b/white-fire-og__primary_5e91.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/white-fire-og_100x100_cd6b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645006/b/white-fire-og__primary_852c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/white-fire-og_100x100_f252.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630256/b/white-fire-og__primary_f9f2.jpg"}],"photoTotalCount":166,"popularCities":["Los Angeles, CA","Portland, OR","Seattle, WA","Denver, CO","Everett, WA","Montréal, QC","Detroit, MI","Toronto, ON","Vancouver, BC","Calgary, AB"],"permalink":"https://mobileapi.leafly.com/hybrid/white-fire-og","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.53551912568306/240","testGraph":"https://leafly.s3.amazonaws.com/strains/testing/jmxqh4CIRBCOjaCiQlMJ_white-fire.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"The White","subtitle":null,"slug":"the-white","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/the-white","symbol":"Twt","applink":"leafly://strain/the-white"},{"name":"Fire OG","subtitle":null,"slug":"fire-og","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/fire-og","symbol":"Fog","applink":"leafly://strain/fire-og"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":66,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":null,"growNotes":"\n\tGood for sea of green (SOG) or screen of green (SCROG) operations\n\tStretches tall during the first 3 weeks of flowering\n\tReservoir Seeds recommends a soil pH level of 5.8 to 6.0\n\tGrows best in warm, slightly arid environments up to\u0026nbsp;88\u0026deg;F (31\u0026deg;C) and rich in CO2\n\n"}}
