{"sl_translate":"description,descriptionPlain,category","id":126032,"slug":"monkey-paw","name":"Monkey Paw","subtitle":null,"symbol":"Mop","category":"Hybrid","description":"\u003cp\u003eMonkey Paw takes its name from its fingerling buds that resemble the curled paws of primates. It is a fabled old school strain whose roots sprouted in Michigan and has built a solid reputation for itself across the Midwest. This \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e is a compelling mixture of \u003ca href=\"http://www.leafly.com/sativa/acapulco-gold\"\u003eAcapulco Gold\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/sativa/colombian-gold\"\u003eColombian Gold\u003c/a\u003e \u003ca href=\"http://www.leafly.com/sativas\"\u003esativas\u003c/a\u003e that are balanced by \u003ca href=\"http://www.leafly.com/indica/afghani\"\u003eAfghani\u0026rsquo;s\u003c/a\u003e \u003ca href=\"http://www.leafly.com/indica\"\u003eindica\u003c/a\u003e influence to produce a \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-pungent\"\u003epungent\u003c/a\u003e combination of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-tree-fruit\"\u003efruity\u003c/a\u003e flavors. Its aroma is reminiscent of the thick musk of \u003ca href=\"http://www.leafly.com/hybrid/skunk-1\"\u003eSkunk\u003c/a\u003e varieties with sharp notes of zesty \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-citrus\"\u003ecitrus\u003c/a\u003e that cut the senses. The aftertaste of fresh fruits, like \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-grape\"\u003egrape\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-blueberry\"\u003eblueberry\u003c/a\u003e, serves as precursor to the \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003erelaxing\u003c/a\u003e effects that calm body \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epains\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-lack-of-appetite\"\u003estimulate the stomach\u003c/a\u003e.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Monkey Paw takes its name from its fingerling buds that resemble the curled paws of primates. It is a fabled old school strain whose roots sprouted in Michigan and has built a solid reputation for itself across the Midwest. This hybrid is a compelling mixture of Acapulco Gold and Colombian Gold sativas that are balanced by Afghani\u0026rsquo;s indica influence to produce a pungent combination of sweet and fruity flavors. Its aroma is reminiscent of the thick musk of Skunk varieties with sharp notes of zesty citrus that cut the senses. The aftertaste of fresh fruits, like grape and blueberry, serves as precursor to the relaxing effects that calm body pains and stimulate the stomach.\u0026nbsp;\n","aka":"Monkey Paws","rating":4.49,"highlightedReviews":[{"id":1394127,"username":"Stevenspowersports","text":"5/5.\n\nOld Michigan Cut. Some of the classic, tight, sticky icky icky you can get around here. Pungent, fruity, spicy aroma, and Rocklike, sugar-coated buds of Lime and Pink. It is so much like a Kush cut but with NONE of the crashy, heaviness of the afghani roots. The best strain for paranoia and anxiety, a crippling duo that my friend says is crushed by the Monkey\u0027s paw.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1640942,"username":"Steven frank","text":"It is great tasting smooth good buzz one my favorite kinds out there","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-28571","title":"5 Excellent Funk Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1495893637000)\/","text":"Originating in the 1960s, funk music was brought earthside by black American musicians who mixed rhythm, blues, soul, and jazz to give birth to a new genre of music that is as groovy as it is dance-inducing. Placing heavy emphasis on bass and drums, funk music is a distinctive genre that gets its name from the early etymology of the word, meaning “musty,” or “earthy.” Anyone who has watched a funk bassist get down knows the “stank face” all too well—it’s this pure, earth-driven vibe that gave funk its name and magnetic presence in the early scene.\n\nThere is truly no other genre like funk—a genre that can enliven, inspire, rejuvenate, and energize. It is a sound that is both euphoric and grounded. The following is a list of some suggested funk albums to get the bones shaking and heart pumping, best enjoyed with some happy, sativa-dominant strains. Have your own funk albums you love to listen to while high? Tell us all about them in the comments below!\nMothership Connection by Parliament-Funkadelic\n\nStrain Pairing Recommendation: Funfetti\n“Funk not only moves, it can remove,” go the intro lyrics in this delightfully stanky, purely funky iconic album by Parliament-Funkadelic. Led by singer-songwriter George Clinton, whose fresh sound sparked its own genre title known as “P-funk,” Parliament-Funkadelic’s vibe is quintessentially funk, and thus impossible not to groove to. Mothership Connection is an album that plays out like a performance: It begins with a lively introduction, like the opening act to a play, and then dives deep into a medley of groovy bass lines and Clinton’s seamless vocals. Mothership Connection is a collection of pure funk sound that will have the listener looking up, getting up, and feeling up—particularly in conjunction with the lively strain Funfetti.\nFugue State by Vulfpeck\n\nStrain Pairing Recommendation: Monkey Paw\nIf you haven’t heard of Vulfpeck yet, get ready to join the vulfpack. The American funk group with an imaginary German flair have been steadily taking the music scene by storm since they were founded in 2011. Fugue State, released in 2014, is one of their most popular albums despite containing only six songs and lasting about 18 minutes. While mostly instrumental, Vulfpeck does at times feature vocals such as those on the track “1612,” a thoroughly catchy offering.\nDespite its short playlist, Fugue State is not lacking in sound or diversity; and perhaps diversity of sound is what Vulfpeck does best. Each song, even each album, builds a distinctive vibe that somehow manages to be both modern and original while also maintaining a nostalgic and vintage je ne sais quoi.\nBeyond The Sun by Orgone\n\nStrain Pairing Recommendation: Lemon Bubble\nOrgone’s Beyond The Sun is a venerable pleasure from the first note to the last. The music is playful, fierce, and lively, with the powerful vocals of singer Fanny Franklin driving the sound like any of the best conductors. Although much of their music is instrumental, Beyond The Sun especially highlights Franklin’s impeccable tone. However, make no mistake—as riveting as Franklin’s voice may be, instrumentalists are not outmatched but rather perfectly paired, creating a delicious confection of funk for the cannabis-elevated ears to enjoy. This is an album that will delight and invigorate while encouraging participation through song and dance.\n\nNext by Soulive\n\nStrain Pairing Recommendation: The Sauce\nOriginating in the forever famous Woodstock, NY, Soulive is a jazz-funk trio that brings the sounds of soul, R\u0026B, rock, and jazz to their largely instrumental recordings. Soulive is certainly a jazzier take on funk, with Eric Krasno on guitar, Alan Evans on drums and Neal Evans on keys, organ, and clarinet. At times, it’s easy to forget Soulive is a trio with their sound so rich and full. Their album Next, released in 2002, adds saxophonist Sam Kininger to the mix, providing an extra depth to their already wildly intricate sound. The album invites the herbally enraptured listener to go on a smooth ride through funky highs and soulful lows, which wind together a sprinkle of vocals amongst a sea of invigorating instrumentals.\nRowdy Duty by Deep Banana Blackout\n\nStrain Pairing Recommendation: Banana Diesel  \nPunchy and powerful, Deep Banana Blackout’s live album Rowdy Duty transports the listener to a live funk show filled with delightful improvisation, stimulating instrumentals, and robust vocals. Recorded in a single night, the 13-track album truly encapsulates the band’s jazz-funk, New Orleans-style sound. The eight-piece ensemble includes a full horn section, creating a funk experience that is truly dynamic and full. All together, it’s an energetic funk soundscape that will lead the blissed-out listener through a maze of funky highs and spacey lows.\n\nFunk music is a music of joy that moves people physically as well as uplifting them mentally. It is perhaps one of the most distinctive genres and one of the most original to come out of the golden era of music in the 1960s. Funk enlivens, and listening to it is simply good for the soul. At the end of the day, funk is all about happiness.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/05/25124830/funk-albums-while-high.jpg","urlslug":"/news/lifestyle/best-funk-albums-to-listen-to-while-high"},{"id":"contentitems-3433","title":"New Strains Alert: White Nightmare, Monkey Paw, Lost Coast OG, Crazy Miss Hyde, and Blueberry Yum Yum","author":"Bailey Rahn","category":null,"date":"\/Date(1420232100000)\/","text":"We\u0027re rolling into 2015 with five new strains nominated by you using the Leafly app! If you had a jarring, eventful transition into the new year, these hybrids are just what you\u0027ll need to recover balanced equilibrium. Or, for those who had a relaxing night in, one of these new varieties should be all you need to stay on track for a blissful, stress-free 2015 launch.\nWe know many of you are no stranger to these new strains, so be sure to leave a review sharing your thoughts if you\u0027ve had a chance to try one already! \n   1. White Nightmare\nCharacteristics of White Nightmare:\n\nBlue Dream’s soaring sativa effects and fruity flavors collide with White Moonshine’s resinous coat of milky trichomes to produce White Nightmare. The sativa-dominant hybrid brings a forceful, sweet aroma of berries and Haze. The flavor stays true to its Blue Dream genetics but with an earthy, hash-like aftertaste. White Nightmare generates a stimulating stream of euphoria and bliss that elevates the mood and brings with it a comfortable, relaxing body high.\n\n   2. Monkey Paw\nCharacteristics of Monkey Paw:\n\nMonkey Paw takes its name from its fingerling buds that resemble the curled paws of primates. It is a fabled old school strain whose roots sprouted in Michigan and has built a solid reputation for itself across the Midwest. This hybrid is a compelling mixture of Acapulco Gold and Colombian Gold sativas that are balanced by Afghani’s indica influence to produce a pungent combination of sweet and fruity flavors. Its aroma is reminiscent of the thick musk of Skunk varieties with sharp notes of zesty citrus that cut the senses. The aftertaste of fresh fruits, like grape and blueberry, serves as precursor to the relaxing effects that calm body pains and stimulate the stomach. \n\n   3. Lost Coast OG\nCharacteristics of Lost Coast OG:\n\nLost Coast OG is a 60/40 indica-dominant hybrid that marries Chemdawg 4 genetics with those of two age-old heirloom strains, Pakistani Kush and Lemon Thai. Flavors of sour citrus and earthy musk burst through on the exhale in show of its signature OG terpene profile. This California native induces a soaring cerebral buzzing sensation that brings new vitality to mood, creativity, and conversation. The potently euphoric effects can sometimes skid into anxiety with large doses, so novices should approach this OG with some degree of caution. \n\n   4. Crazy Miss Hyde\nCharacteristics of Crazy Miss Hyde:\n\nCrazy Miss Hyde is a surprisingly balanced hybrid given her name. She is a lively combination of the uplifting, sativa-dominant Belladona and the powerhouse indica Northern Lights. The buds deliver a potent mixture of earthy flavors like menthol and chocolate with a sweet vanilla influence. The effects tend to be focused in the head, with thought provoking stimulation and creativity that can border on anxiety when over-consumed. With the right dosing, the indica influence levels out the effects of Crazy Miss Hyde and induces a relaxing sense of euphoria.\n\n   5. Blueberry Yum Yum\nCharacteristics of Blueberry Yum Yum:\n\nBlueberry Yum Yum is a hybrid strain whose popularity was ushered in by rap artist Ludacris and his song centered on the strain. While certainly the progeny of the famed Blueberry indica, its other parent is suspected to have been a Durban Poison sativa. Because of its parents’ polarity, Blueberry Yum Yum can express a wide spectrum of effects, but consumers typically report uplifting, happy effects perfect for any time of the day. Though dominated by an unmistakable blueberry aroma, accents of earthy mint and pine can also be detected on the palate. ","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/01/12002449/new-strains-alert-white-nightmare-monkey-paw-lost-coast-og-crazy.jpg","urlslug":"/news/strains-products/new-strains-alert-white-nightmare-monkey-paw-lost-coast-og-crazy"}],"reviewCount":39,"flavors":[{"name":"Citrus","score":60.227272727272727},{"name":"Pungent","score":54.545454545454547},{"name":"Earthy","score":52.272727272727273},{"name":"Grape","score":14.204545454545453},{"name":"Skunk","score":10.227272727272728}],"effects":[{"name":"Uplifted","score":124.43181818181819},{"name":"Relaxed","score":90.9090909090909},{"name":"Happy","score":84.6590909090909},{"name":"Euphoric","score":69.318181818181813},{"name":"Focused","score":68.75}],"symptoms":[{"name":"Stress","score":14.204545454545457},{"name":"Depression","score":13.636363636363637},{"name":"Pain","score":12.5},{"name":"Muscle Spasms","score":11.931818181818183},{"name":"Fatigue","score":11.363636363636365}],"conditions":[{"name":"Anxiety","score":11.931818181818183},{"name":"PTSD","score":5.6818181818181825},{"name":"Cancer","score":5.1136363636363642},{"name":"Parkinson\u0027s","score":5.1136363636363642},{"name":"Bipolar Disorder","score":4.5454545454545459}],"negatives":[{"name":"Dry Mouth","score":61.931818181818187},{"name":"Paranoid","score":10.227272727272728},{"name":"Dry Eyes","score":5.6818181818181825},{"name":"Dizzy","score":0.56818181818181823},{"name":"Anxious","score":0.56818181818181823}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/monkey-paw_100x100_6d39.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/570766/b/monkey-paw__primary_0497.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/monkey-paw_100x100_ec49.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509184/b/monkey-paw__primary_c2fc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/monkey-paw_100x100_caed.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509452/b/monkey-paw__primary_ee49.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/monkey-paw_100x100_3b52.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/414513/b/monkey-paw__primary_6eb9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/monkey-paw_100x100_66b4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/356677/b/monkey-paw__primary_5694.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/monkey-paw_100x100_4ff4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/313998/b/monkey-paw__primary_dfeb.jpg"}],"photoTotalCount":9,"popularCities":["Detroit, MI","Ann Arbor, MI","Bay City, MI","Bothell, WA","Inkster, MI"],"permalink":"https://mobileapi.leafly.com/hybrid/monkey-paw","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.48717948717949/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Acapulco Gold","subtitle":null,"slug":"acapulco-gold","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/acapulco-gold","symbol":"Aca","applink":"leafly://strain/acapulco-gold"},{"name":"Colombian Gold","subtitle":null,"slug":"colombian-gold","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/colombian-gold","symbol":"Cg","applink":"leafly://strain/colombian-gold"},{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
