{
    "aka": "Animal Crackers",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1451246400000)/",
            "id": "contentitems-3591",
            "text": "Looking back at 2015, I can’t help but play a nostalgic montage in my head of all the strains that came and went over the year. Legal markets are becoming saturated with choices, so much so that it’s impossible to determine 2015’s best cream of the crop. Instead, we took a look at the fastest growing strain trends based on Leafly reviews and determined which varieties made the biggest splash last year.\nDispensaries and rec shops, you better keep your eye out for these rising stars in 2016! You’ll definitely want them blessing your shelves.\n \n\n \n#1. GG4 (f.k.a Gorilla Glue #4)\n \nGG4 (f.k.a Gorilla Glue #4) blew it out of the water this year with an astounding 906% increase in user ratings and reviews. That kind of growth is pretty mind-blowing, but if you’ve tried Gorilla Glue, it starts to make sense.\nEven through a sealed container, I could pick up every intricacy of its aroma: earthy pine soured by loud notes of skunky diesel. Trying to pry the buds apart, I can see how this champ got its name; the resin oozing from these trichomes might as well be heavy-duty adhesive. In describing the effects, I can say it no better than this Leafly reviewer who wrote, “I needed a seatbelt for reality.” Me too, dude.\n \n#2. Critical Kush\n \nHeir to the Critical Mass throne is Critical Kush, an indica strain that saw a staggering 407% increase in user engagement this year. By crossing Critical Mass with the West Coast favorite OG Kush, it’s no surprise that Critical Kush is taking off in the U.S. A subtle citrusy lemon OG aroma adds a layer of interest to Critical Mass’ muted hashy and earthy flavors, and its moderate CBD content complements its THC-rich profile for beautifully relaxing effects that one Leafly user compares to a slow massage.\n \n#3. Candyland\n \nCandyland grew almost 380% this year, making it the fastest growing sativa among Leafly users in 2015. The first thing most people note about this strain is its strikingly sweet flavor, a quality that’s earned this strain her name. Its twisting hues of blue, purple, white, and green are also something to write home about, as well as its dueling effects that balance gracefully between relaxing and uplifting. Candyland has been called “a work of art” by Leafly users, while another claimed it was “By far one of the best strains I had of 2015.” Apparently everyone else agrees.\n \n#4. ACDC\n \nNext up is ACDC, a high-CBD hybrid that grew 356% this year. I believe it. A lot of high-CBD strains I’ve tried have a grassy, hay-like aroma and a scraggly appearance, but ACDC is a refreshingly beautiful anomaly. Sweet, zesty lemon notes burst from its crystal-coated buds in an impressively fragrant introduction to its relaxing, clear-headed effects. Reviewers rave over its ability to chase off pain and anxiety without cerebral euphoria or mental cloudiness, which can make all the difference in many medical patients’ lives.\n \n#5. Bubblegum Kush\n \nStep aside, Bubble Gum. Your Kush-infused offspring is taking center stage with a yearly growth rate of 284%. Maintaining a sweet floral and bubble gum aroma, this hybrid gets its enhanced resin production from its hash monster of its second parent, Hindu Kush. It may anchor your body with a physical heaviness, but many reviewers claim this strain still leaves the mind agile and motivated.\n \n#6. Sunset Sherbet\n \nOnce upon a time, you’d see its parent GSC (f.k.a Girl Scout Cookies) on this list, so it comes as no surprise that the offspring Sunset Sherbert is dominating the market with a year-over-year growth rate of nearly 276%. As one reviewer wrote, Sunset Sherbert “smells as if heaven cracked open its Mason jars and said ‘enjoy.’” Yes, it’s that good.\n \n#7. Tangie\n \nClimbing 236% in ratings and reviews this year, the Tangie sativa is a flavor masterpiece. Its aroma spans the entire citrus spectrum with fruity notes of orange, lemon, lime, and grapefruit. Even if this strain didn’t have its amazingly uplifting and upbeat effects, I bet you’d still buy this strain for its flavor alone.\n \n#8. Jedi Kush\n \nEither Star Wars fans spent the entirety of 2015 enjoying Jedi Kush in anticipation of the new sequel or it really is that good, because this indica grew 235% among Leafly visitors. It hits with the force of a Jedi master, delivering heavy-handed euphoria that’ll launch you to a galaxy far, far away.\n \n#9. Animal Cookies\n \nAlso called Animal Crackers, this powerhouse hybrid hiked 224% in 2015. This one’s known to reach impressively high THC heights and provide stupefying effects that can knock out even the most seasoned veteran. As one Leafly reviewer poetically describes it, Animal Cookies is a “soothing, nap-time, I-wish-I-had-money-for-pizza, loving-my-1,000-thread-count-sheets strain.”\n \n#10. OG #18\n \nWith an annual growth rate of 210%, OG #18 (AKA Private Reserve) gained quite a bit of momentum this year. This supreme OG Kush phenotype has snagged numerous awards for its potency, and fans of OG genetics will appreciate how this hybrid captures and enhances the most cherished qualities of OG Kush: its pungent diesel, lemon, and pine flavors; a thick and sticky coat of resin; high-flying euphoria; and pain-relieving anesthetic effects that patients gush over.\nDispensaries, you might want to update your Leafly listing menus to include these trending strains. Don’t have a Leafly listing? We can fix that!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12002930/top-trending-cannabis-strains-of-2015.jpg",
            "title": "The Top Trending Cannabis Strains of 2015",
            "urlslug": "/news/strains-products/top-trending-cannabis-strains-of-2015"
        },
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1444424400000)/",
            "id": "contentitems-3571",
            "text": "October 1st marked the opening of recreational cannabis sales in Oregon, and what better way to close out the weekend of celebrations than with the first cannabis cup in the state? DOPE Magazine hosted the Oregon DOPE Cup at Refuge PDX in Portland. Happy Oregonians spilled out of the venue and into the city streets, eager to join the festivities and excitedly sampling all the vendors had to offer. The evening’s entertainment was provided by a variety of local musicians and artists who warmed the crowd up for Redman’s headlining performance.\nHappy people, good music, and award-winning cannabis — what more could you ask for? How about the winning strains and products? Here are the award-winners from the 2015 Oregon DOPE Cup:\n \nWinning Cannabis Flowers\n\n \nPeoples’ Choice\n\nMango Kush from Chalice Farms\n \nJudges’ Choice\n\nGSC (f.k.a Girl Scout Cookies) from Herbal Roots\n \nBest Indica Cannabis Strain\n\nWinner: Obama Kush from High Standards\nRunner Up: Anonymous V from Eco Firma Farms\n \nBest Sativa Cannabis Strain\n\nWinner: Strawberry Ice from Chalice Farms\nRunner Up: Chernobyl from Geek Farms\n \nBest Hybrid Cannabis Strain\n\nWinner: Platinum Animal Cookies from Ideal Farms\nRunner Up: Cherry Lopez from Dr. Vert\n \nBest High-THC Cannabis Strain\n\nWinner: The White from Eco Firma Farms\nRunner Up: New York Old School from Five Mules Farms\n \nBest High-CBD Cannabis Strain\n\nWinner: TJ’s CBD from TJ’s Organics\nRunner Up: Charlotte’s Web from Chalice Farms\n \nWinning Cannabis Concentrates\n\n \nBest BHO (THC)\n\nWinner: OG Kush Live Resin from Dirty Arm Farm\nRunner Up: Agent Orange Live Resin from Dirty Arm Farm\n \nBest BHO (CBD)\n\nWinner: Harle Tsu from Proper Oil\nRunner Up: Harle Tsu from Mad Fama\n \nBest PHO (THC)\n\nWinner: Jack Herer Terp Wax from Orgone Extracts\nRunner Up: White Super Skunk from Cultivated Industries\n \nBest Non-Solvent Cannabis Concentrate (THC)\n\nWinner: Pineapple Trainwreck Terp Sauce from Primo Extracts\nRunner Up: Animal Cookies from Reson Ranchers\n \nBest Cannabis Concentrate Cartridge\n\nWinner: OG Kush Wax Truly Pure\nRunner Up: Dutch Treat from Golden XTRX\n \nBest CO2 Cannabis Concentrate (THC)\nWinner: Smarties OM Extracts\nRunner Up: The Clear from Orgone Extracts\n \nBest CO2 Cannabis Concentrate (CBD)\nWinner: Buddha Kong from True North Extracts\nRunner Up: Harle Tsu from OM Extracts\n \nWinning Cannabis Edibles\n\n \nBest Sweet Cannabis Edible\nWinner: Chocolate Kettle Corn from Cannavore\nRunner Up: Blueberries and Hazelnut from Blaze Bars\n \nBest Savory Cannabis Edible\nWinner: Garlic Herb Almonds from Lunchbox Alchemy\nRunner Up: Ginger Hemp Granola from Pannacea Valley Gourmet Edibles\n \nBest CBD Cannabis Edible\nWinner: Honey Bee Honey Stick from Echo Electuary\nRunner Up: CBD Dark Chocolate Truffle from Leif Medicinals\n \nBest Cannabis-Infused Drink\nWinner: Mate Karate from Bent Beverage\nRunner Up: Fruit Punch Level 3 from Vitonic\n \nWinning Cannabis Topical\n\n \nBest Cannabis Topical\nWinner: Peppermint Cayenne Salve from Henrys Herbals\nRunner Up: The Transdermal Patches from Synergy Skin Worx",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002857/the-oregon-dope-cup-winning-cannabis-strains-concentrates-and-edi.jpg",
            "title": "The Oregon DOPE Cup Winning Cannabis Strains, Concentrates, and Edibles",
            "urlslug": "/news/strains-products/the-oregon-dope-cup-winning-cannabis-strains-concentrates-and-edi"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 36.934604797914524
        },
        {
            "name": "Arthritis",
            "score": 11.95964713567981
        },
        {
            "name": "PTSD",
            "score": 10.960303547285918
        },
        {
            "name": "Bipolar Disorder",
            "score": 9.228669364377371
        },
        {
            "name": "Migraines",
            "score": 9.180331464361863
        }
    ],
    "description": "<p>Animal Cookies is the child of the legendary hybrid marijuana strains <a href=\"http://www.leafly.com/hybrid/girl-scout-cookie\">Girl Scout Cookies</a> and <a href=\"http://www.leafly.com/hybrid/fire-og\">Fire OG</a>. This clone-only strain flowers in 9-10 weeks, and grows into dense, frosty green buds tipped with purple. True to its name, Animal Cookies has a sweet, sour aroma with heavy full-body effects that will impress any veteran consumer. This potent medicine might be overkill for mild symptoms, but its ability to obliterate severe pain and insomnia is unprecedented.</p>\n\n<p>&nbsp;</p>\n",
    "descriptionPlain": "Animal Cookies is the child of the legendary hybrid marijuana strains Girl Scout Cookies and Fire OG. This clone-only strain flowers in 9-10 weeks, and grows into dense, frosty green buds tipped with purple. True to its name, Animal Cookies has a sweet, sour aroma with heavy full-body effects that will impress any veteran consumer. This potent medicine might be overkill for mild symptoms, but its ability to obliterate severe pain and insomnia is unprecedented.\n\n&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 84.43894823748002
        },
        {
            "name": "Happy",
            "score": 64.1444873174698
        },
        {
            "name": "Euphoric",
            "score": 55.45839149390821
        },
        {
            "name": "Sleepy",
            "score": 41.78004258059058
        },
        {
            "name": "Uplifted",
            "score": 38.95600788947219
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 25.18666215481601
        },
        {
            "name": "Earthy",
            "score": 21.705025230331543
        },
        {
            "name": "Pungent",
            "score": 16.216476401297783
        },
        {
            "name": "Flowery",
            "score": 9.8286358388204
        },
        {
            "name": "Vanilla",
            "score": 8.394266816435042
        }
    ],
    "growInfo": {
        "averageYield": "Medium",
        "difficulty": "Moderate",
        "environment": null,
        "floweringDays": 67,
        "growNotes": "",
        "height": "Tall",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png",
            "id": 1417657,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "While GSC is still my preference, after spending an afternoon indulging in this strain to a point of near tweaking, I have to say it was very enjoyable.  Not overly arousing, which is something I'm always on the lookout for, but highly visual much like the Fire OG from which it is born though a bit more subtle when consumed at a low to moderate level.  I, however, went all out and noticed that, when writing text, the words appeared backwards as if I were writing Hebrew.  Kinda cool but not an experience for everyday.  Consumed in smaller doses it is relaxing while still allowing for a clear but active mind.",
            "username": "DrDrea"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1641314,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This strain is by far the best for me. It does everything! It helps me eat, it kills the pain, and depression. I just hate the inconsistency in grows",
            "username": "Moonangel"
        }
    ],
    "id": 58159,
    "name": "Animal Cookies",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 44.47223880222898
        },
        {
            "name": "Dry Eyes",
            "score": 13.061588328093007
        },
        {
            "name": "Paranoid",
            "score": 11.394843330685756
        },
        {
            "name": "Anxious",
            "score": 8.829049425130695
        },
        {
            "name": "Dizzy",
            "score": 8.21590772012113
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/girl-scout-cookie",
            "category": "Hybrid",
            "name": "Girl Scout Cookies",
            "permalink": "https://mobileapi.leafly.com/hybrid/girl-scout-cookie",
            "slug": "girl-scout-cookie",
            "subtitle": null,
            "symbol": "Gsc"
        },
        {
            "applink": "leafly://strain/fire-og",
            "category": "Hybrid",
            "name": "Fire OG",
            "permalink": "https://mobileapi.leafly.com/hybrid/fire-og",
            "slug": "fire-og",
            "subtitle": null,
            "symbol": "Fog"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/animal-cookies",
    "photoTotalCount": 180,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1021081/b/animal-cookies__primary_c324.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/animal-cookies_100x100_115c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/708463/b/animal-cookies__primary_7000.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/animal-cookies_100x100_ba61.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/708338/b/animal-cookies__primary_b38b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/animal-cookies_100x100_5c94.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645098/b/animal-cookies__primary_797f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/animal-cookies_100x100_071c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/628533/b/animal-cookies__primary_3d75.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/animal-cookies_100x100_0ea2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/618762/b/animal-cookies__primary_9f9e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/animal-cookies_100x100_df13.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Los Angeles, CA",
        "Seattle, WA",
        "Spokane, WA",
        "Eugene, OR",
        "Detroit, MI",
        "Bellingham, WA",
        "Calgary, AB",
        "Montréal, QC",
        "Vancouver, BC"
    ],
    "rating": 4.49,
    "relatedStrains": [],
    "reviewCount": 775,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "animal-cookies",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.49032258064516/240",
    "subtitle": null,
    "symbol": "Ac",
    "symptoms": [
        {
            "name": "Stress",
            "score": 42.3228589467022
        },
        {
            "name": "Pain",
            "score": 30.450331260701937
        },
        {
            "name": "Depression",
            "score": 29.094026654384407
        },
        {
            "name": "Lack of Appetite",
            "score": 21.455855144528048
        },
        {
            "name": "Muscle Spasms",
            "score": 16.49694745103937
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
