{
    "aka": "Loddy Doddy",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1511894705000)/",
            "id": "contentitems-49877",
            "text": "As we explored recently with our list of 9 Most Overhyped Cannabis Strains, a few of the best-known cannabis varieties on the market are a little overrated. Correspondingly, it’s no surprise that there are some underrated cannabis strains out there, too.\n\nThe following represent 11 varieties of cannabis that we think get less love than they deserve, based on Leafly review data, regional availability, and the personal experiences of our cannabis expert team. This is far from an exhaustive list—with thousands of strains available in the world, it’s virtually impossible to give all of them the attention we wish we could. Nevertheless, take the following as just a few recommendations of lesser-known types you should keep an eye out for—who knows? You just might find your new favorite strain among them.\nTahoe OG Kush\nStrain type: Hybrid\nParent strains: OG Kush, SFV OG Kush\nWhy it’s underrated: “Tahoe OG isn’t underrated in the traditional sense of the word. In fact, most people I know who’ve come across this select OG Kush phenotype will share their excitement for the pungent, piney sweetness and the strain’s dynamic mix of deep relaxation and profound euphoria. However, when I think of the OG family tree, the Tahoe cut doesn’t seem to get quite the same notoriety that some of its relatives. The SFV, Larry, and Fire OGs manage to capture a lot of the buzz, while other cuts, like the Ghost and WiFi OGs, have somewhat cult followings. This leaves room for Tahoe OG to stand on its own, which is OK by me. I love its dank, complex aroma and the sedating effects, so the less hype there is for Tahoe OG, the more of this delicious strain is available for me!” —Will Hyde\n\nLodi Dodi\nStrain type: Hybrid\nParent strains: Undisclosed\nWhy it’s underrated: “This strain is a mainstay in the Pacific Northwest, but still flies beneath the radar outside the region. Sativa-dominant in effect, this unknown cultivar has been propagated throughout the Evergreen State for decades. Lodi Dodi’s airy physical lightness and uplifting mental buzz allow the consumer to metaphorically levitate two inches above their problems and their pain. I personally enjoy working out after consuming this strain for its stimulating aura and a mental haze that allows me to fade into my headphones and run forever. It’s equally satisfying on the dancefloor or in the bedroom, as long as you mind your dosage. Lodi Dodi came to party—it don’t cause trouble or bother nobody.” —Jeremiah Wilhelm\nChocolope Kush\nStrain type: Hybrid\nParent strains:  Chocolope, Kosher Kush\nWhy it’s underrated: “This is, weirdly, one of the lowest-rated strains on Leafly (yep, a four-star rating is on the low end—Leafly reviewers give most cannabis pretty high marks), but riddle me this: How can a marriage of superstars like Chocolope and Kosher Kush possibly be bad? Those parent strains are two of our all-time faves (in fact, both landed on our Top 100 Strains list) and given that the apple rarely falls far from the tree, this super-low rating for Chocolate Kush is undeserved.” —Brett Konen\n\nDancehall\nStrain type: Hybrid\nParent strains: Juanita La Lagrimosa, Kalijah\nWhy it’s underrated: “Dancehall is an exceptional CBD-dominant strain that doesn’t get much recognition by comparison to CBD hallmarks like Harlequin, ACDC, Charlotte’s Web, and Cannatonic. With a near 21:1 CBD:THC ratio, Dancehall delivers soothing, easygoing effects with just enough sativa-dominant influence to elevate mood, which makes it a constant companion for consumers who like to stay level and clearheaded while enjoying cannabis. The terpene profile also offers deeper, skunkier notes than the usual grassy, hay-like aroma CBD strains are known for. Whether you’re enjoying it for what it is, or blending with your THC-dominant strains, Dancehall adds something special and drastically underappreciate to any joint or bowl.” —Jeremiah Wilhelm\nBay Dream\nStrain type: Sativa\nParent strains: Blue Dream, Bay 11\nWhy it’s underrated: “Bay Dream is an uplifting strain with sharp citrus notes and subtle earthiness. It seems to be overlooked because of its polarizing parent strain, Blue Dream, but in combination with the sweet, skunky flavors and focused headspace of Bay 11 the mix is a pleasant surprise. I appreciate that Bay Dream trades some of Blue Dream’s fruit notes for a deeper, more poignant Kush-like palate of flavors. So, if you’re in the ‘Blue Dream is overrated’ crowd, don’t shy away from Bay Dream—you might be amazed by how much this strain expresses its individuality.” —Will Hyde\n\nSour Urkle\nStrain type: Hybrid\nParent strains: Sour Diesel, Purple Urkle\nWhy it’s underrated: “Sour Urkle is the potent union of pungent, polar opposites. Created from Sour Diesel and Purple Urkle, this funky and surprisingly affordable bud packs the best of both strains into one frosty package. This strain emits an odd floral and chemical aroma that is contrasted against a latent but tangible sweetness brought forth by the fruitiness of Purple Urkle. This flavor profile can be challenging for some, but the effects are undeniably heady while draping the body in a soothing, mellow aura.” —Jeremiah Wilhelm\nPresidential Kush\nStrain type: Indica\nParent strains: Bubble Gum, OG Kush\nWhy it’s underrated: “Easily one of the more picturesque strains I’ve come across, Presidential Kush (also known as Presidential OG) expresses itself with deep green and purple hues. A thick blanket of trichomes adds another dimension to the strain’s aesthetic, but PK is so much more than just a pretty flower. It’s a potent, complex, and flavorful experience that only takes a puff or two before you feel the comforting weight of deep relaxation wash over you. The piney, diesel flavors make it hard to put down, and I still find myself embarking on epic journeys just to track down this beautiful bud. In my opinion, genetics this compelling should be easier to find and should be garnering more attention in the cannabis community, so for that reason, I’d like to encourage more growers to add this strain to their stable, and if you find it at your local dispensary as a consumer, definitely do not overlook it!” —Will Hyde\n\nDurban Poison\nStrain type: Sativa\nParent strains: African\nWhy it’s underrated: “Landrace strains, including Durban Poison, are hard to find and often faked. As such, many people have had a less-enjoyable-than-average experience with a strain they believed, mistakenly, to be the landrace advertised on the packaging. Durban Poison is a fantastic pure sativa that many people, including myself, loved at first smoke, so if Durban Poison didn’t wow you the first time around, give it another chance—that first batch might have been something else that was merely masquerading as this iconic strain.” —Brett Konen\nApple Jack\nStrain type: Hybrid\nParent strains: Jack Herer, White Widow\nWhy it’s underrated: “Apple Jack hasn’t gained much in the way of ratings on Leafly, but that doesn’t mean it’s a dud. It blends two well-known cuts together (Jack Herer x White Widow) to create something greater than the sum of its parts. Apple Jack’s initially clear-headed high relieves stress while elevating the mind and encouraging creativity. The happy effects and accessible THC concentration make it a friendly flower for consumers of all potency levels. And even though its flavor doesn’t always live up the name, Apple Jack’s sweet, earthy terpene profile still offers satisfying flavors alongside a productive buzz.” —Jeremiah Wilhelm\n\nPlushberry\nStrain type: Indica\nParent strains: Black Cherry Soda, Space Queen\nWhy it’s underrated: “Plushberry is an incredible strain that’s underrated simply because it hasn’t appeared to travel beyond the Pacific Northwest. Wrapped in beautiful lavender foliage, it smells like sweet wildflowers and mixed berries, and if you have the chance to try it while you’re in the area, Plushberry is a strain you won’t soon forget.” —Bailey Rahn\nSkunk No. 1\nStrain type: Hybrid\nParent strains: Afghani, Acapulco Gold, Colombian Gold\nWhy it’s underrated: “Even if you don’t love the flavor of the flower itself, you’ve got to respect a strain that’s given us so many of our favorites on the market—I’m talking Green Crack, Island Sweet Skunk, Amnesia, Pineapple Chunk, UK Cheese, and so many more. Skunk No. 1 is a true original among cannabis strains, and while its skunky flavor is an acquired taste, you’re smoking a piece of history with Skunk No. 1—so respect your elders.” —Brett Konen",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/28103218/most-underrated-cannabis-strains.jpg",
            "title": "11 Unsung Cannabis Strains Worth Discovering",
            "urlslug": "/news/strains-products/11-underrated-marijuana-strains"
        },
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1506976615000)/",
            "id": "contentitems-43694",
            "text": "Dating back to the 18th century, bluegrass sits at the intersection of traditional Scottish, Irish, and English folk music. Settlers brought their ballads, dance music, and fiddles to the Appalachian Mountains in North America, where their individual melodies mixed together to create an uplifting sound that has been passed down from musician to musician for generations.\n\nBluegrass may be a cousin to folk, traditional, and Americana music, but at its heart it exists as one of the most distinct and noteworthy individual genres of our time. It is music that weaves stories and moves the soul—it’s a rich and colorful genre that can excite and invigorate the senses, especially with a little cannabis nearby.\nBelow, explore five bluegrass bands with your favorite pre-roll in hand—preferably on a rocking chair, soaking in the soulful tunes.\nLaws of Gravity by The Infamous Stringdusters\n\nStrain Pairing Recommendation: Tangilope\nThe Infamous Stringdusters’ latest album, Laws of Gravity, wastes no time as it bursts into life with their first track, “Freedom,” instantly immersing listeners in a rich and invigorating sound. The album, released this year, packs a powerful punch that is vibrant, complex and uniquely its own.\nLaws of Gravity manages to encapsulate the traditions of bluegrass while merging it with modern grooves and instrumentation. The bright movements of Jeremy Garrett’s fiddle and Chris Pandolfi’s banjo sing across the soundscape of bass, dobro, and guitar for a symphony that shines with and without the engaging and lively lyrics.\nWhen the lyrics do fade away, listeners enjoy the intricate improvisational jamming that is a hallmark of The Infamous Stringdusters. Laws of Gravity has a life of its own that proves once again why the band continues to be a resounding favorite across the genre’s fanbase.\nThe Muscle Shoals Recordings by The Steeldrivers\n\nStrain Pairing Recommendation: Blueberry Headband\nThe Muscle Shoals Recordings starts with light, happy banjo on the track “Long Way Down,” setting the tone for an album that combines the essence of bluegrass with rich complexity. Gary Nichols’ distinct and powerful voice, often accompanied by beautiful backing vocals, cruises effortlessly across the instrumentation and inspires with its authenticity and depth.\nThe Steeldrivers feature banjo, mandolin, guitar, bass, and fiddle for a full and delightfully classic bluegrass feel. The Muscle Shoals Recordings, produced in 2015, is the band’s fourth album and earned them a Grammy in the Best Bluegrass category.\nFrom the first track to the last, this is a spirited album that uplifts the mind and moves the body with energetic sound.\n\nThief by Keller & The Keels\n\nStrain Pairing Recommendation: Lodi Dodi\nWith a distinctly joyful beat, Thief picks you up and whisks you off into a dance of folky bluegrass with Keller William’s playful vocals leading the way. Williams is joined by Jenny Keel on upright bass and flat picker Larry Keel. Together, the three bring a decidedly full sound to their latest acoustic album.\nKeller & The Keels have never shied away from creative covers, and Thief, released in 2010, is no exception. Unlike their first album, Grass (released in 2006), Thief does not feature any original songs, focusing solely on covers. The album’s title is an ode to this decision.\nBluegrass versions of Amy Winehouse’s “Rehab” and Marcy Playground’s “Sex and Candy” are among the familiar but undeniably fresh covers. The tracks allow the listener to immediately jump in and sing along while still being immersed in new tunes and feelings.\nWilliams’ knack for composing solo music lends expertise to the composition of his trio, and as such, Thief has an intricacy that is impressive for such a small acoustic group.\nFriends of Fall by Crooked Still\n\nStrain Pairing Recommendation: Lemon Drop\nCrooked Still offers a unique bluegrass element that is light, airy, and melodic. Lead singer Aoife O’Donovan’s voice carries across the backdrop of banjo, bass, cello, and fiddle like a shooting star.\nFriends of Fall, released in 2011, brings an ethereal beauty and complexity to the genre of bluegrass. Songs such as “Pretty Bird” will stir emotion, while “It’ll End Too Soon” inspires and invigorates. Often described as ‘progressive bluegrass’ due to innovative acoustics, Crooked Still’s high-energy sound encourages engagement from the first note to the last thanks to its unique instrumentation.\nFriends of Fall is refreshing and wholly uplifting, carrying the spirit of bluegrass as it soars to new and delightful heights.\n\nLove. Ain’t Love  by Yonder Mountain String Band\n\nStrain Pairing Recommendation: Afgooey\nLove. Ain’t Love, released this year, is the latest from Yonder Mountain String Band, encompassing a full thirteen tracks of rich and engaging rhythms that will keep you on your toes.\nFeaturing five band members on banjo, bass, fiddle, guitar, and mandolin, Yonder Mountain String Band also has the distinction of all five members acting as vocalists, which allows them to create beautifully layered and rich harmonies.\nOn the other hand, Love. Ain’t Love does not shy away from fully instrumental tracks, such as “Fall Outta Line,” which showcases the band’s innovation in its tune. This ability to embrace the full merits of their instrumentation has won YMSB fans across various genres, including those in the jam band scene. When listening to Love. Ain’t Love, one can get lost in the music as it paints stories with and without lyrics.\nLove. Ain’t Love provides a playful, energetic, and creative soundscape. The passion and vibrancy in every note of the album act as joyful reminders that Yonder Mountain String Band continues to inspire and be inspired by bluegrass, even 18 years after the release of their first album.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/10/02124702/bluegrass-albums-while-high.jpg",
            "title": "5 Bold Bluegrass Albums to Listen to While High",
            "urlslug": "/news/lifestyle/bluegrass-albums-listen-high"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Bipolar Disorder",
            "score": 15.497076023391813
        },
        {
            "name": "Migraines",
            "score": 13.157894736842104
        },
        {
            "name": "Anxiety",
            "score": 4.5321637426900585
        },
        {
            "name": "ADD/ADHD",
            "score": 3.654970760233918
        },
        {
            "name": "Fibromyalgia",
            "score": 3.435672514619883
        }
    ],
    "description": "<p>Lodi Dodi is a <a href=\"http://www.leafly.com/explore/category-sativa\">sativa</a>-dominant <a href=\"http://www.leafly.com/explore/category-hybrid\">hybrid</a> popular in Washington State. Exclusively bred by The Clone Zone, the genetic heritage of Lodi Dodi is undefined and closely guarded. Lodi Dodi carries a <a href=\"http://www.leafly.com/explore/flavors-sweet\">sweet</a>, unique flavor of <a href=\"http://www.leafly.com/explore/flavors-tropical\">tropical</a> <a href=\"http://www.leafly.com/explore/flavors-tree-fruit\">fruit</a> and fresh <a href=\"http://www.leafly.com/explore/flavors-flowery\">wildflowers</a>. The <a href=\"http://www.leafly.com/explore/flavors-pungent\">pungent</a> aroma leads the way towards a cerebral buzz, known to spark <a href=\"http://www.leafly.com/explore/tags-creative\">creativity</a> and a boost of <a href=\"http://www.leafly.com/explore/tags-energetic\">energy</a> that will turn any task into a more enjoyable adventure.</p>\n",
    "descriptionPlain": "Lodi Dodi is a sativa-dominant hybrid popular in Washington State. Exclusively bred by The Clone Zone, the genetic heritage of Lodi Dodi is undefined and closely guarded. Lodi Dodi carries a sweet, unique flavor of tropical fruit and fresh wildflowers. The pungent aroma leads the way towards a cerebral buzz, known to spark creativity and a boost of energy that will turn any task into a more enjoyable adventure.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 88.1578947368421
        },
        {
            "name": "Euphoric",
            "score": 82.52923976608187
        },
        {
            "name": "Relaxed",
            "score": 65.93567251461988
        },
        {
            "name": "Uplifted",
            "score": 44.225146198830416
        },
        {
            "name": "Focused",
            "score": 44.22514619883041
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 27.63157894736842
        },
        {
            "name": "Flowery",
            "score": 19.66374269005848
        },
        {
            "name": "Berry",
            "score": 18.494152046783626
        },
        {
            "name": "Earthy",
            "score": 16.812865497076025
        },
        {
            "name": "Mint",
            "score": 12.719298245614034
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png",
            "id": 1411132,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I picked up an 8th of Lodi Dodi outside Crater Lake NP.  Having never heard of this strain my bud tender informed me it was from Washington and that's about all the shop knew.  The scent of flowers, and citrus is really what drew me in.  This is a very sativa dominant strain.  The effects remind me of Sour D.  It's a very energetic, uplifting high.  It'd be easy to get lost surfing the web while using this strain.  All in all, I believe any sativa lover could appreciate this strain.",
            "username": "BrettKBG"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/UYCWImboUJzHnrUOAuqmaKlIGhU=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2fQQoEvJBz5OzfjyLTsfaYZqHsmnM%3d%2f120x120%2fhttps%253A%252F%252Fddd33q3967xhi.cloudfront.net%252Fl8-hAbQhRlHyZFxr3k0c6m9q2cQ%253D%252F120x120%252Fhttps%25253A%25252F%25252Fddd33q3967xhi.cloudfront.net%25252Fb2T9NZ_MrQoVuMvJLGbaG5zrIP8%25253D%25252F120x120%25252Fhttps%2525253A%2525252F%2525252Fs3.amazonaws.com%2525252Fleafly%2525252Fbin%2525252FwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1631004,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This was a fun high. Time got distorted, everything was really funny and sex was amazing. Experienced a little dizziness, but not enough to ruin it.",
            "username": "ChillinOnEndor"
        }
    ],
    "id": 167824,
    "name": "Lodi Dodi",
    "negatives": [
        {
            "name": "Dizzy",
            "score": 13.596491228070175
        },
        {
            "name": "Headache",
            "score": 11.11111111111111
        },
        {
            "name": "Dry Eyes",
            "score": 7.090643274853801
        },
        {
            "name": "Dry Mouth",
            "score": 5.190058479532164
        },
        {
            "name": "Anxious",
            "score": 3.435672514619883
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/hybrid/lodi-dodi",
    "photoTotalCount": 11,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/lodi-dodi/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/lodi-dodi/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/661103/b/lodi-dodi__primary_867a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/lodi-dodi_100x100_8db9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/610762/b/lodi-dodi__primary_3536.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/lodi-dodi_100x100_fe8b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/598098/b/lodi-dodi__primary_14e6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/lodi-dodi_100x100_32d6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/563123/b/lodi-dodi__primary_c462.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/lodi-dodi_100x100_4d94.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/508395/b/lodi-dodi__primary_5da6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/lodi-dodi_100x100_dbe9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506101/b/lodi-dodi__primary_5747.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/lodi-dodi_100x100_9fad.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Eugene, OR",
        "Spokane, WA",
        "Everett, WA",
        "Lynnwood, WA",
        "Portland, OR",
        "Bellingham, WA",
        "Bothell, WA",
        "Kirkland, WA",
        "Mount Vernon, WA"
    ],
    "rating": 4.55,
    "relatedStrains": [],
    "reviewCount": 109,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "lodi-dodi",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.55045871559633/240",
    "subtitle": null,
    "symbol": "Lod",
    "symptoms": [
        {
            "name": "Stress",
            "score": 44.152046783625735
        },
        {
            "name": "Depression",
            "score": 33.406432748538016
        },
        {
            "name": "Headaches",
            "score": 18.713450292397663
        },
        {
            "name": "Fatigue",
            "score": 16.374269005847953
        },
        {
            "name": "Insomnia",
            "score": 12.719298245614034
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
