{
    "aka": "God's Crack, God Crack, GodCrack",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1484957722000)/",
            "id": "contentitems-16353",
            "text": "Every year we like to look back and recognize the rising stars of the cannabis world. Last year, GG4 (f.k.a Gorilla Glue #4), Critical Kush, Candyland, and ACDC were among the fastest trending strains according to Leafly user strain reviews, but which strains stood out from the crowd this year?\nTo eliminate outliers that might skew the results, we restricted our search to the top 200 ranking strains of 2016. These strains tend to be more available nationwide, and we hope you’re able to find them in your area!\nBudtenders and inventory managers – are these trending strains on your menu? If not, consider keeping an eye out for them. Because in 2016, they were flying off the shelves fast.\n\n#10. Blue Cookies\n\nWe all know that customers swarm around anything containing the word “Cookies,” thanks to the Girl Scout Cookie hype. But what makes Blue Cookies stand out from the many, many other Cookie crosses? The addition of Blueberry indica genetics, of course.\n#9. Birthday Cake Kush\n\nAnother decadent GSC (f.k.a Girl Scout Cookies) cross, Birthday Cake Kush also pulls in genetics from Cherry Pie to achieve a dessert-like taste that’s not altogether unlike cake itself. It may not be your birthday, but the luxurious and relaxing qualities of this potent hybrid are certainly something to celebrate.\n#8. Sour Tangie\n\nThe citrus-loaded sativa strain Tangie can’t possibly be improved. Or can it? DNA Genetics has done it again, spinning their Tangie masterpiece with the help of East Coast Sour Diesel genetics. Sour Tangie improves the fuel-like taste of Sour Diesel without compromising Sour D’s high-flying creative effects, making this sativa a must-have for flavor enthusiasts and artists alike.\n#7. Purple Candy\n\nPurple Candy blossomed in British Columbia, Canada. Believed to be a cross between BC Sweet Tooth and Mendocino Purps, it’s as sticky and sweet as grape hard candy. But you won’t feel a sugar rush with this indica; instead, expect the heavy-hitter to prime you for bedtime or a solid nap.\n#6. Quantum Kush\n\nA good sativa can lend a positive spark to an otherwise dreary day of chores, so it’s no wonder that Quantum Kush tipped the charts in 2016 as one of the fastest trending sativa strains. While some sativas bring on the buzz with a bit too much gusto, resulting in anxiety and paranoia, Quantum Kush manages to deliver creative, talkative, giggly qualities without what we like to call “The Fear.”\n#5. God’s Green Crack\n\nWho knew the not-so holy union of God Bud and Green Crack would result in something so heavenly? God Bud is known for producing mammoth yields of gargantuan buds, but the effects are a little heavy-handed for some. That’s why Jordan of the Islands crossbred God Bud with Green Crack, the high-flying sativa strain that focuses all of its effort on elevating the mind to a place where laughing fits are inevitable.\n#4. Gelato\n\nA new generation of GSC (f.k.a Girl Scout Cookies) has arrived, and its name is Gelato. From the same breeders that delivered fan favorites Sunset Sherbet and GSC (f.k.a Girl Scout Cookies), Cookie Fam Genetics from Bay Area, California isn’t finished with their royal line quite yet. Gelato, a descendent of Sunset Sherbet and Thin Mint GSC (f.k.a Girl Scout Cookies), blooms in bright colors that are almost as inviting as its tantalizing dessert-like aroma.\n#3. Grape Stomper\n\nGrape Stomper isn’t a new strain, but a jump in Leafly reviews will show that not all good things are sparkly and new. Strong genetics inherited from Purple Elephant and Chemdawg Sour Diesel equip this strain with the full package: flavor, potency, and consistency. Relaxing without encumbering social skills, the balanced Grape Stomper is an excellent choice for so many different activities. No wonder its popularity isn’t waning.\n#2. Nuken\n\nNuken is also an older strain making a comeback. Originally found in Canada, it’s since proliferated throughout the Pacific Northwest to states like Washington and Oregon. Herbal and sweet in flavor, Nuken cradles you in a blanket of dreamy euphoria where your thoughts can float upward to bliss.\n#1. Superglue\n\nLast year, the top trending strain was GG4 (f.k.a Gorilla Glue #4). This year it’s Superglue, which surprisingly bears no family ties to last year’s champ. A cross between Northern Lights and Afghani, Superglue develops a thick coat of sticky resin that will quite literally glue your fingers together. Though its parentage may lead you to believe Superglue will be a knockout, this strain is bred to deliver more light-footed effects. In fact, Leafly users have described this strain as focusing and creative while simultaneously relaxing the body.\n\nWhat was your favorite strain of 2016? We want to hear from you! Leave your most memorable cannabis varieties in the strain section below.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/20115737/cannabis-flower-up-close.jpg",
            "title": "The Top Trending Cannabis Strains of 2016",
            "urlslug": "/news/strains-products/top-trending-cannabis-strains-2016"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1434740400000)/",
            "id": "contentitems-3309",
            "text": "We have some new strains in the database that need your reviews! From the west coast to the U.S.'s northeastern tip, these recent additions span the geographic spectrum. Check out all the other newly added strains in our Explorer and leave a review for those that you've tried!\n \n   1. God's Green Crack\n\nGod’s Green Crack is a balanced hybrid strain bred by Jordan of the Islands, who wanted to lighten up the heavy effects of God’s Gift with a high-flying Green Crack sativa. The indica and sativa parents work together to deliver a duality of head and body effects that lift the mood while relaxing muscles. Its buds take on a deep purple coloration toward the end of its maturation, especially when raised in lower temperatures.\n\n \n   2. Hawaiian Dream\n\nHawaiian Dream is an uplifting sativa strain that crosses Blue Dream with a Hawaiian variety. Though some renditions of this strain have a THC-dominant chemical profile, Hawaiian Dream is best known for its high CBD content which is often twice as abundant as its THC. Patients look to this high-CBD sativa to remedy pain, inflammation, and anxiety without physical heaviness or a foggy head.\n\n \n   3. Maui Bubble Gift\n\nMaui Bubble Gift is an indica-dominant hybrid strain whose known parent strains include Bubble Gum and a Maui Waui/God’s Gift hybrid. This strain’s CBD content often outweighs its THC levels, making it a great match for consumers with pain, anxiety, and inflammation. With only mildly psychoactive effects, Maui Bubble Gift delivers its soothing relief alongside an earthy, floral aroma.\n\n \n   4. Blue Afghani\n\nBred by Jordan of the Islands in Canada, Blue Afghani is an indica-dominant strain that combines genetics from Blueberry and Afghani. Its stout plants produce dense, resinous buds that fill your nose with a sweet and spicy berry aroma. Next come the powerful full-body effects that keep you anchored in relaxation while pain, anxiety, and stress float away.\n\n \n   5. Predator Pink\n\nA cross between Plushberry and Starfighter, Predator Pink by Exotic Genetix is a 60/40 indica-dominant hybrid with a tropical candy flavor. Though less common than its green counterpart, some phenotypes express themselves in pastel pink and fuchsia hues. Beginning with a lift of the spirit and buzzing cerebral energy, Predator Pink’s effects eventually make their descent into meditative relaxation.\n\n \n   6. Mother of Berries\n\nMother of Berries, or M.O.B., is an indica strain from Maine that provides a deeply relaxing experience that transitions well into restful sleep. Carrying the legacy of its Blueberry parent, Mother of Berries lives up to its name with its unmistakable blueberry fragrance. Its chunky buds are wreathed in interweaving hues of purple and green, which are obscured under a dense blanket of crystal trichomes. With effects that are more mellow than jarring, Mother of Berries is suitable for both novice and seasoned consumers alike.\n\n \n   7. Eugene Cream\n\nEugene Cream is an indica-dominant strain grown by Drift Away Farm. Named for its light color and smooth smoke, Eugene Cream inherits its characteristics from a Hash Plant/Big Bud hybrid and a female plant called Queen. Several years of selective breeding gave rise to the stable phenotype that now circulates the Oregon market.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/06/12002152/new-strains-alert-hawaiian-dream-blue-afghani-maui-bubble-gift-go.png",
            "title": "New Strains Alert: Hawaiian Dream, Blue Afghani, Maui Bubble Gift, God's Green Crack, and More",
            "urlslug": "/news/strains-products/new-strains-alert-hawaiian-dream-blue-afghani-maui-bubble-gift-go"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 34.60362156772924
        },
        {
            "name": "Migraines",
            "score": 19.563381926293193
        },
        {
            "name": "ADD/ADHD",
            "score": 14.921676412204825
        },
        {
            "name": "Bipolar Disorder",
            "score": 13.035892323030907
        },
        {
            "name": "PTSD",
            "score": 8.756837595322141
        }
    ],
    "description": "<p>God&rsquo;s Green Crack is a balanced hybrid strain bred by Jordan of the Islands, who wanted to lighten up the heavy effects of <a href=\"https://www.leafly.com/indica/god-bud\">God Bud</a>&nbsp;with a high-flying <a href=\"http://leafly.com/sativa/green-crack\">Green Crack</a> sativa. The indica and sativa parents work together to deliver a duality of head and body effects that lift the mood while relaxing muscles. Its buds take on a deep purple coloration toward the end of its maturation, especially when raised in lower temperatures.&nbsp;</p>\n",
    "descriptionPlain": "God&rsquo;s Green Crack is a balanced hybrid strain bred by Jordan of the Islands, who wanted to lighten up the heavy effects of God Bud&nbsp;with a high-flying Green Crack sativa. The indica and sativa parents work together to deliver a duality of head and body effects that lift the mood while relaxing muscles. Its buds take on a deep purple coloration toward the end of its maturation, especially when raised in lower temperatures.&nbsp;\n",
    "effects": [
        {
            "name": "Energetic",
            "score": 61.61088805655106
        },
        {
            "name": "Happy",
            "score": 61.5080434372558
        },
        {
            "name": "Euphoric",
            "score": 60.51934287228404
        },
        {
            "name": "Uplifted",
            "score": 50.38061491202069
        },
        {
            "name": "Hungry",
            "score": 50.31167757987299
        }
    ],
    "flavors": [
        {
            "name": "Pungent",
            "score": 16.303566777146038
        },
        {
            "name": "Earthy",
            "score": 16.059479219997662
        },
        {
            "name": "Lemon",
            "score": 14.921676412204825
        },
        {
            "name": "Woody",
            "score": 13.547645352231592
        },
        {
            "name": "Sweet",
            "score": 12.509318890176317
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1398415,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "this strain is very potent. and is good for stress, anxiety, depression, relaxation, pain and sleep. \n\nNOT FOR THE FAINT OF HEART! \n\nbut it is amazing. whole body feels relaxed when laying or sitting down on your own, very giggly and trippy when with friends. it even had me hallucinating! was walking home, couldn't figure out why it seemed like I wasn't getting any closer to the top of the hill, then found out I was just standing there stomping my feet thinking I was walking! \n\nthe flavor is great. very rich and buttery. really nice smell to it also, sweet and kind of citrus. \n\nwould totally recommend this to anyone who has troubles relaxing or sleeping. also very fun to lighten the mood! :) makes you feel really happy and giggly when with people. on your own it will just knock you on your butt :p\n\nIT IS AWESOME! ",
            "username": "lyt3w8"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ayCY0eiNiw9wx27LrBfVwEot774=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2f0eG5hLhska8kf11E1bag-lhkotQ%3d%2f120x120%2fhttps%253A%252F%252Fs3-us-west-2.amazonaws.com%252Fleafly-images%252Fuser-profile%252F3bUm9HeNRdqOXL6RM3WK_4F04EC12-33E3-4AEA-B7A6-9D90B815D3D9.jpeg",
            "id": 1637571,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I love this strain for day or evening use, it brings a sense of peace and relaxation, focus, creativity, motivation, and many more positive effects. I enjoy it particularly for horseback riding, I find I ride better and more effectively.",
            "username": "Supra97"
        }
    ],
    "id": 166383,
    "name": "God's Green Crack",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 30.103158991493988
        },
        {
            "name": "Anxious",
            "score": 16.303566777146038
        },
        {
            "name": "Dizzy",
            "score": 15.062919350057932
        },
        {
            "name": "Headache",
            "score": 8.646133671058895
        },
        {
            "name": "Paranoid",
            "score": 6.000916170407696
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/green-crack",
            "category": "Sativa",
            "name": "Green Crack",
            "permalink": "https://mobileapi.leafly.com/sativa/green-crack",
            "slug": "green-crack",
            "subtitle": null,
            "symbol": "Gc"
        },
        {
            "applink": "leafly://strain/god-bud",
            "category": "Indica",
            "name": "God Bud",
            "permalink": "https://mobileapi.leafly.com/indica/god-bud",
            "slug": "god-bud",
            "subtitle": null,
            "symbol": "Gbd"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/gods-green-crack",
    "photoTotalCount": 35,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001755/b/god-s-green-crack__primary_d768.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/god-s-green-crack_100x100_28c7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000815/b/god-s-green-crack__primary_6a06.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/god-s-green-crack_100x100_bf8f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000542/b/god-s-green-crack__primary_55f0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/god-s-green-crack_100x100_93c4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/664688/b/god-s-green-crack__primary_2d7c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/god-s-green-crack_100x100_03e7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646420/b/god-s-green-crack__primary_fd81.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/god-s-green-crack_100x100_cee0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/637872/b/god-s-green-crack__primary_12ef.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/god-s-green-crack_100x100_33fc.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Vancouver, BC",
        "Toronto, ON",
        "Calgary, AB",
        "Montréal, QC",
        "Edmonton, AB",
        "Winnipeg, MB",
        "Ottawa, ON",
        "Hamilton, ON",
        "Saskatoon, SK",
        "Halifax, NS"
    ],
    "rating": 4.49,
    "relatedStrains": [],
    "reviewCount": 185,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "gods-green-crack",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.48648648648649/240",
    "subtitle": null,
    "symbol": "Ggc",
    "symptoms": [
        {
            "name": "Stress",
            "score": 49.445133069260685
        },
        {
            "name": "Depression",
            "score": 47.670052904350015
        },
        {
            "name": "Pain",
            "score": 33.87831999497004
        },
        {
            "name": "Insomnia",
            "score": 22.861595393998186
        },
        {
            "name": "Headaches",
            "score": 22.60964853188183
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
