{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1500942707000)/",
            "id": "contentitems-34817",
            "text": "Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg",
            "title": "5 Rustic Americana Albums to Listen to While High",
            "urlslug": "/news/lifestyle/americana-albums-listen-high"
        },
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1467413520000)/",
            "id": "contentitems-3265",
            "text": "This week’s New Strains Alert is for all my dawgs running wild all over the world. This pack of feral beasts trots the Chemdawg continuum and marks its territory with the chemical essence the genetic parentage is known for. We've also added Trash, Moonwalker Kush, and Ridge Berry to give these hounds a few activities to get into. Round up your dawgs and spark up — these strains are howlers!\n \n  1. Dawgfather OG\n\nDawgfather OG, or simply “The Dawgfather,” is an indica-dominant hybrid created by AlphaKronik Genes capable of massive plant production and a healthier-than-average yield. With potency floating above 20%, this strain contends well with chronic pain, insomnia, Crohn's, and anxiety. Expect traditional notes of gas/chemicals, Kush, and some funkiness. Dawgfather OG offers a strong buzz with nuance worth exploring.\n\n \n  2. Bloodhound\n\nBloodhound is the obscure cross of Huckleberry Hound and Guard Dawg (by RedEyed Genetics). This genetic coupling was motivated by the desire to preserve the beautiful foliage and tartness of Huckleberry Hound while co-opting Guard Dawg’s potency. With a decent yield and THC percentage upwards of 24%, this strain smells of tart fruit intermixed with an earthy chocolate fondue flavor.\n\n \n  3. Huckleberry Hound\n\nHuckleberry Hound is an obscure hybrid that has alleged roots in Blueberry and Chemdawg families. With notes of berry intermixed with a palatable melange of chemicals, this flower's bouquet is challenging but worthwhile. Expect airy body effects that take on more weight with time and cerebral effects that remind many of a href=\"https://www.leafly.com/sativa/sour-diesel\" >Sour Diesel’s type of mental stimuli. Most Chemdawg lineage is potent, so be aware, as this strain is a howler.\n\n \n  4. Guard Dawg\n\nGuard Dawg is an indica-dominant phenotype bred by RedEyed Genetics. This flower’s genetic parentage is a combination of Abusive OG and TreStardawg. The plant smells of its OG heritage with overtones of caramel and coffee bean. But watch out! This strain packs a wallop and is recommended for nighttime use only.\n\n \n  5. Moonwalker Kush\n\nMoonwalker Kush is a balanced indica-dominant hybrid that is the genetic cross of Triple OG and Tahoe Alien. This odoriferous combination speaks volumes through its scent, which is thick with soured earth and a hint of pepper on the finish. The herbaceous terpene profile aligns nicely with this strain’s intense relaxation and moderate cerebral effects. Try Moonwalker Kush after dark to harness the sedative effects nestled below layers of trichomes and brown pistils.\n\n \n  6. Ridge Berry\n\nRidge Berry by Marley Natural is a succulent and stimulating sativa-dominant strain that imbues the consumer with energy right away, but leans back into alert sedation over time. The latent indica parentage consists of Chem’s Sister and Sour Dubble, and shows up as a warm airy sensation in the body, making this strain ideal for pain management. Ridge Berry's crystalline buds smell of pine, berry, and a touch of fuel.\n\n \n  7. Trash\n\nTrash is an indica-dominant hybrid that is anything but garbage. This strain crosses Purple Trainwreck against Afghani Hash Plant, blending the mental alertness of Trainwreck with the resin production and deep, earthy aroma native to Afghani genetics. Trash is an ideal smoke for long bouts of video games or other stationary activities. These effects also lend themselves to patients suffering from chronic pain and nausea.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12002045/new-strains-alert-dawgfather-og-bloodhound-moonwalker-kush-and-mo.jpg",
            "title": "New Strains Alert: Dawgfather OG, Bloodhound, Moonwalker Kush, and More",
            "urlslug": "/news/strains-products/new-strains-alert-dawgfather-og-bloodhound-moonwalker-kush-and-mo"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 28.159340659340657
        },
        {
            "name": "ADD/ADHD",
            "score": 16.689560439560438
        },
        {
            "name": "PTSD",
            "score": 9.386446886446887
        },
        {
            "name": "Spinal Cord Injury",
            "score": 4.212454212454212
        },
        {
            "name": "Tinnitus",
            "score": 3.571428571428571
        }
    ],
    "description": "<p>The origins and genetics of Huckleberry are under debate, but there is no disputing the strain&rsquo;s unmistakable berry aroma. The flower is compact, light green in color, and generally covered in orange hairs. Huckleberry plants have a flowering time of 8-9 weeks and produce average yields. They might be a bit tricky for the novice grower. The effects of this strain are on the milder side and largely reported as relaxing, cutting through stress without the cloudiness. Undoubtedly, this strain is best known for its intense fruity smell and taste, similar to its relative <a href=\"http://www.leafly.com/hybrid/blueberry\" style=\"text-decoration:none;\">Blueberry</a>.</p>\n",
    "descriptionPlain": "The origins and genetics of Huckleberry are under debate, but there is no disputing the strain&rsquo;s unmistakable berry aroma. The flower is compact, light green in color, and generally covered in orange hairs. Huckleberry plants have a flowering time of 8-9 weeks and produce average yields. They might be a bit tricky for the novice grower. The effects of this strain are on the milder side and largely reported as relaxing, cutting through stress without the cloudiness. Undoubtedly, this strain is best known for its intense fruity smell and taste, similar to its relative Blueberry.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 62.866300366300365
        },
        {
            "name": "Relaxed",
            "score": 55.883699633699635
        },
        {
            "name": "Euphoric",
            "score": 51.991758241758234
        },
        {
            "name": "Creative",
            "score": 41.16300366300366
        },
        {
            "name": "Uplifted",
            "score": 36.74450549450549
        }
    ],
    "flavors": [
        {
            "name": "Berry",
            "score": 67.76556776556777
        },
        {
            "name": "Sweet",
            "score": 41.483516483516475
        },
        {
            "name": "Earthy",
            "score": 19.78021978021978
        },
        {
            "name": "Strawberry",
            "score": 14.445970695970695
        },
        {
            "name": "Flowery",
            "score": 12.156593406593405
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1415625,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I saw Huckleberry in the clinic a couple days ago and after smelling and looking at it decided it would be the next strain that i would try. The smell was very unique berry scent that explodes out into your nose when you put your nose to the jar, the smell for some reason went very well with the name 'huckleberry'. Then I got home and rolled a joint and packed a few bowls. I expected, especially since the nugs were very fresh, that the smoke wouldve been smooth. However this nug is highly resinous and had very harsh smoke, especially from the joint. You only need to take small hits from this to get full effects that you would experience from similar quality nugs. Overall i give this strain a 9/10, the high is unique and is more euphoric than most nugs especially most kush, it makes it easy to sleep but enjoyable to stay awake on and do any recreational activity with. The smell/taste are phenominal so unique and tasty. I recommend that everyone try this nug atleast once. Stay Lifted all ",
            "username": "DaFawk"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1624598,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I'm really diggin this strain!!!...besides being a beautiful flower, it helped with back pain and kept me up and on the move at\n work!!!\n",
            "username": "Oakesy110"
        }
    ],
    "id": 566,
    "name": "Huckleberry",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 19.574175824175825
        },
        {
            "name": "Dry Eyes",
            "score": 11.309523809523808
        },
        {
            "name": "Dizzy",
            "score": 5.173992673992673
        },
        {
            "name": "Paranoid",
            "score": 4.532967032967033
        },
        {
            "name": "Headache",
            "score": 1.282051282051282
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/hybrid/huckleberry",
    "photoTotalCount": 24,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002591/b/huckleberry__primary_57ce.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/huckleberry_100x100_7252.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/614130/b/huckleberry__primary_dc96.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/huckleberry_100x100_567e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/569772/b/huckleberry__primary_c1d4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/huckleberry_100x100_9d5e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/504249/b/huckleberry__primary_a1ed.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/huckleberry_100x100_fd1d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/482476/b/huckleberry__primary_9823.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/huckleberry_100x100_203a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/479958/b/huckleberry__primary_2ad6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/huckleberry_100x100_715d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Spokane, WA",
        "Eugene, OR",
        "Everett, WA",
        "Seattle, WA",
        "Bend, OR",
        "Lynnwood, WA",
        "Bellingham, WA",
        "Calgary, AB",
        "Chicago, IL"
    ],
    "rating": 4.23,
    "relatedStrains": [],
    "reviewCount": 133,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "huckleberry",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.22556390977444/240",
    "subtitle": null,
    "symbol": "Huc",
    "symptoms": [
        {
            "name": "Pain",
            "score": 46.65750915750915
        },
        {
            "name": "Stress",
            "score": 37.54578754578755
        },
        {
            "name": "Depression",
            "score": 33.539377289377285
        },
        {
            "name": "Headaches",
            "score": 6.295787545787546
        },
        {
            "name": "Nausea",
            "score": 6.135531135531135
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
