{
    "aka": "BlackJack",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1465142400000)/",
            "id": "contentitems-3073",
            "text": "The fortitude demonstrated by cancer patients and survivors is truly remarkable. With numerous reviewers on Leafly using cannabis to combat the effects of various types of cancer, chemotherapy, and related medications, we’re constantly inspired by the positivity, bravery and determination that shines through their stories.\nWe honor these individuals by sharing a small sampling of the strains that have helped cancer patients deal with the physical, emotional, and psychological effects of their condition as they fight toward joining the ranks of hundreds of thousands of cancer survivors across the nation and around the world.\n\n AK-48\n“AK-48 has helped me in so many ways with respect to my cancer. My appetite has resumed as normal, I sleep GREAT, less depression, moments of bliss, less pain and increased level of hope for survival. It is, without a doubt, my personal favorite.” –Good-juju\n Ingrid\n“The first strain I tried for chemotherapy-induced nausea, vomiting and lack of appetite. After first use I went from nearly heaving at the thought of any food to craving – and eating – Mexican food (peppers and all).” –gobby\n ACDC\n“No brain fog, no paranoia, and doesn’t make me want to eat all of the things. I am in remission from cancer and this helps with remaining painful side effects.” –kamina\n Harlequin\n“This is, by far, one of my favorite medicinal strains…there is a complimentary THC content and effect that I find helpful as opposed to purely CBD strains. Mix it with some Sour Diesel (not enough to kill the CBD effects), vape away, and it’s my ‘morning coffee’ when on chemo.” –bravo2kilo\n Blueberry Kush\n“Every time I get this strain, I specifically save it for my friend with cancer. She says it’s her favorite for the pain.” –HebiMidori\n\n Flo\n“My left breast was diagnosed a couple months ago with breast cancer. Flo has me feeling better than I have in the two months…my body is relaxed. I did not realize how much tension I have been holding. The future looks better and easier at the moment. Wow.” –dataqueen11\n Mr. Nice\n“Using this for my back pain and for my golden retriever who has cancer. Works great for both of us!” –dyeager105\n Jack the Ripper\n“Absolutely fantastic sativa! One of the best strains I’ve had in the past 10 years. The high THC content will knock your socks off and the high lasts for 3-4 hours solid. I have brain cancer so I deal with different health issues…and this strain works extremely well controlling pain, nausea, and vertigo.” –jfu5129\n Blueberry\n“Super relaxing, pain relieving, joyful, floaty. I am a cancer survivor, have fibro, serious anxiety, and advanced degenerative disc disease and 17 herniated discs in my spine paired with scoliosis, and I feel like a carefree kid.” –DabaDharma\n \n Chemo\n“My mom is going through chemotherapy…She suffers from extreme appetite loss, nausea and abdominal discomfort from the chemotherapy. She says this strain is incredible for nausea, probably the best she has ever used and induced a great appetite for her instantly. I haven’t seen her in that much relief regarding nausea in ages.” –rachels95\n Black Jack\n“This strain has been like a little miracle in my life. Cancer treatment related pain keeps me from sleeping most nights. I literally was pain free for the entire evening allowing me to finally sleep for the first time in weeks. I’m grateful for Black Jack!!!” –karmagirl\n Sour Diesel\n“I love this strain a lot. I find myself in my own little creative world, giggling, always forgetting what I was doing then remembering…zoning out to music by Soundgarden (“Black Hole Sun”)…I always smoke with my dad because he gets real funny when he’s medicated. He has cancer so it’s better seeing him happy then depressed and in pain. Speaking of, I think he is lost in the kitchen wondering about which entrée he should devour next. I’m gonna go stop him before he eats us out of house and home, or most likely, I will end up eating a tub of ice cream along side him.” –Thecode007",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001531/celebrate-cancer-survivors-day-with-real-patients-go-to-strains.jpg",
            "title": "These Cancer Survivors Share Their Preferred Cannabis Strains",
            "urlslug": "/news/strains-products/celebrate-cancer-survivors-day-with-real-patients-go-to-strains"
        },
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1417186800000)/",
            "id": "contentitems-3039",
            "text": "Black Friday is here! For most it signals flash sales, holiday hysteria, and American consumerism at its finest. It serves as the official kick off to the holiday spending season, with retailers preparing all year for the sales that are designed to bring them out of the red and into the black.\nFor others, like myself, it has become a day of rest, filled with leftover turkey sandwiches, college football, and of course cannabis. So, if you are shopping for the cannabis connoisseur on your holiday list you may be better served giving God’s Gift instead of waiting in the lines at Best Buy.\nWhether you are wrestling for the season’s hottest toy or just for the TV remote, these strains will help you get through Black Friday with a smile on your face.\n Flo\nWhile being funneled through your favorite retail locations all day, you will find it refreshing to just go with the Flo. A great way to start your day, Flo provides a mellow yet energetic lift with an appropriate amount of clarity that will allow you to maintain your rapid purchasing pace.\n Black Diesel\nGas up with Black Diesel. This energetic sativa will fight off the depression of missing out on a deal and help you power through your gift list. Flavors of skunk and citrus mix with an invigorating scent of diesel fuel that will lift you up even when you are running on fumes.\n Black Ice\nAs the weather gets colder, don’t slip! Black Ice crosses two potent parent strains, Black Domina and Ice, to deliver heavy indica dmoninant effects that will knock you off your feet after a grueling day. The relaxing effects are the perfect way to combat the pain of standing in line all day. Black Ice is a calming and sleep-inducing strain that is best saved for the end of your shopping shenanigans.\n Fire OG\nAfter extinguishing all of your energy running from sale to sale, warm yourself up with some Fire OG. It is known for being one of the strongest varieties of OG Kush and will spark relaxing and happy effects that are sure to elevate your holiday spirit. Be careful not to underestimate Fire OG, this potent variety can leave a novice feeling scorched.\n Black Jack\nHit the jackpot with Black Jack. After a day of questionable purchasing decisions, this Jack Herer cross is a perfect solution to elevated stress levels and the fatigue of repetitious credit card swipes.  \n Mr. Nice\nAfter a morning spent dodging the masses of crazed consumers and snarky sales associates, you’ll be relieved to introduce yourself to Mr. Nice. No coaxing or begging to check the stockroom is needed as this strain will be waiting to shower you with its gift of relaxing euphoria. The sweet pungent aroma will turn any sour attitude around and return your holiday cheer. \n Black Diamond\nWe all have loved ones who are impossible to shop for. They tend to be picky and often have expensive tastes. For those finicky friends, Black Diamond might be the answer you’re looking for. After searching high and low for a particular gift, you may be looking to relax that pain in your backside, or maybe you just like the way the glittery trichomes sparkle like gemstones. Either way Black Diamond provides a pungent mix of Blackberry’s sweetness and Diamond OG’s indica effects that are sure to ease your troubles and help you unwind.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/11/12001441/black-friday-strain-survival-guide-7-strains-to-get-you-through.jpg",
            "title": "Black Friday Strain Survival Guide: 7 Strains to Get You through the Madness",
            "urlslug": "/news/strains-products/black-friday-strain-survival-guide-7-strains-to-get-you-through"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 27.13185270307431
        },
        {
            "name": "Arthritis",
            "score": 21.526614902735826
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 14.726394909755927
        },
        {
            "name": "Fibromyalgia",
            "score": 13.442711279335192
        },
        {
            "name": "Hypertension",
            "score": 12.919165994093277
        }
    ],
    "description": "<p>Black Jack is a marijuana strain that produces hard buds with huge, grape-like calyxes that are completely encrusted with THC.&nbsp;The taste&nbsp;is heavy and flavorful and the strain produces exceptionally long-lasting effects. Because of its high THC levels, Black Jack is popular among medical marijuana patients.</p>\n",
    "descriptionPlain": "Black Jack is a marijuana strain that produces hard buds with huge, grape-like calyxes that are completely encrusted with THC.&nbsp;The taste&nbsp;is heavy and flavorful and the strain produces exceptionally long-lasting effects. Because of its high THC levels, Black Jack is popular among medical marijuana patients.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 74.33638804615381
        },
        {
            "name": "Uplifted",
            "score": 54.38974305088232
        },
        {
            "name": "Happy",
            "score": 41.410883839682356
        },
        {
            "name": "Euphoric",
            "score": 41.00991086260052
        },
        {
            "name": "Hungry",
            "score": 36.67583676699748
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 17.391797660115316
        },
        {
            "name": "Pine",
            "score": 12.307422303800468
        },
        {
            "name": "Blueberry",
            "score": 11.843570235665243
        },
        {
            "name": "Citrus",
            "score": 9.869278561639394
        },
        {
            "name": "Spicy/Herbal",
            "score": 9.525315960445976
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 63,
        "growNotes": "",
        "height": null,
        "outdoorFinish": "Early October",
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1417244,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This is by far one of my favorite strains of cannabis of all time. For the entire weight of the flower after trimmed and cured... the sheer wieght of the trichomes account for a large % of the exact weight. It's oder is not changed upon combustion and you exhale the same oderferous flavor that is inhaled and not often is that achived, namely with hybrids. This has a slew of genetics that will dazzle the entire cannabis loving community- consisting of one of the most poweful strains in the world on BOTH sides of its genetics its no wonder where the majority of its power comes from and that mighty strain is Northern lights. You have a doezens of lines of champions Hazes with a touch of the finest skunk#1, afghani SA, a Canadian developed H called the Ortega Hybrid and not the least the strain to make the Haze in the breed shine to a explosive climax... Hashplant is part of the bloodline as well. This is a hybrid in every sense of the word... yet its undeniable that the indica in this creatures blood is strong, the sativa is stronger. Thus couch-lock is staved off yet you have a tranquil and serene effect that leads to defence against snxiety, depression, insomnia, lack of appatite and lack of creativity and ability to enjoy possative experiences. Essentially this strain offers all effects of indica and sativa in a very evenly blended package in every way. Its very strong but very smooth. Its very heavy in it flowering yet not overly dense and this allows for THC to develope in  360 degree platforms instead of just one side of a hard bud such as Stonehenge or T-Rex. So Though not rock hard like many ppl say, it is a triple calyx producer and the CBN is very high as well. Its gift from hashplant but moreso Northern lights... a couple bowl of this and you mise well have smoked a bowl of fine hash. This is a champion among all strains.",
            "username": "Curufinwe420"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png",
            "id": 1642613,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/3/240",
            "text": "My Black Jack was priced bottom shelf so, keep that in mind. Buds were rock hard with amber hairs & a brownish green color. When the smallish buds were broken apart the scent of pine & citrus was released & lots of clear crystal trichomes could be seen. My Indica strain had 17% THC & at once made me happy/uplifted. Followed by body relaxation. Good bang for the $$",
            "username": "1kushking"
        }
    ],
    "id": 342,
    "name": "Black Jack",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 18.68213250105637
        },
        {
            "name": "Dry Eyes",
            "score": 7.500665121052032
        },
        {
            "name": "Anxious",
            "score": 2.882824674090685
        },
        {
            "name": "Headache",
            "score": 2.2015506822241644
        },
        {
            "name": "Dizzy",
            "score": 2.021967998175668
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/black-domina",
            "category": "Indica",
            "name": "Black Domina",
            "permalink": "https://mobileapi.leafly.com/indica/black-domina",
            "slug": "black-domina",
            "subtitle": null,
            "symbol": "Bdm"
        },
        {
            "applink": "leafly://strain/jack-herer",
            "category": "Sativa",
            "name": "Jack Herer",
            "permalink": "https://mobileapi.leafly.com/sativa/jack-herer",
            "slug": "jack-herer",
            "subtitle": null,
            "symbol": "Jh"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/black-jack",
    "photoTotalCount": 82,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000540/b/black-jack__primary_e20c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-jack_100x100_9fe8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/660559/b/black-jack__primary_6c12.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-jack_100x100_23e2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/658449/b/black-jack__primary_7830.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-jack_100x100_f175.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/656814/b/black-jack__primary_b87f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-jack_100x100_5082.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/644842/b/black-jack__primary_f533.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-jack_100x100_25df.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/596811/b/black-jack__primary_3c83.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-jack_100x100_3ff4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Las Vegas, NV",
        "Seattle, WA",
        "Denver, CO",
        "Spokane, WA",
        "Bellingham, WA",
        "Los Angeles, CA",
        "Everett, WA",
        "Reno, NV",
        "San Diego, CA",
        "San Jose, CA"
    ],
    "rating": 4.4,
    "relatedStrains": [],
    "reviewCount": 315,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "black-jack",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.3968253968254/240",
    "subtitle": null,
    "symbol": "Bj",
    "symptoms": [
        {
            "name": "Lack of Appetite",
            "score": 24.803761343388025
        },
        {
            "name": "Pain",
            "score": 24.356397570240134
        },
        {
            "name": "Stress",
            "score": 23.299972948017714
        },
        {
            "name": "Fatigue",
            "score": 18.63445617690655
        },
        {
            "name": "Headaches",
            "score": 17.45814208774232
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
