{
    "aka": null,
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1513710785000)/",
            "id": "contentitems-52310",
            "text": "Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis flower products of 2017. How many have you tried? What was your favorite flower of 2017? Share with us in the comments below!\n\nChocolope by Gabriel\nAvailable in: Washington\nChocolope’s bright and dreamy sativa effects are magnified by the exceptional grow practices laid out in Gabriel’s airtight facilities. Their cultivation rooms are sealed from the outside, offering perfect environmental control that is carefully manipulated to stimulate the growth of the best quality flower.\nAlso featured in:\n\nWhat Are You Smoking? Episode 15\nWashington’s Best Tasting Strains From Fall 2017\n\nKosher Kush by Santa Cruz Veteran’s Alliance\nAvailable in: California\nThe high-THC indica Kosher Kush is the perfect strain to crush symptoms of PTSD, and the Santa Cruz Veteran’s Alliance—owned and operated by military veterans—produces this pain-relieving strain for those suffering. We love that members are offered free cannabis grown by fellow veterans in rooms meant to exude peace as the cannabis flower blooms.\nAlso featured in: The VA Can’t Provide Cannabis to Veterans With PTSD, so This Group Gives It Out for Free\nDutchberry by Artizen\nAvailable in: Washington\nWith around 27% THC to 8% CBD, the cheerful hybrid Dutchberry boasts one of the highest cannabinoid contents of all time. To house such a powerhouse strain, Artizen moves in tandem with their flower from growth to packaging—and delivers some excellent buds. We love that they slow down and take a little time with their cannabis crops from start to finish.\n\nPineapple by Fire Bros.\nAvailable in: Washington\nA Seattle favorite, Fire Bros. works with their own phenotypes to produce the most effective cannabis flower for consumers. For an uplifting hybrid strain such as Pineapple, stress-relieving characteristics are an important facet enhanced by Fire Bros.’ hand-selection process.\nHybrid Blend by Lowell Farms\nAvailable in: California\nLowell Farms, which works exclusively with flower, offers seasonal blends of their best strains, and we can’t get enough of their hybrid pre-rolls. We appreciate that they’re thinking outside the box in focusing on balanced flower mixes rather than strain-specific products. Grown in organic fertilizer free of pesticides, Lowell takes pride in their dedication to all-natural cannabis as well as in providing good wages for their workers.\nAlso featured in: What Are You Smoking? Episode 3\nZkittlez by Royal Choice Farms\nAvailable in: Arizona\nArizona does not require pesticide testing for cannabis, so it’s all the more important to find a grower you can trust. Royal Choice Farms chose to be an all-organic operation built on a whole lot of love and no pesticides. By instating natural grow methods, Royal Choice keeps our minds at ease when we’re lighting up their sweet indica Zkittles.\n\nCBD Blue Shark by Marley Natural Red\nAvailable in: California, Oregon, Washington*\nWith a full cannabis operation dedicated to Jamaica’s rich culture, Marley Natural hits it out of the park with their hand-selected flower line—notably, the anti-inflammatory and CBD-rich hybrid CBD Blue Shark. Cultivated by independent growers, we love Marley Natural’s dedication to craft cannabis, their commitment to sustainable growing practices, and their RISE UP social justice program.\nBlack Cherry Soda by Royal Tree Gardens\nAvailable in: Washington\nHaving built a facility from the ground up, Washington’s Royal Tree Gardens is a company steeped in perseverance. Licensed since 2014, Royal Tree Farms has been producing fantastic cannabis ever since, and their sativa-dominant Black Cherry Soda is no exception. We’ve been packing our bowls with this strain for its potent relief, particularly for the medical patients among us.\nDo-Si-Dos by Matrix NV\nAvailable in: Nevada\nOne of the best in medical-grade cannabis production, Nevada’s Matrix NV keeps their focus on the people who will consume their products, and that’s why we love them. Their flower, including the deliciously heavy indica Do-Si-Dos, is cared for by a team of passionate people who use purified and organic products to cultivate their hand-trimmed flower collection.\nAlso featured in: Leafly TV’s Growers: Episode 101\n\nOrange Blossom by Falcanna\nAvailable in: Washington\nA small medical operation turned Tier III licensed producer, Falcanna has seen it all when comes to cannabis—from the garden to the shop. Their dedication to the herb started as a dream between founders Bethany and Justin Rondeau and turned into a full grow facility delivering exceptional cannabis across Washington State. Their bright, floral hybrid Orange Blossom is as tasty as it is elevating and provides a perfect example of their dedication to quality flower.\nWhite Tahoe Cookies by Archive Portland\nAvailable in: Oregon\nWith multiple awards under their belt, Archive Portland boasts a team of growers with over 35 years of collective cannabis growing experience. That dedication to quality trickles down to the buds, where the exceptional indica White Tahoe Cookies takes on a smooth sedative high that keeps us coming back for more.\nLemonder by Seattle’s Private Reserve\nAvailable in: Washington\nWe save Seattle’s Private Reserve flower for special occasions; grown in a facility that is tightly sealed and meticulously controlled, the euphoric hybrid Lemonder has found its way into our stash boxes and smoke circles throughout 2017. SPR’s rigorous testing of all their cannabis products lets us consume with full peace of mind.\nLead image by Nastasic/iStock\n*Editor’s note: Leafly and Marley Natural are owned by the same parent company. Also, Marley Natural Red is available in California, Oregon, and Washington but may be a different high-CBD strain in each market.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/19103646/leafly-faves-flower.jpg",
            "title": "Leafly’s Faves 2017: Flower",
            "urlslug": "/news/strains-products/leaflys-faves-2017-flower"
        },
        {
            "author": "Leafly Podcasts",
            "category": null,
            "date": "/Date(1504131589000)/",
            "id": "contentitems-39836",
            "text": "What Are You Smoking? features Leafly experts Jeremiah Wilhelm, Bailey Rahn, Will Hyde, and Brett Konen reviewing strains, test-firing products, offering up pro tips, and answering your toughest cannabis questions.\nLeafly Podcast\nWhat Are You Smoking?\nEpisode 007: Testing the WalMart Rosin Press\n\nIn this episode: Will finds some sweet Black Cherry Soda, and the crew put a $299 WalMart rosin press to the test. Also: What happens if you freeze your nugs?\n\nStrains & Products on This Week’s Show\n\nDownload Past Episodes\n\nMeet Your Show Hosts\n\nJeremiah Wilhelm is a strain researcher and subject matter expert at Leafly. A former budtender, Jeremiah is the site’s reigning beard champion and self-proclaimed Office Garden Gnome.\n \nBailey Rahn is an editor at Leafly specializing in cannabis strains and health. When she’s not at Leafly, you’ll likely find her smoking her way up a mountain or playing dress-up with her cats.\n \nWill Hyde is a subject matter expert, strain specialist, and digital producer at Leafly. He spends his free time traveling and exploring creative outlets as a DJ, digital artist, and film producer.\n \nBrett Konen is an editor at Leafly specializing in lifestyle content. She’s fascinated by parallels between alcohol and cannabis, and is very bad at writing while high.\n \nAbout Our Music:\nMusic for “What Are You Smoking” is provided by Lusine. “Ticking Hands” is from his album Sensorimotor. “Two Dots” is from A Certain Distance. For more about Lusine, check out Ghostly.com.\nSpecial musical clip this week from the Brazilian bluegrass band o Bardo e o Banjo.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/30142224/ben-podcast-2.jpg",
            "title": "What Are You Smoking? Episode 7: We Buy a Dab Maker From Walmart",
            "urlslug": "/news/podcasts/ways-episode-7-we-buy-a-dab-maker-from-walmart"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 32.73714891361951
        },
        {
            "name": "PTSD",
            "score": 23.073661897191307
        },
        {
            "name": "ADD/ADHD",
            "score": 9.14878113407525
        },
        {
            "name": "Arthritis",
            "score": 7.811340752517223
        },
        {
            "name": "Bipolar Disorder",
            "score": 5.216613672496026
        }
    ],
    "description": "<p>Black Cherry Soda&nbsp;is a <a href=\"http://leafly.com/hybrid\">hybrid</a> strain&nbsp;named after its fruity, soda-like taste and unusually dark purple color. This strain has spawned other favorites like <a href=\"http://www.leafly.com/hybrid/black-dhalia\">Black Dahlia</a> and <a href=\"http://www.leafly.com/indica/ace-of-spades\">Ace of Spades</a>, and despite its intensely indica appearance, its effects reach the mind and body in a balance more characteristic of sativa strains. Black Cherry Soda is a potent medicine that hits without heavy sedation, making it popular among patients treating severe symptoms throughout the day.</p>\n",
    "descriptionPlain": "Black Cherry Soda&nbsp;is a hybrid strain&nbsp;named after its fruity, soda-like taste and unusually dark purple color. This strain has spawned other favorites like Black Dahlia and Ace of Spades, and despite its intensely indica appearance, its effects reach the mind and body in a balance more characteristic of sativa strains. Black Cherry Soda is a potent medicine that hits without heavy sedation, making it popular among patients treating severe symptoms throughout the day.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 61.440779014308426
        },
        {
            "name": "Happy",
            "score": 60.09671436142025
        },
        {
            "name": "Uplifted",
            "score": 58.07697403285638
        },
        {
            "name": "Euphoric",
            "score": 47.61062533121357
        },
        {
            "name": "Creative",
            "score": 32.42912029676736
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 41.95945945945946
        },
        {
            "name": "Berry",
            "score": 41.55074191838897
        },
        {
            "name": "Grape",
            "score": 18.224695283518813
        },
        {
            "name": "Earthy",
            "score": 17.615262321144677
        },
        {
            "name": "Citrus",
            "score": 9.891361950185479
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1417750,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "A favorite in flavor and a mediocre but still fun high. She's a creeper and arguably a stage 3 clinger. Swooped in gracefully, stayed for a few and exited gently. The flavor and aroma are intoxicating. Her buds are beautifully marked in deep purple. I love this stuff but it just doesn't hang around long enough to really get to know it. Perfect for a day hike or a stroll on the beach.",
            "username": "McKjudoChop"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1638691,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Oh my lanta! Sweetest, most wonderful smoke I've ever had in the past 5 years. My girl hates weed smell but I opened an 1/8 and she came over like a dog loving the smell.  My joint smelled yummy, the smoke was yummy, the taste was beyond yummy. Again first time I've tasted sweet fruity weed before. I though lemon haze was the go to sweet bud but nope. This surpasses Candyland AND Fruity Loops. \n\n No debate on looking at different bud cause if you want sweet. Get some. \n\nThe high was gentle at first. Maybe 10-15 mins before I got some slight buzz but 30 mins... Get in your sweet(comfy)spot cause a train is gonna hit you. In 25 secs it went from gentle to peeling my eyes open to keep convesation. \n\nCotton mouth was a factor is this chill sesh tbh. Maybe a 2 liters of water was gone fast thoughout 2 hours(is that normal? oops).",
            "username": "clams247"
        }
    ],
    "id": 59503,
    "name": "Black Cherry Soda",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 32.148913619501855
        },
        {
            "name": "Dry Eyes",
            "score": 15.910174880763115
        },
        {
            "name": "Anxious",
            "score": 2.08664546899841
        },
        {
            "name": "Dizzy",
            "score": 1.705087440381558
        },
        {
            "name": "Paranoid",
            "score": 1.2639109697933226
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/hybrid/black-cherry-soda",
    "photoTotalCount": 91,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000094/b/black-cherry-soda__primary_f03b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-cherry-soda_100x100_bd2c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646286/b/black-cherry-soda__primary_ad0f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-cherry-soda_100x100_5856.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646285/b/black-cherry-soda__primary_8dd9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-cherry-soda_100x100_75d5.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/620782/b/black-cherry-soda__primary_9c62.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-cherry-soda_100x100_b8a0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/588108/b/black-cherry-soda__primary_b6f7.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-cherry-soda_100x100_ab04.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/587950/b/black-cherry-soda__primary_44fa.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-cherry-soda_100x100_a213.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Las Vegas, NV",
        "Spokane, WA",
        "Portland, OR",
        "Bellingham, WA",
        "Tacoma, WA",
        "Everett, WA",
        "Spokane Valley, WA",
        "Eugene, OR",
        "Lynnwood, WA"
    ],
    "rating": 4.3,
    "relatedStrains": [],
    "reviewCount": 325,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "black-cherry-soda",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.29538461538462/240",
    "subtitle": null,
    "symbol": "Bcs",
    "symptoms": [
        {
            "name": "Stress",
            "score": 32.74377318494965
        },
        {
            "name": "Depression",
            "score": 32.44303126656068
        },
        {
            "name": "Pain",
            "score": 29.305776364599893
        },
        {
            "name": "Fatigue",
            "score": 12.639772125066242
        },
        {
            "name": "Insomnia",
            "score": 9.075251722310545
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
