{
    "aka": "perma frost",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Hannah Meadows",
            "category": null,
            "date": "/Date(1497189652000)/",
            "id": "contentitems-29132",
            "text": "Firing up a documentary whilst high is hardly a new idea, but it’s usually a good one (hello, Planet Earth). There’s so much to learn and explore via films that showcase unique and mind-bending experiences—especially with a little help from a well-packed bowl. Additionally, the truthfulness of documentaries comes as a breath of fresh air amid the throngs of lowbrow comedies and overly intense dramas that tend to flood the average Netflix queue.\n\nTo elevate this classic cannabis-enhanced activity, we mined the opinions of the staff at the Leafly office and compiled a list of the best documentaries to watch while high. In narrowing from a list that included scores of suggestions, I personally vetted the top picks to bring you the following finalists. From explorations of history to non-verbal spectaculars, there’s a bit of something for everyone below. Spark up a pre-roll or bake a batch of edibles, then get comfortable on the couch and press play—we’re willing to bet you’ll discover a new favorite.\nRecently watched a noteworthy documentary? Tell us about it in the comments below!\nCave of Forgotten Dreams\n\nFamed documentary director Werner Herzog knocked it out of the park—yet again—with his video exploration of the Chauvet Cave of Southern France. Discovered by three explorers in 1994, the cave houses ancient paintings that are the oldest ever recorded in human history, dating back between 28,000 and 35,000 years. The paintings are perfectly preserved—along with the bones of long extinct animals—having never been touched by natural light or exposure to the elements.\nBefore watching this film, I lit up some Blue Dream and even through a small computer screen (I, uh…don’t own a TV), the paintings, their meanings, and Herzog’s beautifully crafted narrative combined to create a film that was truly breathtaking. Long after the film ended, I thought about the person or people who made these, the gods they may have worshipped, the natural world in which they lived, and the ancient culture to which they belonged.\nI doubt sober thoughts would have gravitated toward the essence and deeper meaning these paintings hold in regard to human life and the history of mankind like my Blue Dream-induced thoughts did. I recommend this documentary for the music, the art, the history, the curiosity—everything about it.\nGoing Clear: Scientology and the Prison of Belief\n\nDocumentaries exploring religious sects or cults are my bread and butter. Documentaries exploring religions that are widely regarded as cults are even better—the extra-sweet jam to that bread and butter. Enter Going Clear, an eye-opening expose of L. Ron Hubbard and his imaginative, interwoven ideals of science fiction and religion that ultimately led to the creation of the Church of Scientology.\nIn this documentary, we hear stories from ex-Scientologists. These aren’t just “tried it out for a week and left” Scientologists—these people were indoctrinated into the religion for years, even decades, before getting out. Some moved up to the highest levels of the religion before calling it quits.\nSober, this is an interesting journey down the rabbit hole of Scientology. High, this documentary will open your thoughts to science, religion, and how people respond to both in a whole new light. Load a bowl of the buzzy White Fire OG before pressing play.\nSamsara\n\nNonverbal and utterly breathtaking, Samsara is the younger sister to the popular 1992 documentary Baraka (the previous nonverbal narrative exploration of nature and human life). Like Bakara, Samsara was directed by Mond Russell and produced by Mark Magidson, so the quality and feel stay true to the original.\nSamsara will leave you in awe of its gorgeous, lingering landscapes, and rich visions of people from all over the world. This colossal documentary took five years to film and spanned about 25 countries.\nThroughout this entire spectacular, cannabis will keep your eyes peeled and your mind enamored with this hour-and-a-half film of explosive color and life. Creative strains such as Pineapple Trainwreck or Berry White will let your mind completely soak in this remarkable film.\nFor an extra boost, check out the classic Koyaanisqatsi which pre-dates Samsara by about 20 years. The score is done by the famous composer Philip Glass with cinematography by Ron Fricke (who also worked on Samsara and Baraka). Though Koyaanisqatsi may not be as visually crisp as Samasara or Baraka, it was the core inspiration for both stunning films.\n\nBeware of Mr. Baker\n\nThe colorful life of Ginger Baker, legendary drummer of the popular rock bands Cream and Blind Faith, is front and center in this exploratory documentary. Rock legends laud him as the greatest drummer who ever lived, but the “behind the scenes” of Baker’s life shows a volatile man with a short fuse and passionate air.\nHe’s a true character in every sense of the word, having traveled the world and experienced a life that only one in a billion could mirror. Though hard drug use and angry outbursts (mostly fueled by said hard drug use) clouded his legend, his life story remains remarkable in every way.\nRegardless of whether or not you know who Ginger Baker is, this film is fascinating and will appeal to everyone—especially lovers of rock music. I recommend lighting up a little Durban Poison as you watch this film.\nInto the Inferno\n\nWerner Herzog makes another appearance on this list with his relatively new Netflix documentary Into the Inferno. Much like Cave of Forgotten Dreams, Into the Inferno touches on the history of human life. After delving into the world of volcanic activity, Herzog explores the religions that have developed across cultures greatly influenced by local volcanic eruptions.\nIn true Herzog style, the documentary approaches these subjects with both historical and artistic flair. Some of the most touching and beautiful points in the film are the sweeping shots of erupting volcanoes punctuated with classical or operatic music.\nJuxtaposed with these beautiful shots are scenes of ceremonial activities conducted by worshippers who believe certain volcanoes house spirits of long-dead loved ones and mighty gods. Also wrapped up with all this is the discovery of an ancient human fossil as well as the recounting of the lives of two famous volcano photographers. In short, Herzog does quite a lot with this film, and it’s all compelling.\nYet another amazing documentary that, when paired with cannabis, leaves you contemplating it days after the credits roll. Reach for some Stardawg to pair with this incredible film.\nTickled\n\nFor something well off the beaten path in terms of documentaries, I suggest you sit down and watch Tickled. It starts off innocently enough, with the director, David Farrier, simply wanting to explore an interesting subject: the world of endurance tickling. Sure, it’s an odd sport to most, but why not get a feel for something a bit different? No harm … right?\n…Right?\nWell, much to the filmmakers’ surprise—as well as my own—there is a bit of harm in exploring the unknown. Not to give too much away, the endurance competitions held by professional ticklers are more than just a good laugh.\nYou’ll be on the edge of your seat while Farrier dives down the deep and twisty hole that goes straight to the mystifying and sometimes terrifying underworld of tickling competitions. To really get into this film, you’ll want to have some Permafrost close at hand—its effects will help take the edge off the strangeness in this documentary.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/09155343/best-documentaries-to-watch-while-high.jpg",
            "title": "The 6 Best Documentaries to Watch While High",
            "urlslug": "/news/lifestyle/best-high-documentaries"
        },
        {
            "author": "Hannah Meadows",
            "category": null,
            "date": "/Date(1484677341000)/",
            "id": "contentitems-15829",
            "text": "Following the lunar calendar, the 2017 Chinese New Year (also known as the Spring Festival) falls on January 28th. This year rings in the Year of the Fire Rooster (whose last appearance on the Chinese calendar dated back to 1957) and will be accompanied by two weeks of celebration flanked by firework shows and traditional lion dancing.\nThose born under the fire rooster are thought to exude an attitude of trustworthiness and responsibility while maintaining the rooster’s other positive traits: activeness, popularity, honesty, and loyalty.\nTo join in the celebrations of this Chinese New Year, we decided to pair a few strains that exude the fire rooster’s best qualities.\nMango Haze\n\nSativa Mango Haze packs a fruity punch with its cerebral buzz and mango flavor. Its uplifting qualities speak directly to the fire rooster’s “active” and “popular” traits.\nPermafrost\n\nIf this January chill has you turning blue, give the hybrid Permafrost a try. Despite the name, its only frosty elements come from its coat of crystal trichomes. Ease into this this strain for a relaxing body high that will set a joyous mood.\nSage N Sour\n\nSage is a popular “life-giving” herb commonly used in traditional Chinese medicine, so there’s no wonder why the sativa Sage N Sour made a spot on this list. Ring in the new year with a balance of euphoria and energy as you steep in this aromatic strain.\nFlowerbomb Kush\n\nThe indica Flowerbomb Kush won’t knock you out before celebrations are over. It’s “invigorating cerebral effects” balance out a floaty body high that will cruise you through the Chinese New Year’s two weeks of festivities.\nPeaches and Cream\n\nAdd a little sweetness to your celebrations with the delicious hybrid Peaches and Cream. Possessing a “heady euphoria,” this strain will keep you going through glowing nights full of fireworks.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/27164926/chinese-new-year.jpg",
            "title": "Celebrate Chinese New Year With These 5 Strains",
            "urlslug": "/news/strains-products/strains-to-celebrate-chinese-new-year"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 44.43115512040745
        },
        {
            "name": "PTSD",
            "score": 17.36420165158483
        },
        {
            "name": "Bipolar Disorder",
            "score": 15.337116154873163
        },
        {
            "name": "ADD/ADHD",
            "score": 9.91908965039806
        },
        {
            "name": "PMS",
            "score": 4.463049498096226
        }
    ],
    "description": "<p>Permafrost, bred&nbsp;by Rogue Buds,&nbsp;is a <a href=\"http://leafly.com/sativa\">sativa</a>-dominant <a href=\"http://leafly.com/hybrid\">hybrid</a> named for its frosty coat of crystal trichomes and fresh <a href=\"http://www.leafly.com/explore#!/explore/flavors-pine\">pine</a> aroma. While some believe Permafrost to be the love child of <a href=\"http://www.leafly.com/hybrid/trainwreck\">Trainwreck</a> and <a href=\"http://www.leafly.com/hybrid/white-widow\">White Widow</a>, others claim it comes from <a href=\"http://www.leafly.com/sativa/kali-mist\">Kali Mist</a> and Trinity Snow. True to its hybrid genetics, Permafrost&rsquo;s <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\">relaxing</a> effects are balanced between mind and body. Larger doses demonstrate the strain&rsquo;s potency:&nbsp;as sensory detail peaks, <a href=\"http://www.leafly.com/explore#!/explore/tags-focused\">attention</a> becomes transfixed, and a full-body calm takes over. For this reason, Permafrost may help patients treating <a href=\"http://www.leafly.com/explore#!/explore/conditions-addadhd\">ADD/ADHD</a> and <a href=\"http://www.leafly.com/explore#!/explore/conditions-anxiety\">anxiety</a> symptoms, and others have reported its success in treating <a href=\"http://www.leafly.com/explore#!/explore/conditions-arthritis\">arthritis</a>, <a href=\"http://www.leafly.com/explore#!/explore/conditions-asthma\">asthma</a>, <a href=\"http://www.leafly.com/explore#!/explore/conditions-multiple-sclerosis\">multiple sclerosis</a>, and gastrointestinal disorders.&nbsp;</p>\n",
    "descriptionPlain": "Permafrost, bred&nbsp;by Rogue Buds,&nbsp;is a sativa-dominant hybrid named for its frosty coat of crystal trichomes and fresh pine aroma. While some believe Permafrost to be the love child of Trainwreck and White Widow, others claim it comes from Kali Mist and Trinity Snow. True to its hybrid genetics, Permafrost&rsquo;s relaxing effects are balanced between mind and body. Larger doses demonstrate the strain&rsquo;s potency:&nbsp;as sensory detail peaks, attention becomes transfixed, and a full-body calm takes over. For this reason, Permafrost may help patients treating ADD/ADHD and anxiety symptoms, and others have reported its success in treating arthritis, asthma, multiple sclerosis, and gastrointestinal disorders.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 60.23556099490679
        },
        {
            "name": "Happy",
            "score": 57.76189239974286
        },
        {
            "name": "Focused",
            "score": 54.89974286703258
        },
        {
            "name": "Euphoric",
            "score": 50.8044676853088
        },
        {
            "name": "Uplifted",
            "score": 47.04235276665183
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 14.048978885427484
        },
        {
            "name": "Pine",
            "score": 11.379370024229836
        },
        {
            "name": "Woody",
            "score": 9.33497750086535
        },
        {
            "name": "Pungent",
            "score": 6.840602284527518
        },
        {
            "name": "Sweet",
            "score": 6.098563516787815
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1417737,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I still like this stain better than most. Tastes good, you get nice and high and it doesn't give you couch lock , so you can get your stuff done during the day.",
            "username": "lorian"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1637296,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "i’m bipolar. concentration, mania, depression, anxiety and chronic insomnia are all painful symptoms. i smoke medicinally so i only need two average hits for it to take effect. obviously, the sativa is almost instantaneously induced, gets real heady, like i need to do something, anything... energy was present. in about 20 minutes the underlying indica emerges hitting me in waves and as i watch a movie, i must fight to stay awake at time. the big deal is that with this crazy hybrid is i need less anxiety medicine and focus and relaxation are in the mix. i would say, just be prepared to relax quickly if you stop moving. \n\nanother side note... i would argue highly we are smoking some Ww here... i know how my spiders creep. ",
            "username": "myopically"
        }
    ],
    "id": 1708,
    "name": "Permafrost",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 32.330452949611825
        },
        {
            "name": "Headache",
            "score": 16.838500717005388
        },
        {
            "name": "Dry Eyes",
            "score": 8.359293873312565
        },
        {
            "name": "Dizzy",
            "score": 2.9616649359640013
        },
        {
            "name": "Anxious",
            "score": 2.202319141571478
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/trainwreck",
            "category": "Hybrid",
            "name": "Trainwreck",
            "permalink": "https://mobileapi.leafly.com/hybrid/trainwreck",
            "slug": "trainwreck",
            "subtitle": null,
            "symbol": "Tw"
        },
        {
            "applink": "leafly://strain/white-widow",
            "category": "Hybrid",
            "name": "White Widow",
            "permalink": "https://mobileapi.leafly.com/hybrid/white-widow",
            "slug": "white-widow",
            "subtitle": null,
            "symbol": "Ww"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/permafrost",
    "photoTotalCount": 75,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003476/b/permafrost__primary_f79d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/permafrost_100x100_e5da.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003475/b/permafrost__primary_cc75.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/permafrost_100x100_036f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/538167/b/permafrost__primary_b8aa.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/permafrost_100x100_90a2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/534192/b/permafrost__primary_b21e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/permafrost_100x100_f617.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/522894/b/permafrost__primary_1568.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/permafrost_100x100_b7fc.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509779/b/permafrost__primary_4f33.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/permafrost_100x100_e4bb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Portland, OR",
        "Spokane, WA",
        "Bellingham, WA",
        "Shoreline, WA",
        "Airway Heights, WA",
        "Bremerton, WA",
        "Eugene, OR",
        "Freeland, WA",
        "Los Angeles, CA"
    ],
    "rating": 4.2,
    "relatedStrains": [],
    "reviewCount": 348,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "permafrost",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.20402298850575/240",
    "subtitle": null,
    "symbol": "Per",
    "symptoms": [
        {
            "name": "Fatigue",
            "score": 21.359961430054888
        },
        {
            "name": "Stress",
            "score": 12.448078920041535
        },
        {
            "name": "Depression",
            "score": 11.846659743856005
        },
        {
            "name": "Pain",
            "score": 6.933627552786431
        },
        {
            "name": "Headaches",
            "score": 5.864918656974732
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
