{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1445623200000)/",
            "id": "contentitems-3361",
            "text": "Go check out all the newest additions in the Leafly strain database! We added some new OG hybrids, a classic Chemdawg variation, a…Dream Beaver (whatever that is), and many more. Submit a strain review for the ones you've tried or find out where you can find them near you by checking the links below!\n \n 1. Phishhead Kush\n\nPhishhead Kush, named in homage to the American rock band, is an indica strain that was passed down from an older grower to the cultivators at The Clinic in Colorado. This heavy-handed strain descends from age-old Afghani indicas and inherits a spicy, woody aroma that comes to life when ground up. Heavy hypnotic effects lead the way, leaving both mind and body feeling blissfully pacified.\n\nPhishhead Kush can be found at The Clinic in Denver, CO\n \n 2. Dream Beaver\n\nDream Beaver by Bodhi Seeds is a sativa-dominant strain that crosses Dirty Hippy (an Afghooey–Blockhead hybrid) with Appalachia. With subdued flavors of fresh cedar and earthy spice, Dream Beaver deals a mellow buzz that lets you stay active, productive, and social. This sativa is a great choice for unleashing laughing fits and creative sparks on those days when your mood and motivation could use a lift.\n\nClick here for a full list of locations currently carrying Dream Beaver\n \n 3. Durban Berry\n\nDurban Berry is a hybrid cannabis strain that harnesses the vitalizing sativa power of Durban Poison counterbalanced by the mellow indica qualities of Rocky Mountain Blueberry. Taking after her Durban Poison parent, Durban Berry delivers a functional and upbeat high that allows creativity to flow freely. A pungent lemon and berry aroma erupts from the fluffy buds while tangy citrus flavors awaken on the exhale.\n\nClick here for a full list of locations currently carrying Durban Berry\n \n 4. CBD Critical Cure\n\nFrom Barney’s Farm comes CBD Critical Cure (or simply “Critical Cure”), an indica-dominant strain that’s said to combine Critical Kush with a ruderalis variety. Because this strain typically contains about 8 percent CBD and 5 percent THC, Critical Cure can annihilate pain, stress, and inflammation with little psychoactive interference. The indica influence in CBD Critical Cure gives rise to deeply relaxing effects delivered alongside a sweet, earthy flavor.\n\nClick here for a full list of locations currently carrying CBD Critical Cure\n \n 5. Golden Ticket\n\nGolden Ticket from Archive Seeds Bank is a 50/50 hybrid strain that gives you special access to euphoria’s top floor. Combining genetics from Golden Goat and Face Off OG, Golden Ticket balances full-body relaxation with invigorating cerebral qualities. Its aroma is an enticing mix of tangy lemon, sweet lime, and sour skunk. Keep in mind, Golden Ticket may also refer to a phenotypic variation of Chernobyl, a hybrid from TGA Seeds.\n\nClick here for a full list of locations currently carrying Golden Ticket\n \n 6. Chem's Sister\n\nChem’s Sister, also known as Chem Sis, is a sativa-dominant variation of the classic Chemdawg strain. This phenotype first emerged in 1996 and has since evolved into the uplifting, long-lasting sativa we see on the market today. Her strong cerebral effects come coupled with a distinct skunky diesel aroma underscored by accents of sweet sandalwood and citrus. Over the course of her maturation, Chem Sis’s mint green buds burst with white hairs that darken with age.\n\nClick here for a full list of locations currently carrying Chem's Sister\n \n 7. Monster OG\n\nMonster OG from The Green Element is a hybrid strain that crosses a heavy OG indica with an OG Kush and SFV OG hybrid. With a THC profile that can stretch past 26 percent, Monster OG’s effects come on strong to relax muscles, soothe pains, relieve stress, increase the appetite, and promote rest. Stout plants produce tights resin-packed buds that carry a blend of deep, earthy diesel and subtle burnt spice notes.\n\nMonster OG can be found at The Green Element in Torrance, CA\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002305/new-strains-alert-phishhead-kush-dream-beaver-chems-sister-durban.png",
            "title": "New Strains Alert: Phishhead Kush, Dream Beaver, Chem's Sister, Durban Berry, and More",
            "urlslug": "/news/strains-products/new-strains-alert-phishhead-kush-dream-beaver-chems-sister-durban"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 23.51190476190476
        },
        {
            "name": "HIV/AIDS",
            "score": 7.142857142857142
        },
        {
            "name": "Migraines",
            "score": 7.142857142857142
        },
        {
            "name": "Bipolar Disorder",
            "score": 2.083333333333333
        },
        {
            "name": "ADD/ADHD",
            "score": 1.0416666666666665
        }
    ],
    "description": "<p>Durban Berry is a hybrid cannabis strain that harnesses the vitalizing sativa power of <a href=\"https://www.leafly.com/sativa/durban-poison\">Durban Poison</a> counterbalanced by the mellow indica qualities of <a href=\"https://www.leafly.com/indica/rocky-mountain-blueberry\">Rocky Mountain Blueberry</a>. Taking after her Durban Poison parent, Durban Berry delivers a functional and upbeat high that allows creativity to flow freely. A pungent lemon and berry aroma erupts from the fluffly buds while tangy citrus flavors awaken on the exhale.</p>\n",
    "descriptionPlain": "Durban Berry is a hybrid cannabis strain that harnesses the vitalizing sativa power of Durban Poison counterbalanced by the mellow indica qualities of Rocky Mountain Blueberry. Taking after her Durban Poison parent, Durban Berry delivers a functional and upbeat high that allows creativity to flow freely. A pungent lemon and berry aroma erupts from the fluffly buds while tangy citrus flavors awaken on the exhale.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 50.29761904761905
        },
        {
            "name": "Creative",
            "score": 41.07142857142857
        },
        {
            "name": "Focused",
            "score": 36.9047619047619
        },
        {
            "name": "Relaxed",
            "score": 35.863095238095234
        },
        {
            "name": "Energetic",
            "score": 29.76190476190476
        }
    ],
    "flavors": [
        {
            "name": "Pine",
            "score": 29.613095238095237
        },
        {
            "name": "Citrus",
            "score": 25.595238095238095
        },
        {
            "name": "Lemon",
            "score": 22.470238095238095
        },
        {
            "name": "Berry",
            "score": 19.642857142857142
        },
        {
            "name": "Blueberry",
            "score": 16.369047619047617
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png",
            "id": 1377319,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I recently picked up this strain from The Farm, in Boulder. The knowledgable bud-tender recommended this strain after I told her that I was looking for a \"clean/clear headed\" high.  \n\nI typically love the high that I get from Durban Poison, but have reserved that strain for high energy activities like hiking, dancing or working out. \n\nWhen I found out that the Durban Berry was The Farm's cross of Durban Poison and Rocky Mountain Blueberry I was eager to try it. \nDurban Berry definitely has that hints (smell) of the DP, but the high is not racy like a pure sativa like Durban Poison.\n\nI smoked a joint of Durban Berry and was able truly function without ANY racy feeling. Very clear headed. I was even able to read a book without feeling tired, spacey or anxious. Good strain for studying, painting, cleaning and people who smoke on occasion.",
            "username": "RedEyedRandy"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png",
            "id": 1517355,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Very nice head buzz with some body effects. What stood out most is the taste--very fruity, but more of a lemony/grapefruit taste. Almost like a Tom Collins mix taste. It made my jaw and teeth feel very relaxed and warm. Very relaxing without making you super sleepy. ",
            "username": "caracala"
        }
    ],
    "id": 185199,
    "name": "Durban Berry",
    "negatives": [
        {
            "name": "Dry Eyes",
            "score": 8.184523809523808
        },
        {
            "name": "Dry Mouth",
            "score": 3.125
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/durban-poison",
            "category": "Sativa",
            "name": "Durban Poison",
            "permalink": "https://mobileapi.leafly.com/sativa/durban-poison",
            "slug": "durban-poison",
            "subtitle": null,
            "symbol": "Dp"
        },
        {
            "applink": "leafly://strain/rocky-mountain-blueberry",
            "category": "Indica",
            "name": "Rocky Mountain Blueberry",
            "permalink": "https://mobileapi.leafly.com/indica/rocky-mountain-blueberry",
            "slug": "rocky-mountain-blueberry",
            "subtitle": null,
            "symbol": "Rmb"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/durban-berry",
    "photoTotalCount": 3,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001409/b/durban-berry__primary_54aa.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/durban-berry_100x100_7a5e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/400030/b/durban-berry__primary_6781.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/durban-berry_100x100_7ee0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/399926/b/durban-berry__primary_d649.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/durban-berry_100x100_1802.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "San Mateo, CA",
        "Boulder, CO",
        "Detroit, MI",
        "Millbrae, CA",
        "Mountlake Terrace, WA",
        "San Francisco, CA",
        "Stanford, CA"
    ],
    "rating": 4.64,
    "relatedStrains": [],
    "reviewCount": 25,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "durban-berry",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.64/240",
    "subtitle": null,
    "symbol": "Dub",
    "symptoms": [
        {
            "name": "Stress",
            "score": 32.88690476190476
        },
        {
            "name": "Depression",
            "score": 23.660714285714285
        },
        {
            "name": "Lack of Appetite",
            "score": 9.226190476190474
        },
        {
            "name": "Headaches",
            "score": 8.184523809523808
        },
        {
            "name": "Pain",
            "score": 8.184523809523808
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
