{"sl_translate":"description,descriptionPlain,category","id":121583,"slug":"lucid-dream","name":"Lucid Dream","subtitle":null,"symbol":"Lud","category":"Hybrid","description":"\u003cp\u003eLucid Dream is a dynamic blend of \u003ca href=\"http://www.leafly.com/sativa/amnesia-haze\"\u003eAmnesia Haze\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e. This \u003ca href=\"http://www.leafly.com/sativa\"\u003esativa\u003c/a\u003e-dominant \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e provides a stimulating mix of \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e \u003ca href=\"http://www.leafly.com/sativa/haze\"\u003eHaze\u003c/a\u003e effects with the \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-blueberry\"\u003eblueberry\u003c/a\u003e notes of Blue Dream. Lucid Dream\u0026#39;s\u0026nbsp;\u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergetic\u003c/a\u003e, uplifting buzz\u0026nbsp;makes it a great daytime choice for patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-migraines\"\u003emigraines\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\"\u003enausea\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"Lucid Dream is a dynamic blend of Amnesia Haze and Blue Dream. This sativa-dominant hybrid provides a stimulating mix of uplifting Haze effects with the sweet blueberry notes of Blue Dream. Lucid Dream\u0026#39;s\u0026nbsp;energetic, uplifting buzz\u0026nbsp;makes it a great daytime choice for patients treating migraines, nausea, and stress.\n","aka":"Lucid Dreams","rating":4.66,"highlightedReviews":[{"id":1417506,"username":"themisterspider","text":"My friends have started to jokingly refer to this strain as \"Crybaby Weed\" because just about every time I have it I start to tear up and get emotional. Some context: I\u0027m a 30 yr old dude who is highly analytical and lives mainly in his head. Lucid Dream, for whatever reason, helps me live in my heart and feel all of the things that are typically stuffed down during my waking life. I gotta say, getting in touch with how you truly feel about life, about loved ones, and about yourself (all in a positive way), is powerful medicine. If you\u0027re someone who stuffs their emotions down (read: typical men), you might want to explore this strain with the intention of actually feeling gratitude. BIG difference than just logically or intellectually being grateful. Word or warning: you might end up crying like a big baby. Shouldn\u0027t be a problem though if you\u0027re confident with your self. Having a good friend/lover nearby is also recommended. Great conversations...","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1585741,"username":"becjenn","text":"This strain sneaks up on you. In the first minutes or so, you don\u0027t really feel anything, but 5 minutes later you feel the creep. First effect I notice is that it hit the very tips of my fingers and then my eyelids. I get a vibrating numbness throughout my entire body. For a few moments, I slip into a pleasant lethargy. My mind is slower but I still move from thought to thought as I lose concentration. 30 minutes later, the energy hits. Though relaxed, I start thinking about doing something as my inner monologue tells me \"You can do that, it\u0027s just a little thing\". After the task my eye catches something else to do. And so it begins. Hell, today I did tasks that I hadn\u0027t done it forever and they day\u0027s not over yet.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/h7UCeYO-3SjJsBSYQjuAJkJ1FDM=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2f8TKUB0xTsYii6gG1DIkruAUxSac%3d%2f120x120%2fhttps%253A%252F%252Fddd33q3967xhi.cloudfront.net%252FVa9mYVvA8YS0vuAIFtovXQfMXIA%253D%252F120x120%252Fhttps%25253A%25252F%25252Fs3.amazonaws.com%25252Fleafly%25252Fbin%25252FW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-34817","title":"5 Rustic Americana Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1500942707000)\/","text":"Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg","urlslug":"/news/lifestyle/americana-albums-listen-high"},{"id":"contentitems-3335","title":"New Strains Alert: Lucid Dream, Night Terror OG, Sonoma Coma, Soul Assassin OG, and Americano","author":"Bailey Rahn","category":null,"date":"\/Date(1418414400000)\/","text":"New strains are in! Everyday we receive hundreds of strain submissions from our Leafly app users. We\u0027ve highlighted five that made the cut, but you can browse many other newly added varieties in the Explorer.\nLeave a review if you\u0027ve already had a chance to indulge in one of these newcomers!\n   1. Lucid Dream\nCharacteristics of Lucid Dream:\n\nLucid Dream is a dynamic blend of Amnesia Haze and Blue Dream. This sativa-dominant hybrid provides a stimulating mix of uplifting Haze effects with the sweet blueberry notes of Blue Dream. Lucid Dream\u0027s energetic, uplifting buzz makes it a great daytime choice for patients treating migraines, nausea, and stress.\n\n   2. Night Terror OG\nCharacteristics of Night Terror OG:\n\nNight Terror OG is what you get when you combine Blue Dream with Rare Darkness #1 genetics. This cleverly named hybrid sways heavily toward the indica side of the spectrum, inducing relaxing effects that sink deeper in the body over time. You may find your eyelids feeling heavy before long, but don’t let a name like Night Terror OG fool you: a good night’s sleep is on its way. This 70% indica isn’t necessarily a day-ender, as the OG Kush in Rare Darkness genes provides a heady, invigorating buzz that deteriorates stress at the end of a long day. These effects are ushered in by flavors of blueberry and fruit with subtle notes of lemon, pine, and diesel.\n\n   3. Sonoma Coma\nCharacteristics of Sonoma Coma:\n\nSonoma Coma sprouted in Sonoma County, California and presents itself with tight, electric green buds which produce a thick coat of trichomes that sparkle in the sunlight. Contrary to what the name implies, Sonoma Coma is actually an energetic, uplifting sativa. The genetics remain a closely guarded recipe but are impressive enough to claim the prize for 1st place Sativa at the 2012 High Times Medical Cannabis Cup in Los Angeles. A complex mixture of sweet tropical fruits and spiced, woody undertones combine to give Sonoma Coma its distinct aroma. The flavor maintains the aroma’s complex characteristics but provides a smooth mellow finish. True to its sativa heritage, Sonoma Coma produces an energetic invasion of heady effects that produce bursts of creativity and euphoria. This strain is also known to induce a case of the munchies, so it makes a great remedy to a diminished appetite.\n\n   4. Soul Assassin OG\nCharacteristics of Soul Assassin OG:\n\nSoul Assassin OG is an OG Kush variety bred by the Soul Assassins Crew, a collective of musicians and artists affiliated with the hip hop group Cypress Hill. While the genetics remain unclassified, there have been rumblings through the underground that Lemon Thai is the mistress responsible for influencing OG Kush into its Soul Assassin OG offspring. It is an indica-dominant hybrid that produces smooth, expansive smoke with and aroma of pungent diesel and citrus fumes. Soul Assassin OG evokes sleepy, knockout indica effects that help silence any pain, stress, or tension from a long a day.\n\n   5. Americano\nCharacteristics of Americano:\n\nAmericano is a Canadian strain released by Enterprise Seeds. It is a Northern Lights/Skunk hybrid that is named for the American consumers it was designed to attract. When tourists, notably Americans, came to Vancouver looking to purchase bulk cannabis, they wanted their buds to have “bag appeal” – or stunning visual characteristics that made it easy to sell. Americano is known for its heavy coat of trichomes and its thick dense colas. The flavors and aromas of Americano stay true to its Skunk lineage and produce a sweet, piney musk. The effects are exactly what you would expect from an indica-driven hybrid: fast-acting, relaxing, and sleepy. Americano is a solid answer to symptoms of insomnia, headaches, and chronic pain.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/12/12002226/new-strains-alert-lucid-dream-night-terror-og-sonoma-coma-soul-as.jpg","urlslug":"/news/strains-products/new-strains-alert-lucid-dream-night-terror-og-sonoma-coma-soul-as"}],"reviewCount":80,"flavors":[{"name":"Berry","score":117.10526315789474},{"name":"Sweet","score":111.18421052631578},{"name":"Sage","score":100},{"name":"Blueberry","score":12.171052631578947},{"name":"Earthy","score":7.56578947368421}],"effects":[{"name":"Energetic","score":128.61842105263159},{"name":"Uplifted","score":123.02631578947368},{"name":"Relaxed","score":122.36842105263158},{"name":"Tingly","score":110.19736842105263},{"name":"Focused","score":25.657894736842103}],"symptoms":[{"name":"Fatigue","score":106.90789473684211},{"name":"Inflammation","score":103.61842105263159},{"name":"Cramps","score":102.96052631578948},{"name":"Stress","score":17.105263157894736},{"name":"Depression","score":15.460526315789473}],"conditions":[{"name":"PMS","score":106.57894736842104},{"name":"Crohn\u0027s Disease","score":100},{"name":"Anxiety","score":16.776315789473685},{"name":"Migraines","score":7.2368421052631575},{"name":"PTSD","score":4.9342105263157894}],"negatives":[{"name":"Dry Mouth","score":110.85526315789474},{"name":"Dry Eyes","score":8.5526315789473681},{"name":"Headache","score":2.6315789473684208},{"name":"Anxious","score":1.3157894736842104},{"name":"Paranoid","score":0.98684210526315785}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_417f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/658412/b/lucid-dream__primary_5bd3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_84cd.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/563372/b/lucid-dream__primary_6c63.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_7ea8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/518256/b/lucid-dream__primary_07f6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_dc9a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/471370/b/lucid-dream__primary_0a1b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_2f7b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/458947/b/lucid-dream__primary_d5f0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_0155.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/459298/b/lucid-dream__primary_f1f4.jpg"}],"photoTotalCount":19,"popularCities":["Phoenix, AZ","Chandler, AZ","Ashland, OR","Everett, WA","Fountain Hills, AZ","Freeland, WA","Los Angeles, CA","Medford, OR","Mesa, AZ","Portland, OR"],"permalink":"https://mobileapi.leafly.com/hybrid/lucid-dream","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.6625/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Amnesia Haze","subtitle":null,"slug":"amnesia-haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/amnesia-haze","symbol":"Amh","applink":"leafly://strain/amnesia-haze"},{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"\n\t9 weeks flowering time\n\n"}}
{"sl_translate":"description,descriptionPlain,category","id":121583,"slug":"lucid-dream","name":"Lucid Dream","subtitle":null,"symbol":"Lud","category":"Hybrid","description":"\u003cp\u003eLucid Dream is a dynamic blend of \u003ca href=\"http://www.leafly.com/sativa/amnesia-haze\"\u003eAmnesia Haze\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e. This \u003ca href=\"http://www.leafly.com/sativa\"\u003esativa\u003c/a\u003e-dominant \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e provides a stimulating mix of \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e \u003ca href=\"http://www.leafly.com/sativa/haze\"\u003eHaze\u003c/a\u003e effects with the \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-blueberry\"\u003eblueberry\u003c/a\u003e notes of Blue Dream. Lucid Dream\u0026#39;s\u0026nbsp;\u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergetic\u003c/a\u003e, uplifting buzz\u0026nbsp;makes it a great daytime choice for patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-migraines\"\u003emigraines\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\"\u003enausea\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"Lucid Dream is a dynamic blend of Amnesia Haze and Blue Dream. This sativa-dominant hybrid provides a stimulating mix of uplifting Haze effects with the sweet blueberry notes of Blue Dream. Lucid Dream\u0026#39;s\u0026nbsp;energetic, uplifting buzz\u0026nbsp;makes it a great daytime choice for patients treating migraines, nausea, and stress.\n","aka":"Lucid Dreams","rating":4.66,"highlightedReviews":[{"id":1417506,"username":"themisterspider","text":"My friends have started to jokingly refer to this strain as \"Crybaby Weed\" because just about every time I have it I start to tear up and get emotional. Some context: I\u0027m a 30 yr old dude who is highly analytical and lives mainly in his head. Lucid Dream, for whatever reason, helps me live in my heart and feel all of the things that are typically stuffed down during my waking life. I gotta say, getting in touch with how you truly feel about life, about loved ones, and about yourself (all in a positive way), is powerful medicine. If you\u0027re someone who stuffs their emotions down (read: typical men), you might want to explore this strain with the intention of actually feeling gratitude. BIG difference than just logically or intellectually being grateful. Word or warning: you might end up crying like a big baby. Shouldn\u0027t be a problem though if you\u0027re confident with your self. Having a good friend/lover nearby is also recommended. Great conversations...","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1585741,"username":"becjenn","text":"This strain sneaks up on you. In the first minutes or so, you don\u0027t really feel anything, but 5 minutes later you feel the creep. First effect I notice is that it hit the very tips of my fingers and then my eyelids. I get a vibrating numbness throughout my entire body. For a few moments, I slip into a pleasant lethargy. My mind is slower but I still move from thought to thought as I lose concentration. 30 minutes later, the energy hits. Though relaxed, I start thinking about doing something as my inner monologue tells me \"You can do that, it\u0027s just a little thing\". After the task my eye catches something else to do. And so it begins. Hell, today I did tasks that I hadn\u0027t done it forever and they day\u0027s not over yet.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/h7UCeYO-3SjJsBSYQjuAJkJ1FDM=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2f8TKUB0xTsYii6gG1DIkruAUxSac%3d%2f120x120%2fhttps%253A%252F%252Fddd33q3967xhi.cloudfront.net%252FVa9mYVvA8YS0vuAIFtovXQfMXIA%253D%252F120x120%252Fhttps%25253A%25252F%25252Fs3.amazonaws.com%25252Fleafly%25252Fbin%25252FW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-34817","title":"5 Rustic Americana Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1500942707000)\/","text":"Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg","urlslug":"/news/lifestyle/americana-albums-listen-high"},{"id":"contentitems-3335","title":"New Strains Alert: Lucid Dream, Night Terror OG, Sonoma Coma, Soul Assassin OG, and Americano","author":"Bailey Rahn","category":null,"date":"\/Date(1418414400000)\/","text":"New strains are in! Everyday we receive hundreds of strain submissions from our Leafly app users. We\u0027ve highlighted five that made the cut, but you can browse many other newly added varieties in the Explorer.\nLeave a review if you\u0027ve already had a chance to indulge in one of these newcomers!\n   1. Lucid Dream\nCharacteristics of Lucid Dream:\n\nLucid Dream is a dynamic blend of Amnesia Haze and Blue Dream. This sativa-dominant hybrid provides a stimulating mix of uplifting Haze effects with the sweet blueberry notes of Blue Dream. Lucid Dream\u0027s energetic, uplifting buzz makes it a great daytime choice for patients treating migraines, nausea, and stress.\n\n   2. Night Terror OG\nCharacteristics of Night Terror OG:\n\nNight Terror OG is what you get when you combine Blue Dream with Rare Darkness #1 genetics. This cleverly named hybrid sways heavily toward the indica side of the spectrum, inducing relaxing effects that sink deeper in the body over time. You may find your eyelids feeling heavy before long, but don’t let a name like Night Terror OG fool you: a good night’s sleep is on its way. This 70% indica isn’t necessarily a day-ender, as the OG Kush in Rare Darkness genes provides a heady, invigorating buzz that deteriorates stress at the end of a long day. These effects are ushered in by flavors of blueberry and fruit with subtle notes of lemon, pine, and diesel.\n\n   3. Sonoma Coma\nCharacteristics of Sonoma Coma:\n\nSonoma Coma sprouted in Sonoma County, California and presents itself with tight, electric green buds which produce a thick coat of trichomes that sparkle in the sunlight. Contrary to what the name implies, Sonoma Coma is actually an energetic, uplifting sativa. The genetics remain a closely guarded recipe but are impressive enough to claim the prize for 1st place Sativa at the 2012 High Times Medical Cannabis Cup in Los Angeles. A complex mixture of sweet tropical fruits and spiced, woody undertones combine to give Sonoma Coma its distinct aroma. The flavor maintains the aroma’s complex characteristics but provides a smooth mellow finish. True to its sativa heritage, Sonoma Coma produces an energetic invasion of heady effects that produce bursts of creativity and euphoria. This strain is also known to induce a case of the munchies, so it makes a great remedy to a diminished appetite.\n\n   4. Soul Assassin OG\nCharacteristics of Soul Assassin OG:\n\nSoul Assassin OG is an OG Kush variety bred by the Soul Assassins Crew, a collective of musicians and artists affiliated with the hip hop group Cypress Hill. While the genetics remain unclassified, there have been rumblings through the underground that Lemon Thai is the mistress responsible for influencing OG Kush into its Soul Assassin OG offspring. It is an indica-dominant hybrid that produces smooth, expansive smoke with and aroma of pungent diesel and citrus fumes. Soul Assassin OG evokes sleepy, knockout indica effects that help silence any pain, stress, or tension from a long a day.\n\n   5. Americano\nCharacteristics of Americano:\n\nAmericano is a Canadian strain released by Enterprise Seeds. It is a Northern Lights/Skunk hybrid that is named for the American consumers it was designed to attract. When tourists, notably Americans, came to Vancouver looking to purchase bulk cannabis, they wanted their buds to have “bag appeal” – or stunning visual characteristics that made it easy to sell. Americano is known for its heavy coat of trichomes and its thick dense colas. The flavors and aromas of Americano stay true to its Skunk lineage and produce a sweet, piney musk. The effects are exactly what you would expect from an indica-driven hybrid: fast-acting, relaxing, and sleepy. Americano is a solid answer to symptoms of insomnia, headaches, and chronic pain.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/12/12002226/new-strains-alert-lucid-dream-night-terror-og-sonoma-coma-soul-as.jpg","urlslug":"/news/strains-products/new-strains-alert-lucid-dream-night-terror-og-sonoma-coma-soul-as"}],"reviewCount":80,"flavors":[{"name":"Berry","score":117.10526315789474},{"name":"Sweet","score":111.18421052631578},{"name":"Sage","score":100},{"name":"Blueberry","score":12.171052631578947},{"name":"Earthy","score":7.56578947368421}],"effects":[{"name":"Energetic","score":128.61842105263159},{"name":"Uplifted","score":123.02631578947368},{"name":"Relaxed","score":122.36842105263158},{"name":"Tingly","score":110.19736842105263},{"name":"Focused","score":25.657894736842103}],"symptoms":[{"name":"Fatigue","score":106.90789473684211},{"name":"Inflammation","score":103.61842105263159},{"name":"Cramps","score":102.96052631578948},{"name":"Stress","score":17.105263157894736},{"name":"Depression","score":15.460526315789473}],"conditions":[{"name":"PMS","score":106.57894736842104},{"name":"Crohn\u0027s Disease","score":100},{"name":"Anxiety","score":16.776315789473685},{"name":"Migraines","score":7.2368421052631575},{"name":"PTSD","score":4.9342105263157894}],"negatives":[{"name":"Dry Mouth","score":110.85526315789474},{"name":"Dry Eyes","score":8.5526315789473681},{"name":"Headache","score":2.6315789473684208},{"name":"Anxious","score":1.3157894736842104},{"name":"Paranoid","score":0.98684210526315785}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_417f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/658412/b/lucid-dream__primary_5bd3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_84cd.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/563372/b/lucid-dream__primary_6c63.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_7ea8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/518256/b/lucid-dream__primary_07f6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_dc9a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/471370/b/lucid-dream__primary_0a1b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_2f7b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/458947/b/lucid-dream__primary_d5f0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_0155.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/459298/b/lucid-dream__primary_f1f4.jpg"}],"photoTotalCount":19,"popularCities":["Phoenix, AZ","Chandler, AZ","Ashland, OR","Everett, WA","Fountain Hills, AZ","Freeland, WA","Los Angeles, CA","Medford, OR","Mesa, AZ","Portland, OR"],"permalink":"https://mobileapi.leafly.com/hybrid/lucid-dream","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.6625/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Amnesia Haze","subtitle":null,"slug":"amnesia-haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/amnesia-haze","symbol":"Amh","applink":"leafly://strain/amnesia-haze"},{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"\n\t9 weeks flowering time\n\n"}}
{"sl_translate":"description,descriptionPlain,category","id":121583,"slug":"lucid-dream","name":"Lucid Dream","subtitle":null,"symbol":"Lud","category":"Hybrid","description":"\u003cp\u003eLucid Dream is a dynamic blend of \u003ca href=\"http://www.leafly.com/sativa/amnesia-haze\"\u003eAmnesia Haze\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e. This \u003ca href=\"http://www.leafly.com/sativa\"\u003esativa\u003c/a\u003e-dominant \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e provides a stimulating mix of \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e \u003ca href=\"http://www.leafly.com/sativa/haze\"\u003eHaze\u003c/a\u003e effects with the \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-blueberry\"\u003eblueberry\u003c/a\u003e notes of Blue Dream. Lucid Dream\u0026#39;s\u0026nbsp;\u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergetic\u003c/a\u003e, uplifting buzz\u0026nbsp;makes it a great daytime choice for patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-migraines\"\u003emigraines\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\"\u003enausea\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"Lucid Dream is a dynamic blend of Amnesia Haze and Blue Dream. This sativa-dominant hybrid provides a stimulating mix of uplifting Haze effects with the sweet blueberry notes of Blue Dream. Lucid Dream\u0026#39;s\u0026nbsp;energetic, uplifting buzz\u0026nbsp;makes it a great daytime choice for patients treating migraines, nausea, and stress.\n","aka":"Lucid Dreams","rating":4.66,"highlightedReviews":[{"id":1417506,"username":"themisterspider","text":"My friends have started to jokingly refer to this strain as \"Crybaby Weed\" because just about every time I have it I start to tear up and get emotional. Some context: I\u0027m a 30 yr old dude who is highly analytical and lives mainly in his head. Lucid Dream, for whatever reason, helps me live in my heart and feel all of the things that are typically stuffed down during my waking life. I gotta say, getting in touch with how you truly feel about life, about loved ones, and about yourself (all in a positive way), is powerful medicine. If you\u0027re someone who stuffs their emotions down (read: typical men), you might want to explore this strain with the intention of actually feeling gratitude. BIG difference than just logically or intellectually being grateful. Word or warning: you might end up crying like a big baby. Shouldn\u0027t be a problem though if you\u0027re confident with your self. Having a good friend/lover nearby is also recommended. Great conversations...","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1585741,"username":"becjenn","text":"This strain sneaks up on you. In the first minutes or so, you don\u0027t really feel anything, but 5 minutes later you feel the creep. First effect I notice is that it hit the very tips of my fingers and then my eyelids. I get a vibrating numbness throughout my entire body. For a few moments, I slip into a pleasant lethargy. My mind is slower but I still move from thought to thought as I lose concentration. 30 minutes later, the energy hits. Though relaxed, I start thinking about doing something as my inner monologue tells me \"You can do that, it\u0027s just a little thing\". After the task my eye catches something else to do. And so it begins. Hell, today I did tasks that I hadn\u0027t done it forever and they day\u0027s not over yet.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/h7UCeYO-3SjJsBSYQjuAJkJ1FDM=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2f8TKUB0xTsYii6gG1DIkruAUxSac%3d%2f120x120%2fhttps%253A%252F%252Fddd33q3967xhi.cloudfront.net%252FVa9mYVvA8YS0vuAIFtovXQfMXIA%253D%252F120x120%252Fhttps%25253A%25252F%25252Fs3.amazonaws.com%25252Fleafly%25252Fbin%25252FW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-34817","title":"5 Rustic Americana Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1500942707000)\/","text":"Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg","urlslug":"/news/lifestyle/americana-albums-listen-high"},{"id":"contentitems-3335","title":"New Strains Alert: Lucid Dream, Night Terror OG, Sonoma Coma, Soul Assassin OG, and Americano","author":"Bailey Rahn","category":null,"date":"\/Date(1418414400000)\/","text":"New strains are in! Everyday we receive hundreds of strain submissions from our Leafly app users. We\u0027ve highlighted five that made the cut, but you can browse many other newly added varieties in the Explorer.\nLeave a review if you\u0027ve already had a chance to indulge in one of these newcomers!\n   1. Lucid Dream\nCharacteristics of Lucid Dream:\n\nLucid Dream is a dynamic blend of Amnesia Haze and Blue Dream. This sativa-dominant hybrid provides a stimulating mix of uplifting Haze effects with the sweet blueberry notes of Blue Dream. Lucid Dream\u0027s energetic, uplifting buzz makes it a great daytime choice for patients treating migraines, nausea, and stress.\n\n   2. Night Terror OG\nCharacteristics of Night Terror OG:\n\nNight Terror OG is what you get when you combine Blue Dream with Rare Darkness #1 genetics. This cleverly named hybrid sways heavily toward the indica side of the spectrum, inducing relaxing effects that sink deeper in the body over time. You may find your eyelids feeling heavy before long, but don’t let a name like Night Terror OG fool you: a good night’s sleep is on its way. This 70% indica isn’t necessarily a day-ender, as the OG Kush in Rare Darkness genes provides a heady, invigorating buzz that deteriorates stress at the end of a long day. These effects are ushered in by flavors of blueberry and fruit with subtle notes of lemon, pine, and diesel.\n\n   3. Sonoma Coma\nCharacteristics of Sonoma Coma:\n\nSonoma Coma sprouted in Sonoma County, California and presents itself with tight, electric green buds which produce a thick coat of trichomes that sparkle in the sunlight. Contrary to what the name implies, Sonoma Coma is actually an energetic, uplifting sativa. The genetics remain a closely guarded recipe but are impressive enough to claim the prize for 1st place Sativa at the 2012 High Times Medical Cannabis Cup in Los Angeles. A complex mixture of sweet tropical fruits and spiced, woody undertones combine to give Sonoma Coma its distinct aroma. The flavor maintains the aroma’s complex characteristics but provides a smooth mellow finish. True to its sativa heritage, Sonoma Coma produces an energetic invasion of heady effects that produce bursts of creativity and euphoria. This strain is also known to induce a case of the munchies, so it makes a great remedy to a diminished appetite.\n\n   4. Soul Assassin OG\nCharacteristics of Soul Assassin OG:\n\nSoul Assassin OG is an OG Kush variety bred by the Soul Assassins Crew, a collective of musicians and artists affiliated with the hip hop group Cypress Hill. While the genetics remain unclassified, there have been rumblings through the underground that Lemon Thai is the mistress responsible for influencing OG Kush into its Soul Assassin OG offspring. It is an indica-dominant hybrid that produces smooth, expansive smoke with and aroma of pungent diesel and citrus fumes. Soul Assassin OG evokes sleepy, knockout indica effects that help silence any pain, stress, or tension from a long a day.\n\n   5. Americano\nCharacteristics of Americano:\n\nAmericano is a Canadian strain released by Enterprise Seeds. It is a Northern Lights/Skunk hybrid that is named for the American consumers it was designed to attract. When tourists, notably Americans, came to Vancouver looking to purchase bulk cannabis, they wanted their buds to have “bag appeal” – or stunning visual characteristics that made it easy to sell. Americano is known for its heavy coat of trichomes and its thick dense colas. The flavors and aromas of Americano stay true to its Skunk lineage and produce a sweet, piney musk. The effects are exactly what you would expect from an indica-driven hybrid: fast-acting, relaxing, and sleepy. Americano is a solid answer to symptoms of insomnia, headaches, and chronic pain.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/12/12002226/new-strains-alert-lucid-dream-night-terror-og-sonoma-coma-soul-as.jpg","urlslug":"/news/strains-products/new-strains-alert-lucid-dream-night-terror-og-sonoma-coma-soul-as"}],"reviewCount":80,"flavors":[{"name":"Berry","score":117.10526315789474},{"name":"Sweet","score":111.18421052631578},{"name":"Sage","score":100},{"name":"Blueberry","score":12.171052631578947},{"name":"Earthy","score":7.56578947368421}],"effects":[{"name":"Energetic","score":128.61842105263159},{"name":"Uplifted","score":123.02631578947368},{"name":"Relaxed","score":122.36842105263158},{"name":"Tingly","score":110.19736842105263},{"name":"Focused","score":25.657894736842103}],"symptoms":[{"name":"Fatigue","score":106.90789473684211},{"name":"Inflammation","score":103.61842105263159},{"name":"Cramps","score":102.96052631578948},{"name":"Stress","score":17.105263157894736},{"name":"Depression","score":15.460526315789473}],"conditions":[{"name":"PMS","score":106.57894736842104},{"name":"Crohn\u0027s Disease","score":100},{"name":"Anxiety","score":16.776315789473685},{"name":"Migraines","score":7.2368421052631575},{"name":"PTSD","score":4.9342105263157894}],"negatives":[{"name":"Dry Mouth","score":110.85526315789474},{"name":"Dry Eyes","score":8.5526315789473681},{"name":"Headache","score":2.6315789473684208},{"name":"Anxious","score":1.3157894736842104},{"name":"Paranoid","score":0.98684210526315785}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_417f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/658412/b/lucid-dream__primary_5bd3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_84cd.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/563372/b/lucid-dream__primary_6c63.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_7ea8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/518256/b/lucid-dream__primary_07f6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_dc9a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/471370/b/lucid-dream__primary_0a1b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_2f7b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/458947/b/lucid-dream__primary_d5f0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_0155.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/459298/b/lucid-dream__primary_f1f4.jpg"}],"photoTotalCount":19,"popularCities":["Phoenix, AZ","Chandler, AZ","Ashland, OR","Everett, WA","Fountain Hills, AZ","Freeland, WA","Los Angeles, CA","Medford, OR","Mesa, AZ","Portland, OR"],"permalink":"https://mobileapi.leafly.com/hybrid/lucid-dream","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.6625/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Amnesia Haze","subtitle":null,"slug":"amnesia-haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/amnesia-haze","symbol":"Amh","applink":"leafly://strain/amnesia-haze"},{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"\n\t9 weeks flowering time\n\n"}}
{"sl_translate":"description,descriptionPlain,category","id":121583,"slug":"lucid-dream","name":"Lucid Dream","subtitle":null,"symbol":"Lud","category":"Hybrid","description":"\u003cp\u003eLucid Dream is a dynamic blend of \u003ca href=\"http://www.leafly.com/sativa/amnesia-haze\"\u003eAmnesia Haze\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e. This \u003ca href=\"http://www.leafly.com/sativa\"\u003esativa\u003c/a\u003e-dominant \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e provides a stimulating mix of \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e \u003ca href=\"http://www.leafly.com/sativa/haze\"\u003eHaze\u003c/a\u003e effects with the \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-blueberry\"\u003eblueberry\u003c/a\u003e notes of Blue Dream. Lucid Dream\u0026#39;s\u0026nbsp;\u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergetic\u003c/a\u003e, uplifting buzz\u0026nbsp;makes it a great daytime choice for patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-migraines\"\u003emigraines\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\"\u003enausea\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"Lucid Dream is a dynamic blend of Amnesia Haze and Blue Dream. This sativa-dominant hybrid provides a stimulating mix of uplifting Haze effects with the sweet blueberry notes of Blue Dream. Lucid Dream\u0026#39;s\u0026nbsp;energetic, uplifting buzz\u0026nbsp;makes it a great daytime choice for patients treating migraines, nausea, and stress.\n","aka":"Lucid Dreams","rating":4.66,"highlightedReviews":[{"id":1417506,"username":"themisterspider","text":"My friends have started to jokingly refer to this strain as \"Crybaby Weed\" because just about every time I have it I start to tear up and get emotional. Some context: I\u0027m a 30 yr old dude who is highly analytical and lives mainly in his head. Lucid Dream, for whatever reason, helps me live in my heart and feel all of the things that are typically stuffed down during my waking life. I gotta say, getting in touch with how you truly feel about life, about loved ones, and about yourself (all in a positive way), is powerful medicine. If you\u0027re someone who stuffs their emotions down (read: typical men), you might want to explore this strain with the intention of actually feeling gratitude. BIG difference than just logically or intellectually being grateful. Word or warning: you might end up crying like a big baby. Shouldn\u0027t be a problem though if you\u0027re confident with your self. Having a good friend/lover nearby is also recommended. Great conversations...","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1585741,"username":"becjenn","text":"This strain sneaks up on you. In the first minutes or so, you don\u0027t really feel anything, but 5 minutes later you feel the creep. First effect I notice is that it hit the very tips of my fingers and then my eyelids. I get a vibrating numbness throughout my entire body. For a few moments, I slip into a pleasant lethargy. My mind is slower but I still move from thought to thought as I lose concentration. 30 minutes later, the energy hits. Though relaxed, I start thinking about doing something as my inner monologue tells me \"You can do that, it\u0027s just a little thing\". After the task my eye catches something else to do. And so it begins. Hell, today I did tasks that I hadn\u0027t done it forever and they day\u0027s not over yet.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/h7UCeYO-3SjJsBSYQjuAJkJ1FDM=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2f8TKUB0xTsYii6gG1DIkruAUxSac%3d%2f120x120%2fhttps%253A%252F%252Fddd33q3967xhi.cloudfront.net%252FVa9mYVvA8YS0vuAIFtovXQfMXIA%253D%252F120x120%252Fhttps%25253A%25252F%25252Fs3.amazonaws.com%25252Fleafly%25252Fbin%25252FW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-34817","title":"5 Rustic Americana Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1500942707000)\/","text":"Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg","urlslug":"/news/lifestyle/americana-albums-listen-high"},{"id":"contentitems-3335","title":"New Strains Alert: Lucid Dream, Night Terror OG, Sonoma Coma, Soul Assassin OG, and Americano","author":"Bailey Rahn","category":null,"date":"\/Date(1418414400000)\/","text":"New strains are in! Everyday we receive hundreds of strain submissions from our Leafly app users. We\u0027ve highlighted five that made the cut, but you can browse many other newly added varieties in the Explorer.\nLeave a review if you\u0027ve already had a chance to indulge in one of these newcomers!\n   1. Lucid Dream\nCharacteristics of Lucid Dream:\n\nLucid Dream is a dynamic blend of Amnesia Haze and Blue Dream. This sativa-dominant hybrid provides a stimulating mix of uplifting Haze effects with the sweet blueberry notes of Blue Dream. Lucid Dream\u0027s energetic, uplifting buzz makes it a great daytime choice for patients treating migraines, nausea, and stress.\n\n   2. Night Terror OG\nCharacteristics of Night Terror OG:\n\nNight Terror OG is what you get when you combine Blue Dream with Rare Darkness #1 genetics. This cleverly named hybrid sways heavily toward the indica side of the spectrum, inducing relaxing effects that sink deeper in the body over time. You may find your eyelids feeling heavy before long, but don’t let a name like Night Terror OG fool you: a good night’s sleep is on its way. This 70% indica isn’t necessarily a day-ender, as the OG Kush in Rare Darkness genes provides a heady, invigorating buzz that deteriorates stress at the end of a long day. These effects are ushered in by flavors of blueberry and fruit with subtle notes of lemon, pine, and diesel.\n\n   3. Sonoma Coma\nCharacteristics of Sonoma Coma:\n\nSonoma Coma sprouted in Sonoma County, California and presents itself with tight, electric green buds which produce a thick coat of trichomes that sparkle in the sunlight. Contrary to what the name implies, Sonoma Coma is actually an energetic, uplifting sativa. The genetics remain a closely guarded recipe but are impressive enough to claim the prize for 1st place Sativa at the 2012 High Times Medical Cannabis Cup in Los Angeles. A complex mixture of sweet tropical fruits and spiced, woody undertones combine to give Sonoma Coma its distinct aroma. The flavor maintains the aroma’s complex characteristics but provides a smooth mellow finish. True to its sativa heritage, Sonoma Coma produces an energetic invasion of heady effects that produce bursts of creativity and euphoria. This strain is also known to induce a case of the munchies, so it makes a great remedy to a diminished appetite.\n\n   4. Soul Assassin OG\nCharacteristics of Soul Assassin OG:\n\nSoul Assassin OG is an OG Kush variety bred by the Soul Assassins Crew, a collective of musicians and artists affiliated with the hip hop group Cypress Hill. While the genetics remain unclassified, there have been rumblings through the underground that Lemon Thai is the mistress responsible for influencing OG Kush into its Soul Assassin OG offspring. It is an indica-dominant hybrid that produces smooth, expansive smoke with and aroma of pungent diesel and citrus fumes. Soul Assassin OG evokes sleepy, knockout indica effects that help silence any pain, stress, or tension from a long a day.\n\n   5. Americano\nCharacteristics of Americano:\n\nAmericano is a Canadian strain released by Enterprise Seeds. It is a Northern Lights/Skunk hybrid that is named for the American consumers it was designed to attract. When tourists, notably Americans, came to Vancouver looking to purchase bulk cannabis, they wanted their buds to have “bag appeal” – or stunning visual characteristics that made it easy to sell. Americano is known for its heavy coat of trichomes and its thick dense colas. The flavors and aromas of Americano stay true to its Skunk lineage and produce a sweet, piney musk. The effects are exactly what you would expect from an indica-driven hybrid: fast-acting, relaxing, and sleepy. Americano is a solid answer to symptoms of insomnia, headaches, and chronic pain.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/12/12002226/new-strains-alert-lucid-dream-night-terror-og-sonoma-coma-soul-as.jpg","urlslug":"/news/strains-products/new-strains-alert-lucid-dream-night-terror-og-sonoma-coma-soul-as"}],"reviewCount":80,"flavors":[{"name":"Berry","score":117.10526315789474},{"name":"Sweet","score":111.18421052631578},{"name":"Sage","score":100},{"name":"Blueberry","score":12.171052631578947},{"name":"Earthy","score":7.56578947368421}],"effects":[{"name":"Energetic","score":128.61842105263159},{"name":"Uplifted","score":123.02631578947368},{"name":"Relaxed","score":122.36842105263158},{"name":"Tingly","score":110.19736842105263},{"name":"Focused","score":25.657894736842103}],"symptoms":[{"name":"Fatigue","score":106.90789473684211},{"name":"Inflammation","score":103.61842105263159},{"name":"Cramps","score":102.96052631578948},{"name":"Stress","score":17.105263157894736},{"name":"Depression","score":15.460526315789473}],"conditions":[{"name":"PMS","score":106.57894736842104},{"name":"Crohn\u0027s Disease","score":100},{"name":"Anxiety","score":16.776315789473685},{"name":"Migraines","score":7.2368421052631575},{"name":"PTSD","score":4.9342105263157894}],"negatives":[{"name":"Dry Mouth","score":110.85526315789474},{"name":"Dry Eyes","score":8.5526315789473681},{"name":"Headache","score":2.6315789473684208},{"name":"Anxious","score":1.3157894736842104},{"name":"Paranoid","score":0.98684210526315785}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_417f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/658412/b/lucid-dream__primary_5bd3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_84cd.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/563372/b/lucid-dream__primary_6c63.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_7ea8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/518256/b/lucid-dream__primary_07f6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_dc9a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/471370/b/lucid-dream__primary_0a1b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_2f7b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/458947/b/lucid-dream__primary_d5f0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lucid-dream_100x100_0155.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/459298/b/lucid-dream__primary_f1f4.jpg"}],"photoTotalCount":19,"popularCities":["Phoenix, AZ","Chandler, AZ","Ashland, OR","Everett, WA","Fountain Hills, AZ","Freeland, WA","Los Angeles, CA","Medford, OR","Mesa, AZ","Portland, OR"],"permalink":"https://mobileapi.leafly.com/hybrid/lucid-dream","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.6625/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Amnesia Haze","subtitle":null,"slug":"amnesia-haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/amnesia-haze","symbol":"Amh","applink":"leafly://strain/amnesia-haze"},{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"\n\t9 weeks flowering time\n\n"}}
