{"sl_translate":"description,descriptionPlain,category","id":1000,"slug":"ice","name":"Ice","subtitle":null,"symbol":"Ice","category":"Hybrid","description":"\u003cp\u003e\u003cspan id=\"docs-internal-guid-584b9e90-3ac8-6692-1c81-441cd47ac86c\"\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; vertical-align: baseline; white-space: pre-wrap;\"\u003eNirvana Seeds really took their time with this indica/sativa hybrid, carefully selecting from thousands of plants before combining choice \u003c/span\u003e\u003ca href=\"https://www.leafly.com/hybrid/skunk-1\" style=\"text-decoration:none;\"\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; text-decoration: underline; vertical-align: baseline; white-space: pre-wrap;\"\u003eSkunk #1\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; vertical-align: baseline; white-space: pre-wrap;\"\u003e, \u003c/span\u003e\u003ca href=\"https://www.leafly.com/indica/afghani\" style=\"text-decoration:none;\"\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; text-decoration: underline; vertical-align: baseline; white-space: pre-wrap;\"\u003eAfghani\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; vertical-align: baseline; white-space: pre-wrap;\"\u003e, \u003c/span\u003e\u003ca href=\"https://www.leafly.com/indica/northern-lights\" style=\"text-decoration:none;\"\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; text-decoration: underline; vertical-align: baseline; white-space: pre-wrap;\"\u003eNorthern Lights\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; vertical-align: baseline; white-space: pre-wrap;\"\u003e, and \u003ca href=\"https://www.leafly.com/indica/shiva-skunk\"\u003eShiva\u003c/a\u003e genetics into one potent seed line. Ice features copious yields of high density flowers with incredible \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\"\u003etrichome\u003c/a\u003e production. Some \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\"\u003ephenotypes\u003c/a\u003e will grow quite large, so growing indoors can be challenging. Most users report Ice as having a petrol aroma and a very heavy indica-type buzz, while some variations can present a more uplifting sativa-like effect.\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n","descriptionPlain":"Nirvana Seeds really took their time with this indica/sativa hybrid, carefully selecting from thousands of plants before combining choice Skunk #1, Afghani, Northern Lights, and Shiva genetics into one potent seed line. Ice features copious yields of high density flowers with incredible trichome production. Some phenotypes will grow quite large, so growing indoors can be challenging. Most users report Ice as having a petrol aroma and a very heavy indica-type buzz, while some variations can present a more uplifting sativa-like effect.\n","aka":null,"rating":4.11,"highlightedReviews":[{"id":1417084,"username":"Riotess18","text":"I tried Ice once before when I was trying a ton of strains at once, and it did stand out to me. I have been searching for a good daytime flower that is not more than 50% sativa and that works well for my issues and I have found it! I wish I had donated for more of it and will be getting Ice next time Oregon\u0027s Finest has it available to patients. I vaporize and I regularly ingest RSO so my baseline for review is solid. I vaporized about a half gram (I fill two turkey bags of vapor each time) twice yesterday and I noticed the following medical benefits and side effects: medical issues treated - anxiety, depression, back pain, muscle pain, nerve pain, fibromyalgia, stress, ADHD, loss of appetite; side effects and benefits - focus, attentiveness, relaxation, energy, sense of overall well being, creativity, overall pain relief, I ate better than I had in days, and I slept a solid 7 hours - unusual for me because of pain and fibro - vaping and ingesting less cannabis in the evening than usual, getting tired more \"naturally\" and waking feeling more refreshed than usual. I remembered some of my dreams too which hasn\u0027t happened much lately, a sign for me of deeper, more restful sleep. Ice seems to be the perfect blend of the perfect parts of sativa and indica for my needs and is a strain I will always be looking for when running low until I find the one or two other daytime flowers to add that can match the brilliance of Ice. I am a loyal, daily medical user of cannabis. I\u0027d say the overall effects and benefits of Ice are comparable to how we make ice in trays in our freezers. It usually takes a while to turn water into ice, and the effects of Ice definitely stay with me for a while, which is what seals the deal for me with a flower whose effects meet my needs. I also want to say that this flower from Oregon\u0027s Finest in Portland is grown by the same person who grows their UBC Chemo which I really wish Leafly would list because I could write a book about the medicinal powers of that growers strain of UBC Chemo. It is as powerful as Ice in its own unique way. They do it right there for sure. Take care and be well. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1639141,"username":"SirHighnessss","text":"Picked up some White Castle today, a hybrid of Ice and White Widow. This stash is by far the most unique scented strain I’ve ever had. The aroma in my glass jar perfectly matches the flavour profile described in the “Ice” strain description: the chemically smell hitting your nose first but soon dissipating to the usual smell of fresh bud with a strong presence of gourmet herbs and spices.\n\nThe aroma from the white widow on the other hand is almost non existent, but it makes up for a lack of stench with a heavy indica sedation and muscle relaxer. I’m not sure on this but I think “Ice” alone is a more average mid-low end quality strain with a unique smell and the white widow really gives it a nice kick while keeping the smell.\n\nI personally noticed my steps felt lighter and easier after having smoked a joint sitting down and then walking around downtown. This would be a great strain for workouts.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-22882","title":"ICE Uses a Cannabis Misdemeanor To Arrest, Deport","author":"Stephen Paulsen","category":null,"date":"\/Date(1490717943000)\/","text":"Joel and Jessica Guerrero: Caught in the Trap\nJoel and Jessica Guerrero: Everything was fine until the new immigration rules came down. Then Joel’s decade-old cannabis misdemeanor led to his arrest. (Photo from GoFundMe)\nA legal resident living in upstate New York was arrested late last month, and is now awaiting deportation—all for a decade-old misdemeanor cannabis conviction. President Trump recently lauded his stepped-up immigration enforcement policy for weeding out “drug lords” and “really bad dudes.” But the arrest and potential deportation of Joel Guerrero, a Dominican immigrant living in New Paltz, New York, raises questions about whether the nationwide Immigration and Customs Enforcement (ICE) crackdown is extending to law-abiding residents with minor cannabis convictions.\n \n[table id=63 /]\n \nGuerrero, a 37 year-old newlywed and expectant father, immigrated legally to the United States 20 years ago when he was 17. He was arrested at a routine ICE check-in at the New York City Immigration Court in downtown Manhattan on February 28. Guerrero is currently being held at the Hudson County Correctional Facility, according to ICE inmate records, where he’s slated for deportation.\n\nThe reason? Guerrero has a minor cannabis charge dating from 2004. Since January 2017 almost 40,000 immigrants  have been deported, many of them for minor infractions. Trump removed an Obama-era rule forcing ICE to focus on serious criminals, giving border patrol agents more power to make arrests and deportations based on minor infractions.\nThe details of Guerrero’s case are disputed. In a statement to Gothamist, Rachael Yong Low, a spokesperson for ICE, said that Guerrero has a “felony conviction with intent to manufacture, sell or deliver…marijuana or a synthetic equivalent.”\nBut Joel Guerrero’s wife, Jessica, challenged this account in a phone interview with Leafly. “Either they’re lying or they’re misinformed,” she said, her voice rising. “And either way, that’s really scary for our country.”\nIn this March 3, 2015 photo, Immigration and Customs Enforcement officers escort an arrestee (not Joel Guerrero) in an apartment building, in the Bronx borough of New York, during a series of early-morning raids. (Richard Drew/AP)\nJessica Guerrero, who was with her husband when he was arrested, said an ICE officer even told her specifically that Joel Guerrero was being deported for a misdemeanor marijuana charge.\nShe’s ordered a copy of the judgement from Onslow County, North Carolina, where Guerrero was originally charged, she said.\n\nA clerk at the Onslow County Superior Court confirmed to Leafly that Guerrero was indeed charged with a misdemeanor—not a felony.\nWhen reached for comment via email, an ICE spokesperson told Leafly that the initial ICE statement on Guerrero was incorrect, and that Guerrero had pleaded to a misdemeanor. However, the spokesperson maintained that Guerrero was charged with possession with intent to manufacture, sell or distribute.\nIf the ICE spokesperson is right about that, then the fact that Guerrero was convicted of a misdemeanor, not a felony, would not matter in his deportation case. Immigration law treats anything beyond simple possession as a drug felony, regardless of the original charge. That gives ICE officials broad authority to deport all but the most minor cannabis offenders.\n\nCannabis As a Deportable Offense\nPresident Trump may be taking a harsh public stance on immigration, but the strictures allowing deportations for minor drug offenses have been around since the mid-90s, when Bill Clinton and Congress enacted them as part of the 1996 omnibus crime bill. They’ve stuck around ever since. And the Trump White House isn’t the only administration that’s used them. Data provided by Syracuse University shows that deportations for drug offenses increased by 15% from 2008 to 2013, while Barack Obama was in office. In 2013 alone, over 40,000 people were deported for drug offenses.\nThose rules have been known to most non-citizen residents. Yascha Mounk, a Slate columnist and Harvard lecturer, wrote recently in the New York Times about his own “overly cautious” approach to protecting his US residency. “When applying for a work visa, or for a green card, or for naturalization,” he wrote, “I would have to document every citation and arrest. And since the law explicitly instructs the officer who would decide my fate to ascertain whether I am of ‘good moral character,’ I preferred to avoid the slightest risk of legal trouble.”\nThe Obama administration focused on what it called “smart enforcement,” a policy under which immigration authorities aggressively deported immigrants identified as criminals or terrorists. Because of that policy, the percentage of people deported as a result of criminal convictions rose steadily from 2011 through 2016, from 67% to 92%. And those removals weren’t all for violent crimes. Sejal Zota, a lawyer at the National Immigration Project, estimates that in 2013 alone, roughly 6,000 people were deported for personal possession of marijuana.\nICE deportations, 2011 through 2016. Source: US Immigration and Customs Enforcement, FY 2016 ICE Immigration Removals report.\nWhat has changed under President Trump? It’s difficult to say with any certainty so far. We have mostly anecdotal reports, and it’s hard to know whether those are increasing because enforcement is ramping up or because Trump has thrown such a bright spotlight on the subject. We do have two months of data–January and February 2017–but those figures are muddled because ICE operated for three of the four January weeks under existing Obama-era policies. According to the latest numbers supplied by ICE, 35,604 people were deported in January and February combined. If 2016 figures were evenly spread over 12 months, they would average out to 20,021 deportations per month, which is a higher rate, so far, than ICE has recorded in 2017. \nIt’s a far lower rate, in fact, than ICE recorded under the Obama administration in 2012, when an average of 34,154 people were deported per month.\nHere are the deportation figures from 2008-2016:\nAnnual deportations from the United States. Source: US Immigration and Customs Enforcement.\nAnything Beyond Simple Possession\nBy law, any drug offense beyond simple possession of 30 grams or less of marijuana is enough to deport someone. Even other minor cannabis crimes, like a second possession charge or smoking in a school zone, are enough to trigger a deportation, according to lawyers who specialize in criminal immigration law.\nFor people applying for green cards, or for legal residents returning to the country, the rules are even stricter. Admitting to ever smoking pot — even in a legal state like Colorado — is enough to have someone ruled “inadmissible” to enter the United States.\nLast year, the Denver-based alt-weekly Westword reported the story of a young Chilean woman who was barred from entering the United States after she admitted to trying state-legal cannabis in Colorado on a previous visit.\n\nA couple of things seem to have changed under Trump. Various reports indicate that many Immigration and Customs Enforcement agents feel like the restraints holding them back have been released. Agents “feel emboldened and they feel that now they have a president that’s basically is going to give them carte blanche,” Rep. Raúl Grijalva (D-Ariz.), a frequent critic of ICE tactics, said in a recent interview with HuffingtonPost’s Elise Foley. During Trump’s first week in office, he signed an executive order that called on border officers to “detain individuals apprehended on suspicion of violating Federal or State law, including Federal immigration law.” That’s always been the law, of course, but Trump’s order and his public proclamations made clear that he expected ICE agents to stop prioritizing violent criminals and go after every and any non-citizen suspected of violating federal or state law, no matter how minor the offense.\nToday, “there is a clear ‘everything goes and everyone is a target’ culture in ICE,” Greisa Martinez, advocacy director at the undocumented activist group United We Dream, told Elise Foley. “It’s the realization of the dreams of a lot of ICE agents that endorsed Trump.”\nA big part of the new, bolder tactics on the border is the stepped-up investigation of an immigrant or traveler’s mobile phone, email, and social networking data. Six years ago, Customs and Border Agents rarely asked to search a traveler’s cell phone. As Leafly’s Chris Roberts documented yesterday, in 2010 border agents nationwide searched fewer than 400 phones per month. In February 2017, they searched about 5,000 devices, often looking for evidence of lawbreaking–including the purchase or consumption of state-legal cannabis.\n\n\n\n \nJacob Sapochnick, a immigration lawyer based in San Diego, said he had a German client who was detained for seven hours in August after Border Patrol agents found images from Burning Man on his phone. Another client, Sapochnick said, was asked if he’d tried marijuana while on vacation in Maui.\n“Those are the kinds of things where you have to be careful how you answer,” Sapochnick said. “That’s why they’re searching your social media and phone–to elicit cues for whatever they’re looking for, to be able to deny you entry.”\nSince Trump took office, Sapochnick said, he knows of at least three people who have had their student visas revoked for marijuana offenses — all of them from Muslim countries.\n“I think it’s going to get worse and worse, honestly,” Sapochnick said. “People are going to have to be very, very careful.”\n\nBad Under Obama, Worse Under Trump\nAfter Washington and Colorado legalized recreational marijuana use, in 2013, Eric Holder, then attorney general, made a historic announcement: The Obama administration would not go after marijuana users or businessmen who were following state law.\nAt the same time, the Obama Administration took the opposite stance on immigrants with marijuana offenses, argues Matt Adams, a lawyer at the Northwest Immigrant Rights Project.\n“That was under Obama,” he added. “Of course, the outlook is even more grim when you look at Sessions coming in as attorney general.”\nThings are certainly grim for Joel Guerrero. He’s been checking in with ICE every six months since 2011. His green card was revoked that year when he returned from a trip to the Dominican Republic and then missed an immigration court date.\nIn 2014, an immigration judge gave Guerrero an Order of Removal, according to his wife, Jessica. But she said ICE agents told him, “If you keep reporting to us, you don’t have to worry about it.”\n“He shouldn’t have taken them at their word,” she said. If her husband gets deported, Jessica Guerrero, who’s from New York, plans to leave the country with him.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/03/28101442/immigration-border-patrol.jpg","urlslug":"/news/politics/ice-wants-deport-cannabis-misdemeanor-becomes-felony"},{"id":"contentitems-3323","title":"New Strains Alert: King Cake, Memory Loss, Urkle Train Haze, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1462597200000)\/","text":"The Leafly Explorer has just been updated with some new varieties, just in time for your weekend. Trainwreck fans, rejoice: a couple of these are spins on the classic hybrid\u0027s genetics. Others offer new twists to old strains like Granddaddy Purple, Amnesia Haze, Sour Diesel, and more. Read up on all of our newly added strains below, and remember to leave reviews for any you\u0027ve had the pleasure of trying!\n \n 1. King Cake\n\nKing Cake is a clone-only strain from Oregon growers Golden Beaver Farms that combines Ken’s Granddaddy Purple with Mystic Gem and was originally released under the name Disco Glitter. It has tested at up to 20% THC and combines an uplifting and creative head high with a relaxing body feel. King Cake features a unique terpene profile that smells like sweet basil and licorice and produces frosty purple, green, and yellow flowers reminiscent of the Mardi Gras pastry after which it is named.\n\n \n 2. Urkle Train Haze\n\nAn Arizona Natural Selections original, Urkle Train Haze was created using the genetics of Ghost Train Haze and Purple Urkle. These two parent strains are often described as polar opposites of each other, and yet crossing them yields a pleasantly uplifting and euphoric result. Urkle Train Haze’s fragrance and flavor is that of an invigorating sweet, berry, and pine that will linger long after consumption. With predominantly indica effects, this strain holds a feeling of relaxation that will leave you smiling and ready to raid the fridge.\n\n \n 3. Memory Loss\n\nMemory Loss is a fast-finishing 70% sativa hybrid from Archive Seed Bank that smells very much like a Dutch Haze, with a strong, peppery incense odor and undertones of bubblegum and fruit. This cross of Amnesia Haze and a Face Off OG male produces large, easy to grow plants and heavy yields. Memory Loss is named for its mind-warping high that can leave users in a disoriented and forgetful mental state.\n\n \n 4. Ice Wreck\n\nBy combining two high-potency strains, Ice and Trainwreck, Crop King Seeds has created a real knockout of a hybrid that has tested at over 27% THC. Ice Wreck blends the cerebral high of a sativa with the deep body stone of an indica into one great package.\n\n \n 5. SnowLAnd\n\nA limited edition release from DNA Genetics, SnowLAnd is a cross of Snowcap and LA Confidential created in an attempt to tame the huge size of Snowcap while still producing large yields of potent, highly-resinous flowers. Most phenotypes are compact indica-like plants with extremely dense buds and flavors ranging from fruit to diesel to sandalwood. Reports indicate that SnowLAnd is very strong with a long lasting, balanced high.\n\n \n 6. Purple Power\n\nA sativa-dominant cross of Dutch Dope and Skunk #1, Purple Power is a very popular strain with outdoor and greenhouse growers, but is very unpredictable and difficult to manage when grown indoors. Large yields of resinous purple flowers produce a strong sweet smell and a sweet, skunky flavor when smoked. The buzz comes on quick and strong, with trippy visual effects and a relaxed feeling of euphoria that gradually fades to a deep sense of relaxation.\n\n \n 7. Sour Dubble\n\nOriginally a mysterious clone-only strain of unknown heritage, Sour Dubble is thought to be a cross of East Coast Sour Diesel and Sour Bubble. B.O.G. Seeds recreated Sour Dubble using Rez Dog’s Sour Diesel IBL instead of the ECSD and the results are very similar, if more indica-like than the original sativa-dominant hybrid. Dense buds with copious amounts of trichomes produce a pungent, sweet n’ sour odor and a strong diesel flavor with a sweet fruity aftertaste. The high of Sour Dubble is a nice blend of head and body effects.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/05/12002210/new-strains-alert-king-cake-memory-loss-urkle-train-haze-and-more.jpg","urlslug":"/news/strains-products/new-strains-alert-king-cake-memory-loss-urkle-train-haze-and-more"}],"reviewCount":211,"flavors":[{"name":"Chemical","score":43.764019050545393},{"name":"Earthy","score":42.738515901060069},{"name":"Pepper","score":42.350591488707941},{"name":"Menthol","score":41.766784452296818},{"name":"Pungent","score":40.883392226148409}],"effects":[{"name":"Happy","score":77.971270548471352},{"name":"Uplifted","score":76.027807650944851},{"name":"Focused","score":71.7337532647104},{"name":"Relaxed","score":60.675218927638653},{"name":"Euphoric","score":60.145183591949611}],"symptoms":[{"name":"Stress","score":75.1789829466892},{"name":"Depression","score":71.468735596865884},{"name":"Fatigue","score":64.2057151636196},{"name":"Pain","score":52.386695344907054},{"name":"Nausea","score":42.738515901060069}],"conditions":[{"name":"Anxiety","score":34.825626056229837},{"name":"Migraines","score":24.559072054078968},{"name":"PTSD","score":24.470732831464126},{"name":"Bipolar Disorder","score":7.1401136887386691},{"name":"ADD/ADHD","score":3.5873406053157169}],"negatives":[{"name":"Dizzy","score":23.7640190505454},{"name":"Headache","score":21.236749116607776},{"name":"Dry Mouth","score":13.588876939622061},{"name":"Paranoid","score":9.9324012905208168},{"name":"Anxious","score":6.6984175756644646}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_1ed2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/703755/b/ice__primary_6db3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_cf84.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/703628/b/ice__primary_9dab.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_94a3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607850/b/ice__primary_400d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_665d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/550578/b/ice__primary_46a3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_ca08.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/522301/b/ice__primary_bc20.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_b886.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/508838/b/ice__primary_1f1d.jpg"}],"photoTotalCount":99,"popularCities":["Portland, OR","Bellevue, WA","Eugene, OR","Everett, WA","Salem, OR","Shoreline, WA","Beaverton, OR","Bend, OR","Colorado Springs, CO","Damascus, OR"],"permalink":"https://mobileapi.leafly.com/hybrid/ice","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.10900473933649/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Shiva Skunk","subtitle":null,"slug":"shiva-skunk","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/shiva-skunk","symbol":"Sh","applink":"leafly://strain/shiva-skunk"},{"name":"Northern Lights","subtitle":null,"slug":"northern-lights","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/northern-lights","symbol":"Nl","applink":"leafly://strain/northern-lights"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":1000,"slug":"ice","name":"Ice","subtitle":null,"symbol":"Ice","category":"Hybrid","description":"\u003cp\u003e\u003cspan id=\"docs-internal-guid-584b9e90-3ac8-6692-1c81-441cd47ac86c\"\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; vertical-align: baseline; white-space: pre-wrap;\"\u003eNirvana Seeds really took their time with this indica/sativa hybrid, carefully selecting from thousands of plants before combining choice \u003c/span\u003e\u003ca href=\"https://www.leafly.com/hybrid/skunk-1\" style=\"text-decoration:none;\"\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; text-decoration: underline; vertical-align: baseline; white-space: pre-wrap;\"\u003eSkunk #1\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; vertical-align: baseline; white-space: pre-wrap;\"\u003e, \u003c/span\u003e\u003ca href=\"https://www.leafly.com/indica/afghani\" style=\"text-decoration:none;\"\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; text-decoration: underline; vertical-align: baseline; white-space: pre-wrap;\"\u003eAfghani\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; vertical-align: baseline; white-space: pre-wrap;\"\u003e, \u003c/span\u003e\u003ca href=\"https://www.leafly.com/indica/northern-lights\" style=\"text-decoration:none;\"\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; text-decoration: underline; vertical-align: baseline; white-space: pre-wrap;\"\u003eNorthern Lights\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; vertical-align: baseline; white-space: pre-wrap;\"\u003e, and \u003ca href=\"https://www.leafly.com/indica/shiva-skunk\"\u003eShiva\u003c/a\u003e genetics into one potent seed line. Ice features copious yields of high density flowers with incredible \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\"\u003etrichome\u003c/a\u003e production. Some \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\"\u003ephenotypes\u003c/a\u003e will grow quite large, so growing indoors can be challenging. Most users report Ice as having a petrol aroma and a very heavy indica-type buzz, while some variations can present a more uplifting sativa-like effect.\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n","descriptionPlain":"Nirvana Seeds really took their time with this indica/sativa hybrid, carefully selecting from thousands of plants before combining choice Skunk #1, Afghani, Northern Lights, and Shiva genetics into one potent seed line. Ice features copious yields of high density flowers with incredible trichome production. Some phenotypes will grow quite large, so growing indoors can be challenging. Most users report Ice as having a petrol aroma and a very heavy indica-type buzz, while some variations can present a more uplifting sativa-like effect.\n","aka":null,"rating":4.11,"highlightedReviews":[{"id":1417084,"username":"Riotess18","text":"I tried Ice once before when I was trying a ton of strains at once, and it did stand out to me. I have been searching for a good daytime flower that is not more than 50% sativa and that works well for my issues and I have found it! I wish I had donated for more of it and will be getting Ice next time Oregon\u0027s Finest has it available to patients. I vaporize and I regularly ingest RSO so my baseline for review is solid. I vaporized about a half gram (I fill two turkey bags of vapor each time) twice yesterday and I noticed the following medical benefits and side effects: medical issues treated - anxiety, depression, back pain, muscle pain, nerve pain, fibromyalgia, stress, ADHD, loss of appetite; side effects and benefits - focus, attentiveness, relaxation, energy, sense of overall well being, creativity, overall pain relief, I ate better than I had in days, and I slept a solid 7 hours - unusual for me because of pain and fibro - vaping and ingesting less cannabis in the evening than usual, getting tired more \"naturally\" and waking feeling more refreshed than usual. I remembered some of my dreams too which hasn\u0027t happened much lately, a sign for me of deeper, more restful sleep. Ice seems to be the perfect blend of the perfect parts of sativa and indica for my needs and is a strain I will always be looking for when running low until I find the one or two other daytime flowers to add that can match the brilliance of Ice. I am a loyal, daily medical user of cannabis. I\u0027d say the overall effects and benefits of Ice are comparable to how we make ice in trays in our freezers. It usually takes a while to turn water into ice, and the effects of Ice definitely stay with me for a while, which is what seals the deal for me with a flower whose effects meet my needs. I also want to say that this flower from Oregon\u0027s Finest in Portland is grown by the same person who grows their UBC Chemo which I really wish Leafly would list because I could write a book about the medicinal powers of that growers strain of UBC Chemo. It is as powerful as Ice in its own unique way. They do it right there for sure. Take care and be well. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1639141,"username":"SirHighnessss","text":"Picked up some White Castle today, a hybrid of Ice and White Widow. This stash is by far the most unique scented strain I’ve ever had. The aroma in my glass jar perfectly matches the flavour profile described in the “Ice” strain description: the chemically smell hitting your nose first but soon dissipating to the usual smell of fresh bud with a strong presence of gourmet herbs and spices.\n\nThe aroma from the white widow on the other hand is almost non existent, but it makes up for a lack of stench with a heavy indica sedation and muscle relaxer. I’m not sure on this but I think “Ice” alone is a more average mid-low end quality strain with a unique smell and the white widow really gives it a nice kick while keeping the smell.\n\nI personally noticed my steps felt lighter and easier after having smoked a joint sitting down and then walking around downtown. This would be a great strain for workouts.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-22882","title":"ICE Uses a Cannabis Misdemeanor To Arrest, Deport","author":"Stephen Paulsen","category":null,"date":"\/Date(1490717943000)\/","text":"Joel and Jessica Guerrero: Caught in the Trap\nJoel and Jessica Guerrero: Everything was fine until the new immigration rules came down. Then Joel’s decade-old cannabis misdemeanor led to his arrest. (Photo from GoFundMe)\nA legal resident living in upstate New York was arrested late last month, and is now awaiting deportation—all for a decade-old misdemeanor cannabis conviction. President Trump recently lauded his stepped-up immigration enforcement policy for weeding out “drug lords” and “really bad dudes.” But the arrest and potential deportation of Joel Guerrero, a Dominican immigrant living in New Paltz, New York, raises questions about whether the nationwide Immigration and Customs Enforcement (ICE) crackdown is extending to law-abiding residents with minor cannabis convictions.\n \n[table id=63 /]\n \nGuerrero, a 37 year-old newlywed and expectant father, immigrated legally to the United States 20 years ago when he was 17. He was arrested at a routine ICE check-in at the New York City Immigration Court in downtown Manhattan on February 28. Guerrero is currently being held at the Hudson County Correctional Facility, according to ICE inmate records, where he’s slated for deportation.\n\nThe reason? Guerrero has a minor cannabis charge dating from 2004. Since January 2017 almost 40,000 immigrants  have been deported, many of them for minor infractions. Trump removed an Obama-era rule forcing ICE to focus on serious criminals, giving border patrol agents more power to make arrests and deportations based on minor infractions.\nThe details of Guerrero’s case are disputed. In a statement to Gothamist, Rachael Yong Low, a spokesperson for ICE, said that Guerrero has a “felony conviction with intent to manufacture, sell or deliver…marijuana or a synthetic equivalent.”\nBut Joel Guerrero’s wife, Jessica, challenged this account in a phone interview with Leafly. “Either they’re lying or they’re misinformed,” she said, her voice rising. “And either way, that’s really scary for our country.”\nIn this March 3, 2015 photo, Immigration and Customs Enforcement officers escort an arrestee (not Joel Guerrero) in an apartment building, in the Bronx borough of New York, during a series of early-morning raids. (Richard Drew/AP)\nJessica Guerrero, who was with her husband when he was arrested, said an ICE officer even told her specifically that Joel Guerrero was being deported for a misdemeanor marijuana charge.\nShe’s ordered a copy of the judgement from Onslow County, North Carolina, where Guerrero was originally charged, she said.\n\nA clerk at the Onslow County Superior Court confirmed to Leafly that Guerrero was indeed charged with a misdemeanor—not a felony.\nWhen reached for comment via email, an ICE spokesperson told Leafly that the initial ICE statement on Guerrero was incorrect, and that Guerrero had pleaded to a misdemeanor. However, the spokesperson maintained that Guerrero was charged with possession with intent to manufacture, sell or distribute.\nIf the ICE spokesperson is right about that, then the fact that Guerrero was convicted of a misdemeanor, not a felony, would not matter in his deportation case. Immigration law treats anything beyond simple possession as a drug felony, regardless of the original charge. That gives ICE officials broad authority to deport all but the most minor cannabis offenders.\n\nCannabis As a Deportable Offense\nPresident Trump may be taking a harsh public stance on immigration, but the strictures allowing deportations for minor drug offenses have been around since the mid-90s, when Bill Clinton and Congress enacted them as part of the 1996 omnibus crime bill. They’ve stuck around ever since. And the Trump White House isn’t the only administration that’s used them. Data provided by Syracuse University shows that deportations for drug offenses increased by 15% from 2008 to 2013, while Barack Obama was in office. In 2013 alone, over 40,000 people were deported for drug offenses.\nThose rules have been known to most non-citizen residents. Yascha Mounk, a Slate columnist and Harvard lecturer, wrote recently in the New York Times about his own “overly cautious” approach to protecting his US residency. “When applying for a work visa, or for a green card, or for naturalization,” he wrote, “I would have to document every citation and arrest. And since the law explicitly instructs the officer who would decide my fate to ascertain whether I am of ‘good moral character,’ I preferred to avoid the slightest risk of legal trouble.”\nThe Obama administration focused on what it called “smart enforcement,” a policy under which immigration authorities aggressively deported immigrants identified as criminals or terrorists. Because of that policy, the percentage of people deported as a result of criminal convictions rose steadily from 2011 through 2016, from 67% to 92%. And those removals weren’t all for violent crimes. Sejal Zota, a lawyer at the National Immigration Project, estimates that in 2013 alone, roughly 6,000 people were deported for personal possession of marijuana.\nICE deportations, 2011 through 2016. Source: US Immigration and Customs Enforcement, FY 2016 ICE Immigration Removals report.\nWhat has changed under President Trump? It’s difficult to say with any certainty so far. We have mostly anecdotal reports, and it’s hard to know whether those are increasing because enforcement is ramping up or because Trump has thrown such a bright spotlight on the subject. We do have two months of data–January and February 2017–but those figures are muddled because ICE operated for three of the four January weeks under existing Obama-era policies. According to the latest numbers supplied by ICE, 35,604 people were deported in January and February combined. If 2016 figures were evenly spread over 12 months, they would average out to 20,021 deportations per month, which is a higher rate, so far, than ICE has recorded in 2017. \nIt’s a far lower rate, in fact, than ICE recorded under the Obama administration in 2012, when an average of 34,154 people were deported per month.\nHere are the deportation figures from 2008-2016:\nAnnual deportations from the United States. Source: US Immigration and Customs Enforcement.\nAnything Beyond Simple Possession\nBy law, any drug offense beyond simple possession of 30 grams or less of marijuana is enough to deport someone. Even other minor cannabis crimes, like a second possession charge or smoking in a school zone, are enough to trigger a deportation, according to lawyers who specialize in criminal immigration law.\nFor people applying for green cards, or for legal residents returning to the country, the rules are even stricter. Admitting to ever smoking pot — even in a legal state like Colorado — is enough to have someone ruled “inadmissible” to enter the United States.\nLast year, the Denver-based alt-weekly Westword reported the story of a young Chilean woman who was barred from entering the United States after she admitted to trying state-legal cannabis in Colorado on a previous visit.\n\nA couple of things seem to have changed under Trump. Various reports indicate that many Immigration and Customs Enforcement agents feel like the restraints holding them back have been released. Agents “feel emboldened and they feel that now they have a president that’s basically is going to give them carte blanche,” Rep. Raúl Grijalva (D-Ariz.), a frequent critic of ICE tactics, said in a recent interview with HuffingtonPost’s Elise Foley. During Trump’s first week in office, he signed an executive order that called on border officers to “detain individuals apprehended on suspicion of violating Federal or State law, including Federal immigration law.” That’s always been the law, of course, but Trump’s order and his public proclamations made clear that he expected ICE agents to stop prioritizing violent criminals and go after every and any non-citizen suspected of violating federal or state law, no matter how minor the offense.\nToday, “there is a clear ‘everything goes and everyone is a target’ culture in ICE,” Greisa Martinez, advocacy director at the undocumented activist group United We Dream, told Elise Foley. “It’s the realization of the dreams of a lot of ICE agents that endorsed Trump.”\nA big part of the new, bolder tactics on the border is the stepped-up investigation of an immigrant or traveler’s mobile phone, email, and social networking data. Six years ago, Customs and Border Agents rarely asked to search a traveler’s cell phone. As Leafly’s Chris Roberts documented yesterday, in 2010 border agents nationwide searched fewer than 400 phones per month. In February 2017, they searched about 5,000 devices, often looking for evidence of lawbreaking–including the purchase or consumption of state-legal cannabis.\n\n\n\n \nJacob Sapochnick, a immigration lawyer based in San Diego, said he had a German client who was detained for seven hours in August after Border Patrol agents found images from Burning Man on his phone. Another client, Sapochnick said, was asked if he’d tried marijuana while on vacation in Maui.\n“Those are the kinds of things where you have to be careful how you answer,” Sapochnick said. “That’s why they’re searching your social media and phone–to elicit cues for whatever they’re looking for, to be able to deny you entry.”\nSince Trump took office, Sapochnick said, he knows of at least three people who have had their student visas revoked for marijuana offenses — all of them from Muslim countries.\n“I think it’s going to get worse and worse, honestly,” Sapochnick said. “People are going to have to be very, very careful.”\n\nBad Under Obama, Worse Under Trump\nAfter Washington and Colorado legalized recreational marijuana use, in 2013, Eric Holder, then attorney general, made a historic announcement: The Obama administration would not go after marijuana users or businessmen who were following state law.\nAt the same time, the Obama Administration took the opposite stance on immigrants with marijuana offenses, argues Matt Adams, a lawyer at the Northwest Immigrant Rights Project.\n“That was under Obama,” he added. “Of course, the outlook is even more grim when you look at Sessions coming in as attorney general.”\nThings are certainly grim for Joel Guerrero. He’s been checking in with ICE every six months since 2011. His green card was revoked that year when he returned from a trip to the Dominican Republic and then missed an immigration court date.\nIn 2014, an immigration judge gave Guerrero an Order of Removal, according to his wife, Jessica. But she said ICE agents told him, “If you keep reporting to us, you don’t have to worry about it.”\n“He shouldn’t have taken them at their word,” she said. If her husband gets deported, Jessica Guerrero, who’s from New York, plans to leave the country with him.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/03/28101442/immigration-border-patrol.jpg","urlslug":"/news/politics/ice-wants-deport-cannabis-misdemeanor-becomes-felony"},{"id":"contentitems-3323","title":"New Strains Alert: King Cake, Memory Loss, Urkle Train Haze, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1462597200000)\/","text":"The Leafly Explorer has just been updated with some new varieties, just in time for your weekend. Trainwreck fans, rejoice: a couple of these are spins on the classic hybrid\u0027s genetics. Others offer new twists to old strains like Granddaddy Purple, Amnesia Haze, Sour Diesel, and more. Read up on all of our newly added strains below, and remember to leave reviews for any you\u0027ve had the pleasure of trying!\n \n 1. King Cake\n\nKing Cake is a clone-only strain from Oregon growers Golden Beaver Farms that combines Ken’s Granddaddy Purple with Mystic Gem and was originally released under the name Disco Glitter. It has tested at up to 20% THC and combines an uplifting and creative head high with a relaxing body feel. King Cake features a unique terpene profile that smells like sweet basil and licorice and produces frosty purple, green, and yellow flowers reminiscent of the Mardi Gras pastry after which it is named.\n\n \n 2. Urkle Train Haze\n\nAn Arizona Natural Selections original, Urkle Train Haze was created using the genetics of Ghost Train Haze and Purple Urkle. These two parent strains are often described as polar opposites of each other, and yet crossing them yields a pleasantly uplifting and euphoric result. Urkle Train Haze’s fragrance and flavor is that of an invigorating sweet, berry, and pine that will linger long after consumption. With predominantly indica effects, this strain holds a feeling of relaxation that will leave you smiling and ready to raid the fridge.\n\n \n 3. Memory Loss\n\nMemory Loss is a fast-finishing 70% sativa hybrid from Archive Seed Bank that smells very much like a Dutch Haze, with a strong, peppery incense odor and undertones of bubblegum and fruit. This cross of Amnesia Haze and a Face Off OG male produces large, easy to grow plants and heavy yields. Memory Loss is named for its mind-warping high that can leave users in a disoriented and forgetful mental state.\n\n \n 4. Ice Wreck\n\nBy combining two high-potency strains, Ice and Trainwreck, Crop King Seeds has created a real knockout of a hybrid that has tested at over 27% THC. Ice Wreck blends the cerebral high of a sativa with the deep body stone of an indica into one great package.\n\n \n 5. SnowLAnd\n\nA limited edition release from DNA Genetics, SnowLAnd is a cross of Snowcap and LA Confidential created in an attempt to tame the huge size of Snowcap while still producing large yields of potent, highly-resinous flowers. Most phenotypes are compact indica-like plants with extremely dense buds and flavors ranging from fruit to diesel to sandalwood. Reports indicate that SnowLAnd is very strong with a long lasting, balanced high.\n\n \n 6. Purple Power\n\nA sativa-dominant cross of Dutch Dope and Skunk #1, Purple Power is a very popular strain with outdoor and greenhouse growers, but is very unpredictable and difficult to manage when grown indoors. Large yields of resinous purple flowers produce a strong sweet smell and a sweet, skunky flavor when smoked. The buzz comes on quick and strong, with trippy visual effects and a relaxed feeling of euphoria that gradually fades to a deep sense of relaxation.\n\n \n 7. Sour Dubble\n\nOriginally a mysterious clone-only strain of unknown heritage, Sour Dubble is thought to be a cross of East Coast Sour Diesel and Sour Bubble. B.O.G. Seeds recreated Sour Dubble using Rez Dog’s Sour Diesel IBL instead of the ECSD and the results are very similar, if more indica-like than the original sativa-dominant hybrid. Dense buds with copious amounts of trichomes produce a pungent, sweet n’ sour odor and a strong diesel flavor with a sweet fruity aftertaste. The high of Sour Dubble is a nice blend of head and body effects.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/05/12002210/new-strains-alert-king-cake-memory-loss-urkle-train-haze-and-more.jpg","urlslug":"/news/strains-products/new-strains-alert-king-cake-memory-loss-urkle-train-haze-and-more"}],"reviewCount":211,"flavors":[{"name":"Chemical","score":43.764019050545393},{"name":"Earthy","score":42.738515901060069},{"name":"Pepper","score":42.350591488707941},{"name":"Menthol","score":41.766784452296818},{"name":"Pungent","score":40.883392226148409}],"effects":[{"name":"Happy","score":77.971270548471352},{"name":"Uplifted","score":76.027807650944851},{"name":"Focused","score":71.7337532647104},{"name":"Relaxed","score":60.675218927638653},{"name":"Euphoric","score":60.145183591949611}],"symptoms":[{"name":"Stress","score":75.1789829466892},{"name":"Depression","score":71.468735596865884},{"name":"Fatigue","score":64.2057151636196},{"name":"Pain","score":52.386695344907054},{"name":"Nausea","score":42.738515901060069}],"conditions":[{"name":"Anxiety","score":34.825626056229837},{"name":"Migraines","score":24.559072054078968},{"name":"PTSD","score":24.470732831464126},{"name":"Bipolar Disorder","score":7.1401136887386691},{"name":"ADD/ADHD","score":3.5873406053157169}],"negatives":[{"name":"Dizzy","score":23.7640190505454},{"name":"Headache","score":21.236749116607776},{"name":"Dry Mouth","score":13.588876939622061},{"name":"Paranoid","score":9.9324012905208168},{"name":"Anxious","score":6.6984175756644646}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_1ed2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/703755/b/ice__primary_6db3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_cf84.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/703628/b/ice__primary_9dab.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_94a3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607850/b/ice__primary_400d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_665d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/550578/b/ice__primary_46a3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_ca08.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/522301/b/ice__primary_bc20.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_b886.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/508838/b/ice__primary_1f1d.jpg"}],"photoTotalCount":99,"popularCities":["Portland, OR","Bellevue, WA","Eugene, OR","Everett, WA","Salem, OR","Shoreline, WA","Beaverton, OR","Bend, OR","Colorado Springs, CO","Damascus, OR"],"permalink":"https://mobileapi.leafly.com/hybrid/ice","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.10900473933649/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Shiva Skunk","subtitle":null,"slug":"shiva-skunk","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/shiva-skunk","symbol":"Sh","applink":"leafly://strain/shiva-skunk"},{"name":"Northern Lights","subtitle":null,"slug":"northern-lights","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/northern-lights","symbol":"Nl","applink":"leafly://strain/northern-lights"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":1000,"slug":"ice","name":"Ice","subtitle":null,"symbol":"Ice","category":"Hybrid","description":"\u003cp\u003e\u003cspan id=\"docs-internal-guid-584b9e90-3ac8-6692-1c81-441cd47ac86c\"\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; vertical-align: baseline; white-space: pre-wrap;\"\u003eNirvana Seeds really took their time with this indica/sativa hybrid, carefully selecting from thousands of plants before combining choice \u003c/span\u003e\u003ca href=\"https://www.leafly.com/hybrid/skunk-1\" style=\"text-decoration:none;\"\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; text-decoration: underline; vertical-align: baseline; white-space: pre-wrap;\"\u003eSkunk #1\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; vertical-align: baseline; white-space: pre-wrap;\"\u003e, \u003c/span\u003e\u003ca href=\"https://www.leafly.com/indica/afghani\" style=\"text-decoration:none;\"\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; text-decoration: underline; vertical-align: baseline; white-space: pre-wrap;\"\u003eAfghani\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; vertical-align: baseline; white-space: pre-wrap;\"\u003e, \u003c/span\u003e\u003ca href=\"https://www.leafly.com/indica/northern-lights\" style=\"text-decoration:none;\"\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; text-decoration: underline; vertical-align: baseline; white-space: pre-wrap;\"\u003eNorthern Lights\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"font-size: 13.3333px; font-family: Arial; vertical-align: baseline; white-space: pre-wrap;\"\u003e, and \u003ca href=\"https://www.leafly.com/indica/shiva-skunk\"\u003eShiva\u003c/a\u003e genetics into one potent seed line. Ice features copious yields of high density flowers with incredible \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\"\u003etrichome\u003c/a\u003e production. Some \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\"\u003ephenotypes\u003c/a\u003e will grow quite large, so growing indoors can be challenging. Most users report Ice as having a petrol aroma and a very heavy indica-type buzz, while some variations can present a more uplifting sativa-like effect.\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n","descriptionPlain":"Nirvana Seeds really took their time with this indica/sativa hybrid, carefully selecting from thousands of plants before combining choice Skunk #1, Afghani, Northern Lights, and Shiva genetics into one potent seed line. Ice features copious yields of high density flowers with incredible trichome production. Some phenotypes will grow quite large, so growing indoors can be challenging. Most users report Ice as having a petrol aroma and a very heavy indica-type buzz, while some variations can present a more uplifting sativa-like effect.\n","aka":null,"rating":4.11,"highlightedReviews":[{"id":1417084,"username":"Riotess18","text":"I tried Ice once before when I was trying a ton of strains at once, and it did stand out to me. I have been searching for a good daytime flower that is not more than 50% sativa and that works well for my issues and I have found it! I wish I had donated for more of it and will be getting Ice next time Oregon\u0027s Finest has it available to patients. I vaporize and I regularly ingest RSO so my baseline for review is solid. I vaporized about a half gram (I fill two turkey bags of vapor each time) twice yesterday and I noticed the following medical benefits and side effects: medical issues treated - anxiety, depression, back pain, muscle pain, nerve pain, fibromyalgia, stress, ADHD, loss of appetite; side effects and benefits - focus, attentiveness, relaxation, energy, sense of overall well being, creativity, overall pain relief, I ate better than I had in days, and I slept a solid 7 hours - unusual for me because of pain and fibro - vaping and ingesting less cannabis in the evening than usual, getting tired more \"naturally\" and waking feeling more refreshed than usual. I remembered some of my dreams too which hasn\u0027t happened much lately, a sign for me of deeper, more restful sleep. Ice seems to be the perfect blend of the perfect parts of sativa and indica for my needs and is a strain I will always be looking for when running low until I find the one or two other daytime flowers to add that can match the brilliance of Ice. I am a loyal, daily medical user of cannabis. I\u0027d say the overall effects and benefits of Ice are comparable to how we make ice in trays in our freezers. It usually takes a while to turn water into ice, and the effects of Ice definitely stay with me for a while, which is what seals the deal for me with a flower whose effects meet my needs. I also want to say that this flower from Oregon\u0027s Finest in Portland is grown by the same person who grows their UBC Chemo which I really wish Leafly would list because I could write a book about the medicinal powers of that growers strain of UBC Chemo. It is as powerful as Ice in its own unique way. They do it right there for sure. Take care and be well. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1639141,"username":"SirHighnessss","text":"Picked up some White Castle today, a hybrid of Ice and White Widow. This stash is by far the most unique scented strain I’ve ever had. The aroma in my glass jar perfectly matches the flavour profile described in the “Ice” strain description: the chemically smell hitting your nose first but soon dissipating to the usual smell of fresh bud with a strong presence of gourmet herbs and spices.\n\nThe aroma from the white widow on the other hand is almost non existent, but it makes up for a lack of stench with a heavy indica sedation and muscle relaxer. I’m not sure on this but I think “Ice” alone is a more average mid-low end quality strain with a unique smell and the white widow really gives it a nice kick while keeping the smell.\n\nI personally noticed my steps felt lighter and easier after having smoked a joint sitting down and then walking around downtown. This would be a great strain for workouts.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-22882","title":"ICE Uses a Cannabis Misdemeanor To Arrest, Deport","author":"Stephen Paulsen","category":null,"date":"\/Date(1490717943000)\/","text":"Joel and Jessica Guerrero: Caught in the Trap\nJoel and Jessica Guerrero: Everything was fine until the new immigration rules came down. Then Joel’s decade-old cannabis misdemeanor led to his arrest. (Photo from GoFundMe)\nA legal resident living in upstate New York was arrested late last month, and is now awaiting deportation—all for a decade-old misdemeanor cannabis conviction. President Trump recently lauded his stepped-up immigration enforcement policy for weeding out “drug lords” and “really bad dudes.” But the arrest and potential deportation of Joel Guerrero, a Dominican immigrant living in New Paltz, New York, raises questions about whether the nationwide Immigration and Customs Enforcement (ICE) crackdown is extending to law-abiding residents with minor cannabis convictions.\n \n[table id=63 /]\n \nGuerrero, a 37 year-old newlywed and expectant father, immigrated legally to the United States 20 years ago when he was 17. He was arrested at a routine ICE check-in at the New York City Immigration Court in downtown Manhattan on February 28. Guerrero is currently being held at the Hudson County Correctional Facility, according to ICE inmate records, where he’s slated for deportation.\n\nThe reason? Guerrero has a minor cannabis charge dating from 2004. Since January 2017 almost 40,000 immigrants  have been deported, many of them for minor infractions. Trump removed an Obama-era rule forcing ICE to focus on serious criminals, giving border patrol agents more power to make arrests and deportations based on minor infractions.\nThe details of Guerrero’s case are disputed. In a statement to Gothamist, Rachael Yong Low, a spokesperson for ICE, said that Guerrero has a “felony conviction with intent to manufacture, sell or deliver…marijuana or a synthetic equivalent.”\nBut Joel Guerrero’s wife, Jessica, challenged this account in a phone interview with Leafly. “Either they’re lying or they’re misinformed,” she said, her voice rising. “And either way, that’s really scary for our country.”\nIn this March 3, 2015 photo, Immigration and Customs Enforcement officers escort an arrestee (not Joel Guerrero) in an apartment building, in the Bronx borough of New York, during a series of early-morning raids. (Richard Drew/AP)\nJessica Guerrero, who was with her husband when he was arrested, said an ICE officer even told her specifically that Joel Guerrero was being deported for a misdemeanor marijuana charge.\nShe’s ordered a copy of the judgement from Onslow County, North Carolina, where Guerrero was originally charged, she said.\n\nA clerk at the Onslow County Superior Court confirmed to Leafly that Guerrero was indeed charged with a misdemeanor—not a felony.\nWhen reached for comment via email, an ICE spokesperson told Leafly that the initial ICE statement on Guerrero was incorrect, and that Guerrero had pleaded to a misdemeanor. However, the spokesperson maintained that Guerrero was charged with possession with intent to manufacture, sell or distribute.\nIf the ICE spokesperson is right about that, then the fact that Guerrero was convicted of a misdemeanor, not a felony, would not matter in his deportation case. Immigration law treats anything beyond simple possession as a drug felony, regardless of the original charge. That gives ICE officials broad authority to deport all but the most minor cannabis offenders.\n\nCannabis As a Deportable Offense\nPresident Trump may be taking a harsh public stance on immigration, but the strictures allowing deportations for minor drug offenses have been around since the mid-90s, when Bill Clinton and Congress enacted them as part of the 1996 omnibus crime bill. They’ve stuck around ever since. And the Trump White House isn’t the only administration that’s used them. Data provided by Syracuse University shows that deportations for drug offenses increased by 15% from 2008 to 2013, while Barack Obama was in office. In 2013 alone, over 40,000 people were deported for drug offenses.\nThose rules have been known to most non-citizen residents. Yascha Mounk, a Slate columnist and Harvard lecturer, wrote recently in the New York Times about his own “overly cautious” approach to protecting his US residency. “When applying for a work visa, or for a green card, or for naturalization,” he wrote, “I would have to document every citation and arrest. And since the law explicitly instructs the officer who would decide my fate to ascertain whether I am of ‘good moral character,’ I preferred to avoid the slightest risk of legal trouble.”\nThe Obama administration focused on what it called “smart enforcement,” a policy under which immigration authorities aggressively deported immigrants identified as criminals or terrorists. Because of that policy, the percentage of people deported as a result of criminal convictions rose steadily from 2011 through 2016, from 67% to 92%. And those removals weren’t all for violent crimes. Sejal Zota, a lawyer at the National Immigration Project, estimates that in 2013 alone, roughly 6,000 people were deported for personal possession of marijuana.\nICE deportations, 2011 through 2016. Source: US Immigration and Customs Enforcement, FY 2016 ICE Immigration Removals report.\nWhat has changed under President Trump? It’s difficult to say with any certainty so far. We have mostly anecdotal reports, and it’s hard to know whether those are increasing because enforcement is ramping up or because Trump has thrown such a bright spotlight on the subject. We do have two months of data–January and February 2017–but those figures are muddled because ICE operated for three of the four January weeks under existing Obama-era policies. According to the latest numbers supplied by ICE, 35,604 people were deported in January and February combined. If 2016 figures were evenly spread over 12 months, they would average out to 20,021 deportations per month, which is a higher rate, so far, than ICE has recorded in 2017. \nIt’s a far lower rate, in fact, than ICE recorded under the Obama administration in 2012, when an average of 34,154 people were deported per month.\nHere are the deportation figures from 2008-2016:\nAnnual deportations from the United States. Source: US Immigration and Customs Enforcement.\nAnything Beyond Simple Possession\nBy law, any drug offense beyond simple possession of 30 grams or less of marijuana is enough to deport someone. Even other minor cannabis crimes, like a second possession charge or smoking in a school zone, are enough to trigger a deportation, according to lawyers who specialize in criminal immigration law.\nFor people applying for green cards, or for legal residents returning to the country, the rules are even stricter. Admitting to ever smoking pot — even in a legal state like Colorado — is enough to have someone ruled “inadmissible” to enter the United States.\nLast year, the Denver-based alt-weekly Westword reported the story of a young Chilean woman who was barred from entering the United States after she admitted to trying state-legal cannabis in Colorado on a previous visit.\n\nA couple of things seem to have changed under Trump. Various reports indicate that many Immigration and Customs Enforcement agents feel like the restraints holding them back have been released. Agents “feel emboldened and they feel that now they have a president that’s basically is going to give them carte blanche,” Rep. Raúl Grijalva (D-Ariz.), a frequent critic of ICE tactics, said in a recent interview with HuffingtonPost’s Elise Foley. During Trump’s first week in office, he signed an executive order that called on border officers to “detain individuals apprehended on suspicion of violating Federal or State law, including Federal immigration law.” That’s always been the law, of course, but Trump’s order and his public proclamations made clear that he expected ICE agents to stop prioritizing violent criminals and go after every and any non-citizen suspected of violating federal or state law, no matter how minor the offense.\nToday, “there is a clear ‘everything goes and everyone is a target’ culture in ICE,” Greisa Martinez, advocacy director at the undocumented activist group United We Dream, told Elise Foley. “It’s the realization of the dreams of a lot of ICE agents that endorsed Trump.”\nA big part of the new, bolder tactics on the border is the stepped-up investigation of an immigrant or traveler’s mobile phone, email, and social networking data. Six years ago, Customs and Border Agents rarely asked to search a traveler’s cell phone. As Leafly’s Chris Roberts documented yesterday, in 2010 border agents nationwide searched fewer than 400 phones per month. In February 2017, they searched about 5,000 devices, often looking for evidence of lawbreaking–including the purchase or consumption of state-legal cannabis.\n\n\n\n \nJacob Sapochnick, a immigration lawyer based in San Diego, said he had a German client who was detained for seven hours in August after Border Patrol agents found images from Burning Man on his phone. Another client, Sapochnick said, was asked if he’d tried marijuana while on vacation in Maui.\n“Those are the kinds of things where you have to be careful how you answer,” Sapochnick said. “That’s why they’re searching your social media and phone–to elicit cues for whatever they’re looking for, to be able to deny you entry.”\nSince Trump took office, Sapochnick said, he knows of at least three people who have had their student visas revoked for marijuana offenses — all of them from Muslim countries.\n“I think it’s going to get worse and worse, honestly,” Sapochnick said. “People are going to have to be very, very careful.”\n\nBad Under Obama, Worse Under Trump\nAfter Washington and Colorado legalized recreational marijuana use, in 2013, Eric Holder, then attorney general, made a historic announcement: The Obama administration would not go after marijuana users or businessmen who were following state law.\nAt the same time, the Obama Administration took the opposite stance on immigrants with marijuana offenses, argues Matt Adams, a lawyer at the Northwest Immigrant Rights Project.\n“That was under Obama,” he added. “Of course, the outlook is even more grim when you look at Sessions coming in as attorney general.”\nThings are certainly grim for Joel Guerrero. He’s been checking in with ICE every six months since 2011. His green card was revoked that year when he returned from a trip to the Dominican Republic and then missed an immigration court date.\nIn 2014, an immigration judge gave Guerrero an Order of Removal, according to his wife, Jessica. But she said ICE agents told him, “If you keep reporting to us, you don’t have to worry about it.”\n“He shouldn’t have taken them at their word,” she said. If her husband gets deported, Jessica Guerrero, who’s from New York, plans to leave the country with him.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/03/28101442/immigration-border-patrol.jpg","urlslug":"/news/politics/ice-wants-deport-cannabis-misdemeanor-becomes-felony"},{"id":"contentitems-3323","title":"New Strains Alert: King Cake, Memory Loss, Urkle Train Haze, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1462597200000)\/","text":"The Leafly Explorer has just been updated with some new varieties, just in time for your weekend. Trainwreck fans, rejoice: a couple of these are spins on the classic hybrid\u0027s genetics. Others offer new twists to old strains like Granddaddy Purple, Amnesia Haze, Sour Diesel, and more. Read up on all of our newly added strains below, and remember to leave reviews for any you\u0027ve had the pleasure of trying!\n \n 1. King Cake\n\nKing Cake is a clone-only strain from Oregon growers Golden Beaver Farms that combines Ken’s Granddaddy Purple with Mystic Gem and was originally released under the name Disco Glitter. It has tested at up to 20% THC and combines an uplifting and creative head high with a relaxing body feel. King Cake features a unique terpene profile that smells like sweet basil and licorice and produces frosty purple, green, and yellow flowers reminiscent of the Mardi Gras pastry after which it is named.\n\n \n 2. Urkle Train Haze\n\nAn Arizona Natural Selections original, Urkle Train Haze was created using the genetics of Ghost Train Haze and Purple Urkle. These two parent strains are often described as polar opposites of each other, and yet crossing them yields a pleasantly uplifting and euphoric result. Urkle Train Haze’s fragrance and flavor is that of an invigorating sweet, berry, and pine that will linger long after consumption. With predominantly indica effects, this strain holds a feeling of relaxation that will leave you smiling and ready to raid the fridge.\n\n \n 3. Memory Loss\n\nMemory Loss is a fast-finishing 70% sativa hybrid from Archive Seed Bank that smells very much like a Dutch Haze, with a strong, peppery incense odor and undertones of bubblegum and fruit. This cross of Amnesia Haze and a Face Off OG male produces large, easy to grow plants and heavy yields. Memory Loss is named for its mind-warping high that can leave users in a disoriented and forgetful mental state.\n\n \n 4. Ice Wreck\n\nBy combining two high-potency strains, Ice and Trainwreck, Crop King Seeds has created a real knockout of a hybrid that has tested at over 27% THC. Ice Wreck blends the cerebral high of a sativa with the deep body stone of an indica into one great package.\n\n \n 5. SnowLAnd\n\nA limited edition release from DNA Genetics, SnowLAnd is a cross of Snowcap and LA Confidential created in an attempt to tame the huge size of Snowcap while still producing large yields of potent, highly-resinous flowers. Most phenotypes are compact indica-like plants with extremely dense buds and flavors ranging from fruit to diesel to sandalwood. Reports indicate that SnowLAnd is very strong with a long lasting, balanced high.\n\n \n 6. Purple Power\n\nA sativa-dominant cross of Dutch Dope and Skunk #1, Purple Power is a very popular strain with outdoor and greenhouse growers, but is very unpredictable and difficult to manage when grown indoors. Large yields of resinous purple flowers produce a strong sweet smell and a sweet, skunky flavor when smoked. The buzz comes on quick and strong, with trippy visual effects and a relaxed feeling of euphoria that gradually fades to a deep sense of relaxation.\n\n \n 7. Sour Dubble\n\nOriginally a mysterious clone-only strain of unknown heritage, Sour Dubble is thought to be a cross of East Coast Sour Diesel and Sour Bubble. B.O.G. Seeds recreated Sour Dubble using Rez Dog’s Sour Diesel IBL instead of the ECSD and the results are very similar, if more indica-like than the original sativa-dominant hybrid. Dense buds with copious amounts of trichomes produce a pungent, sweet n’ sour odor and a strong diesel flavor with a sweet fruity aftertaste. The high of Sour Dubble is a nice blend of head and body effects.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/05/12002210/new-strains-alert-king-cake-memory-loss-urkle-train-haze-and-more.jpg","urlslug":"/news/strains-products/new-strains-alert-king-cake-memory-loss-urkle-train-haze-and-more"}],"reviewCount":211,"flavors":[{"name":"Chemical","score":43.764019050545393},{"name":"Earthy","score":42.738515901060069},{"name":"Pepper","score":42.350591488707941},{"name":"Menthol","score":41.766784452296818},{"name":"Pungent","score":40.883392226148409}],"effects":[{"name":"Happy","score":77.971270548471352},{"name":"Uplifted","score":76.027807650944851},{"name":"Focused","score":71.7337532647104},{"name":"Relaxed","score":60.675218927638653},{"name":"Euphoric","score":60.145183591949611}],"symptoms":[{"name":"Stress","score":75.1789829466892},{"name":"Depression","score":71.468735596865884},{"name":"Fatigue","score":64.2057151636196},{"name":"Pain","score":52.386695344907054},{"name":"Nausea","score":42.738515901060069}],"conditions":[{"name":"Anxiety","score":34.825626056229837},{"name":"Migraines","score":24.559072054078968},{"name":"PTSD","score":24.470732831464126},{"name":"Bipolar Disorder","score":7.1401136887386691},{"name":"ADD/ADHD","score":3.5873406053157169}],"negatives":[{"name":"Dizzy","score":23.7640190505454},{"name":"Headache","score":21.236749116607776},{"name":"Dry Mouth","score":13.588876939622061},{"name":"Paranoid","score":9.9324012905208168},{"name":"Anxious","score":6.6984175756644646}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_1ed2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/703755/b/ice__primary_6db3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_cf84.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/703628/b/ice__primary_9dab.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_94a3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607850/b/ice__primary_400d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_665d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/550578/b/ice__primary_46a3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_ca08.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/522301/b/ice__primary_bc20.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ice_100x100_b886.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/508838/b/ice__primary_1f1d.jpg"}],"photoTotalCount":99,"popularCities":["Portland, OR","Bellevue, WA","Eugene, OR","Everett, WA","Salem, OR","Shoreline, WA","Beaverton, OR","Bend, OR","Colorado Springs, CO","Damascus, OR"],"permalink":"https://mobileapi.leafly.com/hybrid/ice","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.10900473933649/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Shiva Skunk","subtitle":null,"slug":"shiva-skunk","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/shiva-skunk","symbol":"Sh","applink":"leafly://strain/shiva-skunk"},{"name":"Northern Lights","subtitle":null,"slug":"northern-lights","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/northern-lights","symbol":"Nl","applink":"leafly://strain/northern-lights"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
