{
    "aka": "Sour Dubb, Sour Double",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1462597200000)/",
            "id": "contentitems-3323",
            "text": "The Leafly Explorer has just been updated with some new varieties, just in time for your weekend. Trainwreck fans, rejoice: a couple of these are spins on the classic hybrid's genetics. Others offer new twists to old strains like Granddaddy Purple, Amnesia Haze, Sour Diesel, and more. Read up on all of our newly added strains below, and remember to leave reviews for any you've had the pleasure of trying!\n \n 1. King Cake\n\nKing Cake is a clone-only strain from Oregon growers Golden Beaver Farms that combines Ken’s Granddaddy Purple with Mystic Gem and was originally released under the name Disco Glitter. It has tested at up to 20% THC and combines an uplifting and creative head high with a relaxing body feel. King Cake features a unique terpene profile that smells like sweet basil and licorice and produces frosty purple, green, and yellow flowers reminiscent of the Mardi Gras pastry after which it is named.\n\n \n 2. Urkle Train Haze\n\nAn Arizona Natural Selections original, Urkle Train Haze was created using the genetics of Ghost Train Haze and Purple Urkle. These two parent strains are often described as polar opposites of each other, and yet crossing them yields a pleasantly uplifting and euphoric result. Urkle Train Haze’s fragrance and flavor is that of an invigorating sweet, berry, and pine that will linger long after consumption. With predominantly indica effects, this strain holds a feeling of relaxation that will leave you smiling and ready to raid the fridge.\n\n \n 3. Memory Loss\n\nMemory Loss is a fast-finishing 70% sativa hybrid from Archive Seed Bank that smells very much like a Dutch Haze, with a strong, peppery incense odor and undertones of bubblegum and fruit. This cross of Amnesia Haze and a Face Off OG male produces large, easy to grow plants and heavy yields. Memory Loss is named for its mind-warping high that can leave users in a disoriented and forgetful mental state.\n\n \n 4. Ice Wreck\n\nBy combining two high-potency strains, Ice and Trainwreck, Crop King Seeds has created a real knockout of a hybrid that has tested at over 27% THC. Ice Wreck blends the cerebral high of a sativa with the deep body stone of an indica into one great package.\n\n \n 5. SnowLAnd\n\nA limited edition release from DNA Genetics, SnowLAnd is a cross of Snowcap and LA Confidential created in an attempt to tame the huge size of Snowcap while still producing large yields of potent, highly-resinous flowers. Most phenotypes are compact indica-like plants with extremely dense buds and flavors ranging from fruit to diesel to sandalwood. Reports indicate that SnowLAnd is very strong with a long lasting, balanced high.\n\n \n 6. Purple Power\n\nA sativa-dominant cross of Dutch Dope and Skunk #1, Purple Power is a very popular strain with outdoor and greenhouse growers, but is very unpredictable and difficult to manage when grown indoors. Large yields of resinous purple flowers produce a strong sweet smell and a sweet, skunky flavor when smoked. The buzz comes on quick and strong, with trippy visual effects and a relaxed feeling of euphoria that gradually fades to a deep sense of relaxation.\n\n \n 7. Sour Dubble\n\nOriginally a mysterious clone-only strain of unknown heritage, Sour Dubble is thought to be a cross of East Coast Sour Diesel and Sour Bubble. B.O.G. Seeds recreated Sour Dubble using Rez Dog’s Sour Diesel IBL instead of the ECSD and the results are very similar, if more indica-like than the original sativa-dominant hybrid. Dense buds with copious amounts of trichomes produce a pungent, sweet n’ sour odor and a strong diesel flavor with a sweet fruity aftertaste. The high of Sour Dubble is a nice blend of head and body effects.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/05/12002210/new-strains-alert-king-cake-memory-loss-urkle-train-haze-and-more.jpg",
            "title": "New Strains Alert: King Cake, Memory Loss, Urkle Train Haze, and More",
            "urlslug": "/news/strains-products/new-strains-alert-king-cake-memory-loss-urkle-train-haze-and-more"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 17.36111111111111
        },
        {
            "name": "Bipolar Disorder",
            "score": 16.666666666666664
        },
        {
            "name": "ADD/ADHD",
            "score": 13.194444444444443
        },
        {
            "name": "Migraines",
            "score": 11.11111111111111
        },
        {
            "name": "PTSD",
            "score": 11.11111111111111
        }
    ],
    "description": "<p>Originally a mysterious clone-only strain of unknown heritage, Sour Dubble is thought to be a cross of <a href=\"https://www.leafly.com/sativa/east-coast-sour-diesel\">East Coast Sour Diesel</a> and <a href=\"https://www.leafly.com/indica/sour-bubble\">Sour Bubble</a>. B.O.G. Seeds recreated Sour Dubble using Rez Dog&rsquo;s <a href=\"http://leafly.com/sativa/sour-diesel\">Sour Diesel</a> IBL instead of the ECSD and the results are very similar, if more indica-like than the original sativa-dominant hybrid. Dense buds with copious amounts of trichomes produce a pungent, sweet n&rsquo; sour odor and a strong diesel flavor with a sweet fruity aftertaste. The high of Sour Dubble is a nice blend of head and body effects.</p>\n",
    "descriptionPlain": "Originally a mysterious clone-only strain of unknown heritage, Sour Dubble is thought to be a cross of East Coast Sour Diesel and Sour Bubble. B.O.G. Seeds recreated Sour Dubble using Rez Dog&rsquo;s Sour Diesel IBL instead of the ECSD and the results are very similar, if more indica-like than the original sativa-dominant hybrid. Dense buds with copious amounts of trichomes produce a pungent, sweet n&rsquo; sour odor and a strong diesel flavor with a sweet fruity aftertaste. The high of Sour Dubble is a nice blend of head and body effects.\n",
    "effects": [
        {
            "name": "Talkative",
            "score": 34.72222222222222
        },
        {
            "name": "Relaxed",
            "score": 34.72222222222222
        },
        {
            "name": "Happy",
            "score": 31.25
        },
        {
            "name": "Uplifted",
            "score": 27.083333333333332
        },
        {
            "name": "Euphoric",
            "score": 27.083333333333332
        }
    ],
    "flavors": [
        {
            "name": "Diesel",
            "score": 22.916666666666664
        },
        {
            "name": "Pungent",
            "score": 15.277777777777777
        },
        {
            "name": "Sweet",
            "score": 7.638888888888888
        },
        {
            "name": "Flowery",
            "score": 5.555555555555555
        },
        {
            "name": "Rose",
            "score": 5.555555555555555
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1413376,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Awesome, upfront Sativa high! Great sweet-diesel flavor that lasts through the bowl. I visited my favorite rec dispensary(Buddahs wellness center) at my favorite  vacation spot(Port Orford, OR). I asked for something from the bottom shelf($30 1/8ths) suitable for joints and blunts that wouldn't put me to sleep, in addition to the top shelf 707 Headband and Durban Poison which I would use in a glass pipe. I quickly found that the cheaper Sour Dub was too potent for blunts or joints after I experienced a heart racing \"too high\" feeling after 4 puffs of blunt, my wife was in the same boat with one big hit. This was impressive since my wife and I are in our 40s and have lots of experience smoking over the years, I had been searching for a bud that \"grabbed me by the boo-boo ever since  recreational became legal in Oregon. I quickly switched to easy puffing off a small pipe and had a bud that was far and away more potent than the 707 Headband or Durban Poison I had purchased at the same time. My only negative here is that Sour Dub(ble) seems to be quite rare, and possibly in danger of disappearing all together, which would be a shame! \nP.S.- I'm amazed this strain is so ignored, it is after all one of the parents of Gorilla Glue #4(one of the trending strains of late). Leafly should enable the lineage link between the two, it might help save this strain!",
            "username": "Umpquadank"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1546922,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Sour Dubble has made its place into a strain I need to always have on hand, usually the first I go to everyday. \nFirst off, the terpene profile is out of this world! Perfect sour diesel, hint of pine and so pungent, even the smoke from it is heavenly.\nSecond, the high is what I consider to be THE perfect sativa dominant, perfect for morning and through out the day, in small doses which is what I prefer, but in larger doses it can be the soaring sativa high as well. I can't recommend this strain enough.\nMy flower is grown by Sunday Goods out of Southern Arizona, and is available through dispensaries throughout the region, and also just recommendation for anything Sunday Goods, they are a top notch farm turning out some of the best most uniquely terpy strains I have ever seen or consumed.",
            "username": "Christoph3r"
        }
    ],
    "id": 224783,
    "name": "Sour Dubble",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 18.749999999999996
        },
        {
            "name": "Dry Eyes",
            "score": 16.666666666666664
        },
        {
            "name": "Headache",
            "score": 2.083333333333333
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/sour-diesel",
            "category": "Sativa",
            "name": "Sour Diesel",
            "permalink": "https://mobileapi.leafly.com/sativa/sour-diesel",
            "slug": "sour-diesel",
            "subtitle": null,
            "symbol": "Sd"
        },
        {
            "applink": "leafly://strain/sour-bubble",
            "category": "Indica",
            "name": "Sour Bubble",
            "permalink": "https://mobileapi.leafly.com/indica/sour-bubble",
            "slug": "sour-bubble",
            "subtitle": null,
            "symbol": "Sbb"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/sour-dubble",
    "photoTotalCount": 2,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/708051/b/sour-dubble__primary_0202.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-dubble_100x100_3610.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/490606/b/sour-dubble__primary_60cf.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-dubble_100x100_1f34.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Eugene, OR",
        "Gunnison, CO",
        "Irvine, CA",
        "Laguna Hills, CA",
        "Lansing, MI",
        "Los Angeles, CA",
        "San Jose, CA",
        "Seattle, WA",
        "Springfield, OR"
    ],
    "rating": 4.8,
    "relatedStrains": [],
    "reviewCount": 15,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "sour-dubble",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.8/240",
    "subtitle": null,
    "symbol": "Sdb",
    "symptoms": [
        {
            "name": "Stress",
            "score": 19.444444444444443
        },
        {
            "name": "Depression",
            "score": 13.888888888888888
        },
        {
            "name": "Insomnia",
            "score": 13.194444444444443
        },
        {
            "name": "Pain",
            "score": 11.11111111111111
        },
        {
            "name": "Fatigue",
            "score": 9.722222222222221
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
