{"sl_translate":"description,descriptionPlain,category","id":4813,"slug":"larry-og","name":"Larry OG","subtitle":null,"symbol":"Log","category":"Hybrid","description":"\u003cp\u003eLarry OG, also called\u0026nbsp;Lemon Larry,\u0026nbsp;is yet another member of the famous ocean-grown family. Originally created in Orange County, this indica is a cross between \u003ca href=\"http://www.leafly.com/hybrid/og-kush\" style=\"text-decoration:none;\"\u003eOG Kush\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/sfv-og\" style=\"text-decoration:none;\"\u003eSFV OG.\u003c/a\u003e Larry OG produces a potent yet easy body buzz that will allow you to relax while getting things done. The effects are happy but not overwhelming. Like other members of the OG family, this strain has a very clean and piney aroma. The nugs tend to be dense and feature distinct burnt orange hairs that are longer than average.\u003c/p\u003e\n","descriptionPlain":"Larry OG, also called\u0026nbsp;Lemon Larry,\u0026nbsp;is yet another member of the famous ocean-grown family. Originally created in Orange County, this indica is a cross between OG Kush and SFV OG. Larry OG produces a potent yet easy body buzz that will allow you to relax while getting things done. The effects are happy but not overwhelming. Like other members of the OG family, this strain has a very clean and piney aroma. The nugs tend to be dense and feature distinct burnt orange hairs that are longer than average.\n","aka":"Grandpa Larry, Lemon Larry","rating":4.28,"highlightedReviews":[{"id":1412913,"username":"KushMunkee","text":"Dense, mildly sticky nugs. Grinds really well. Piney sent with a hint of citrus-fuel. Vaped on Magic Flight Box, 4 pulls on one trench. Citrus on the breath on the exhale. Makes you cough, just a bit.\r\n\r\nComes on really slow from the base of your neck around the spine to fill up the brain with goose down. Creeps in with a constant low/heavy flow, like a steady rise of ocean tide in an estuary. Then it settles into your upper body. Head becomes heavy, leaning to one side. Eyes and mouth tingle. Lungs feel a bit heavy. Definitely good pain meds. Not too giggly, and seemingly really focused. Was able to do some PHP coding and set up a new website without too many distractions - even though my body feels stupid.\r\n\r\nCurrently deep into my first hour and a half. Going to watch some TV and check back in later.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1641477,"username":"loosejoint","text":"Larry OG is everything I read about and much more. It has a clean citrus, piney taste. In a glass bowl the smoke makes the fore-mentioned more favorable.\n\nI suffer from chronic pain and this worked very well. i didn\u0027t have to take my regular pain medicine. I felt relaxed, yet very creative. I am a coder and video editor - it got me back to being more attentive to  my crafts and hobbies. The buzz creeps up on you and stays for a good while - making you feel warm and cozy.\n\nMy eyes got a little dry, but reading sure didn\u0027t help the situation either. Yes, I got the munchies, but it wasn\u0027t like I was ravenous , just wanted something light and not to messy.\n\nOverall it is a very good strain. I recommend it for those suffering with pain and muscle spasms. Pain medicine has a way of upsetting your stomach after a prolonged period of use. Larry OG will put a break in that cycle.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-66121","title":"Try These Strains Before Attending Your Next Sporting Event","author":"Dante Jordan","category":null,"date":"\/Date(1526423695000)\/","text":"If you don’t get high before attending a sporting event, then you’re doing it all wrong. I mean, sure, you can have a good time while being sober, but you can have a great time while being lifted.\nSo with that said, I curated a list of suggested strains for you to indulge in, depending on which sport you’re going to see. Peep the list, use Leafly’s Finder to locate the dispensaries stocking these strains, purchase, and enjoy some good ol’ sportsball.\nStrains to Pair With Exciting Sports (Basketball, Football, Soccer, Hockey)\nSports that fall under this category are the types of sports that include constant back and forth action, which keeps you engaged from start to finish. A big play is always looming, so you’re stuck to the edge of your seat because you don’t want to miss that big dunk or the chance to yell “GOOOOAAALLLLL” in the face of whoever’s sitting next to you. For that reason, you should indulge in strains that’ll have you uplifted and energetic, feeling hyped and ready for that big moment.\n  Candyland\nCandyland’s a high-THC, sativa-dominant hybrid that’ll have you super smacked without the paranoia. As a mix of Grandaddy Purple and Platinum GSC, it’s got an earthy type of scent and a sweet flavor, with effects that will have you uplifted, engaged, and in a whole entire world of euphoria. Smoke these before an exciting sport and those big plays will feel that much bigger.\nFind Candyland Nearby\n  Green Crack\nEveryone knows how good, energized, and focused Green Crack can make you feel. It’s one of those strains that you can smoke and power through the day like you drank 84 cold brews, so it’s perfect to smoke before a sporting event that you want to be locked into.\nFind Green Crack Nearby\n  Cotton Candy Kush\nCotton Candy Kush is another high-THC strain that leaves you feeling good, feeling great, feeling great, feeling good, like Outkast on “GhettoMusick.” As a mix of Power Plant and Lavender, its powerful effects are relaxing yet still energetic while inducing happiness, freedom, and overall euphoria, so you’ll be that much more excited when you see that Ronaldo bicycle kick for the game-winning goal live and in person.\nFind Cotton Candy Kush Nearby\n  Stardawg\nStardawg is one of the best smelling, best tasting, most euphoric, most energetic, most everything strains I’ve ever come across. Gifted to me by LTRMN in Portland, I smoked this and walked around the city for hours, falling in love with everything and everybody. It’s definitely a strain I’d recommend smoking before a sporting event, because every single dunk, touchdown, and goal will likely feel like the greatest moment in sports history for you.\nFind Stardawg Nearby\nStrains to Pair With Chill Sports (Baseball, Golf, Tennis)\nSports that fall under this category tend to be a lot more laid-back and reserved. Baseball games can be long and boring, and golf and tennis matches require damn near complete silence, with light clapping being the most excited you can get, so if you’re overly hyped at any of them, you may feel a bit uncomfortable or out-of-place. These strains will help you lean a little more towards the indica side of things.\n  Obama Kush\nObama Kush is a great indica with a relatively mild THC percentage that’ll chill you out without knocking you out. I smoked a gram joint of Obama Kush a few weeks ago and knocked out the entire first season of Girls Incarcerated on Netflix, which is still shorter than one full-length baseball game.\nFind Obama Kush Nearby\n  Larry OG\nLarry OG is a hybrid of OG Kush and SFV OG, whose indica effects will overtake your body and have you with your feet in the air like your Cares-to-Give Meter is at zero. Smoke a little of this and you’ll have no problem sitting through an entire round of golf, where the most exciting thing possible is a fox running across the course.\nFind Larry OG Nearby\n  Cheese\nCheese is an indica-dominant hybrid that:\n\nactually smells like Cheese, which is wild; and\nwill have you feeling relaxed while avoiding the sleepy sleepy nap nap state of mind.\n\nYou can smoke some Cheese and kick back in comfort for hours, so if you’re going to see one of the chill sports where everything’s deathly silent and calm, Cheese is a good strain to indulge in beforehand.\nFind Cheese Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/05/15152818/strains-before-sports-event.jpg","urlslug":"/news/strains-products/try-these-strains-before-attending-your-next-sporting-event"},{"id":"contentitems-3537","title":"The Best Cannabis Strains for the Holidays (According to Leafly Reviewers)","author":"Brett Konen","category":null,"date":"\/Date(1450897200000)\/","text":"The holidays are fast approaching, so naturally you’re thinking about the perfect cannabis strains to enjoy over the upcoming weeks. Have innumerable aunts, uncles, in-laws, and second cousins coming into town for the long weekend? You’ll probably need something to chill you out after all that family time. Wanting to keep moving in spite of the weather? You’re after something active. Have about a thousand errands left to run? Something to spice up the process would be nice.\nLuckily, Leafly user reviews are a gold mine of suggestions for cannabis strains that fit any scenario, so we’ve compiled a few great user-sourced recommendations for a range of seasonal activities listed below. Whether you’re grocery shopping, cocoa-sipping, or baking some cannabis-infused holiday cookies, try out one of the ideas below and enjoy your holiday celebrations!\n\nFor Coping with Winter\n  “This is the perfect strain to make Seattle winter days productive! A couple hits gives my ambition, creativity and libido a jump-start.” –munin.raven\n \n “My go to for getting my figure back after holiday indulgence!” –grngrazer\n \n “Smooth pull, great taste – exactly what I hoped for…real killer high to cure the inevitable holiday blues.” –hazedandconfused\nFor Spending Time with Family \u0026 Friends\n “Smells like Christmas trees, tastes like pine and lightens the heart and mind…I found it made the whole holiday with ALL the family, very enjoyable. Oh and added benefits of not breaking ornaments or dropping the turkey.” –Free_Byrd\n \n “Smoked this with my Nana and great Uncle Pete while on winter vacation…Made me forget how much my back hurt from sleeping on an air mattress.” –somniumtextrix\n \n “A swift cerebral head high, accompanied by a punch of energy. Best used at a party with friends as is very good for getting you in the mood, to talk, dance, whatever!” –JustAnotherStoner\nFor Curling Up by the Fire\n “I could feel every atom in my body float away in rhythm with the space heater I was sitting next to. Perfect for sitting home on a cold winter evening and then getting a good night sleep.” –Anonymous\n \n “I enjoyed a blunt and hits from my vaporizer along side with a cup of hot chocolate, it was a great combo…pick it up for a stay-at-home type of day.” –kushconnoisseur420\n \n “I’m washing it down with some seasonal ale and it’s the perfect end to a perfect night.” –BudseyXO\nLooks, Smells, and Tastes Like Christmas\n “When I opened the bag I thought I was suddenly on a camping trip. It smelled like a Christmas tree…The taste of pine, clove and earth danced across across my palate.” –robmacpheejr\n \n “Nom nom nom like a Christmas tree with a lifesaver candy cane in your mouth.” –greedyguy\n \n “Feels like I threw a Christmas tree in a wood chipper… lights, ornaments, candy canes – everything – and put it in my Pax to vape it.’” –Midnyte003\nFor Making Spirits Bright\n “This is like that one ‘big’ present hidden behind the tree just when you think you didn’t get what you ‘really’ wanted that year. It’s that good.” –Anonymous\n \n “My brain lit up like Times Square on New Years Eve.” –Grumple\n \n “This strain had me smiling like the Grinch that stole Christmas.” –Skyclub\n \n “Like skating across a frozen lake surrounded by snowflakes in the night.” – bugpowderdustmugwumpjism\n \n “BEST. STRAIN. EVER. Four for you, Sour D, you go Sour D.” –Anonymous\nWhat are some of your favorite strains to enjoy over the holidays? Share in the comments!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12002805/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re.jpg","urlslug":"/news/strains-products/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re"}],"reviewCount":629,"flavors":[{"name":"Pine","score":30.938133232016209},{"name":"Lemon","score":27.58654170888213},{"name":"Citrus","score":22.696090847686591},{"name":"Earthy","score":13.585043059777103},{"name":"Sweet","score":13.408265788584938}],"effects":[{"name":"Relaxed","score":81.581074805808839},{"name":"Happy","score":70.8314336372847},{"name":"Euphoric","score":42.539049307666332},{"name":"Giggly","score":38.918650793650791},{"name":"Focused","score":31.337069402228977}],"symptoms":[{"name":"Pain","score":37.661474164133736},{"name":"Stress","score":34.068515704154},{"name":"Depression","score":26.029213103681187},{"name":"Headaches","score":23.986301080715975},{"name":"Insomnia","score":21.44756838905775}],"conditions":[{"name":"Anxiety","score":32.301165146909824},{"name":"Arthritis","score":17.77123438027693},{"name":"PTSD","score":10.80209388720027},{"name":"ADD/ADHD","score":10.494237588652481},{"name":"Fibromyalgia","score":10.421415906788248}],"negatives":[{"name":"Dry Mouth","score":36.450629010469434},{"name":"Dry Eyes","score":28.350219520432287},{"name":"Headache","score":16.261187098953055},{"name":"Dizzy","score":9.1923125633232},{"name":"Paranoid","score":3.3096926713947989}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/larry-og/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/larry-og/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/larry-og_100x100_719d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003219/b/larry-og__primary_ef41.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/larry-og_100x100_cef0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003218/b/larry-og__primary_dc59.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/larry-og_100x100_db1c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/653002/b/larry-og__primary_0811.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/larry-og_100x100_da1d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648472/b/larry-og__primary_bbb3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/larry-og_100x100_ea41.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/643794/b/larry-og__primary_cdf9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/larry-og_100x100_7cec.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/634891/b/larry-og__primary_aa4a.jpg"}],"photoTotalCount":157,"popularCities":["Portland, OR","Detroit, MI","Los Angeles, CA","Phoenix, AZ","Denver, CO","San Francisco, CA","Chandler, AZ","Eugene, OR","Montréal, QC","Salem, OR"],"permalink":"https://mobileapi.leafly.com/hybrid/larry-og","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.28298887122417/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"},{"name":"SFV OG","subtitle":null,"slug":"sfv-og","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/sfv-og","symbol":"Sfv","applink":"leafly://strain/sfv-og"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":56,"outdoorFinish":null,"height":"Tall","averageYield":"High","environment":null,"growNotes":""}}
