{"sl_translate":"description,descriptionPlain,category","id":621,"slug":"sour-dream","name":"Sour Dream","subtitle":null,"symbol":"Sdr","category":"Hybrid","description":"\u003cp class=\"p1\"\u003eSour Dream is the energetic daughter of a \u003ca href=\"http://www.leafly.com/hybrid/blue-dream\"\u003e\u003cspan class=\"s1\"\u003eBlue Dream\u003c/span\u003e\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/sativa/sour-diesel\"\u003e\u003cspan class=\"s1\"\u003eSour Diesel\u003c/span\u003e\u003c/a\u003e cross. Featuring a strong, sour, fuel-like aroma, this hybrid takes after its Diesel heritage. A sativa-dominant hybrid, Sour Dream is extremely uplifting and fun. Its euphoric effects make this a great social strain. Perfect for being out and about, Sour Dream will ease anxiety while giving you energy equivalent to a cup of coffee.\u003c/p\u003e\n","descriptionPlain":"Sour Dream is the energetic daughter of a Blue Dream and Sour Diesel cross. Featuring a strong, sour, fuel-like aroma, this hybrid takes after its Diesel heritage. A sativa-dominant hybrid, Sour Dream is extremely uplifting and fun. Its euphoric effects make this a great social strain. Perfect for being out and about, Sour Dream will ease anxiety while giving you energy equivalent to a cup of coffee.\n","aka":null,"rating":4.44,"highlightedReviews":[{"id":1413895,"username":"Prof_Zeitgeist","text":"Good stuff. Smoked some, lost the bowl. Waiting to come down so i can find the bowl again.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1620291,"username":"SayWeedski","text":"This is the perfect strain if you need to stay productive and focused. It wakes you up just like a cup of coffee would but without the crash.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3127","title":"11 Arousing Strains to Help You Celebrate Valentine\u0027s Day Right","author":"Rebecca Kelley","category":null,"date":"\/Date(1392406680000)\/","text":"There’s nobody we’d rather spend Valentine’s Day with than all of you Leafly fans. Thanks for making our website and app such a success! You fill the buds in our heart.\nTo celebrate this amorous day, here are a few strains you might want to pick up for you and your honey, as they’ve been tagged by Leafly visitors as having an “arousing” effect. Enjoy!\nTo Kick the Evening Off\n\nYou don’t have to be of the Asian “persuasian” to enjoy this titillating sativa. Though Asian Fantasy is a somewhat rare find, this strain delivers arousing, energetic, and relaxing effects, as well as flavors of apples and cheese.\n“this strain smells and taste so good with a more sativa buzz to it” – lazytoke\n\nSweet and citrusy, Ultimate Trainwreck is rated high in arousal, focus, and happiness, which sounds like a recipe for a fun evening with your loved one.\n“By far one of my favorite strains. Just make sure you have a couch nearby, because you won’t be leaving it for a few hours. Smelled like an Angel’s Lady Parts, after they’d been put through 4 Quarters of an NFL game. I wouldn’t have it any other way.” – Sinsation\nTo Keep Things Going Right\n\nThis pretty Purple Princess has berry flavors and will leave you feeling creative, energetic, and euphoric — a perfect combination for trying out some new moves on your own prince or princess.\n“really nice head high, noticed a little cough so I broke it up and noticed that was a better idea. this girl has allot of branches tucked in her, not a terrible pain though because it’s easier to decipher flower because of her dark purple color. the feeling i instantly have after smoking it is it makes me feel happy in my head, really nice to listen to music on or some sexual adventure, I can see too. I donated a 25 and to my surprise she hits hard as a cerebral high and could have a couch lock feel if you let it.” – DevyantByson\n\nSour Dream is a beautiful hybrid of Blue Dream and Sour Diesel, resulting in an earthy, pungent experience that will spark arousal, euphoria, and a touch of the giggles. Keep you and your honey’s mood in amorous spirits with this Dream.\n“Just picked up and was surprised by the high I got. It smokes smooth and the high is even smoother. Drops you in some giggle fits and some longs conversations. Very social, functional, and fun high. Highly recommended if you want to uplift your day and go out and do something.” – Anonymous/a\u003e\nTo Take You Straight to Cuddle Town\n\nWhile it’s another somewhat rare find, Yumboldt is a potent strain that will help you and your drift off to sleep after a night of sexy shenanigans feeling happy and relaxed.\n“This is an effective strain of cannabis that provides a smooth, mellow, and pain relieving high. It has a very pleasant scent, with a great taste.. along with thick, beautiful orange hairs on the buds. As a veteran smoker, I will say that it’s one of the very best.” – Anonymous\n\nSome people can’t celebrate Valentine’s Day without a piece of chocolate, so Chocolate Chunk is a perfect way to cap off your special night. With flavors most commonly described as nutty, earthy, and coffee, this strain offers a rich way to help you both drift off to sleep.\n“I enjoy this strain before I end the day. It really helps me unwind all my stress after a long busy day.” – jakeyodice\nRecommended By Leafly Users\nLooking to stock up on even more sexy strains? Here are some Leafly visitor reviews that highlight some of our strains’ seductive sides:\n\n“Seriously, the sex on this strain has been… the BEST ever. My wife and I love it. My only complaint about GC is it doesn’t allow a solid night’s sleep. Instead, I can be restless and wake up feeling and looking tired. Oh well, not a big deal for weekends. And did I mention the sex? Wow.” – Synthie\n\n“Had great sex \u0026 amazing orgasm. Great daytime/sexytime strain” – koesherbacon\n\n“Wow, best sex of my life after this stuff! Great overall high, only down part is the scary dry eyes it’s typically gives.” – Anonymous\n\n“STRONG. extremely aroused… uncontrollable sex drive pain relief. head high is psychedlic and introspective but not euphoric. – georgeeliot\nLast, but certainly not least, this offering seems to be quite the popular arousing strain among our visitors:\n\n“I love it. Great high, great smell, awsome taste and an amazing high. Great to have sex while using. I recommend this strain to anyone.” – Long_live12\n“You won’t need Viagra with this awesome strain.” – ZenKat\n“This one makes both the male and female hormone go a little wild and if your lucky the sex better.” – McLovin94","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/02/12001707/happy-valentines-day-from-leafly.jpg","urlslug":"/news/strains-products/happy-valentines-day-from-leafly"}],"reviewCount":108,"flavors":[{"name":"Diesel","score":46.136363636363633},{"name":"Earthy","score":11.515151515151516},{"name":"Sweet","score":10.151515151515152},{"name":"Blueberry","score":6.1363636363636367},{"name":"Citrus","score":5.9469696969696972}],"effects":[{"name":"Happy","score":98.030303030303017},{"name":"Energetic","score":90.378787878787875},{"name":"Euphoric","score":79.242424242424249},{"name":"Creative","score":74.6969696969697},{"name":"Focused","score":66.477272727272734}],"symptoms":[{"name":"Fatigue","score":27.386363636363633},{"name":"Depression","score":16.666666666666664},{"name":"Stress","score":13.181818181818182},{"name":"Pain","score":11.098484848484848},{"name":"Headaches","score":6.8939393939393945}],"conditions":[{"name":"Anxiety","score":13.977272727272727},{"name":"ADD/ADHD","score":7.4621212121212119},{"name":"Migraines","score":6.7045454545454541},{"name":"Arthritis","score":5},{"name":"Bipolar Disorder","score":4.2045454545454541}],"negatives":[{"name":"Dry Mouth","score":29.469696969696969},{"name":"Dry Eyes","score":25.265151515151512},{"name":"Anxious","score":6.3257575757575761},{"name":"Paranoid","score":5.9469696969696972},{"name":"Dizzy","score":4.2045454545454541}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-dream_100x100_27c0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/534862/b/sour-dream__primary_ac3f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-dream_100x100_ac5d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/515390/b/sour-dream__primary_e4e2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-dream_100x100_50dc.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509969/b/sour-dream__primary_add0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-dream_100x100_88a9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503978/b/sour-dream__primary_4f34.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-dream_100x100_5b86.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/501176/b/sour-dream__primary_e7c0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-dream_100x100_f36c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500593/b/sour-dream__primary_dfc8.jpg"}],"photoTotalCount":37,"popularCities":["Phoenix, AZ","Albany, OR","Bend, OR","Brampton, ON","Calgary, AB","Chandler, AZ","Edmonton, AB","Eugene, OR","Fort McMurray, AB","Gold Hill, OR"],"permalink":"https://mobileapi.leafly.com/hybrid/sour-dream","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.43518518518519/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Sour Diesel","subtitle":null,"slug":"sour-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/sour-diesel","symbol":"Sd","applink":"leafly://strain/sour-diesel"},{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
