{"sl_translate":"description,descriptionPlain,category","id":42223,"slug":"humboldt","name":"Humboldt","subtitle":null,"symbol":"Hm","category":"Hybrid","description":"\u003cp\u003eThe genetics of the Humboldt strain are something of a mystery, but it\u0026rsquo;s believed to be an \u003ca href=\"http://leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e strain that was cultivated in the Humboldt County area of California in the 1970s and later gained popularity in Europe in the 1990s. These plants are fast, tall growers that need lots of attention. Given proper care, they grow well indoors and out, flower in 8 weeks, and have above average yields. Humboldt\u0026rsquo;s aroma is floral and sweet and its high is uplifting and upbeat, bringing to mind the qualities of a Haze strain. It\u0026rsquo;s a good choice if you want to stay clear-headed.\u003c/p\u003e\n","descriptionPlain":"The genetics of the Humboldt strain are something of a mystery, but it\u0026rsquo;s believed to be an Afghani strain that was cultivated in the Humboldt County area of California in the 1970s and later gained popularity in Europe in the 1990s. These plants are fast, tall growers that need lots of attention. Given proper care, they grow well indoors and out, flower in 8 weeks, and have above average yields. Humboldt\u0026rsquo;s aroma is floral and sweet and its high is uplifting and upbeat, bringing to mind the qualities of a Haze strain. It\u0026rsquo;s a good choice if you want to stay clear-headed.\n","aka":"Humboldt Kush","rating":4.3,"highlightedReviews":[{"id":1415579,"username":"LegitLogic","text":"This strain just popped up in Tx recently and I would have to say im pretty amazed. Its a very very Indica dominant strain that really puts you in a haze. A definite couchlock bud! Buds are beautiful and dense with a very very strong pungent skunk smell too it. This is now a new favorite of mine.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png"},{"id":1611078,"username":"Chadd720","text":"Terrific strain, definitely more of a head high but still relaxed. And definitely clear headed. Feel light headed a bit and uplifting ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-60005","title":"8 Amazing Places to Blaze Up in Humboldt County","author":"Ocean Malandra","category":null,"date":"\/Date(1520701248000)\/","text":"For any cannabis aficionado, hearing the words “Humboldt County” can get the goosebumps going. One of the top cannabis producers in the Emerald Triangle—reaching back to the 1960s and 70s—Humboldt is known far and wide as the Napa Valley of weed; the place that produces the best quality outdoor cannabis in the entire country.\nBut while many connoisseurs have sampled its finest wares, Humboldt County has a lot more to offer than its incredible bud; it’s also a natural paradise filled with gorgeous landscapes and stunning views. And now that California has finally gone recreational, exploring Humboldt County—and all it has to offer—has become one of the best cannabis-infused trips in the world.\n\nBursting with wild coastlines, pristine rivers, unique small towns, and towering stands of ancient redwoods, Humboldt County is a truly breathtaking experience.\nBelow, discover some incredible places to light up and enjoy one of California’s greatest gems.\nPatrick’s Point State Park\n(Redwood Coast/Flickr Creative Commons)\nThe dramatic meeting of land and sea that Humboldt County embodies is on full display at Patrick’s Point State Park—a single square mile of lush forest teeters over the vast ocean on rugged rock promontories. Day hikes along the cliff edge offer fantastic views of raw Humboldt coastline, while inside the park a model Yurok village gives you a chance to explore daily indigenous life before European contact.\nCheck out Wedding Rock before you go, where countless couples have tied the knot backed by awe-inspiring panoramas of Agate Beach, where semi-precious stones lie hidden in the golden sands. Spark up a deliciously relaxing and euphoric strain, like Blueberry Muffins from Humboldt Seed Company, to take in this Eden-like paradise.\nThe Trinity River\n(CampPhoto/iStock)\nClear as glass and sparkling green, the living jewel known as the Trinity River winds its way out of the snowcapped Trinity Alps—the highest point on California’s coastal range. Locals flock here in the summertime to soak in high temperatures in this mountainous paradise. An hour inland from Eureka and Arcata, the town of Willow Creek is the center of activity here. Stop by River Song Natural Foods (a great place to stock up on munchies before hitting the river), and check out a handful of white water rafting outfits around the area.\nCamp Kimtu, just outside Willow Creek, fronts multiple swimming holes and riverside camping while the South Fork of Trinity offers a crystalline paradise of natural pools and rocky edges. For something truly mind-blowing, head into the Hoopa Indian Reservation, the largest in the state, and check out Tish Tang. This native run campground and natural beach offers a spectacular backdrop of forest covered mountains at a picture-perfect bend in the shimmering river. End the day by massaging your tired muscles with Wipe Out Salve by Humboldt Marijuana Company before beginning another adventure in the clear waters.\n\nThe Manila Dunes\n(Redwood Coast/Flickr Creative Commons)\nThe narrow spits that separate the tranquil Humboldt Bay from the Pacific Ocean are home to eco-systems bursting with wildflowers. They seem to have been made just for whiling away the better part of a cannabis-infused afternoon.\nMake your way to the lookout point above the Manila community center for a panoramic view of the bay and the rolling redwood hills before meandering through the dunes and, finally, onto the wilderness beach. From here, it’s a short trot over to the Humboldt Coastal Nature Center, a hobbit-hole like structure built right into the side of a massive sand dune that hosts a variety of educational exhibits for public enjoyment.\nThe Lost Coast\n(Redwood Coast/ Flickr Creative Commons)\nAn endless stretch of black sand beaches against a backdrop of rugged, ocean-worn mountains, the Lost Coast is the largest wilderness coastline on the west outside of Alaska. While the breathtaking Lost Coast Trail takes up to five days to hike—weaving up and down the wind swept summits of the Kings Range to isolated beaches—it is also possible to access the pristine coastline from the town of Shelter Cove, where you’ll find the Black Sands Beach trailhead.\nAn incredible day hike is also possible at King’s Peak, which offers dramatic 360° views of the Lost Coast at 4,000 feet. Exploring the old farming communities of the Matolle Valley, a bastion of old school hippies and a center of cannabis fueled counter cultures via the Lost Coast Scenic Drive, makes for slow travel at its best. It boasts several stand-out swimming holes along the Matolle River made more spectacular with fresh fruit dipped in Humboldt Valley Farms’ infused Chocolate Space Sauce.\n\nThe Humboldt Bay\n(shunyufan/iStock)\nThe largest protected body of water between San Francisco Bay and Puget Sound, Humboldt Bay is bookended by two unique towns—the Victorian seaport of Eureka and the hip college town of Arcata. The bay is home to California sea lions, river otters, and other marine mammals as well as an abundance of avian species.\nFrom the Eureka side, you’ll find the mural-peppered waterfront where Old Town reveals several stand-out small businesses worth patronizing. The Works record store, the palatial Eureka Books with its vast selection of local hiking and wildlife guides, and Humboldt Herbals, where you can stock up on natural, local products like Redwood Honey and talk to an herbalist about your medical marijuana regime.\nThe Victorian downtown area gives way to a bay-front promenade lined with benches, making it a wonderful place to spark up Bubba’s Gift—developed by Humboldt Seed Organization—before taking in the views over the marina and the redwood carpeted hills in the background. If you’re feeling adventurous, kayaks and small sailboat rentals are available, while the 1930s-era Madaket Ferry offers daily sunset cocktail cruises which sets out from the Eureka boardwalk daily.\nIn Arcata, known far and wide for its dedication to all things eco-friendly, an innovative wastewater treatment program has transformed a tidal marsh into a bird sanctuary that offers sweeping views out over the Humboldt Bay.\nThe Arcata Community Forest\n(yhelfman/iStock)\nConsidered a “model” for ecological sustainability, Arcata’s community owned forest blankets the hills just behind Humboldt State University, covering nearly 800 acres. Although you won’t find the several thousand-year-old giants here that exist in nearby State and National Parks, you will enjoy the pleasant and well-kept trail system that let you get completely lost in nature just steps from downtown Arcata. Frisbee golfers have set up a world-class course within the community forest, and just below it—in the grassy open space known as Redwood Park—cannabis lovers gather to puff and pass all day long.\n\nGrizzly Creek Redwoods State Park\n(maislam/iStock)\nYou have to leave the tourist track and head up the rural Highway 36 into Humboldt’s mountainous interior in order to reach Grizzly Creek Redwoods State Park. It’s a hidden gem where old growth forest surrounds the sapphire waters of the Van Duzen River. Fill a thermos of Kikoko’s Positivi-Tea (made with Humboldt-grown bud) to lift the spirits as you travel through the woods and rivers.\nThis small but picture-perfect park is the ultimate place to shun reality in exchange for clear summer skies, hot swimming weather, and spectacular star-gazing through the forest canopy. While car-camping is available at the main entrance, there are several nicely clandestine camping sites located in the gorgeous groves just steps from the riverbank.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/08123143/8-amazing-places-to-toke-up-31.jpg","urlslug":"/news/lifestyle/8-amazing-places-to-blaze-up-in-humboldt-county"},{"id":"contentitems-49249","title":"Don\u0027t Blame Wildfires for Rising California Cannabis Prices","author":"Chris Roberts","category":null,"date":"\/Date(1511203152000)\/","text":"October’s vicious Northern California wildfires, the deadliest and most damaging in US history, also dealt an unprecedented blow to California’s emerging legal cannabis industry—and at a crucial moment.\n\nIn addition to at least 43 deaths and the destruction of more than 8,900 homes and buildings, the fires’ casualties included at least 47 legal marijuana farms, according to the most recent tally from the California Growers Association. Total damage to legal cannabis crops is now estimated at “$60 million or greater,” according to Hezekiah Allen, the association’s executive director.\nAs much as 4% of the state’s cannabis crop may be affected in some way, according to commonly accepted industry estimates.\nThat figure could rise as farms untouched by flames discover their crops are contaminated with toxic smoke, or as wholesalers find that their smoke-scented harvest—which has earned nicknames like “campfire pot” and “hickory kush”—is now worthless on an already saturated market. “Is there benzene in that smoke? We just don’t know yet,” Allen said.\n\nBut as apocalyptic as the fires were for the farmers they touched, as far as statewide marijuana prices are concerned, they may as well not have existed.\nThe fires simply aren’t enough to disrupt a marketplace already drowning in biblical oversupply.\n“I don’t expect this fire to affect cannabis prices too much,” said Mike Ray, CEO of Bloom Farms, a major cannabis oil producer. “Production is at an all-time high. That’s going to be much more to blame for price elasticity than the fire.”\n\nAnd while whatever impact the fires had on the statewide marijuana market has already been absorbed, farmers and analysts say, small and medium cannabis cultivators are still at serious risk of being driven out of business. The real knockout blows to cannabis businesses have yet to come.\nRay, too, is a victim of a California wildfire. His family home and his company’s farm both went up in flames during the 2015 Butte fire in Calaveras County, and he has yet to fully rebuild.\nThe recent fires will absolutely put some people out of business—but cold, hard market forces will end the dreams of many more.\n\nIn 2016, the state’s marijuana farmers produced as much as 13.5 million pounds of cannabis, according to a study commissioned by the state Department of Food and Agriculture. That’s five times more than California cannabis users consumed. The surplus exited the state to be sold on the black market at a higher price—or worse, stayed put.\nThis year, industry observers are seeing more of the same—literally. Last year’s harvest is still coming into dispensaries for sale, and it’s now competing for shelf space with the 2017 crop—including the bounty from massive, investor-backed greenhouses.\n“From what I saw before the fire, there was an awful lot of cannabis in the market,” said Andrew DeAngelo, the co-founder and director of operations at Oakland-based Harborside, the state’s largest dispensary. “Last year’s crop was still coming into our shop and being offered to us before the fire—and last year’s crop is still coming into our shop and being offered to us, post-fire.”\n\nHarborside sources about “between 10 and 20%” of its products from the wildfire-affected areas, DeAngelo said—but the dispensary is also currently cultivating marijuana on a 47-acre former ivy topiary nursery in Monterey County.\nDespite the obvious oversupply, many cannabis businesses are building bigger and bigger farms. Last week, California officials finally released the state’s long-awaited regulations for the cannabis industry—which include no limit on how many acres a cannabis cultivator can plant.\nCities, meanwhile, are generally keeping the number of retail stores steady, meaning most of California’s marijuana harvest may never see a dispensary shelf.\n\nFor most sun-grown marijuana farmers new or old, prices are at an all-time low.\nHow low? While retail prices have remained relatively stable (so far), suppliers are reporting wholesale offers of $500 to $700 per pound for outdoor-grown flower—if the crops are accepted at all.\nFor cannabis destined to be extracted into concentrates to fill vape cartridges or dab rigs, prices are even lower. $50 a pound isn’t unheard of.\nFaced with such low profit margins—as well as the choice of either selling product at a loss or trying to ship it out of state—many small-to-medium marijuana entrepreneurs are calling it quits.\n\nThese growers generally don’t have massive savings or any hope at investment from funders looking for pre-legalization’s massive margins, said Kevin Jodrey, a nursery owner and longtime cannabis cultivator based in Humboldt County.\n“This was a make-or-break year,” he said.\nBut while wholesale prices continue to tumble and producers’ livelihoods evaporate, it’s not clear consumers will see much savings at all.\n\nThe state’s marijuana market has yet to figure out how it will react to government regulations, which are poised to increase overhead for cannabis businesses and raise end prices for consumers. When state excise, cultivation, and state and local sales taxes are added tallied, the government’s toll on California marijuana will be as high as 45 percent in some parts of the state, according to a recent report by Fitch Ratings.\nThat doesn’t include the cost of subjecting products to purity tests, which are shaping up to be the toughest in the nation and could be so costly that, at current estimates and prices, testing a pound of cannabis could be more expensive than buying one.\nAccording to an estimate from the state’s official Bureau of Cannabis Control, lab testing will cost $407 per pound.\nSo while the recent fires won’t cause prices to spike, more expensive cannabis is still coming.\n“Retailers are paying less and less for cannabis than we did 10 years ago, but our costs to deliver that cannabis have gone up and up,” DeAngelo said. “It’s a lot more expensive to do this legally. With the taxes going up from 0% to 35% just on the supply chain itself, I don’t see how I can not raise prices.”","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/20103050/california-fire-cannabis.jpg","urlslug":"/news/industry/dont-blame-wildfires-for-rising-california-cannabis-prices"}],"reviewCount":44,"flavors":[{"name":"Earthy","score":28.75},{"name":"Woody","score":28.4375},{"name":"Pine","score":27.1875},{"name":"Flowery","score":11.5625},{"name":"Sweet","score":11.25}],"effects":[{"name":"Relaxed","score":52.1875},{"name":"Happy","score":40.9375},{"name":"Uplifted","score":39.6875},{"name":"Tingly","score":27.8125},{"name":"Talkative","score":27.5}],"symptoms":[{"name":"Stress","score":29.6875},{"name":"Cramps","score":25.625},{"name":"Lack of Appetite","score":11.25},{"name":"Pain","score":3.125},{"name":"Depression","score":2.1875}],"conditions":[{"name":"Anxiety","score":27.8125},{"name":"PMS","score":25.3125},{"name":"ADD/ADHD","score":1.875},{"name":"Migraines","score":1.25},{"name":"PTSD","score":1.25}],"negatives":[{"name":"Dry Mouth","score":12.1875},{"name":"Dry Eyes","score":2.5},{"name":"Dizzy","score":1.25},{"name":"Headache","score":0.9375},{"name":"Paranoid","score":0.9375}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_126a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630957/b/humboldt__primary_0420.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_d656.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/601168/b/humboldt__primary_8751.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_84e0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/600564/b/humboldt__primary_f236.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_ea98.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/562428/b/humboldt__primary_3548.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_ef41.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/553346/b/humboldt__primary_6acc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_1780.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/458767/b/humboldt__primary_1b21.jpg"}],"photoTotalCount":17,"popularCities":["Los Angeles, CA","Arcata, CA","San Jose, CA","Berkeley, CA","Bremerton, WA","Detroit, MI","Granite Falls, WA","Mount Morris, MI","Oakland, CA","Olympia, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/humboldt","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.29545454545455/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":42223,"slug":"humboldt","name":"Humboldt","subtitle":null,"symbol":"Hm","category":"Hybrid","description":"\u003cp\u003eThe genetics of the Humboldt strain are something of a mystery, but it\u0026rsquo;s believed to be an \u003ca href=\"http://leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e strain that was cultivated in the Humboldt County area of California in the 1970s and later gained popularity in Europe in the 1990s. These plants are fast, tall growers that need lots of attention. Given proper care, they grow well indoors and out, flower in 8 weeks, and have above average yields. Humboldt\u0026rsquo;s aroma is floral and sweet and its high is uplifting and upbeat, bringing to mind the qualities of a Haze strain. It\u0026rsquo;s a good choice if you want to stay clear-headed.\u003c/p\u003e\n","descriptionPlain":"The genetics of the Humboldt strain are something of a mystery, but it\u0026rsquo;s believed to be an Afghani strain that was cultivated in the Humboldt County area of California in the 1970s and later gained popularity in Europe in the 1990s. These plants are fast, tall growers that need lots of attention. Given proper care, they grow well indoors and out, flower in 8 weeks, and have above average yields. Humboldt\u0026rsquo;s aroma is floral and sweet and its high is uplifting and upbeat, bringing to mind the qualities of a Haze strain. It\u0026rsquo;s a good choice if you want to stay clear-headed.\n","aka":"Humboldt Kush","rating":4.3,"highlightedReviews":[{"id":1415579,"username":"LegitLogic","text":"This strain just popped up in Tx recently and I would have to say im pretty amazed. Its a very very Indica dominant strain that really puts you in a haze. A definite couchlock bud! Buds are beautiful and dense with a very very strong pungent skunk smell too it. This is now a new favorite of mine.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png"},{"id":1611078,"username":"Chadd720","text":"Terrific strain, definitely more of a head high but still relaxed. And definitely clear headed. Feel light headed a bit and uplifting ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-60005","title":"8 Amazing Places to Blaze Up in Humboldt County","author":"Ocean Malandra","category":null,"date":"\/Date(1520701248000)\/","text":"For any cannabis aficionado, hearing the words “Humboldt County” can get the goosebumps going. One of the top cannabis producers in the Emerald Triangle—reaching back to the 1960s and 70s—Humboldt is known far and wide as the Napa Valley of weed; the place that produces the best quality outdoor cannabis in the entire country.\nBut while many connoisseurs have sampled its finest wares, Humboldt County has a lot more to offer than its incredible bud; it’s also a natural paradise filled with gorgeous landscapes and stunning views. And now that California has finally gone recreational, exploring Humboldt County—and all it has to offer—has become one of the best cannabis-infused trips in the world.\n\nBursting with wild coastlines, pristine rivers, unique small towns, and towering stands of ancient redwoods, Humboldt County is a truly breathtaking experience.\nBelow, discover some incredible places to light up and enjoy one of California’s greatest gems.\nPatrick’s Point State Park\n(Redwood Coast/Flickr Creative Commons)\nThe dramatic meeting of land and sea that Humboldt County embodies is on full display at Patrick’s Point State Park—a single square mile of lush forest teeters over the vast ocean on rugged rock promontories. Day hikes along the cliff edge offer fantastic views of raw Humboldt coastline, while inside the park a model Yurok village gives you a chance to explore daily indigenous life before European contact.\nCheck out Wedding Rock before you go, where countless couples have tied the knot backed by awe-inspiring panoramas of Agate Beach, where semi-precious stones lie hidden in the golden sands. Spark up a deliciously relaxing and euphoric strain, like Blueberry Muffins from Humboldt Seed Company, to take in this Eden-like paradise.\nThe Trinity River\n(CampPhoto/iStock)\nClear as glass and sparkling green, the living jewel known as the Trinity River winds its way out of the snowcapped Trinity Alps—the highest point on California’s coastal range. Locals flock here in the summertime to soak in high temperatures in this mountainous paradise. An hour inland from Eureka and Arcata, the town of Willow Creek is the center of activity here. Stop by River Song Natural Foods (a great place to stock up on munchies before hitting the river), and check out a handful of white water rafting outfits around the area.\nCamp Kimtu, just outside Willow Creek, fronts multiple swimming holes and riverside camping while the South Fork of Trinity offers a crystalline paradise of natural pools and rocky edges. For something truly mind-blowing, head into the Hoopa Indian Reservation, the largest in the state, and check out Tish Tang. This native run campground and natural beach offers a spectacular backdrop of forest covered mountains at a picture-perfect bend in the shimmering river. End the day by massaging your tired muscles with Wipe Out Salve by Humboldt Marijuana Company before beginning another adventure in the clear waters.\n\nThe Manila Dunes\n(Redwood Coast/Flickr Creative Commons)\nThe narrow spits that separate the tranquil Humboldt Bay from the Pacific Ocean are home to eco-systems bursting with wildflowers. They seem to have been made just for whiling away the better part of a cannabis-infused afternoon.\nMake your way to the lookout point above the Manila community center for a panoramic view of the bay and the rolling redwood hills before meandering through the dunes and, finally, onto the wilderness beach. From here, it’s a short trot over to the Humboldt Coastal Nature Center, a hobbit-hole like structure built right into the side of a massive sand dune that hosts a variety of educational exhibits for public enjoyment.\nThe Lost Coast\n(Redwood Coast/ Flickr Creative Commons)\nAn endless stretch of black sand beaches against a backdrop of rugged, ocean-worn mountains, the Lost Coast is the largest wilderness coastline on the west outside of Alaska. While the breathtaking Lost Coast Trail takes up to five days to hike—weaving up and down the wind swept summits of the Kings Range to isolated beaches—it is also possible to access the pristine coastline from the town of Shelter Cove, where you’ll find the Black Sands Beach trailhead.\nAn incredible day hike is also possible at King’s Peak, which offers dramatic 360° views of the Lost Coast at 4,000 feet. Exploring the old farming communities of the Matolle Valley, a bastion of old school hippies and a center of cannabis fueled counter cultures via the Lost Coast Scenic Drive, makes for slow travel at its best. It boasts several stand-out swimming holes along the Matolle River made more spectacular with fresh fruit dipped in Humboldt Valley Farms’ infused Chocolate Space Sauce.\n\nThe Humboldt Bay\n(shunyufan/iStock)\nThe largest protected body of water between San Francisco Bay and Puget Sound, Humboldt Bay is bookended by two unique towns—the Victorian seaport of Eureka and the hip college town of Arcata. The bay is home to California sea lions, river otters, and other marine mammals as well as an abundance of avian species.\nFrom the Eureka side, you’ll find the mural-peppered waterfront where Old Town reveals several stand-out small businesses worth patronizing. The Works record store, the palatial Eureka Books with its vast selection of local hiking and wildlife guides, and Humboldt Herbals, where you can stock up on natural, local products like Redwood Honey and talk to an herbalist about your medical marijuana regime.\nThe Victorian downtown area gives way to a bay-front promenade lined with benches, making it a wonderful place to spark up Bubba’s Gift—developed by Humboldt Seed Organization—before taking in the views over the marina and the redwood carpeted hills in the background. If you’re feeling adventurous, kayaks and small sailboat rentals are available, while the 1930s-era Madaket Ferry offers daily sunset cocktail cruises which sets out from the Eureka boardwalk daily.\nIn Arcata, known far and wide for its dedication to all things eco-friendly, an innovative wastewater treatment program has transformed a tidal marsh into a bird sanctuary that offers sweeping views out over the Humboldt Bay.\nThe Arcata Community Forest\n(yhelfman/iStock)\nConsidered a “model” for ecological sustainability, Arcata’s community owned forest blankets the hills just behind Humboldt State University, covering nearly 800 acres. Although you won’t find the several thousand-year-old giants here that exist in nearby State and National Parks, you will enjoy the pleasant and well-kept trail system that let you get completely lost in nature just steps from downtown Arcata. Frisbee golfers have set up a world-class course within the community forest, and just below it—in the grassy open space known as Redwood Park—cannabis lovers gather to puff and pass all day long.\n\nGrizzly Creek Redwoods State Park\n(maislam/iStock)\nYou have to leave the tourist track and head up the rural Highway 36 into Humboldt’s mountainous interior in order to reach Grizzly Creek Redwoods State Park. It’s a hidden gem where old growth forest surrounds the sapphire waters of the Van Duzen River. Fill a thermos of Kikoko’s Positivi-Tea (made with Humboldt-grown bud) to lift the spirits as you travel through the woods and rivers.\nThis small but picture-perfect park is the ultimate place to shun reality in exchange for clear summer skies, hot swimming weather, and spectacular star-gazing through the forest canopy. While car-camping is available at the main entrance, there are several nicely clandestine camping sites located in the gorgeous groves just steps from the riverbank.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/08123143/8-amazing-places-to-toke-up-31.jpg","urlslug":"/news/lifestyle/8-amazing-places-to-blaze-up-in-humboldt-county"},{"id":"contentitems-49249","title":"Don\u0027t Blame Wildfires for Rising California Cannabis Prices","author":"Chris Roberts","category":null,"date":"\/Date(1511203152000)\/","text":"October’s vicious Northern California wildfires, the deadliest and most damaging in US history, also dealt an unprecedented blow to California’s emerging legal cannabis industry—and at a crucial moment.\n\nIn addition to at least 43 deaths and the destruction of more than 8,900 homes and buildings, the fires’ casualties included at least 47 legal marijuana farms, according to the most recent tally from the California Growers Association. Total damage to legal cannabis crops is now estimated at “$60 million or greater,” according to Hezekiah Allen, the association’s executive director.\nAs much as 4% of the state’s cannabis crop may be affected in some way, according to commonly accepted industry estimates.\nThat figure could rise as farms untouched by flames discover their crops are contaminated with toxic smoke, or as wholesalers find that their smoke-scented harvest—which has earned nicknames like “campfire pot” and “hickory kush”—is now worthless on an already saturated market. “Is there benzene in that smoke? We just don’t know yet,” Allen said.\n\nBut as apocalyptic as the fires were for the farmers they touched, as far as statewide marijuana prices are concerned, they may as well not have existed.\nThe fires simply aren’t enough to disrupt a marketplace already drowning in biblical oversupply.\n“I don’t expect this fire to affect cannabis prices too much,” said Mike Ray, CEO of Bloom Farms, a major cannabis oil producer. “Production is at an all-time high. That’s going to be much more to blame for price elasticity than the fire.”\n\nAnd while whatever impact the fires had on the statewide marijuana market has already been absorbed, farmers and analysts say, small and medium cannabis cultivators are still at serious risk of being driven out of business. The real knockout blows to cannabis businesses have yet to come.\nRay, too, is a victim of a California wildfire. His family home and his company’s farm both went up in flames during the 2015 Butte fire in Calaveras County, and he has yet to fully rebuild.\nThe recent fires will absolutely put some people out of business—but cold, hard market forces will end the dreams of many more.\n\nIn 2016, the state’s marijuana farmers produced as much as 13.5 million pounds of cannabis, according to a study commissioned by the state Department of Food and Agriculture. That’s five times more than California cannabis users consumed. The surplus exited the state to be sold on the black market at a higher price—or worse, stayed put.\nThis year, industry observers are seeing more of the same—literally. Last year’s harvest is still coming into dispensaries for sale, and it’s now competing for shelf space with the 2017 crop—including the bounty from massive, investor-backed greenhouses.\n“From what I saw before the fire, there was an awful lot of cannabis in the market,” said Andrew DeAngelo, the co-founder and director of operations at Oakland-based Harborside, the state’s largest dispensary. “Last year’s crop was still coming into our shop and being offered to us before the fire—and last year’s crop is still coming into our shop and being offered to us, post-fire.”\n\nHarborside sources about “between 10 and 20%” of its products from the wildfire-affected areas, DeAngelo said—but the dispensary is also currently cultivating marijuana on a 47-acre former ivy topiary nursery in Monterey County.\nDespite the obvious oversupply, many cannabis businesses are building bigger and bigger farms. Last week, California officials finally released the state’s long-awaited regulations for the cannabis industry—which include no limit on how many acres a cannabis cultivator can plant.\nCities, meanwhile, are generally keeping the number of retail stores steady, meaning most of California’s marijuana harvest may never see a dispensary shelf.\n\nFor most sun-grown marijuana farmers new or old, prices are at an all-time low.\nHow low? While retail prices have remained relatively stable (so far), suppliers are reporting wholesale offers of $500 to $700 per pound for outdoor-grown flower—if the crops are accepted at all.\nFor cannabis destined to be extracted into concentrates to fill vape cartridges or dab rigs, prices are even lower. $50 a pound isn’t unheard of.\nFaced with such low profit margins—as well as the choice of either selling product at a loss or trying to ship it out of state—many small-to-medium marijuana entrepreneurs are calling it quits.\n\nThese growers generally don’t have massive savings or any hope at investment from funders looking for pre-legalization’s massive margins, said Kevin Jodrey, a nursery owner and longtime cannabis cultivator based in Humboldt County.\n“This was a make-or-break year,” he said.\nBut while wholesale prices continue to tumble and producers’ livelihoods evaporate, it’s not clear consumers will see much savings at all.\n\nThe state’s marijuana market has yet to figure out how it will react to government regulations, which are poised to increase overhead for cannabis businesses and raise end prices for consumers. When state excise, cultivation, and state and local sales taxes are added tallied, the government’s toll on California marijuana will be as high as 45 percent in some parts of the state, according to a recent report by Fitch Ratings.\nThat doesn’t include the cost of subjecting products to purity tests, which are shaping up to be the toughest in the nation and could be so costly that, at current estimates and prices, testing a pound of cannabis could be more expensive than buying one.\nAccording to an estimate from the state’s official Bureau of Cannabis Control, lab testing will cost $407 per pound.\nSo while the recent fires won’t cause prices to spike, more expensive cannabis is still coming.\n“Retailers are paying less and less for cannabis than we did 10 years ago, but our costs to deliver that cannabis have gone up and up,” DeAngelo said. “It’s a lot more expensive to do this legally. With the taxes going up from 0% to 35% just on the supply chain itself, I don’t see how I can not raise prices.”","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/20103050/california-fire-cannabis.jpg","urlslug":"/news/industry/dont-blame-wildfires-for-rising-california-cannabis-prices"}],"reviewCount":44,"flavors":[{"name":"Earthy","score":28.75},{"name":"Woody","score":28.4375},{"name":"Pine","score":27.1875},{"name":"Flowery","score":11.5625},{"name":"Sweet","score":11.25}],"effects":[{"name":"Relaxed","score":52.1875},{"name":"Happy","score":40.9375},{"name":"Uplifted","score":39.6875},{"name":"Tingly","score":27.8125},{"name":"Talkative","score":27.5}],"symptoms":[{"name":"Stress","score":29.6875},{"name":"Cramps","score":25.625},{"name":"Lack of Appetite","score":11.25},{"name":"Pain","score":3.125},{"name":"Depression","score":2.1875}],"conditions":[{"name":"Anxiety","score":27.8125},{"name":"PMS","score":25.3125},{"name":"ADD/ADHD","score":1.875},{"name":"Migraines","score":1.25},{"name":"PTSD","score":1.25}],"negatives":[{"name":"Dry Mouth","score":12.1875},{"name":"Dry Eyes","score":2.5},{"name":"Dizzy","score":1.25},{"name":"Headache","score":0.9375},{"name":"Paranoid","score":0.9375}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_126a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630957/b/humboldt__primary_0420.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_d656.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/601168/b/humboldt__primary_8751.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_84e0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/600564/b/humboldt__primary_f236.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_ea98.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/562428/b/humboldt__primary_3548.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_ef41.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/553346/b/humboldt__primary_6acc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_1780.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/458767/b/humboldt__primary_1b21.jpg"}],"photoTotalCount":17,"popularCities":["Los Angeles, CA","Arcata, CA","San Jose, CA","Berkeley, CA","Bremerton, WA","Detroit, MI","Granite Falls, WA","Mount Morris, MI","Oakland, CA","Olympia, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/humboldt","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.29545454545455/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":42223,"slug":"humboldt","name":"Humboldt","subtitle":null,"symbol":"Hm","category":"Hybrid","description":"\u003cp\u003eThe genetics of the Humboldt strain are something of a mystery, but it\u0026rsquo;s believed to be an \u003ca href=\"http://leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e strain that was cultivated in the Humboldt County area of California in the 1970s and later gained popularity in Europe in the 1990s. These plants are fast, tall growers that need lots of attention. Given proper care, they grow well indoors and out, flower in 8 weeks, and have above average yields. Humboldt\u0026rsquo;s aroma is floral and sweet and its high is uplifting and upbeat, bringing to mind the qualities of a Haze strain. It\u0026rsquo;s a good choice if you want to stay clear-headed.\u003c/p\u003e\n","descriptionPlain":"The genetics of the Humboldt strain are something of a mystery, but it\u0026rsquo;s believed to be an Afghani strain that was cultivated in the Humboldt County area of California in the 1970s and later gained popularity in Europe in the 1990s. These plants are fast, tall growers that need lots of attention. Given proper care, they grow well indoors and out, flower in 8 weeks, and have above average yields. Humboldt\u0026rsquo;s aroma is floral and sweet and its high is uplifting and upbeat, bringing to mind the qualities of a Haze strain. It\u0026rsquo;s a good choice if you want to stay clear-headed.\n","aka":"Humboldt Kush","rating":4.3,"highlightedReviews":[{"id":1415579,"username":"LegitLogic","text":"This strain just popped up in Tx recently and I would have to say im pretty amazed. Its a very very Indica dominant strain that really puts you in a haze. A definite couchlock bud! Buds are beautiful and dense with a very very strong pungent skunk smell too it. This is now a new favorite of mine.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png"},{"id":1611078,"username":"Chadd720","text":"Terrific strain, definitely more of a head high but still relaxed. And definitely clear headed. Feel light headed a bit and uplifting ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-60005","title":"8 Amazing Places to Blaze Up in Humboldt County","author":"Ocean Malandra","category":null,"date":"\/Date(1520701248000)\/","text":"For any cannabis aficionado, hearing the words “Humboldt County” can get the goosebumps going. One of the top cannabis producers in the Emerald Triangle—reaching back to the 1960s and 70s—Humboldt is known far and wide as the Napa Valley of weed; the place that produces the best quality outdoor cannabis in the entire country.\nBut while many connoisseurs have sampled its finest wares, Humboldt County has a lot more to offer than its incredible bud; it’s also a natural paradise filled with gorgeous landscapes and stunning views. And now that California has finally gone recreational, exploring Humboldt County—and all it has to offer—has become one of the best cannabis-infused trips in the world.\n\nBursting with wild coastlines, pristine rivers, unique small towns, and towering stands of ancient redwoods, Humboldt County is a truly breathtaking experience.\nBelow, discover some incredible places to light up and enjoy one of California’s greatest gems.\nPatrick’s Point State Park\n(Redwood Coast/Flickr Creative Commons)\nThe dramatic meeting of land and sea that Humboldt County embodies is on full display at Patrick’s Point State Park—a single square mile of lush forest teeters over the vast ocean on rugged rock promontories. Day hikes along the cliff edge offer fantastic views of raw Humboldt coastline, while inside the park a model Yurok village gives you a chance to explore daily indigenous life before European contact.\nCheck out Wedding Rock before you go, where countless couples have tied the knot backed by awe-inspiring panoramas of Agate Beach, where semi-precious stones lie hidden in the golden sands. Spark up a deliciously relaxing and euphoric strain, like Blueberry Muffins from Humboldt Seed Company, to take in this Eden-like paradise.\nThe Trinity River\n(CampPhoto/iStock)\nClear as glass and sparkling green, the living jewel known as the Trinity River winds its way out of the snowcapped Trinity Alps—the highest point on California’s coastal range. Locals flock here in the summertime to soak in high temperatures in this mountainous paradise. An hour inland from Eureka and Arcata, the town of Willow Creek is the center of activity here. Stop by River Song Natural Foods (a great place to stock up on munchies before hitting the river), and check out a handful of white water rafting outfits around the area.\nCamp Kimtu, just outside Willow Creek, fronts multiple swimming holes and riverside camping while the South Fork of Trinity offers a crystalline paradise of natural pools and rocky edges. For something truly mind-blowing, head into the Hoopa Indian Reservation, the largest in the state, and check out Tish Tang. This native run campground and natural beach offers a spectacular backdrop of forest covered mountains at a picture-perfect bend in the shimmering river. End the day by massaging your tired muscles with Wipe Out Salve by Humboldt Marijuana Company before beginning another adventure in the clear waters.\n\nThe Manila Dunes\n(Redwood Coast/Flickr Creative Commons)\nThe narrow spits that separate the tranquil Humboldt Bay from the Pacific Ocean are home to eco-systems bursting with wildflowers. They seem to have been made just for whiling away the better part of a cannabis-infused afternoon.\nMake your way to the lookout point above the Manila community center for a panoramic view of the bay and the rolling redwood hills before meandering through the dunes and, finally, onto the wilderness beach. From here, it’s a short trot over to the Humboldt Coastal Nature Center, a hobbit-hole like structure built right into the side of a massive sand dune that hosts a variety of educational exhibits for public enjoyment.\nThe Lost Coast\n(Redwood Coast/ Flickr Creative Commons)\nAn endless stretch of black sand beaches against a backdrop of rugged, ocean-worn mountains, the Lost Coast is the largest wilderness coastline on the west outside of Alaska. While the breathtaking Lost Coast Trail takes up to five days to hike—weaving up and down the wind swept summits of the Kings Range to isolated beaches—it is also possible to access the pristine coastline from the town of Shelter Cove, where you’ll find the Black Sands Beach trailhead.\nAn incredible day hike is also possible at King’s Peak, which offers dramatic 360° views of the Lost Coast at 4,000 feet. Exploring the old farming communities of the Matolle Valley, a bastion of old school hippies and a center of cannabis fueled counter cultures via the Lost Coast Scenic Drive, makes for slow travel at its best. It boasts several stand-out swimming holes along the Matolle River made more spectacular with fresh fruit dipped in Humboldt Valley Farms’ infused Chocolate Space Sauce.\n\nThe Humboldt Bay\n(shunyufan/iStock)\nThe largest protected body of water between San Francisco Bay and Puget Sound, Humboldt Bay is bookended by two unique towns—the Victorian seaport of Eureka and the hip college town of Arcata. The bay is home to California sea lions, river otters, and other marine mammals as well as an abundance of avian species.\nFrom the Eureka side, you’ll find the mural-peppered waterfront where Old Town reveals several stand-out small businesses worth patronizing. The Works record store, the palatial Eureka Books with its vast selection of local hiking and wildlife guides, and Humboldt Herbals, where you can stock up on natural, local products like Redwood Honey and talk to an herbalist about your medical marijuana regime.\nThe Victorian downtown area gives way to a bay-front promenade lined with benches, making it a wonderful place to spark up Bubba’s Gift—developed by Humboldt Seed Organization—before taking in the views over the marina and the redwood carpeted hills in the background. If you’re feeling adventurous, kayaks and small sailboat rentals are available, while the 1930s-era Madaket Ferry offers daily sunset cocktail cruises which sets out from the Eureka boardwalk daily.\nIn Arcata, known far and wide for its dedication to all things eco-friendly, an innovative wastewater treatment program has transformed a tidal marsh into a bird sanctuary that offers sweeping views out over the Humboldt Bay.\nThe Arcata Community Forest\n(yhelfman/iStock)\nConsidered a “model” for ecological sustainability, Arcata’s community owned forest blankets the hills just behind Humboldt State University, covering nearly 800 acres. Although you won’t find the several thousand-year-old giants here that exist in nearby State and National Parks, you will enjoy the pleasant and well-kept trail system that let you get completely lost in nature just steps from downtown Arcata. Frisbee golfers have set up a world-class course within the community forest, and just below it—in the grassy open space known as Redwood Park—cannabis lovers gather to puff and pass all day long.\n\nGrizzly Creek Redwoods State Park\n(maislam/iStock)\nYou have to leave the tourist track and head up the rural Highway 36 into Humboldt’s mountainous interior in order to reach Grizzly Creek Redwoods State Park. It’s a hidden gem where old growth forest surrounds the sapphire waters of the Van Duzen River. Fill a thermos of Kikoko’s Positivi-Tea (made with Humboldt-grown bud) to lift the spirits as you travel through the woods and rivers.\nThis small but picture-perfect park is the ultimate place to shun reality in exchange for clear summer skies, hot swimming weather, and spectacular star-gazing through the forest canopy. While car-camping is available at the main entrance, there are several nicely clandestine camping sites located in the gorgeous groves just steps from the riverbank.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/08123143/8-amazing-places-to-toke-up-31.jpg","urlslug":"/news/lifestyle/8-amazing-places-to-blaze-up-in-humboldt-county"},{"id":"contentitems-49249","title":"Don\u0027t Blame Wildfires for Rising California Cannabis Prices","author":"Chris Roberts","category":null,"date":"\/Date(1511203152000)\/","text":"October’s vicious Northern California wildfires, the deadliest and most damaging in US history, also dealt an unprecedented blow to California’s emerging legal cannabis industry—and at a crucial moment.\n\nIn addition to at least 43 deaths and the destruction of more than 8,900 homes and buildings, the fires’ casualties included at least 47 legal marijuana farms, according to the most recent tally from the California Growers Association. Total damage to legal cannabis crops is now estimated at “$60 million or greater,” according to Hezekiah Allen, the association’s executive director.\nAs much as 4% of the state’s cannabis crop may be affected in some way, according to commonly accepted industry estimates.\nThat figure could rise as farms untouched by flames discover their crops are contaminated with toxic smoke, or as wholesalers find that their smoke-scented harvest—which has earned nicknames like “campfire pot” and “hickory kush”—is now worthless on an already saturated market. “Is there benzene in that smoke? We just don’t know yet,” Allen said.\n\nBut as apocalyptic as the fires were for the farmers they touched, as far as statewide marijuana prices are concerned, they may as well not have existed.\nThe fires simply aren’t enough to disrupt a marketplace already drowning in biblical oversupply.\n“I don’t expect this fire to affect cannabis prices too much,” said Mike Ray, CEO of Bloom Farms, a major cannabis oil producer. “Production is at an all-time high. That’s going to be much more to blame for price elasticity than the fire.”\n\nAnd while whatever impact the fires had on the statewide marijuana market has already been absorbed, farmers and analysts say, small and medium cannabis cultivators are still at serious risk of being driven out of business. The real knockout blows to cannabis businesses have yet to come.\nRay, too, is a victim of a California wildfire. His family home and his company’s farm both went up in flames during the 2015 Butte fire in Calaveras County, and he has yet to fully rebuild.\nThe recent fires will absolutely put some people out of business—but cold, hard market forces will end the dreams of many more.\n\nIn 2016, the state’s marijuana farmers produced as much as 13.5 million pounds of cannabis, according to a study commissioned by the state Department of Food and Agriculture. That’s five times more than California cannabis users consumed. The surplus exited the state to be sold on the black market at a higher price—or worse, stayed put.\nThis year, industry observers are seeing more of the same—literally. Last year’s harvest is still coming into dispensaries for sale, and it’s now competing for shelf space with the 2017 crop—including the bounty from massive, investor-backed greenhouses.\n“From what I saw before the fire, there was an awful lot of cannabis in the market,” said Andrew DeAngelo, the co-founder and director of operations at Oakland-based Harborside, the state’s largest dispensary. “Last year’s crop was still coming into our shop and being offered to us before the fire—and last year’s crop is still coming into our shop and being offered to us, post-fire.”\n\nHarborside sources about “between 10 and 20%” of its products from the wildfire-affected areas, DeAngelo said—but the dispensary is also currently cultivating marijuana on a 47-acre former ivy topiary nursery in Monterey County.\nDespite the obvious oversupply, many cannabis businesses are building bigger and bigger farms. Last week, California officials finally released the state’s long-awaited regulations for the cannabis industry—which include no limit on how many acres a cannabis cultivator can plant.\nCities, meanwhile, are generally keeping the number of retail stores steady, meaning most of California’s marijuana harvest may never see a dispensary shelf.\n\nFor most sun-grown marijuana farmers new or old, prices are at an all-time low.\nHow low? While retail prices have remained relatively stable (so far), suppliers are reporting wholesale offers of $500 to $700 per pound for outdoor-grown flower—if the crops are accepted at all.\nFor cannabis destined to be extracted into concentrates to fill vape cartridges or dab rigs, prices are even lower. $50 a pound isn’t unheard of.\nFaced with such low profit margins—as well as the choice of either selling product at a loss or trying to ship it out of state—many small-to-medium marijuana entrepreneurs are calling it quits.\n\nThese growers generally don’t have massive savings or any hope at investment from funders looking for pre-legalization’s massive margins, said Kevin Jodrey, a nursery owner and longtime cannabis cultivator based in Humboldt County.\n“This was a make-or-break year,” he said.\nBut while wholesale prices continue to tumble and producers’ livelihoods evaporate, it’s not clear consumers will see much savings at all.\n\nThe state’s marijuana market has yet to figure out how it will react to government regulations, which are poised to increase overhead for cannabis businesses and raise end prices for consumers. When state excise, cultivation, and state and local sales taxes are added tallied, the government’s toll on California marijuana will be as high as 45 percent in some parts of the state, according to a recent report by Fitch Ratings.\nThat doesn’t include the cost of subjecting products to purity tests, which are shaping up to be the toughest in the nation and could be so costly that, at current estimates and prices, testing a pound of cannabis could be more expensive than buying one.\nAccording to an estimate from the state’s official Bureau of Cannabis Control, lab testing will cost $407 per pound.\nSo while the recent fires won’t cause prices to spike, more expensive cannabis is still coming.\n“Retailers are paying less and less for cannabis than we did 10 years ago, but our costs to deliver that cannabis have gone up and up,” DeAngelo said. “It’s a lot more expensive to do this legally. With the taxes going up from 0% to 35% just on the supply chain itself, I don’t see how I can not raise prices.”","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/20103050/california-fire-cannabis.jpg","urlslug":"/news/industry/dont-blame-wildfires-for-rising-california-cannabis-prices"}],"reviewCount":44,"flavors":[{"name":"Earthy","score":28.75},{"name":"Woody","score":28.4375},{"name":"Pine","score":27.1875},{"name":"Flowery","score":11.5625},{"name":"Sweet","score":11.25}],"effects":[{"name":"Relaxed","score":52.1875},{"name":"Happy","score":40.9375},{"name":"Uplifted","score":39.6875},{"name":"Tingly","score":27.8125},{"name":"Talkative","score":27.5}],"symptoms":[{"name":"Stress","score":29.6875},{"name":"Cramps","score":25.625},{"name":"Lack of Appetite","score":11.25},{"name":"Pain","score":3.125},{"name":"Depression","score":2.1875}],"conditions":[{"name":"Anxiety","score":27.8125},{"name":"PMS","score":25.3125},{"name":"ADD/ADHD","score":1.875},{"name":"Migraines","score":1.25},{"name":"PTSD","score":1.25}],"negatives":[{"name":"Dry Mouth","score":12.1875},{"name":"Dry Eyes","score":2.5},{"name":"Dizzy","score":1.25},{"name":"Headache","score":0.9375},{"name":"Paranoid","score":0.9375}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_126a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630957/b/humboldt__primary_0420.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_d656.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/601168/b/humboldt__primary_8751.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_84e0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/600564/b/humboldt__primary_f236.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_ea98.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/562428/b/humboldt__primary_3548.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_ef41.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/553346/b/humboldt__primary_6acc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/humboldt_100x100_1780.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/458767/b/humboldt__primary_1b21.jpg"}],"photoTotalCount":17,"popularCities":["Los Angeles, CA","Arcata, CA","San Jose, CA","Berkeley, CA","Bremerton, WA","Detroit, MI","Granite Falls, WA","Mount Morris, MI","Oakland, CA","Olympia, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/humboldt","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.29545454545455/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
