{"sl_translate":"description,descriptionPlain,category","id":182735,"slug":"sunset-haze","name":"Sunset Haze","subtitle":null,"symbol":"Suh","category":"Hybrid","description":"\u003cp\u003eSunset Haze is what you get when you combine \u003ca href=\"https://www.leafly.com/hybrid/tangerine-haze\"\u003eTangerine Haze\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/indica/rocky-mountain-blueberry\"\u003eRocky Mountain Blueberry\u003c/a\u003e, two flavorful parent strains that represent the opposite ends of the sativa-indica spectrum. Much like a summer sunset, this hybrid\u0026rsquo;s buds burst with hues of pink, purple, and red. It inherits a medley of fruity flavors, from ripe berry and watermelon to the sweet citrus notes of its Tangerine Haze parent. Expect an active and uplifting cerebral buzz from Sunset Haze, one that keeps the creativity flowing while also keeping your muscles fully relaxed.\u003c/p\u003e\n","descriptionPlain":"Sunset Haze is what you get when you combine Tangerine Haze and Rocky Mountain Blueberry, two flavorful parent strains that represent the opposite ends of the sativa-indica spectrum. Much like a summer sunset, this hybrid\u0026rsquo;s buds burst with hues of pink, purple, and red. It inherits a medley of fruity flavors, from ripe berry and watermelon to the sweet citrus notes of its Tangerine Haze parent. Expect an active and uplifting cerebral buzz from Sunset Haze, one that keeps the creativity flowing while also keeping your muscles fully relaxed.\n","aka":"Sun Set Haze","rating":4.2,"highlightedReviews":[{"id":1240004,"username":"omegaclan","text":"Gives you an almost instant body high that is outstanding. Nullifies pain better that Vicodin. The head high comes on slow, after 5 min or so you are completely engulfed in one of the BEST highs you\u0027ll ever experience. Superb, superb herb! ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1506981,"username":"Rawkett","text":"Finally a strain that combats my insomnia! I slept like a baby after some late-night dabs!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3411","title":"New Strains Alert: Sunset Haze, LA Ultra, Pineapple Super Silver Haze, Banana Peel, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1444406400000)\/","text":"Another batch of strains were just added to the Leafly strain Explorer, so get at \u0027em. Start by finding out if they\u0027re available near you by checking the links below. If you\u0027ve already tried any on the list, be the first to leave a strain review!\n \n 1. Sunset Haze\n\nSunset Haze is what you get when you combine Tangerine Haze and Rocky Mountain Blueberry, two flavorful parent strains that represent the opposite ends of the sativa-indica spectrum. Much like a summer sunset, this hybrid’s buds burst with hues of pink, purple, and red. It inherits a medley of fruity flavors, from ripe berry and watermelon to the sweet citrus notes of its Tangerine Haze parent. Expect an active and uplifting cerebral buzz from Sunset Haze, one that keeps the creativity flowing while also keeping your muscles fully relaxed.\n\n \n 2. LA Ultra\n\nLA Ultra by Resin Seeds is a strong indica strain whose genetics are kept secret, but its breeders and name hint at a LA Confidential and MK Ultra cross. An 80/20 indica-dominant hybrid, LA Ultra provides a mesmerizing, trippy high that lends a spark to creativity if you can harness it. This indica is spicy and fruity in fragrance, and its buds grow with chunky, finger-like calyxes that are utterly drenched in resin.\n\n \n 3. Banana Peel\n\nBanana Peel is a hybrid cannabis strain bred by Illuminati Seeds that descends from Banana OG (Laffy Taffy cut) and Pestilence, an Abusive OG and West Coast Dawg cross. Together, these parent strains bring both flavor and potency to the mix. With sweet flavors of banana taffy, Banana Peel delivers a crushing wave of euphoria that will have you hitting the couch like bricks.\n\n \n 4. Pineapple Super Silver Haze\n\nPineapple Super Silver Haze from Fire Bros. is a sativa strain that modifies the widely cherished Super Silver Haze with a Pineapple hybrid strain. This second parent is thought to be either Pineapple Express or Pineapple, a phenotype of Ed Rosenthal Super Bud. The Haze genetics in this strain come through in both flavor and effect, as Pineapple Super Silver Haze delivers a high-flying cerebral buzz alongside a spicy, zesty flavor. Its aroma is more of a tropical medley of candied mango, pineapple, and oranges. Like a cup of coffee, this sativa is a perfect pick-me-up with motivating, talkative, and creative effects and minimal heaviness in the body.\n\n \n 5. Quin-N-Tonic\n\nQuin-N-Tonic is a high-CBD strain bred by La Plata Labs, who combines genetics from Harlequin and Cannatonic. Led by indica genetics, Quin-N-Tonic produces high yields of frosted purple-tipped buds that carry a sweet, dessert-like blueberry aroma. Its CBD-rich profile makes this strain an excellent choice for patients dealing with pain or inflammation, or for those made uncomfortable by THC’s psychoactive effects.\n\n \n 6. Amethyst\n\nAmethyst is a hybrid cannabis strain from the gardens of Zion Botanicals, who crossed parent strains Sage N Sour and Granddaddy Purple. This high-THC 50/50 hybrid provides a clear and focused buzz that sharpens the senses, making this a perfect pair for creative activities, enjoying nature, or productive afternoons. The inhale brings with it sweet and sour flavors ranging from spicy berry to tangy grape.\n\n \n 7. Rocky Mountain Blueberry\n\nRocky Mountain Blueberry is an indica-dominant cannabis strain parented by Shishkaberry and Dutch Passion’s Blueberry. Its oversized, blue-hued buds take on a smooth, sweet blueberry aroma similar to that of a berry-loaded dessert. Its long-lasting effects bring on a creative spark to help you stay engaged and motivated while your body stays anchored in deep relaxation.\n\nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002412/new-strains-alert-sunset-haze-la-ultra-pineapple-super-silver-haz.png","urlslug":"/news/strains-products/new-strains-alert-sunset-haze-la-ultra-pineapple-super-silver-haz"}],"reviewCount":10,"flavors":[{"name":"Sweet","score":4.5454545454545459},{"name":"Citrus","score":4.5454545454545459},{"name":"Flowery","score":4.5454545454545459},{"name":"Orange","score":2.2727272727272729},{"name":"Tropical","score":2.2727272727272729}],"effects":[{"name":"Relaxed","score":36.36363636363636},{"name":"Creative","score":34.090909090909093},{"name":"Aroused","score":27.272727272727273},{"name":"Sleepy","score":25},{"name":"Uplifted","score":13.636363636363635}],"symptoms":[{"name":"Stress","score":29.545454545454547},{"name":"Depression","score":27.272727272727273},{"name":"Insomnia","score":27.272727272727273},{"name":"Lack of Appetite","score":25},{"name":"Pain","score":6.8181818181818175}],"conditions":[{"name":"Migraines","score":27.272727272727273},{"name":"PTSD","score":27.272727272727273},{"name":"Arthritis","score":25},{"name":"Tinnitus","score":25},{"name":"Anxiety","score":2.2727272727272729}],"negatives":[{"name":"Dry Mouth","score":4.5454545454545459},{"name":"Dry Eyes","score":2.2727272727272729}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-haze_100x100_7b5f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/480586/b/sunset-haze__primary_3163.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sunset-haze_100x100_5703.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/397550/b/sunset-haze__primary_0ae1.jpg"}],"photoTotalCount":2,"popularCities":["Detroit, MI","Everett, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/sunset-haze","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.2/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Tangerine Haze","subtitle":null,"slug":"tangerine-haze","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/tangerine-haze","symbol":"Tnh","applink":"leafly://strain/tangerine-haze"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
