{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1519855191000)/",
            "id": "contentitems-58783",
            "text": "Pop music is a diverse and lenient genre that often accompanies many influences such as hip-hop, soul, dance, rap, and rock. The term “pop” is short for “popular,” so the recognized sound of this genre has continually shifted over time. From the 60s, when The Beatles and rock music was considered pop, to today’s landscape where you’ll find pop artists ranging from soul singers to rappers, this lively genre will always be changing and evolving as the years wane on.\n\nPop music takes many forms, which means that there’s probably an album out there that speaks solely to you. Below, explore five modern pop albums—paired with their perfect strains—for an elevating experience of our modern-day manifestation of an evolving genre.\nSeat at the Table by Solange\n(Columbia Records)\nStrain Pairing Recommendation: Dream Queen\nSolange released her third album, Seat at the Table, in 2016, and it quickly shot to the number one spot on Billboard 200. The 21-song album is an infusion of Solange’s neo-soul, r&b sound. It’s a refreshing number one album in a world of top 40 hits that often adhere to rigid, narrow hooks and phrasing. Seat at the Table has a deep, serene beauty from each calculated note to Solange’s effortlessly melodic voice. With lyrics that speak to the black American experience and touch on topics such as prejudice and racism, A Seat at the Table is poignant, meaningful, and an important contribution to the artistic landscape of our times.\n\nMore Life by Drake\n(Republic Records)\nStrain Pairing Recommendation: Sage N Sour\nMore Life, Drake’s 13th album, dropped in 2017. With over 80 minutes of music, it delivers an expressive and vibrant soundscape that is a delight to dive into. With songs such as “Madiba Riddim,” “Lose You,” “Can’t Have Everything,” and “Passionfruit,” Drake explores a wide variety of sounds that keeps it fresh and engaging throughout. Yet—despite the variety—each track contains Drake’s quintessential style, tying it together with the genuine heart he puts into his work.\nLemonade by Beyonce\n(Columbia Records)\nStrain Pairing Recommendation: Electric Lemonade\nReleased in 2016, Lemonade took the music scene by storm—and with good reason. A modern masterpiece, Lemonade is a deeply personal musical journey through romantic tribulations and black American life in the modern age. The album moves seamlessly through each song, leading the listener along a ride of emotional ups and downs. Anger, grief, joy, triumph, self-love—Lemonade has it all. Paired with the visual album, it’s easy to see why it made a major, lasting impact on the musical world.\n\nRainbow by Kesha\n(Kemosabe)\nStrain Pairing Recommendation: Cherry Thunder Fuck\nRainbow is Kesha’s first album since 2014 due to her long legal battle with producer and abuser, Dr. Luke. Having now won back the rights to her own music, Kesha’s album, Rainbow, is an anthem of freedom, triumph, and a spirit that refuses to quit. With songs such as “Praying” and “Bastard,” which directly addresses the trials Kesha went through over the last few years, the album is deeply personal. On the other end, songs such as “Boogie Shoes” and “Woman” (featuring Dap Kings) are bursting with joy and strength, making Rainbow a well-rounded, emotional hit.\nThe Pinkprint (Deluxe) by Nicki Minaj\n(Republic)\nStrain Pairing Recommendation: Boss OG\nThe Pinkprint was released in 2014, but with Minaj hinting at a new 2018 release, there’s plenty of reason to get hyped about this album all over again. With 23 songs on the roster, Pinkprint gives fans plenty to unwrap during her hiatus, and for those who only know her from the hit “Anaconda,” it’s time to take a deeper look. The Pinkprint features a wide breadth of sound; the diverse tracks range in genre from hip-hop, soul, rap, to dance. Minaj brings all her talent to the table, showing off her skills as a great rapper and soulful singer. The contrast between songs such as “Feeling Myself” and “Grand Piano” exemplify Minaj’s ability to embrace any sound she wants and she packages it all into one fire album.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28131717/pop-albums-while-high.jpg",
            "title": "5 Vibrant Pop Albums to Listen to While High",
            "urlslug": "/news/lifestyle/5-vibrant-pop-albums-to-listen-to-while-high"
        },
        {
            "author": "Rebecca Kelley",
            "category": null,
            "date": "/Date(1446147180000)/",
            "id": "contentitems-2831",
            "text": "Who doesn’t love a good Netflix and chill sesh? Now that the days are getting shorter, the weather a little colder, and the sweatpants a little cozier, we thought we’d peruse the list of new releases coming to Netflix in November to recommend a few options that would pair well with these delectable strains. If you find yourself interested in any of these streaming offerings, try to pick up the corresponding strains to enhance your Netflix and chill experience.\n \nCOMEDIES\nMaster of None: Season 1\n\nDate Available: November 6\nThis new comedy series stars Aziz Ansari, who you may recognize as Tom Haverford from “Parks and Recreation.” His new show follows the personal and professional life of a 30-year old actor in New York City.\nStrain Pairing: Black Domina\n\nIn homage to Ansari’s Tom Haverford character and his food language, we thought a nice appetite-inducing strain like Black Domina would pair well with his new comedy series. Order up some chicky chicky parm parm and some big ol’ cookies — you wouldn’t want to laugh on an empty stomach!\n \nW/Bob & David\n\nDate Available: November 13\nThese two veteran comedians are back with another round of sketch comedy. The pair became notable for their first sketch series, Mr. Show with Bob and David, and each has enjoyed acclaim in separate television series (David Cross for “Arrested Development” and Bob Odenkirk for “Breaking Bad” and “Better Call Saul”). So pull up a chair (just ask if you can use it first) and get ready for some good laughs!\nStrain Pairing: Fire Haze\n\nThis daytime sativa will help get the giggles going for a marathon sesh of sketch comedy, and its happy, uplifting effects will ensure that you won’t lose steam while you binge-watch.\n \nDOCUMENTARIES\nLast Days in Vietnam\n\nDate Available: November 1\nThis Oscar-nominated documentary explores the chaotic final weeks of the Vietnam War, when American soldiers and diplomats were faced with the tough decision to obey White House orders to evacuate only U.S. citizens, or whether they were willing to risk treason charges in order to save South Vietnamese citizens as well.\nStrain Pairing: Dream Queen\n\nThe hybrid strain Dream Queen should help balance the sobering effects of this wartime documentary by delivering uplifting relaxation while still allowing you to focus on the film.\n \nSoaked in Bleach\n\nDate Available: November 15\nYes, it’s another Kurt Cobain documentary. You may have heard of the film “Kurt Cobain: Montage of Heck” that’s been generating attention lately, but “Soaked in Bleach” follows a private investigator who had been hired by Courtney Love and his perspective on the death of the grunge legend.\nStrain Pairing: Chemdawg\n\nThe creative Chemdawg should help you tap into your inner artist as you revisit the life of one of the 90s’ most iconic musicians.\n \nFOR THE KID IN ALL OF US\nThe SpongeBob Squarepants Movie\n\nDate Available: November 1\nSometimes a “Netflix and chill” night is best spent watching a silly children’s film, and SpongeBob Squarepants can deliver just that. Follow your favorite pineapple under the sea-dwelling creature and his pal Patrick as they attempt to track down King Neptune’s stolen crown.\n[BLURB]\nStrain Pairing: Pineapple Express\n\nNothing should put a smile on your face like a silly animated feature paired with the grin-inducing Pineapple Express. You’ll feel energetic and uplifted, plus the pineapple flavor is an all-too appropriate combination for Spongebob’s humble abode.\n \nSCI-FI/ACTION\nRobot Overlords\n\nDate Available: November 1\nOh no! Earth has been overtaken by alien robots, and it’s up to Gillian Anderson and Ben Kingsley to save the day! If you’re in the mood for a so-bad-it-might-be-good robot sci-fi film starring Gandhi and Scully, this ridiculous action/adventure offering could be right up your alley.\nStrain Pairing: Chocolope\n\nThis optimistic sativa will keep you happy long after the movie does, keeping you alert and energetic while you slog through what will either be a “guilty pleasure” or a “never again.”\n \nMarvel’s Jessica Jones: Season 1\n\nDate Available: November 20\nA superhero (the titular Jessica Jones) goes the private investigator route in this new Netflix original series based on the Marvel graphic novels. Starring a who’s who of recognizable actors, including Krysten Ritter (who you may recognize from “Breaking Bad”), David Tennant (“Dr. Who” fans should know him all too well), and Carrie-Anne Moss (aka Trinity from “The Matrix” trilogy), this show could be a fun entry into the ever-expanding Marvel universe.\nStrain Pairing: Bruce Banner\n\nWhat better pairing for a Marvel television series than this comic book character-inspired strain? The powerful Bruce Banner will settle you into a euphoric and creative state of mind, perfect for getting absorbed into the vast world of Marvel.\n \nWILDCARD SELECTION\nThe Runner\n\nDate Available: November 5\nOh, Nicolas Cage. He’s an actor so enigmatic that it’s tough to decide whether he’s good or bad. In “The Runner,” he plays a sex scandal-plagued politician during the 2010 BP oil spill. Is this a “good” Nic Cage flick or a “bad” one? Grab a strain and decide for yourself!\nStrain Pairing: LA Confidential\n\nThis potent indica has strong psychedelic effects, putting you in the perfect state of mind to fully embrace the Nic Cage experience. Whether your mind is blown or bored by this movie, you’ll feel calm and relaxed enough to easily drift off to sleep afterwards.\nImage sources: IMDb",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12000405/netflix-and-chill-with-these-eight-strain-pairings-for-november-2.jpg",
            "title": "Netflix and \"Chill\" with These Eight Strain Pairings for November 2015",
            "urlslug": "/news/lifestyle/netflix-and-chill-with-these-eight-strain-pairings-for-november-2"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 23.424146728755197
        },
        {
            "name": "ADD/ADHD",
            "score": 7.984085353886778
        },
        {
            "name": "PMS",
            "score": 7.984085353886778
        },
        {
            "name": "Epilepsy",
            "score": 5.159993933879284
        },
        {
            "name": "Migraines",
            "score": 4.912888722367928
        }
    ],
    "description": "<p>Dream Queen is an aptly named sativa-dominant hybrid that will leave you in a euphoric, dream-like state after a few puffs. A cross of two beloved strains, <a href=\"https://www.leafly.com/hybrid/blue-dream\">Blue Dream</a> and <a href=\"https://www.leafly.com/hybrid/space-queen\">Space Queen</a>, it offers intense odors reminiscent of pineapple and bubblegum, and flavors of citrus, menthol and hash when vaped or smoked. Dream Queen&rsquo;s very frosty, light green flowers will have you sticking your nose back in the jar again and again to experience their delicious fruity aroma.</p>\n",
    "descriptionPlain": "Dream Queen is an aptly named sativa-dominant hybrid that will leave you in a euphoric, dream-like state after a few puffs. A cross of two beloved strains, Blue Dream and Space Queen, it offers intense odors reminiscent of pineapple and bubblegum, and flavors of citrus, menthol and hash when vaped or smoked. Dream Queen&rsquo;s very frosty, light green flowers will have you sticking your nose back in the jar again and again to experience their delicious fruity aroma.\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 65.35732127245802
        },
        {
            "name": "Relaxed",
            "score": 63.50737747328231
        },
        {
            "name": "Happy",
            "score": 57.00436225445592
        },
        {
            "name": "Euphoric",
            "score": 56.539590358436364
        },
        {
            "name": "Creative",
            "score": 34.994602936716085
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 31.355599564666633
        },
        {
            "name": "Citrus",
            "score": 21.747488804438973
        },
        {
            "name": "Earthy",
            "score": 13.6697354100876
        },
        {
            "name": "Tropical",
            "score": 12.764723723884458
        },
        {
            "name": "Pineapple",
            "score": 11.631340434262878
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1416987,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "this is making me want to make a list of fun and easy things to do if you are home alone. the only problem is my hands can't type on my phone that good right now so I have to voice text the list. The first thing is put makeup on and put music on in the background and it feels like you're living in the time that the song is playing. I know this probably doesn't make much sense to you reading this but it totally does to me in my head right now. Okay, the second thing to do when you're home alone and took this train is try to do some stretches or exercises. Your body will feel very strong like the Incredible Hulk, at least mine does right now. Okay I can't think of anything else to do but those two things should keep you busy for a while.",
            "username": "fartysmoker"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1626469,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "very relaxing high. ",
            "username": "JuLit"
        }
    ],
    "id": 166,
    "name": "Dream Queen",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 26.078520580206604
        },
        {
            "name": "Dry Eyes",
            "score": 7.5777444735856125
        },
        {
            "name": "Dizzy",
            "score": 3.6202697639565375
        },
        {
            "name": "Paranoid",
            "score": 2.2667665792431624
        },
        {
            "name": "Headache",
            "score": 0.5573248407643312
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/blue-dream",
            "category": "Hybrid",
            "name": "Blue Dream",
            "permalink": "https://mobileapi.leafly.com/hybrid/blue-dream",
            "slug": "blue-dream",
            "subtitle": null,
            "symbol": "Bd"
        },
        {
            "applink": "leafly://strain/space-queen",
            "category": "Hybrid",
            "name": "Space Queen",
            "permalink": "https://mobileapi.leafly.com/hybrid/space-queen",
            "slug": "space-queen",
            "subtitle": null,
            "symbol": "Sq"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/dream-queen",
    "photoTotalCount": 85,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002740/b/dream-queen__primary_3e85.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-queen_100x100_c7b5.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/665035/b/dream-queen__primary_d008.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-queen_100x100_9f3e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639371/b/dream-queen__primary_c706.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-queen_100x100_5628.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/634135/b/dream-queen__primary_ac98.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-queen_100x100_cd50.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/628971/b/dream-queen__primary_4f00.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-queen_100x100_0209.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/622000/b/dream-queen__primary_f6a9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-queen_100x100_da8d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Las Vegas, NV",
        "Portland, OR",
        "Los Angeles, CA",
        "San Francisco, CA",
        "San Jose, CA",
        "Berkeley, CA",
        "Medford, OR",
        "Phoenix, AZ",
        "San Diego, CA",
        "Santa Ana, CA"
    ],
    "rating": 4.27,
    "relatedStrains": [],
    "reviewCount": 291,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "dream-queen",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.27147766323024/240",
    "subtitle": null,
    "symbol": "Dq",
    "symptoms": [
        {
            "name": "Depression",
            "score": 26.97305036664347
        },
        {
            "name": "Stress",
            "score": 25.911033203090152
        },
        {
            "name": "Pain",
            "score": 24.828052240004283
        },
        {
            "name": "Headaches",
            "score": 11.164115327659726
        },
        {
            "name": "Lack of Appetite",
            "score": 10.428821210012668
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
