{
    "aka": null,
    "articleTotalCount": 0,
    "articles": [
        {
            "author": "The Associated Press",
            "category": null,
            "date": "/Date(1528244414000)/",
            "id": "contentitems-67775",
            "text": "TALLAHASSEE, Fla. (AP) — Floridians allowed to use medical marijuana are one step closer to being able to smoke it.\nLeon County circuit court Judge Karen Gievers on Tuesday lifted a stay on her May 25 ruling that the Florida Legislature’s provision banning smokable medical marijuana is unconstitutional. The state’s Department of Health had filed an appeal of Gievers’ ruling, which automatically put it on hold. Attorney John Morgan and two patients with terminal illnesses then filed an appeal of that stay.\n\nThe stay will officially be lifted on June 11. Gievers wrote that delaying her ruling any further would create irreparable harm to patients.\nShe also wrote that the stay returns the law to its previous state after voters approved a constitutional amendment in November 2016 allowing the use of medical marijuana.\nWhen the Legislature passed the laws to enact the amendment last year, they included a section banning the sale of products used to smoke marijuana, citing health risks. The laws, signed by Gov. Rick Scott last June, state that patients can use cannabis through vaping and in food, oils, sprays and tinctures.\nMorgan, who led the push for the constitutional amendment, filed a lawsuit challenging the ban two weeks after Scott signed the bill. He was joined in the suit by Cathy Jordan and Diana Dodson, who say that smoking medical marijuana has prolonged their lives.\n\nIn her four-page ruling, Gievers cited the harm that could be caused to Jordan, who has had ALS since 1986, and Dodson, who has had HIV since 1991, if the stay was extended.\n“First, they cannot legally access the treatment recommended for them. Second, they face potential criminal prosecution for possession and use of the medicinal substance,” she wrote.\nMorgan asked Gov. Scott on Tuesday via social media to drop his appeals.\n“Every day you waste taxpayers’ money with this frivolous appeal sick people, veterans, cops, firefighters and cancer patients suffer!” Morgan wrote on Twitter. “Where is your compassion man?”\n\nEven with the stay being lifted, smokable medical marijuana will not immediately be available for sale at treatment centers. That’s because the Department of Health must come up with rules to cultivate, distribute and sell, which could take several months.\nAs of last Friday there were 117,522 patients and 2,644 doctors in the state’s medical marijuana registry. The Department of Health also says that 94,023 patients have received their ID cards, which allow them to receive cannabis at state-approved treatment centers.\nFlorida Department of Health spokesman Devin Galetta said in a statement that department officials are reviewing the ruling. Any further appeal would be heard in the state’s 1st District Court of Appeal in Tallahassee.\nThe health department is involved in six other cases dealing with medical marijuana, ranging from the process of awarding treatment center licenses to allowing a Tampa man to grow it at home for juicing.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/06/05171920/florida-smokeable-marijuana.jpg",
            "title": "Florida Judge Lifts Stay on Smokable Medical Marijuana",
            "urlslug": "/news/politics/florida-judge-lifts-stay-on-smokable-medical-marijuana"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1527194776000)/",
            "id": "contentitems-66721",
            "text": "This article is sponsored by Jupiter Research.\n\nAs the market for cannabis oil vaporizers continues to mature, so is the user base. Seasoned vape pen customers are increasingly prevalent and come in all stripes, but they have one thing in common: they’ve tried plenty of pens that didn’t quite cut it.\nA more crowded marketplace means that competition is heating up to keep increasingly savvy consumers coming back. And retaining customers is two tiers of tough for cannabis oil processors—they have to make sure they not only have an impeccably refined product, but also that it’s being delivered consistently.\nVape Pen 101\nVaporizers work by heating a concentrate to its boiling point, vaporizing rather than burning the substance. That process accounts for the clean taste and smooth pull consumers expect from a vaporizer, but achieving it can be a tricky prospect.\nA variety of batteries and vape cartridges from Jupiter Research. (Courtesy of Jupiter Research)\n“We tested a lot of cartridges that provided one good hit,” says Jupiter Research VP of Engineering David Schuler. “After that, they didn’t deliver much vapor, and the vapor they did create often tasted burnt.”\nThat’s because in cartridges where a wick delivers fluid to a heating element, sometimes it doesn’t deliver that fluid as fast as a user is pulling, which can cause the wick to dry out. The result can be a vicious cycle; a dry wick can lead to burning in the cart that can leave residue behind, which may in turn impede fluid delivery even further.\nCarts that don’t perform reliably or only draw properly when held at just the right angle are destined for the kitchen junk drawer, and customers won’t be back to try a poorly performing cartridge a second time.\nTo prevent their pens from being relegated to the same fate as dried-out ballpoints, extra twist-ties, and that set of keys that must open something, many processors are turning to a new twist on an established technology to heat the cannabis distillates just right: ceramics.\n\nWhy Ceramic?\nCeramic heating elements are popping up in more vape pens lately for the same reason they’ve been seeing use in kitchen cookware in recent years—namely, that ceramic elements can reach the high temperatures needed to vaporize cannabis oil without burning the material.\nThat’s a turn away from previous iterations of vaporizer cartridge technology, many of which employ technology originally developed for the e-cigarette industry. The problem is, that technology isn’t always the best answer for cannabis oils.\nCeramic cores prevent thick cannabis oils from burning when heated by vape pen batteries. (Courtesy of Jupiter Research)\n“E-cigarette liquid is not as thin as water, but it’s darned close, and that’s not the case with cannabis oil,” Schuler recalls. “When we first started working on these cartridges, we found out pretty quickly that existing e-cig technology wasn’t well-suited to the higher viscosity and higher boiling point of cannabis oils.”\nFree Flow\nJust as a pot of pasta will scorch on the stovetop if you don’t add enough water, the finest cannabis oil in the world will burn and taste rotten if the heating element goes dry. Thick, sticky cannabis oil needs room to flow, and not all ceramics can handle it.\n“The ceramic we use, CCELL, is porous, kind of like a rigid sponge, which gives it the ability to wick high viscosity fluid,” says Schuler. “When you fire these elements, they just keep on going. They never dry out, which allows us to run higher power and make more vapor, without worrying about burning.”\nThat porous ceramic also helps Jupiter’s cartridges breathe better, ensuring that as cannabis oil in the cart is vaporized, air is allowed in to replace it. Proper breathing is a key to getting every last bit of oil in a cart fully vaporized every time.\nThe consistency provided by ceramic heating elements isn’t just limited to a single vape pen. Predictable heating like that provided by Jupiter’s CCELL cores can provide reliable, dependable heating across the whole product line.\n\nThat ensures customers get what they came for—the best version of a processor’s carefully crafted cannabis extract—the first time, every time, no matter what oil they’re using. And since those cannabis extracts keep evolving and getting refined, the team at Jupiter Research is constantly working out new ways to provide great performance for a swelling suite of products.\n“It’s really interesting to watch how these oils are evolving,” says Schuler. “When we started, it was with BHO-extracted oils. Now, we’re seeing distillates more frequently. Those are going to perform differently, so we have to make sure we’re always providing the best solutions for a whole variety of materials.”\nA Premium Platform\nAs Schuler and his team work to develop new solutions for vaporizing cannabis oils, they’re also working to broaden the usefulness of their existing devices. Jupiter’s Liquid 9 platform, for instance, is already a popular item among recreational cannabis users, powering vaporizers like the IndigoPro. When Kanabo Research was looking for a device it could use as the foundation for its VapePod—the first vaporizer approved as a medical device in Israel—it found a lot about the Liquid 9 to like.\nJupiter Research technology powers the VapePod, the first medically-cleared cannabis vaporizer. (Courtesy of VapePod)\nBut the company also knew it would need to make some modifications before it would pass muster with Ministry of Health officials. Notably, it needed to be able to meter how patients are using the device and deliver consistent, carefully measured puffs that administer the same amount of vapor every time.\n“That’s very important for a medical device, because it makes it possible to administer a defined and consistent dose,” says Kanabo Research founder and COO David Sack. “The team at Jupiter was fantastic to work with as we made the changes we necessary to bring the platform in line with our needs. The result has been a really strong partnership that’s important to us in the long term.”",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/05/24083533/Liquid6-on-Laptop-copy-web.jpg",
            "title": "Jupiter Research Explains Why Vape Pen Elements Are Going Ceramic",
            "urlslug": "/news/industry/jupiter-research-explains-why-vape-pen-elements-are-going-ceramic"
        }
    ],
    "articlesAvailable": false,
    "category": null,
    "conditions": [],
    "description": null,
    "descriptionPlain": "",
    "effects": [],
    "flavors": [],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [],
    "id": 0,
    "name": null,
    "negatives": [],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/strain/details",
    "photoTotalCount": 0,
    "photos": [],
    "popularCities": [],
    "rating": 0,
    "relatedStrains": [],
    "reviewCount": 0,
    "sl_translate": "description,descriptionPlain,category",
    "slug": null,
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/0/240",
    "subtitle": null,
    "symbol": null,
    "symptoms": [],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
