{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1451656800000)/",
            "id": "contentitems-3215",
            "text": "Happy New Year! Start 2016 off right by branching out with some new strains. Here are seven that were recently added to Leafly's database, which means you're now able to rate and review them. Remember to check out the links below to see if a location near you currently has a strain stocked!\n \n   1. Alien Hallucination\n\nAlien Hallucination is a hybrid cannabis strain that is believed to be a cross between the sedating Tahoe Alien and LSD, a classic Amsterdam hybrid known for its trippy head buzz. Bred by Alien Genetics, this strain will abduct the mind while your body remains anchored in deep physical relaxation.\n\nClick here for a full list of locations currently carrying Alien Hallucination\n \n   2. Madcow\n\nMadcow descends from two high-energy sativas, Durban Poison and Purple Cow. With a heavy blanket of crystal resin, this strain is a solid choice for veteran consumers and for making concentrates. This pure-blooded sativa will hit you with weightless cerebral effects and induce fits of laughter. Smooth yet spicy, this flower releases a flavor similar to that of butterscotch.\n\nClick here for a full list of locations currently carrying Madcow\n \n   3. Whiteout\n\nParent strains Super Silver Haze and The White were brought together to create this uplifting hybrid strain. Whiteout delivers intense euphoria paired with an alert, focused effect sure to satisfy your daytime needs. These frosty light green buds shimmer in light and will hit you with a pungent zesty lemon aroma that would be expected of a Super Silver offspring.\n\nClick here for a full list of locations currently carrying Whiteout\n \n   4. Grape Inferno\n\nGrape Inferno is a 70/30 indica-dominant strain bred by NorStar Genetics and propagated by TGA Genetics. A cross between Nepali OG and Querkle, Grape Inferno inherits a dense bud structure and a sweet grape aroma from which this strain gets its name. With flavorful undertones of hash and berries, Grape Inferno delivers a meditative and calming high that lets the body relax while the mind wanders. Its buds bloom in a colorful show of lavender, pink, red, and green.\n\nClick here for a full list of locations currently carrying Grape Inferno\n \n   5. Fire Alien Kush\n\nFire Alien Kush from OG Raskal Genetics is a potent hybrid strain that crosses Alien Kush with Fire OG. Known for its heavy resin production and lofty buzz, Fire Alien Kush will send you flying through the cosmos in blissful euphoria. Some phenotypes take after Fire OG with a lemony pine aroma while others lean more towards Alien Kush, an earthy indica that provides deeply relaxing effects in the body while elevating the mood.\n\nClick here for a full list of locations currently carrying Fire Alien Kush\n \n   6. Mother Tongue\n\nMother Tongue is a vibrant 70/30 sativa-dominant strain bred by JinxProof Genetics. A cross between Afgooey, Watermelon OG, and JOG Kush, Mother Tongue exhibits a wide range of flavors from sweet melons and berry to spicy, earthy coffee with hints of citrus. Bright hues of red, pink, and purple stretch from the buds to the leaf tips in an inviting display of color. A perfect daytime companion for productivity, Mother Tongue provides a clear-headed and thoughtful buzz coupled with deep physical relaxation.\n\nClick here for a full list of locations currently carrying Mother Tongue\n \n   7. Haleigh's Hope\n\nHaleigh’s Hope is a high-CBD strain from Colorado named after a 4-year old with cerebral palsy and epilepsy. Her conditions were treated with an oil derived from this strain, which exhibits a CBD:THC ratio of 24:1. This low-THC, high-CBD cannabinoid profile was finally achieved after four years of crossing and selecting from hundreds of different phenotypes.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12001930/new-strains-alert-alien-hallucination-whiteout-fire-alien-kush-gr.png",
            "title": "New Strains Alert: Alien Hallucination, Whiteout, Fire Alien Kush, Grape Inferno, and More",
            "urlslug": "/news/strains-products/new-strains-alert-alien-hallucination-whiteout-fire-alien-kush-gr"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Arthritis",
            "score": 2.5
        }
    ],
    "description": "<p class=\"p1\">Parent strains <a href=\"https://www.leafly.com/sativa/super-silver-haze\">Super Silver Haze</a> and <a href=\"https://www.leafly.com/hybrid/the-white\">The White</a> were brought together to create this <a href=\"https://www.leafly.com/explore/tags-uplifted\">uplifting</a> <a href=\"https://www.leafly.com/explore/category-hybrid\">hybrid</a> strain. Whiteout delivers intense <a href=\"https://www.leafly.com/explore/tags-euphoric\">euphoria</a> paired with an alert, <a href=\"https://www.leafly.com/explore/tags-focused\">focused</a> effect sure to satisfy your daytime needs. These frosty light green buds shimmer in light and will hit you with a <a href=\"https://www.leafly.com/explore/flavors-pungent\">pungenst</a> zesty <a href=\"https://www.leafly.com/explore/flavors-lemon\">lemon</a> aroma that would be expected of a Super Silver Haze offspring.</p>\n",
    "descriptionPlain": "Parent strains Super Silver Haze and The White were brought together to create this uplifting hybrid strain. Whiteout delivers intense euphoria paired with an alert, focused effect sure to satisfy your daytime needs. These frosty light green buds shimmer in light and will hit you with a pungenst zesty lemon aroma that would be expected of a Super Silver Haze offspring.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 57.5
        },
        {
            "name": "Focused",
            "score": 55
        },
        {
            "name": "Euphoric",
            "score": 10
        },
        {
            "name": "Uplifted",
            "score": 7.5
        },
        {
            "name": "Creative",
            "score": 7.5
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 2.5
        },
        {
            "name": "Citrus",
            "score": 2.5
        },
        {
            "name": "Orange",
            "score": 2.5
        },
        {
            "name": "Flowery",
            "score": 2.5
        },
        {
            "name": "Earthy",
            "score": 2.5
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1397104,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I bought this as an oil from The Farm a few weeks back.  I've had to smoke this about 10 times to really decide if I liked it or not.  Here's the deal... I was looking for a supermom strain that would make me clean the house in a single bound but this strain is a little too euphoric for being productive.  I can't keep trucking with my chores.  I'm like a magpie looking for something shiny and getting obsessed with music and tiny details...  This strain would be amazing for concerts and hanging out with friends around a campfire when you don't want to be sedated but you don't have to be productive for a while.  Also has all off the trip of a sativa but none of the anxiety.  A little couch lock.  Also, feeling kinda sexy...  hmmm...  Yeah.  it's good. ;)",
            "username": "DarkGypsy"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1385392,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/3/240",
            "text": "Vaped almost two full bowls with very little result. Happy and focused, not much else... ",
            "username": "ddigitalbathh"
        }
    ],
    "id": 197521,
    "name": "Whiteout",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 55
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/super-silver-haze",
            "category": "Sativa",
            "name": "Super Silver Haze",
            "permalink": "https://mobileapi.leafly.com/sativa/super-silver-haze",
            "slug": "super-silver-haze",
            "subtitle": null,
            "symbol": "Ss"
        },
        {
            "applink": "leafly://strain/the-white",
            "category": "Hybrid",
            "name": "The White",
            "permalink": "https://mobileapi.leafly.com/hybrid/the-white",
            "slug": "the-white",
            "subtitle": null,
            "symbol": "Twt"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/whiteout",
    "photoTotalCount": 5,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/590294/b/whiteout__primary_eced.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/whiteout_100x100_fae5.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/522765/b/whiteout__primary_6c5e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/whiteout_100x100_59fd.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/520524/b/whiteout__primary_1fda.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/whiteout_100x100_3348.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/451474/b/whiteout__primary_4846.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/whiteout_100x100_3bd6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/418634/b/whiteout__primary_3575.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/whiteout_100x100_481b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [],
    "rating": 4.57,
    "relatedStrains": [],
    "reviewCount": 7,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "whiteout",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.57142857142857/240",
    "subtitle": null,
    "symbol": "Wou",
    "symptoms": [
        {
            "name": "Depression",
            "score": 2.5
        },
        {
            "name": "Stress",
            "score": 2.5
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
