{"sl_translate":"description,descriptionPlain,category","id":540,"slug":"pineapple-trainwreck","name":"Pineapple Trainwreck","subtitle":null,"symbol":"Ptw","category":"Hybrid","description":"\u003cp\u003eBring together the popular clear-headed effects of \u003ca href=\"http://www.leafly.com/hybrid/pineapple-express\"\u003ePineapple Express\u003c/a\u003e and the pain relief qualities of \u003ca href=\"http://www.leafly.com/hybrid/trainwreck\"\u003eTrainwreck\u003c/a\u003e and you get this happy sativa. Pineapple Trainwreck has an earthy aroma and a fruity flavor that usually takes more after its pineapple parent. Long-lasting and potent, this strain hits hard at first, but mellows into a state where being sociable or getting things done is possible. The buzz tends to be more mellow than active, though, so don\u0026rsquo;t be surprised if verbal activity is all you get around to.\u003c/p\u003e\n","descriptionPlain":"Bring together the popular clear-headed effects of Pineapple Express and the pain relief qualities of Trainwreck and you get this happy sativa. Pineapple Trainwreck has an earthy aroma and a fruity flavor that usually takes more after its pineapple parent. Long-lasting and potent, this strain hits hard at first, but mellows into a state where being sociable or getting things done is possible. The buzz tends to be more mellow than active, though, so don\u0026rsquo;t be surprised if verbal activity is all you get around to.\n","aka":"Pineapple Wreck","rating":4.15,"highlightedReviews":[{"id":1414895,"username":"Allie17","text":"Oh Pineapple Trainwreck, what have you done to me? I\u0027m an experienced smoker with severe arthritis, and this strain knocked me into an ocean and left me stranded there without a life vest. The onset takes a little bit for sure. You start to feel very giggly and happy, and then you get smacked in the face with a tsunami of highness. My body was floating in nothingness, and all my pain disappeared completely. You do get the spiciness from Trainwreck, but the Pineapple Express overpowers the Trainwreck in taste. It\u0027s like smoking an assortment of tropical fruit. Smoke it with a bong, it tastes like Pineapples. Drink a Baja Blast before taking a hit, it tastes like mango and watermelon. It tasted amazing, and worked wonderfully for pain. The only downside is that dry eyes hit you really hard. I felt like I was in the ocean, but my eyes were left in the Sahara. Only downside to the strain, but the positives outweigh the negatives for sure! ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1637530,"username":"sheisblue242","text":"Very aroused, extremely high after one bowl","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-29132","title":"The 6 Best Documentaries to Watch While High","author":"Hannah Meadows","category":null,"date":"\/Date(1497189652000)\/","text":"Firing up a documentary whilst high is hardly a new idea, but it’s usually a good one (hello, Planet Earth). There’s so much to learn and explore via films that showcase unique and mind-bending experiences—especially with a little help from a well-packed bowl. Additionally, the truthfulness of documentaries comes as a breath of fresh air amid the throngs of lowbrow comedies and overly intense dramas that tend to flood the average Netflix queue.\n\nTo elevate this classic cannabis-enhanced activity, we mined the opinions of the staff at the Leafly office and compiled a list of the best documentaries to watch while high. In narrowing from a list that included scores of suggestions, I personally vetted the top picks to bring you the following finalists. From explorations of history to non-verbal spectaculars, there’s a bit of something for everyone below. Spark up a pre-roll or bake a batch of edibles, then get comfortable on the couch and press play—we’re willing to bet you’ll discover a new favorite.\nRecently watched a noteworthy documentary? Tell us about it in the comments below!\nCave of Forgotten Dreams\n\nFamed documentary director Werner Herzog knocked it out of the park—yet again—with his video exploration of the Chauvet Cave of Southern France. Discovered by three explorers in 1994, the cave houses ancient paintings that are the oldest ever recorded in human history, dating back between 28,000 and 35,000 years. The paintings are perfectly preserved—along with the bones of long extinct animals—having never been touched by natural light or exposure to the elements.\nBefore watching this film, I lit up some Blue Dream and even through a small computer screen (I, uh…don’t own a TV), the paintings, their meanings, and Herzog’s beautifully crafted narrative combined to create a film that was truly breathtaking. Long after the film ended, I thought about the person or people who made these, the gods they may have worshipped, the natural world in which they lived, and the ancient culture to which they belonged.\nI doubt sober thoughts would have gravitated toward the essence and deeper meaning these paintings hold in regard to human life and the history of mankind like my Blue Dream-induced thoughts did. I recommend this documentary for the music, the art, the history, the curiosity—everything about it.\nGoing Clear: Scientology and the Prison of Belief\n\nDocumentaries exploring religious sects or cults are my bread and butter. Documentaries exploring religions that are widely regarded as cults are even better—the extra-sweet jam to that bread and butter. Enter Going Clear, an eye-opening expose of L. Ron Hubbard and his imaginative, interwoven ideals of science fiction and religion that ultimately led to the creation of the Church of Scientology.\nIn this documentary, we hear stories from ex-Scientologists. These aren’t just “tried it out for a week and left” Scientologists—these people were indoctrinated into the religion for years, even decades, before getting out. Some moved up to the highest levels of the religion before calling it quits.\nSober, this is an interesting journey down the rabbit hole of Scientology. High, this documentary will open your thoughts to science, religion, and how people respond to both in a whole new light. Load a bowl of the buzzy White Fire OG before pressing play.\nSamsara\n\nNonverbal and utterly breathtaking, Samsara is the younger sister to the popular 1992 documentary Baraka (the previous nonverbal narrative exploration of nature and human life). Like Bakara, Samsara was directed by Mond Russell and produced by Mark Magidson, so the quality and feel stay true to the original.\nSamsara will leave you in awe of its gorgeous, lingering landscapes, and rich visions of people from all over the world. This colossal documentary took five years to film and spanned about 25 countries.\nThroughout this entire spectacular, cannabis will keep your eyes peeled and your mind enamored with this hour-and-a-half film of explosive color and life. Creative strains such as Pineapple Trainwreck or Berry White will let your mind completely soak in this remarkable film.\nFor an extra boost, check out the classic Koyaanisqatsi which pre-dates Samsara by about 20 years. The score is done by the famous composer Philip Glass with cinematography by Ron Fricke (who also worked on Samsara and Baraka). Though Koyaanisqatsi may not be as visually crisp as Samasara or Baraka, it was the core inspiration for both stunning films.\n\nBeware of Mr. Baker\n\nThe colorful life of Ginger Baker, legendary drummer of the popular rock bands Cream and Blind Faith, is front and center in this exploratory documentary. Rock legends laud him as the greatest drummer who ever lived, but the “behind the scenes” of Baker’s life shows a volatile man with a short fuse and passionate air.\nHe’s a true character in every sense of the word, having traveled the world and experienced a life that only one in a billion could mirror. Though hard drug use and angry outbursts (mostly fueled by said hard drug use) clouded his legend, his life story remains remarkable in every way.\nRegardless of whether or not you know who Ginger Baker is, this film is fascinating and will appeal to everyone—especially lovers of rock music. I recommend lighting up a little Durban Poison as you watch this film.\nInto the Inferno\n\nWerner Herzog makes another appearance on this list with his relatively new Netflix documentary Into the Inferno. Much like Cave of Forgotten Dreams, Into the Inferno touches on the history of human life. After delving into the world of volcanic activity, Herzog explores the religions that have developed across cultures greatly influenced by local volcanic eruptions.\nIn true Herzog style, the documentary approaches these subjects with both historical and artistic flair. Some of the most touching and beautiful points in the film are the sweeping shots of erupting volcanoes punctuated with classical or operatic music.\nJuxtaposed with these beautiful shots are scenes of ceremonial activities conducted by worshippers who believe certain volcanoes house spirits of long-dead loved ones and mighty gods. Also wrapped up with all this is the discovery of an ancient human fossil as well as the recounting of the lives of two famous volcano photographers. In short, Herzog does quite a lot with this film, and it’s all compelling.\nYet another amazing documentary that, when paired with cannabis, leaves you contemplating it days after the credits roll. Reach for some Stardawg to pair with this incredible film.\nTickled\n\nFor something well off the beaten path in terms of documentaries, I suggest you sit down and watch Tickled. It starts off innocently enough, with the director, David Farrier, simply wanting to explore an interesting subject: the world of endurance tickling. Sure, it’s an odd sport to most, but why not get a feel for something a bit different? No harm … right?\n…Right?\nWell, much to the filmmakers’ surprise—as well as my own—there is a bit of harm in exploring the unknown. Not to give too much away, the endurance competitions held by professional ticklers are more than just a good laugh.\nYou’ll be on the edge of your seat while Farrier dives down the deep and twisty hole that goes straight to the mystifying and sometimes terrifying underworld of tickling competitions. To really get into this film, you’ll want to have some Permafrost close at hand—its effects will help take the edge off the strangeness in this documentary.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/09155343/best-documentaries-to-watch-while-high.jpg","urlslug":"/news/lifestyle/best-high-documentaries"},{"id":"contentitems-3571","title":"The Oregon DOPE Cup Winning Cannabis Strains, Concentrates, and Edibles","author":"Will Hyde","category":null,"date":"\/Date(1444424400000)\/","text":"October 1st marked the opening of recreational cannabis sales in Oregon, and what better way to close out the weekend of celebrations than with the first cannabis cup in the state? DOPE Magazine hosted the Oregon DOPE Cup at Refuge PDX in Portland. Happy Oregonians spilled out of the venue and into the city streets, eager to join the festivities and excitedly sampling all the vendors had to offer. The evening’s entertainment was provided by a variety of local musicians and artists who warmed the crowd up for Redman’s headlining performance.\nHappy people, good music, and award-winning cannabis — what more could you ask for? How about the winning strains and products? Here are the award-winners from the 2015 Oregon DOPE Cup:\n \nWinning Cannabis Flowers\n\n \nPeoples’ Choice\n\nMango Kush from Chalice Farms\n \nJudges’ Choice\n\nGSC (f.k.a Girl Scout Cookies) from Herbal Roots\n \nBest Indica Cannabis Strain\n\nWinner: Obama Kush from High Standards\nRunner Up: Anonymous V from Eco Firma Farms\n \nBest Sativa Cannabis Strain\n\nWinner: Strawberry Ice from Chalice Farms\nRunner Up: Chernobyl from Geek Farms\n \nBest Hybrid Cannabis Strain\n\nWinner: Platinum Animal Cookies from Ideal Farms\nRunner Up: Cherry Lopez from Dr. Vert\n \nBest High-THC Cannabis Strain\n\nWinner: The White from Eco Firma Farms\nRunner Up: New York Old School from Five Mules Farms\n \nBest High-CBD Cannabis Strain\n\nWinner: TJ’s CBD from TJ’s Organics\nRunner Up: Charlotte’s Web from Chalice Farms\n \nWinning Cannabis Concentrates\n\n \nBest BHO (THC)\n\nWinner: OG Kush Live Resin from Dirty Arm Farm\nRunner Up: Agent Orange Live Resin from Dirty Arm Farm\n \nBest BHO (CBD)\n\nWinner: Harle Tsu from Proper Oil\nRunner Up: Harle Tsu from Mad Fama\n \nBest PHO (THC)\n\nWinner: Jack Herer Terp Wax from Orgone Extracts\nRunner Up: White Super Skunk from Cultivated Industries\n \nBest Non-Solvent Cannabis Concentrate (THC)\n\nWinner: Pineapple Trainwreck Terp Sauce from Primo Extracts\nRunner Up: Animal Cookies from Reson Ranchers\n \nBest Cannabis Concentrate Cartridge\n\nWinner: OG Kush Wax Truly Pure\nRunner Up: Dutch Treat from Golden XTRX\n \nBest CO2 Cannabis Concentrate (THC)\nWinner: Smarties OM Extracts\nRunner Up: The Clear from Orgone Extracts\n \nBest CO2 Cannabis Concentrate (CBD)\nWinner: Buddha Kong from True North Extracts\nRunner Up: Harle Tsu from OM Extracts\n \nWinning Cannabis Edibles\n\n \nBest Sweet Cannabis Edible\nWinner: Chocolate Kettle Corn from Cannavore\nRunner Up: Blueberries and Hazelnut from Blaze Bars\n \nBest Savory Cannabis Edible\nWinner: Garlic Herb Almonds from Lunchbox Alchemy\nRunner Up: Ginger Hemp Granola from Pannacea Valley Gourmet Edibles\n \nBest CBD Cannabis Edible\nWinner: Honey Bee Honey Stick from Echo Electuary\nRunner Up: CBD Dark Chocolate Truffle from Leif Medicinals\n \nBest Cannabis-Infused Drink\nWinner: Mate Karate from Bent Beverage\nRunner Up: Fruit Punch Level 3 from Vitonic\n \nWinning Cannabis Topical\n\n \nBest Cannabis Topical\nWinner: Peppermint Cayenne Salve from Henrys Herbals\nRunner Up: The Transdermal Patches from Synergy Skin Worx","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002857/the-oregon-dope-cup-winning-cannabis-strains-concentrates-and-edi.jpg","urlslug":"/news/strains-products/the-oregon-dope-cup-winning-cannabis-strains-concentrates-and-edi"}],"reviewCount":186,"flavors":[{"name":"Sweet","score":55.627446715963458},{"name":"Pineapple","score":44.769464984775986},{"name":"Earthy","score":29.38777729447586},{"name":"Mango","score":25.619834710743802},{"name":"Grapefruit","score":25.206611570247933}],"effects":[{"name":"Relaxed","score":75.7557633753806},{"name":"Uplifted","score":72.455415397999133},{"name":"Euphoric","score":69.823836450630708},{"name":"Creative","score":35.06959547629404},{"name":"Energetic","score":34.656372335798174}],"symptoms":[{"name":"Stress","score":37.597868638538493},{"name":"Depression","score":32.177033492822964},{"name":"Pain","score":7.9001739886907352},{"name":"Nausea","score":5.2142235754675941},{"name":"Lack of Appetite","score":5.0076120052196611}],"conditions":[{"name":"Anxiety","score":33.416702914310569},{"name":"Arthritis","score":28.251413658112224},{"name":"Migraines","score":4.69769464984776},{"name":"ADD/ADHD","score":3.5613310134841232},{"name":"Gastrointestinal Disorder","score":3.3547194432361893}],"negatives":[{"name":"Dry Mouth","score":14.71291866028708},{"name":"Dry Eyes","score":6.2472814267072634},{"name":"Paranoid","score":4.69769464984776},{"name":"Dizzy","score":3.9745541539799909},{"name":"Anxious","score":3.4580252283601562}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_ac74.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/609612/b/pineapple-trainwreck__primary_2406.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_5f86.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/589931/b/pineapple-trainwreck__primary_3707.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_5d35.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/553069/b/pineapple-trainwreck__primary_614e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_cefe.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/534136/b/pineapple-trainwreck__primary_54ac.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_5c10.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/510549/b/pineapple-trainwreck__primary_a54c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_3ef0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/499914/b/pineapple-trainwreck__primary_988c.jpg"}],"photoTotalCount":48,"popularCities":["Portland, OR","Eugene, OR","Montréal, QC","Keizer, OR","Los Angeles, CA","Santa Ana, CA","Springfield, OR","Vancouver, BC","Arnold, CA","Barrie, ON"],"permalink":"https://mobileapi.leafly.com/hybrid/pineapple-trainwreck","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.14516129032258/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Pineapple Express","subtitle":null,"slug":"pineapple-express","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/pineapple-express","symbol":"Pex","applink":"leafly://strain/pineapple-express"},{"name":"Trainwreck","subtitle":null,"slug":"trainwreck","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/trainwreck","symbol":"Tw","applink":"leafly://strain/trainwreck"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":540,"slug":"pineapple-trainwreck","name":"Pineapple Trainwreck","subtitle":null,"symbol":"Ptw","category":"Hybrid","description":"\u003cp\u003eBring together the popular clear-headed effects of \u003ca href=\"http://www.leafly.com/hybrid/pineapple-express\"\u003ePineapple Express\u003c/a\u003e and the pain relief qualities of \u003ca href=\"http://www.leafly.com/hybrid/trainwreck\"\u003eTrainwreck\u003c/a\u003e and you get this happy sativa. Pineapple Trainwreck has an earthy aroma and a fruity flavor that usually takes more after its pineapple parent. Long-lasting and potent, this strain hits hard at first, but mellows into a state where being sociable or getting things done is possible. The buzz tends to be more mellow than active, though, so don\u0026rsquo;t be surprised if verbal activity is all you get around to.\u003c/p\u003e\n","descriptionPlain":"Bring together the popular clear-headed effects of Pineapple Express and the pain relief qualities of Trainwreck and you get this happy sativa. Pineapple Trainwreck has an earthy aroma and a fruity flavor that usually takes more after its pineapple parent. Long-lasting and potent, this strain hits hard at first, but mellows into a state where being sociable or getting things done is possible. The buzz tends to be more mellow than active, though, so don\u0026rsquo;t be surprised if verbal activity is all you get around to.\n","aka":"Pineapple Wreck","rating":4.15,"highlightedReviews":[{"id":1414895,"username":"Allie17","text":"Oh Pineapple Trainwreck, what have you done to me? I\u0027m an experienced smoker with severe arthritis, and this strain knocked me into an ocean and left me stranded there without a life vest. The onset takes a little bit for sure. You start to feel very giggly and happy, and then you get smacked in the face with a tsunami of highness. My body was floating in nothingness, and all my pain disappeared completely. You do get the spiciness from Trainwreck, but the Pineapple Express overpowers the Trainwreck in taste. It\u0027s like smoking an assortment of tropical fruit. Smoke it with a bong, it tastes like Pineapples. Drink a Baja Blast before taking a hit, it tastes like mango and watermelon. It tasted amazing, and worked wonderfully for pain. The only downside is that dry eyes hit you really hard. I felt like I was in the ocean, but my eyes were left in the Sahara. Only downside to the strain, but the positives outweigh the negatives for sure! ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1637530,"username":"sheisblue242","text":"Very aroused, extremely high after one bowl","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-29132","title":"The 6 Best Documentaries to Watch While High","author":"Hannah Meadows","category":null,"date":"\/Date(1497189652000)\/","text":"Firing up a documentary whilst high is hardly a new idea, but it’s usually a good one (hello, Planet Earth). There’s so much to learn and explore via films that showcase unique and mind-bending experiences—especially with a little help from a well-packed bowl. Additionally, the truthfulness of documentaries comes as a breath of fresh air amid the throngs of lowbrow comedies and overly intense dramas that tend to flood the average Netflix queue.\n\nTo elevate this classic cannabis-enhanced activity, we mined the opinions of the staff at the Leafly office and compiled a list of the best documentaries to watch while high. In narrowing from a list that included scores of suggestions, I personally vetted the top picks to bring you the following finalists. From explorations of history to non-verbal spectaculars, there’s a bit of something for everyone below. Spark up a pre-roll or bake a batch of edibles, then get comfortable on the couch and press play—we’re willing to bet you’ll discover a new favorite.\nRecently watched a noteworthy documentary? Tell us about it in the comments below!\nCave of Forgotten Dreams\n\nFamed documentary director Werner Herzog knocked it out of the park—yet again—with his video exploration of the Chauvet Cave of Southern France. Discovered by three explorers in 1994, the cave houses ancient paintings that are the oldest ever recorded in human history, dating back between 28,000 and 35,000 years. The paintings are perfectly preserved—along with the bones of long extinct animals—having never been touched by natural light or exposure to the elements.\nBefore watching this film, I lit up some Blue Dream and even through a small computer screen (I, uh…don’t own a TV), the paintings, their meanings, and Herzog’s beautifully crafted narrative combined to create a film that was truly breathtaking. Long after the film ended, I thought about the person or people who made these, the gods they may have worshipped, the natural world in which they lived, and the ancient culture to which they belonged.\nI doubt sober thoughts would have gravitated toward the essence and deeper meaning these paintings hold in regard to human life and the history of mankind like my Blue Dream-induced thoughts did. I recommend this documentary for the music, the art, the history, the curiosity—everything about it.\nGoing Clear: Scientology and the Prison of Belief\n\nDocumentaries exploring religious sects or cults are my bread and butter. Documentaries exploring religions that are widely regarded as cults are even better—the extra-sweet jam to that bread and butter. Enter Going Clear, an eye-opening expose of L. Ron Hubbard and his imaginative, interwoven ideals of science fiction and religion that ultimately led to the creation of the Church of Scientology.\nIn this documentary, we hear stories from ex-Scientologists. These aren’t just “tried it out for a week and left” Scientologists—these people were indoctrinated into the religion for years, even decades, before getting out. Some moved up to the highest levels of the religion before calling it quits.\nSober, this is an interesting journey down the rabbit hole of Scientology. High, this documentary will open your thoughts to science, religion, and how people respond to both in a whole new light. Load a bowl of the buzzy White Fire OG before pressing play.\nSamsara\n\nNonverbal and utterly breathtaking, Samsara is the younger sister to the popular 1992 documentary Baraka (the previous nonverbal narrative exploration of nature and human life). Like Bakara, Samsara was directed by Mond Russell and produced by Mark Magidson, so the quality and feel stay true to the original.\nSamsara will leave you in awe of its gorgeous, lingering landscapes, and rich visions of people from all over the world. This colossal documentary took five years to film and spanned about 25 countries.\nThroughout this entire spectacular, cannabis will keep your eyes peeled and your mind enamored with this hour-and-a-half film of explosive color and life. Creative strains such as Pineapple Trainwreck or Berry White will let your mind completely soak in this remarkable film.\nFor an extra boost, check out the classic Koyaanisqatsi which pre-dates Samsara by about 20 years. The score is done by the famous composer Philip Glass with cinematography by Ron Fricke (who also worked on Samsara and Baraka). Though Koyaanisqatsi may not be as visually crisp as Samasara or Baraka, it was the core inspiration for both stunning films.\n\nBeware of Mr. Baker\n\nThe colorful life of Ginger Baker, legendary drummer of the popular rock bands Cream and Blind Faith, is front and center in this exploratory documentary. Rock legends laud him as the greatest drummer who ever lived, but the “behind the scenes” of Baker’s life shows a volatile man with a short fuse and passionate air.\nHe’s a true character in every sense of the word, having traveled the world and experienced a life that only one in a billion could mirror. Though hard drug use and angry outbursts (mostly fueled by said hard drug use) clouded his legend, his life story remains remarkable in every way.\nRegardless of whether or not you know who Ginger Baker is, this film is fascinating and will appeal to everyone—especially lovers of rock music. I recommend lighting up a little Durban Poison as you watch this film.\nInto the Inferno\n\nWerner Herzog makes another appearance on this list with his relatively new Netflix documentary Into the Inferno. Much like Cave of Forgotten Dreams, Into the Inferno touches on the history of human life. After delving into the world of volcanic activity, Herzog explores the religions that have developed across cultures greatly influenced by local volcanic eruptions.\nIn true Herzog style, the documentary approaches these subjects with both historical and artistic flair. Some of the most touching and beautiful points in the film are the sweeping shots of erupting volcanoes punctuated with classical or operatic music.\nJuxtaposed with these beautiful shots are scenes of ceremonial activities conducted by worshippers who believe certain volcanoes house spirits of long-dead loved ones and mighty gods. Also wrapped up with all this is the discovery of an ancient human fossil as well as the recounting of the lives of two famous volcano photographers. In short, Herzog does quite a lot with this film, and it’s all compelling.\nYet another amazing documentary that, when paired with cannabis, leaves you contemplating it days after the credits roll. Reach for some Stardawg to pair with this incredible film.\nTickled\n\nFor something well off the beaten path in terms of documentaries, I suggest you sit down and watch Tickled. It starts off innocently enough, with the director, David Farrier, simply wanting to explore an interesting subject: the world of endurance tickling. Sure, it’s an odd sport to most, but why not get a feel for something a bit different? No harm … right?\n…Right?\nWell, much to the filmmakers’ surprise—as well as my own—there is a bit of harm in exploring the unknown. Not to give too much away, the endurance competitions held by professional ticklers are more than just a good laugh.\nYou’ll be on the edge of your seat while Farrier dives down the deep and twisty hole that goes straight to the mystifying and sometimes terrifying underworld of tickling competitions. To really get into this film, you’ll want to have some Permafrost close at hand—its effects will help take the edge off the strangeness in this documentary.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/09155343/best-documentaries-to-watch-while-high.jpg","urlslug":"/news/lifestyle/best-high-documentaries"},{"id":"contentitems-3571","title":"The Oregon DOPE Cup Winning Cannabis Strains, Concentrates, and Edibles","author":"Will Hyde","category":null,"date":"\/Date(1444424400000)\/","text":"October 1st marked the opening of recreational cannabis sales in Oregon, and what better way to close out the weekend of celebrations than with the first cannabis cup in the state? DOPE Magazine hosted the Oregon DOPE Cup at Refuge PDX in Portland. Happy Oregonians spilled out of the venue and into the city streets, eager to join the festivities and excitedly sampling all the vendors had to offer. The evening’s entertainment was provided by a variety of local musicians and artists who warmed the crowd up for Redman’s headlining performance.\nHappy people, good music, and award-winning cannabis — what more could you ask for? How about the winning strains and products? Here are the award-winners from the 2015 Oregon DOPE Cup:\n \nWinning Cannabis Flowers\n\n \nPeoples’ Choice\n\nMango Kush from Chalice Farms\n \nJudges’ Choice\n\nGSC (f.k.a Girl Scout Cookies) from Herbal Roots\n \nBest Indica Cannabis Strain\n\nWinner: Obama Kush from High Standards\nRunner Up: Anonymous V from Eco Firma Farms\n \nBest Sativa Cannabis Strain\n\nWinner: Strawberry Ice from Chalice Farms\nRunner Up: Chernobyl from Geek Farms\n \nBest Hybrid Cannabis Strain\n\nWinner: Platinum Animal Cookies from Ideal Farms\nRunner Up: Cherry Lopez from Dr. Vert\n \nBest High-THC Cannabis Strain\n\nWinner: The White from Eco Firma Farms\nRunner Up: New York Old School from Five Mules Farms\n \nBest High-CBD Cannabis Strain\n\nWinner: TJ’s CBD from TJ’s Organics\nRunner Up: Charlotte’s Web from Chalice Farms\n \nWinning Cannabis Concentrates\n\n \nBest BHO (THC)\n\nWinner: OG Kush Live Resin from Dirty Arm Farm\nRunner Up: Agent Orange Live Resin from Dirty Arm Farm\n \nBest BHO (CBD)\n\nWinner: Harle Tsu from Proper Oil\nRunner Up: Harle Tsu from Mad Fama\n \nBest PHO (THC)\n\nWinner: Jack Herer Terp Wax from Orgone Extracts\nRunner Up: White Super Skunk from Cultivated Industries\n \nBest Non-Solvent Cannabis Concentrate (THC)\n\nWinner: Pineapple Trainwreck Terp Sauce from Primo Extracts\nRunner Up: Animal Cookies from Reson Ranchers\n \nBest Cannabis Concentrate Cartridge\n\nWinner: OG Kush Wax Truly Pure\nRunner Up: Dutch Treat from Golden XTRX\n \nBest CO2 Cannabis Concentrate (THC)\nWinner: Smarties OM Extracts\nRunner Up: The Clear from Orgone Extracts\n \nBest CO2 Cannabis Concentrate (CBD)\nWinner: Buddha Kong from True North Extracts\nRunner Up: Harle Tsu from OM Extracts\n \nWinning Cannabis Edibles\n\n \nBest Sweet Cannabis Edible\nWinner: Chocolate Kettle Corn from Cannavore\nRunner Up: Blueberries and Hazelnut from Blaze Bars\n \nBest Savory Cannabis Edible\nWinner: Garlic Herb Almonds from Lunchbox Alchemy\nRunner Up: Ginger Hemp Granola from Pannacea Valley Gourmet Edibles\n \nBest CBD Cannabis Edible\nWinner: Honey Bee Honey Stick from Echo Electuary\nRunner Up: CBD Dark Chocolate Truffle from Leif Medicinals\n \nBest Cannabis-Infused Drink\nWinner: Mate Karate from Bent Beverage\nRunner Up: Fruit Punch Level 3 from Vitonic\n \nWinning Cannabis Topical\n\n \nBest Cannabis Topical\nWinner: Peppermint Cayenne Salve from Henrys Herbals\nRunner Up: The Transdermal Patches from Synergy Skin Worx","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002857/the-oregon-dope-cup-winning-cannabis-strains-concentrates-and-edi.jpg","urlslug":"/news/strains-products/the-oregon-dope-cup-winning-cannabis-strains-concentrates-and-edi"}],"reviewCount":186,"flavors":[{"name":"Sweet","score":55.627446715963458},{"name":"Pineapple","score":44.769464984775986},{"name":"Earthy","score":29.38777729447586},{"name":"Mango","score":25.619834710743802},{"name":"Grapefruit","score":25.206611570247933}],"effects":[{"name":"Relaxed","score":75.7557633753806},{"name":"Uplifted","score":72.455415397999133},{"name":"Euphoric","score":69.823836450630708},{"name":"Creative","score":35.06959547629404},{"name":"Energetic","score":34.656372335798174}],"symptoms":[{"name":"Stress","score":37.597868638538493},{"name":"Depression","score":32.177033492822964},{"name":"Pain","score":7.9001739886907352},{"name":"Nausea","score":5.2142235754675941},{"name":"Lack of Appetite","score":5.0076120052196611}],"conditions":[{"name":"Anxiety","score":33.416702914310569},{"name":"Arthritis","score":28.251413658112224},{"name":"Migraines","score":4.69769464984776},{"name":"ADD/ADHD","score":3.5613310134841232},{"name":"Gastrointestinal Disorder","score":3.3547194432361893}],"negatives":[{"name":"Dry Mouth","score":14.71291866028708},{"name":"Dry Eyes","score":6.2472814267072634},{"name":"Paranoid","score":4.69769464984776},{"name":"Dizzy","score":3.9745541539799909},{"name":"Anxious","score":3.4580252283601562}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_ac74.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/609612/b/pineapple-trainwreck__primary_2406.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_5f86.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/589931/b/pineapple-trainwreck__primary_3707.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_5d35.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/553069/b/pineapple-trainwreck__primary_614e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_cefe.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/534136/b/pineapple-trainwreck__primary_54ac.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_5c10.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/510549/b/pineapple-trainwreck__primary_a54c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_3ef0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/499914/b/pineapple-trainwreck__primary_988c.jpg"}],"photoTotalCount":48,"popularCities":["Portland, OR","Eugene, OR","Montréal, QC","Keizer, OR","Los Angeles, CA","Santa Ana, CA","Springfield, OR","Vancouver, BC","Arnold, CA","Barrie, ON"],"permalink":"https://mobileapi.leafly.com/hybrid/pineapple-trainwreck","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.14516129032258/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Pineapple Express","subtitle":null,"slug":"pineapple-express","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/pineapple-express","symbol":"Pex","applink":"leafly://strain/pineapple-express"},{"name":"Trainwreck","subtitle":null,"slug":"trainwreck","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/trainwreck","symbol":"Tw","applink":"leafly://strain/trainwreck"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":540,"slug":"pineapple-trainwreck","name":"Pineapple Trainwreck","subtitle":null,"symbol":"Ptw","category":"Hybrid","description":"\u003cp\u003eBring together the popular clear-headed effects of \u003ca href=\"http://www.leafly.com/hybrid/pineapple-express\"\u003ePineapple Express\u003c/a\u003e and the pain relief qualities of \u003ca href=\"http://www.leafly.com/hybrid/trainwreck\"\u003eTrainwreck\u003c/a\u003e and you get this happy sativa. Pineapple Trainwreck has an earthy aroma and a fruity flavor that usually takes more after its pineapple parent. Long-lasting and potent, this strain hits hard at first, but mellows into a state where being sociable or getting things done is possible. The buzz tends to be more mellow than active, though, so don\u0026rsquo;t be surprised if verbal activity is all you get around to.\u003c/p\u003e\n","descriptionPlain":"Bring together the popular clear-headed effects of Pineapple Express and the pain relief qualities of Trainwreck and you get this happy sativa. Pineapple Trainwreck has an earthy aroma and a fruity flavor that usually takes more after its pineapple parent. Long-lasting and potent, this strain hits hard at first, but mellows into a state where being sociable or getting things done is possible. The buzz tends to be more mellow than active, though, so don\u0026rsquo;t be surprised if verbal activity is all you get around to.\n","aka":"Pineapple Wreck","rating":4.15,"highlightedReviews":[{"id":1414895,"username":"Allie17","text":"Oh Pineapple Trainwreck, what have you done to me? I\u0027m an experienced smoker with severe arthritis, and this strain knocked me into an ocean and left me stranded there without a life vest. The onset takes a little bit for sure. You start to feel very giggly and happy, and then you get smacked in the face with a tsunami of highness. My body was floating in nothingness, and all my pain disappeared completely. You do get the spiciness from Trainwreck, but the Pineapple Express overpowers the Trainwreck in taste. It\u0027s like smoking an assortment of tropical fruit. Smoke it with a bong, it tastes like Pineapples. Drink a Baja Blast before taking a hit, it tastes like mango and watermelon. It tasted amazing, and worked wonderfully for pain. The only downside is that dry eyes hit you really hard. I felt like I was in the ocean, but my eyes were left in the Sahara. Only downside to the strain, but the positives outweigh the negatives for sure! ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1637530,"username":"sheisblue242","text":"Very aroused, extremely high after one bowl","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-29132","title":"The 6 Best Documentaries to Watch While High","author":"Hannah Meadows","category":null,"date":"\/Date(1497189652000)\/","text":"Firing up a documentary whilst high is hardly a new idea, but it’s usually a good one (hello, Planet Earth). There’s so much to learn and explore via films that showcase unique and mind-bending experiences—especially with a little help from a well-packed bowl. Additionally, the truthfulness of documentaries comes as a breath of fresh air amid the throngs of lowbrow comedies and overly intense dramas that tend to flood the average Netflix queue.\n\nTo elevate this classic cannabis-enhanced activity, we mined the opinions of the staff at the Leafly office and compiled a list of the best documentaries to watch while high. In narrowing from a list that included scores of suggestions, I personally vetted the top picks to bring you the following finalists. From explorations of history to non-verbal spectaculars, there’s a bit of something for everyone below. Spark up a pre-roll or bake a batch of edibles, then get comfortable on the couch and press play—we’re willing to bet you’ll discover a new favorite.\nRecently watched a noteworthy documentary? Tell us about it in the comments below!\nCave of Forgotten Dreams\n\nFamed documentary director Werner Herzog knocked it out of the park—yet again—with his video exploration of the Chauvet Cave of Southern France. Discovered by three explorers in 1994, the cave houses ancient paintings that are the oldest ever recorded in human history, dating back between 28,000 and 35,000 years. The paintings are perfectly preserved—along with the bones of long extinct animals—having never been touched by natural light or exposure to the elements.\nBefore watching this film, I lit up some Blue Dream and even through a small computer screen (I, uh…don’t own a TV), the paintings, their meanings, and Herzog’s beautifully crafted narrative combined to create a film that was truly breathtaking. Long after the film ended, I thought about the person or people who made these, the gods they may have worshipped, the natural world in which they lived, and the ancient culture to which they belonged.\nI doubt sober thoughts would have gravitated toward the essence and deeper meaning these paintings hold in regard to human life and the history of mankind like my Blue Dream-induced thoughts did. I recommend this documentary for the music, the art, the history, the curiosity—everything about it.\nGoing Clear: Scientology and the Prison of Belief\n\nDocumentaries exploring religious sects or cults are my bread and butter. Documentaries exploring religions that are widely regarded as cults are even better—the extra-sweet jam to that bread and butter. Enter Going Clear, an eye-opening expose of L. Ron Hubbard and his imaginative, interwoven ideals of science fiction and religion that ultimately led to the creation of the Church of Scientology.\nIn this documentary, we hear stories from ex-Scientologists. These aren’t just “tried it out for a week and left” Scientologists—these people were indoctrinated into the religion for years, even decades, before getting out. Some moved up to the highest levels of the religion before calling it quits.\nSober, this is an interesting journey down the rabbit hole of Scientology. High, this documentary will open your thoughts to science, religion, and how people respond to both in a whole new light. Load a bowl of the buzzy White Fire OG before pressing play.\nSamsara\n\nNonverbal and utterly breathtaking, Samsara is the younger sister to the popular 1992 documentary Baraka (the previous nonverbal narrative exploration of nature and human life). Like Bakara, Samsara was directed by Mond Russell and produced by Mark Magidson, so the quality and feel stay true to the original.\nSamsara will leave you in awe of its gorgeous, lingering landscapes, and rich visions of people from all over the world. This colossal documentary took five years to film and spanned about 25 countries.\nThroughout this entire spectacular, cannabis will keep your eyes peeled and your mind enamored with this hour-and-a-half film of explosive color and life. Creative strains such as Pineapple Trainwreck or Berry White will let your mind completely soak in this remarkable film.\nFor an extra boost, check out the classic Koyaanisqatsi which pre-dates Samsara by about 20 years. The score is done by the famous composer Philip Glass with cinematography by Ron Fricke (who also worked on Samsara and Baraka). Though Koyaanisqatsi may not be as visually crisp as Samasara or Baraka, it was the core inspiration for both stunning films.\n\nBeware of Mr. Baker\n\nThe colorful life of Ginger Baker, legendary drummer of the popular rock bands Cream and Blind Faith, is front and center in this exploratory documentary. Rock legends laud him as the greatest drummer who ever lived, but the “behind the scenes” of Baker’s life shows a volatile man with a short fuse and passionate air.\nHe’s a true character in every sense of the word, having traveled the world and experienced a life that only one in a billion could mirror. Though hard drug use and angry outbursts (mostly fueled by said hard drug use) clouded his legend, his life story remains remarkable in every way.\nRegardless of whether or not you know who Ginger Baker is, this film is fascinating and will appeal to everyone—especially lovers of rock music. I recommend lighting up a little Durban Poison as you watch this film.\nInto the Inferno\n\nWerner Herzog makes another appearance on this list with his relatively new Netflix documentary Into the Inferno. Much like Cave of Forgotten Dreams, Into the Inferno touches on the history of human life. After delving into the world of volcanic activity, Herzog explores the religions that have developed across cultures greatly influenced by local volcanic eruptions.\nIn true Herzog style, the documentary approaches these subjects with both historical and artistic flair. Some of the most touching and beautiful points in the film are the sweeping shots of erupting volcanoes punctuated with classical or operatic music.\nJuxtaposed with these beautiful shots are scenes of ceremonial activities conducted by worshippers who believe certain volcanoes house spirits of long-dead loved ones and mighty gods. Also wrapped up with all this is the discovery of an ancient human fossil as well as the recounting of the lives of two famous volcano photographers. In short, Herzog does quite a lot with this film, and it’s all compelling.\nYet another amazing documentary that, when paired with cannabis, leaves you contemplating it days after the credits roll. Reach for some Stardawg to pair with this incredible film.\nTickled\n\nFor something well off the beaten path in terms of documentaries, I suggest you sit down and watch Tickled. It starts off innocently enough, with the director, David Farrier, simply wanting to explore an interesting subject: the world of endurance tickling. Sure, it’s an odd sport to most, but why not get a feel for something a bit different? No harm … right?\n…Right?\nWell, much to the filmmakers’ surprise—as well as my own—there is a bit of harm in exploring the unknown. Not to give too much away, the endurance competitions held by professional ticklers are more than just a good laugh.\nYou’ll be on the edge of your seat while Farrier dives down the deep and twisty hole that goes straight to the mystifying and sometimes terrifying underworld of tickling competitions. To really get into this film, you’ll want to have some Permafrost close at hand—its effects will help take the edge off the strangeness in this documentary.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/09155343/best-documentaries-to-watch-while-high.jpg","urlslug":"/news/lifestyle/best-high-documentaries"},{"id":"contentitems-3571","title":"The Oregon DOPE Cup Winning Cannabis Strains, Concentrates, and Edibles","author":"Will Hyde","category":null,"date":"\/Date(1444424400000)\/","text":"October 1st marked the opening of recreational cannabis sales in Oregon, and what better way to close out the weekend of celebrations than with the first cannabis cup in the state? DOPE Magazine hosted the Oregon DOPE Cup at Refuge PDX in Portland. Happy Oregonians spilled out of the venue and into the city streets, eager to join the festivities and excitedly sampling all the vendors had to offer. The evening’s entertainment was provided by a variety of local musicians and artists who warmed the crowd up for Redman’s headlining performance.\nHappy people, good music, and award-winning cannabis — what more could you ask for? How about the winning strains and products? Here are the award-winners from the 2015 Oregon DOPE Cup:\n \nWinning Cannabis Flowers\n\n \nPeoples’ Choice\n\nMango Kush from Chalice Farms\n \nJudges’ Choice\n\nGSC (f.k.a Girl Scout Cookies) from Herbal Roots\n \nBest Indica Cannabis Strain\n\nWinner: Obama Kush from High Standards\nRunner Up: Anonymous V from Eco Firma Farms\n \nBest Sativa Cannabis Strain\n\nWinner: Strawberry Ice from Chalice Farms\nRunner Up: Chernobyl from Geek Farms\n \nBest Hybrid Cannabis Strain\n\nWinner: Platinum Animal Cookies from Ideal Farms\nRunner Up: Cherry Lopez from Dr. Vert\n \nBest High-THC Cannabis Strain\n\nWinner: The White from Eco Firma Farms\nRunner Up: New York Old School from Five Mules Farms\n \nBest High-CBD Cannabis Strain\n\nWinner: TJ’s CBD from TJ’s Organics\nRunner Up: Charlotte’s Web from Chalice Farms\n \nWinning Cannabis Concentrates\n\n \nBest BHO (THC)\n\nWinner: OG Kush Live Resin from Dirty Arm Farm\nRunner Up: Agent Orange Live Resin from Dirty Arm Farm\n \nBest BHO (CBD)\n\nWinner: Harle Tsu from Proper Oil\nRunner Up: Harle Tsu from Mad Fama\n \nBest PHO (THC)\n\nWinner: Jack Herer Terp Wax from Orgone Extracts\nRunner Up: White Super Skunk from Cultivated Industries\n \nBest Non-Solvent Cannabis Concentrate (THC)\n\nWinner: Pineapple Trainwreck Terp Sauce from Primo Extracts\nRunner Up: Animal Cookies from Reson Ranchers\n \nBest Cannabis Concentrate Cartridge\n\nWinner: OG Kush Wax Truly Pure\nRunner Up: Dutch Treat from Golden XTRX\n \nBest CO2 Cannabis Concentrate (THC)\nWinner: Smarties OM Extracts\nRunner Up: The Clear from Orgone Extracts\n \nBest CO2 Cannabis Concentrate (CBD)\nWinner: Buddha Kong from True North Extracts\nRunner Up: Harle Tsu from OM Extracts\n \nWinning Cannabis Edibles\n\n \nBest Sweet Cannabis Edible\nWinner: Chocolate Kettle Corn from Cannavore\nRunner Up: Blueberries and Hazelnut from Blaze Bars\n \nBest Savory Cannabis Edible\nWinner: Garlic Herb Almonds from Lunchbox Alchemy\nRunner Up: Ginger Hemp Granola from Pannacea Valley Gourmet Edibles\n \nBest CBD Cannabis Edible\nWinner: Honey Bee Honey Stick from Echo Electuary\nRunner Up: CBD Dark Chocolate Truffle from Leif Medicinals\n \nBest Cannabis-Infused Drink\nWinner: Mate Karate from Bent Beverage\nRunner Up: Fruit Punch Level 3 from Vitonic\n \nWinning Cannabis Topical\n\n \nBest Cannabis Topical\nWinner: Peppermint Cayenne Salve from Henrys Herbals\nRunner Up: The Transdermal Patches from Synergy Skin Worx","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002857/the-oregon-dope-cup-winning-cannabis-strains-concentrates-and-edi.jpg","urlslug":"/news/strains-products/the-oregon-dope-cup-winning-cannabis-strains-concentrates-and-edi"}],"reviewCount":186,"flavors":[{"name":"Sweet","score":55.627446715963458},{"name":"Pineapple","score":44.769464984775986},{"name":"Earthy","score":29.38777729447586},{"name":"Mango","score":25.619834710743802},{"name":"Grapefruit","score":25.206611570247933}],"effects":[{"name":"Relaxed","score":75.7557633753806},{"name":"Uplifted","score":72.455415397999133},{"name":"Euphoric","score":69.823836450630708},{"name":"Creative","score":35.06959547629404},{"name":"Energetic","score":34.656372335798174}],"symptoms":[{"name":"Stress","score":37.597868638538493},{"name":"Depression","score":32.177033492822964},{"name":"Pain","score":7.9001739886907352},{"name":"Nausea","score":5.2142235754675941},{"name":"Lack of Appetite","score":5.0076120052196611}],"conditions":[{"name":"Anxiety","score":33.416702914310569},{"name":"Arthritis","score":28.251413658112224},{"name":"Migraines","score":4.69769464984776},{"name":"ADD/ADHD","score":3.5613310134841232},{"name":"Gastrointestinal Disorder","score":3.3547194432361893}],"negatives":[{"name":"Dry Mouth","score":14.71291866028708},{"name":"Dry Eyes","score":6.2472814267072634},{"name":"Paranoid","score":4.69769464984776},{"name":"Dizzy","score":3.9745541539799909},{"name":"Anxious","score":3.4580252283601562}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_ac74.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/609612/b/pineapple-trainwreck__primary_2406.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_5f86.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/589931/b/pineapple-trainwreck__primary_3707.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_5d35.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/553069/b/pineapple-trainwreck__primary_614e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_cefe.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/534136/b/pineapple-trainwreck__primary_54ac.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_5c10.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/510549/b/pineapple-trainwreck__primary_a54c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-trainwreck_100x100_3ef0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/499914/b/pineapple-trainwreck__primary_988c.jpg"}],"photoTotalCount":48,"popularCities":["Portland, OR","Eugene, OR","Montréal, QC","Keizer, OR","Los Angeles, CA","Santa Ana, CA","Springfield, OR","Vancouver, BC","Arnold, CA","Barrie, ON"],"permalink":"https://mobileapi.leafly.com/hybrid/pineapple-trainwreck","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.14516129032258/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Pineapple Express","subtitle":null,"slug":"pineapple-express","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/pineapple-express","symbol":"Pex","applink":"leafly://strain/pineapple-express"},{"name":"Trainwreck","subtitle":null,"slug":"trainwreck","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/trainwreck","symbol":"Tw","applink":"leafly://strain/trainwreck"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
