{
    "aka": "Gate Keeper OG, Farmer 12 OG Kush",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1439564400000)/",
            "id": "contentitems-3267",
            "text": "New strains have been added to the Leafly Explorer, and we want to hear what you think of them! Leave a strain review for the ones you've tried, or seek them out by navigating to their strain page or by visiting one of the links below.\n \n 1. Day Tripper\n\nDay Tripper is a hybrid cannabis strain that managed to inherit sativa-like effects from its indica-dominant family tree. A descendant of Sensi Star, Medicine Man, and Master Kush, Day Tripper is an unexpectedly lightweight hybrid that pairs well with active and creative hobbies. Its motivating effects come with a fresh, clean aroma and can be enjoyed morning, afternoon, and night.\n\nDay Tripper is currently available at Zion Cannabis in Portland, OR\n \n 2. Ancient Kush\n\nAncient Kush is an indica-dominant hybrid strain whose genetic background is lost to history, but most certainly contains the age-old characteristics of Afghani indicas. Its short bushy plants bloom with resinous buds that tend to darken purple near the end of maturation. Skunky lemon and smooth earthiness make up this indica’s aroma in a fragrant introduction of her relaxing, mood-warming effects.\n\nAncient Kush is currently available at Zion Cannabis in Portland, OR\n \n 3. CBD Kush\n\nFrom the collaborative efforts of CBD Crew and Dutch Passion comes CBD Kush, a hybrid strain with equal parts THC and CBD. Bred from Kandy Kush and an unnamed high-CBD variety, CBD Kush typically tests around 7% in both THC and CBD which may benefit consumers with a low tolerance or those treating conditions such as pain, inflammation, or anxiety. Its psychoactive effects are subtle, offering a tame experience that eases the muscles into relaxation without too much mental cloudiness.\n\nClick here for a full list of shops currently carrying CBD Kush\n \n 4. NYPD\n\nNYPD, or New York Power Diesel, is a 70/30 sativa-dominant hybrid bred by Nirvana Seeds, who crossed Aurora Indica with a Mexican sativa called Eldorado. With its dueling indica and sativa genetics, NYPD delivers a balanced effect that is neither racy nor lethargic, but a happy in-between. Its name is derived from its funky diesel aroma which is sweetened by the citrusy smell of lemons.\n\nClick here for a full list of shops currently carrying NYPD\n \n 5. Super Sweet\n\nSuper Sweet is an indica-dominant hybrid strain that was bred in Flint, Michigan by Masterpiece Medical Group. This decades old heirloom strain entices the senses with a floral candy-like aroma and a frosty layer of crystal resin that blankets tight, dense buds. With a modest THC content that typically measures around 13-14%, Super Sweet is a good choice for novice consumers or those looking for a less intoxicating buzz. Its mellow euphoria resonates cerebrally while long-lasting relaxation takes over mind and body.\n\nSuper Sweet is currently available at Mr. Doobees in Raymond, WA\n \n 6. Star Master Kush\n\nStar Master Kush is an indica-dominant hybrid strain from the gardens of Zion Cannabis in Portland, Oregon. A complex tangle of award-winning genetics, Star Master Kush descends from Sensi Star, Medicine Man, Master Kush, and Platinum Kush. This fruity-scented indica packs a punch, with fast-acting and long-lasting effects that may overwhelm the novice consumer. Hypnotic euphoria invites sleepiness over time, making this strain a preferred choice for evening use.\n\nStar Master Kush is currently available at Zion Cannabis in Portland, OR\n \n 7. Gatekeeper OG\n\nGatekeeper OG is a sativa-dominant hybrid strain that was bred as an attempt to recreate and stabilize the “Farmer 12” version of OG Kush. Its breeding processes consisted of crossing Sensi Star, Medicine Man, and OG Kush, and then backcrossing it with OG Kush several more times to accentuate its earthy pine aroma and powerful effect profile. Expect that familiar OG Kush experience that begins with blissful relaxation and ends with a ravenous appetite.\n\nGatekeeper OG is currently available at Zion Cannabis in Portland, OR\n \nCheck out our other new strains recently added to the Leafly Explorer, or catch up on last week's recently added strains!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/08/12002048/new-strains-alert-day-tripper-cbd-kush-lapd-ancient-kush-and-more.png",
            "title": "New Strains Alert: Day Tripper, CBD Kush, LAPD, Ancient Kush, and More",
            "urlslug": "/news/strains-products/new-strains-alert-day-tripper-cbd-kush-lapd-ancient-kush-and-more"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [],
    "description": "<p>Gatekeeper OG is a sativa-dominant hybrid strain that was bred as an attempt to recreate and stabilize the &ldquo;Farmer 12&rdquo; version of OG Kush. Its breeding processes consisted of crossing <a href=\"https://www.leafly.com/indica/sensi-star\">Sensi Star</a>, <a href=\"https://www.leafly.com/hybrid/medicine-man\">Medicine Man</a>, and <a href=\"http://leafly.com/hybrid/og-kush\">OG Kush</a>, and then backcrossing it with OG Kush several more times to accentuate its earthy pine aroma and powerful effect profile. Expect that familiar OG Kush experience that begins with blissful relaxation and ends with a ravenous appetite.</p>\n",
    "descriptionPlain": "Gatekeeper OG is a sativa-dominant hybrid strain that was bred as an attempt to recreate and stabilize the &ldquo;Farmer 12&rdquo; version of OG Kush. Its breeding processes consisted of crossing Sensi Star, Medicine Man, and OG Kush, and then backcrossing it with OG Kush several more times to accentuate its earthy pine aroma and powerful effect profile. Expect that familiar OG Kush experience that begins with blissful relaxation and ends with a ravenous appetite.\n",
    "effects": [
        {
            "name": "Euphoric",
            "score": 10
        },
        {
            "name": "Relaxed",
            "score": 10
        },
        {
            "name": "Sleepy",
            "score": 5
        },
        {
            "name": "Uplifted",
            "score": 5
        },
        {
            "name": "Focused",
            "score": 5
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 15
        },
        {
            "name": "Sweet",
            "score": 5
        },
        {
            "name": "Flowery",
            "score": 5
        },
        {
            "name": "Pungent",
            "score": 5
        },
        {
            "name": "Woody",
            "score": 5
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1231424,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Pine & earth hybrids run rampant among us, but if you're a connoisseur of what's really good like me, most specifically this flower - it will stand out as one of the best strains as this one, my friends; is blended to perfection. Sensi Star, Medicine Man & OG Kush makes for a very balanced hybrid with the XB creates a light bodied, head-heavy yet indica based high. The name speaks for itself; unless prepared, you'll be trapped. ",
            "username": "tdever75"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1215656,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "this is my new favorite strain.  tastes yummy. talk about an uplifting med, wow. I feel great. ",
            "username": "wildchad"
        }
    ],
    "id": 175248,
    "name": "Gatekeeper OG",
    "negatives": [
        {
            "name": "Dry Eyes",
            "score": 5
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/og-kush",
            "category": "Hybrid",
            "name": "OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/og-kush",
            "slug": "og-kush",
            "subtitle": null,
            "symbol": "Ogk"
        },
        {
            "applink": "leafly://strain/sensi-star",
            "category": "Indica",
            "name": "Sensi Star",
            "permalink": "https://mobileapi.leafly.com/indica/sensi-star",
            "slug": "sensi-star",
            "subtitle": null,
            "symbol": "Sen"
        },
        {
            "applink": "leafly://strain/medicine-man",
            "category": "Hybrid",
            "name": "Medicine Man",
            "permalink": "https://mobileapi.leafly.com/hybrid/medicine-man",
            "slug": "medicine-man",
            "subtitle": null,
            "symbol": "Med"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/gatekeeper-og",
    "photoTotalCount": 3,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/526731/b/gatekeeper-og__primary_dfd4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/gatekeeper-og_100x100_c186.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/377427/b/gatekeeper-og__primary_6be9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/gatekeeper-og_100x100_726c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/377579/b/gatekeeper-og__primary_7d93.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/gatekeeper-og_100x100_d48a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [],
    "rating": 5,
    "relatedStrains": [],
    "reviewCount": 5,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "gatekeeper-og",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
    "subtitle": null,
    "symbol": "Gat",
    "symptoms": [
        {
            "name": "Fatigue",
            "score": 5
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
