{"sl_translate":"description,descriptionPlain,category","id":182063,"slug":"american-dream","name":"American Dream","subtitle":null,"symbol":"Adr","category":"Hybrid","description":"\u003cp\u003eAmerican Dream by Sensi Seeds is an indica-dominant strain that blends \u003ca href=\"https://www.leafly.com/indica/afghan-skunk\"\u003eAfghan Skunk\u003c/a\u003e with \u003ca href=\"https://www.leafly.com/sativa/jamaican\"\u003eJamaican\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/sativa/hawaiian\"\u003eHawaiian\u003c/a\u003e genetics. Its name is charged with meaning, mainly in that this indica represents \u0026ldquo;honest toil, personal improvement, and enjoying the fruits of one\u0026rsquo;s labor,\u0026rdquo; as Sensi Seeds puts it. Earthy and skunky in flavor, American Dream helps you pursue happiness with balanced uplifting, social effects appropriate for day or evening use.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"American Dream by Sensi Seeds is an indica-dominant strain that blends Afghan Skunk with Jamaican and Hawaiian genetics. Its name is charged with meaning, mainly in that this indica represents \u0026ldquo;honest toil, personal improvement, and enjoying the fruits of one\u0026rsquo;s labor,\u0026rdquo; as Sensi Seeds puts it. Earthy and skunky in flavor, American Dream helps you pursue happiness with balanced uplifting, social effects appropriate for day or evening use.\u0026nbsp;\n","aka":null,"rating":4.73,"highlightedReviews":[{"id":1378531,"username":"thenamefittz","text":"The sensation you get after hitting American Dream... can only be compared to the feeling of taking your first step onto Ellis Island while gazing up at the Statue of Liberty’s wondrous bosom after completing your long journey across the Atlantic to escape your war-torn homeland. And that sensation my friends... is greatness.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1636430,"username":"macdaddyemily","text":"A really great strain, gets the creative juices flowing and is for sure helping the healing process of my sprained foot. much love for this strain ✌️","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Vt5M48GWTthyYLbmsfpetoWhvCA=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmlu7GeVZTteolLKW62f8_old-school-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-17346","title":"Which U.S. Presidents Would Have Tried Cannabis?","author":"Hannah Meadows","category":null,"date":"\/Date(1487614225000)\/","text":"From George Washington’s first presidential year in 1789 all the way up to our present time, cannabis use in the United States has been an interesting and often misunderstood hot button issue. Between the hemp fields owned by Founding Father Benjamin Franklin and the ridiculous “Reefer Madness” scare-mongering that lasted for a good chunk of modern American history, the presence of cannabis in politics and public discussion seems to have no end in sight.\nTo celebrate this wildly debated plant, we decided to take a peek into the history of a few American presidents and their sometimes embracing, sometimes hypocritical stance on the cannabis plant, speculating whether or not we believe they ‘inhaled’. We also provide a strain pairing we think most exudes each president on this list, because why not?\nGeorge Washington\n\nIf Washington were around these days, would he turn down a chance to puff on his indica pairing of Presidential OG? According to his numerous hemp farms, probably not. However, at the time, hemp was a commonly farmed plant used for its sturdy fibers to fashion ropes, clothing, fishing nets, and myriad other fibrous and useful items.\n\nApart from the practical use of hemp, it was noted that Washington included in one of his letters the following passage:\n“Began to separate the male from female plants rather too late…Pulling up the (male) hemp. Was too late for the blossom hemp by three weeks or a month.”\nThis note could indicate that he was planning a yield of higher-THC female plants, but that could be just a bit of our hopeful speculation.\nThomas Jefferson\n\nIt has been rumored that Thomas Jefferson once said, “Some of my finest hours have been spent on my back veranda, smoking hemp and observing as far as my eye can see.” That particular quote, however, has been debunked by a few historians.\nIn truth, Jefferson was an avid gardener with expansive portions of land dedicated to the cultivation of hundreds of plants, some of which some could have been cannabis. In his “Summary of Public Service” published in 1800, he stated, “The greatest service that can be rendered to any country is to add a useful plant to its culture.”\nWe like to take that quote very seriously here and apply it to the cannabis plant with its numerous medicinal contributions. For his acceptance of all things green, we decided to pair Jefferson with the hybrid American Dream, which represents “honest toil, personal improvement, and enjoying the fruits of one’s labor.” \nUlysses S. Grant\n\nHaving been the leading Union general of the North during the Civil War, it was most fitting to pair Grant with the popular indica Northern Lights. Whether or not he would have inhaled this strain seems to sway on the end of the affirmative. Cannabis was not illegal in the country during the Civil War era; in fact, it was (allegedly) used medicinally by many soldiers on both sides to cure a number of ailments.\n\nGrant, possibly being one of those who indulged in the consumption of cannabis, could have easily participated with little to no judgment from his peers.\nFranklin D. Roosevelt\n\nThe United States’ longest running president in history may or may not have participated in the consumption of cannabis. During his time in the oval office, he signed the 1937 Marijuana Tax Act. However, on the other side of the coin, he ended up signing an executive order pushing for hemp production for use during WWII in 1941. He also repealed prohibition, which indicates that he could have been open-minded toward the use of cannabis as much as the consumption of alcohol.\n\nFor FDR, we’re pairing him with the hybrid Lady Liberty for his famous 1936 address on the Statue of Liberty.\nRonald Reagan\n\nIt seems a bit tongue-in-cheek to include one of the fathers of the War on Drugs on this list, but we couldn’t ignore one of Reagan’s most iconic quotes when it comes to cannabis consumption (said after viewing an old botched study of the effects of marijuana on brain cells):\n“I now have absolute proof that smoking even one marijuana cigarette is equal in brain damage to being on Bikini Island during an H-Bomb blast.”\n\nThough we don’t believe Reagan would have touched the stuff (unless in private), we do think the hybrid THC Bomb pairs perfectly with the Great Communicator’s amusing quote.\nBarack Obama\n\nIt’s a no-brainer that we decided to pair Barack Obama with his dedicated indica strain Obama Kush, and his prior relationship with cannabis is definitely no secret. He has admitted to smoking here and there while he was going to school in Hawaii, but he’s pretty tight-lipped on whether or not he currently consumes.\nHowever, in a recent interview with Rolling Stone, the former president noted, in regard to cannabis:\n“I do believe that treating this [marijuana] as a public-health issue, the same way we do with cigarettes or alcohol, is the much smarter way to deal with it.”\nWe’ll light up some Obama Kush and cheers to that!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/02/17141818/presidents-day.jpg","urlslug":"/news/lifestyle/which-presidents-would-have-tried-cannabis"},{"id":"contentitems-3307","title":"New Strains Alert: Gumbi, Pokie, Light of Jah, G13 Diesel, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1443805200000)\/","text":"This week\u0027s new strains are here! We added a few varieties that are sure to bring you back to the days of Saturday morning cartoons, as well as some classic genetics that will leave fans of G13, Sour Diesel, and Skunk giddy.\nWhich ones have you tried? Let\u0027s see those strain reviews coming in!\n \n 1. Gumbi\n\nGumbi is an indica strain bred by combining a Pure Kush and LA Confidential cross with a Sweet Tooth and Juicy Fruit hybrid. This strain’s CBD content tends to be slightly higher than its THC profile, making this indica a great choice for those sensitive to psychoactive effects or patients treating pain, inflammation, or anxiety. With an aroma of sweet lemon and berries, Gumbi delivers functional, clear-headed effects that allow you to stay active and productive throughout the day. Don’t confuse Gumbi with its sister strain Pokie, who inherits a high-THC and low-CBD chemical profile despite being bred from the same parent genetics.\n\n \n 2. G13 Diesel\n\nG13 Diesel from Head Seeds is a well-balanced hybrid strain that descends from G13 and East Coast Sour Diesel. Its effects distribute themselves evenly between mind and body, bringing dueling sensations of cerebral energy and physical relaxation. This indica-leaning hybrid is a perfect way to get the appetite started or for spending cozy evenings at home. True to its Diesel heritage, G13 Diesel carries a pungent fuel-like odor sweetened by notes of citrus.\n\n \n 3. Pokie\n\nPokie is an indica-dominant strain that descends from a Pure Kush and LA Confidential hybrid and a Sweet Tooth and Juicy Fruit cross. Sister to the high-CBD indica Gumbi, Pokie caters to those more concerned with a high-THC content. Its earthy chocolate flavors are met with tranquilizing effects that relax the body without too much fogginess in the mind.\n\nClick here for a full list of shops currently carrying Pokie\n \n 4. Light of Jah\n\nLight of Jah is a sativa-dominant cannabis strain whose name is often used interchangeably with Jack Herer, but may also refer to a Jack Herer and Afghani hybrid. This hybridized rendition still leans toward the sativa side with uplifting effects that fuel creativity and positive moods. Its flavor is a sweet combination of tropical fruit and hashy, peppery spice.\n\nClick here for a full list of shops currently carrying Light of Jah\n \n 5. Sunlight Skunk\n\nSunlight Skunk from Zion Botanicals is a hybrid cannabis strain bred from Skunk #1 genetics. This Skunk is named after the glow its crystal-tipped trichomes take on when the sun rays hit them just right. Its buds radiate with fragrances of tangy fruit and sweet wildflowers in a pungently aromatic introduction to the blissful effects to come.\n\n \n 6. Nuken\n\nThe mostly indica Nuken is a Canadian strain bred by combining genetics from Kish (a cross of two Shishkaberry parents) and God Bud. Her even-keeled effects are delivered alongside a sweet, earthy aroma of fresh herbs and grass. While undeniably strong, Nuken typically leaves you functional enough to still enjoy hobbies and the company of friends. Nuken blooms with rounded, dense buds covered in a blanket of crystal resin veiling its sage hues.\n\nClick here for a full list of shops currently carrying Nuken\n \n 7. American Dream\n\nAmerican Dream by Sensi Seeds is an indica-dominant strain that blends Afghan Skunk with Jamaican and Hawaiian genetics. Its name is charged with meaning, mainly in that this indica represents “honest toil, personal improvement, and enjoying the fruits of one’s labor,” as Sensi Seeds puts it. Earthy and skunky in flavor, American Dream helps you pursue happiness with balanced uplifting, social effects appropriate for day or evening use.\n\nClick here for a full list of shops currently carrying American Dream\n \nCheck out our other new strains recently added to the Leafly Explorer, or catch up on last week\u0027s New Strains Alert!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002148/new-strains-alert-gumbi-pokie-light-of-jah-g13-diesel-and-more.png","urlslug":"/news/strains-products/new-strains-alert-gumbi-pokie-light-of-jah-g13-diesel-and-more"}],"reviewCount":15,"flavors":[{"name":"Earthy","score":37.692307692307693},{"name":"Pungent","score":13.846153846153847},{"name":"Woody","score":13.846153846153847},{"name":"Spicy/Herbal","score":11.923076923076923},{"name":"Sweet","score":11.923076923076923}],"effects":[{"name":"Relaxed","score":139.61538461538461},{"name":"Creative","score":123.84615384615384},{"name":"Uplifted","score":111.92307692307692},{"name":"Euphoric","score":79.615384615384613},{"name":"Tingly","score":73.84615384615384}],"symptoms":[{"name":"Spasticity","score":60},{"name":"Stress","score":57.692307692307693},{"name":"Depression","score":55.769230769230766},{"name":"Headaches","score":51.92307692307692},{"name":"Muscle Spasms","score":50}],"conditions":[{"name":"Migraines","score":60},{"name":"Anxiety","score":55.769230769230766},{"name":"ADD/ADHD","score":50},{"name":"PMS","score":50},{"name":"Arthritis","score":11.923076923076923}],"negatives":[{"name":"Dizzy","score":11.923076923076923},{"name":"Anxious","score":10},{"name":"Dry Mouth","score":7.6923076923076925},{"name":"Dry Eyes","score":1.9230769230769231},{"name":"Headache","score":1.9230769230769231}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/american-dream_100x100_4e42.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506705/b/american-dream__primary_377b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/american-dream_100x100_2aaa.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500948/b/american-dream__primary_107f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/american-dream_100x100_2856.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500912/b/american-dream__primary_5998.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/american-dream_100x100_49d5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/395402/b/american-dream__primary_a49a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/american-dream_100x100_bcbc.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/391127/b/american-dream__primary_e8b1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/american-dream_100x100_994f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/389330/b/american-dream__primary_7c49.jpg"}],"photoTotalCount":6,"popularCities":["Las Vegas, NV","Denver, CO","Henderson, NV","Portland, OR","Steamboat Springs, CO"],"permalink":"https://mobileapi.leafly.com/hybrid/american-dream","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.73333333333333/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghan Skunk","subtitle":null,"slug":"afghan-skunk","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghan-skunk","symbol":"Afs","applink":"leafly://strain/afghan-skunk"},{"name":"Jamaican","subtitle":null,"slug":"jamaican","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jamaican","symbol":"Jam","applink":"leafly://strain/jamaican"},{"name":"Hawaiian","subtitle":null,"slug":"hawaiian","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/hawaiian","symbol":"Haw","applink":"leafly://strain/hawaiian"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
