{"sl_translate":"description,descriptionPlain,category","id":100976,"slug":"tangerine","name":"Tangerine","subtitle":null,"symbol":"Tng","category":"Hybrid","description":"\u003cp\u003eTangerine is a \u003ca href=\"http://www.leafly.com/sativa\"\u003esativa\u003c/a\u003e-dominant \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e, a 4th generation daughter of\u0026nbsp;Ch9 Aroma. The fruity \u003ca href=\"http://www.leafly.com/explore#/explore/flavors-orange\"\u003etangerine\u003c/a\u003e\u0026nbsp;aroma is accompanied with notes of \u003ca href=\"http://www.leafly.com/explore#/explore/flavors-mango\"\u003emango\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#/explore/flavors-pineapple\"\u003epineapple\u003c/a\u003e. Indoor or outdoor grows can expect flowers between 7 and 8 weeks.\u003c/p\u003e\n","descriptionPlain":"Tangerine is a sativa-dominant hybrid, a 4th generation daughter of\u0026nbsp;Ch9 Aroma. The fruity tangerine\u0026nbsp;aroma is accompanied with notes of mango and pineapple. Indoor or outdoor grows can expect flowers between 7 and 8 weeks.\n","aka":null,"rating":4.26,"highlightedReviews":[{"id":1417069,"username":"Bubbles1","text":"Smoked with a friend and we both loved Tangerine so much that we went back to buy more the next morning. This is a fun, euphoric, giggly and potent high with energy in the beginning and then deep happy relaxation at the end. We highly recommend this strain!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"},{"id":1615851,"username":"lmclauz","text":"Smells so god, I realy loved ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-6309","title":"Bud \u0026 Bubbly: Pairing Your New Year\u0027s Champagne With Cannabis","author":"Brett Konen","category":null,"date":"\/Date(1450735260000)\/","text":"10… 9… 8… 7… 6… 5…\nIt’s New Year’s Eve! And we’re guessing your party planning is already in full swing. Traditionally, the most important element of the evening has been the sparkling wine for a midnight toast. Bringing cannabis into the mix this year is the perfect way to celebrate everything the legalization movement has achieved in 2016, and the delectable pairing virtually guarantees a feel-good start to 2017.\nHow to go about pairing bud with your bubbly? As with any wine pairing, you’ll want to be aware of how the cannabis’s tasting notes will complement those of your sparkling wine. You’ll also want to take into account the effects of the strain you choose — steer clear of anything that might cause you to nod off before midnight!\nWhile everyone’s preferences will vary slightly, read on for four pairing ideas to end the year on a high note.\n \nIf you’re drinking cava…\n\nWine to try: Can Macià Bohigas Cava Brut Penedes ($15, K\u0026L Wine Merchants)\n \nStrain to try: Outer Space\nA style of sparkling wine that has made great gains in popularity of late, cava is Spain’s signature sparkler. This particular iteration from Can Macià reveals crisp apple and sweet pear notes upon popping the cork. For a full range of holiday fruit flavors, pair with a cherry- and berry-flavored sativa like Outer Space. Its cheery, chatty aftereffects are an excellent added bonus.\n \nIf you’re drinking sparkling rosé…\n\nWine to try: Argyle Winery 2012 Brut Rosé ($50, Argyle Winery)\n \nStrain to try: Tangerine Dream\nLooking to sip outside the box this year? Switch out the classic golden bubbles for something a little pinker: sparkling rosé. This particular bottling is a bit spendy at $50, but Argyle’s Brut Rosé has also been served at White House dinners by two different presidential administrations, so you know it’s worth the splurge. Pair it with an equally highly regarded hybrid like the appetizing, award-winning Tangerine Dream.\n \nIf you’re drinking brut…\n\nWine to try: NV Mumm Napa Brut Prestige ($18, BevMo!)\n \nStrain to try: Cactus\nOn the dry end of the sparkling wine spectrum, a brut classification indicates that your bottle of sparkling wine contains hardly any residual sugar. This lets the grapes’ naturally occurring flavor notes shine through. Pair with a relaxed yet chatty indica like Cactus; if big parties aren’t always your cup of tea, an anxiety-quelling strain like this one is a great way to go.\n \nIf you’re drinking demi-sec…\n\nWine to try: Veuve Clicquot Demi-Sec ($31, Total Wine)\n \nStrain to try: Laughing Buddha\nToward the other end of sparkling wine’s sweetness spectrum lie demi-sec Champagnes, which maintain more residual sugar than their drier brut cousins. To offset this sweetness, match a demi-sec wine with the herbal, earthy aromas and giggly, feel-good effects of a sativa like Laughing Buddha. What better way to go into the new year than with a smile on your face?\n\n\nImage Sources: Argyle Winery, Total Wine, Bevmo!, KL Wines, Michael Mina Wine Club","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/29200422/bud-bubbly-pairing-your-new-years-champagne-with-cannabis.jpg","urlslug":"/news/lifestyle/bud-bubbly-pairing-your-new-years-champagne-with-cannabis"},{"id":"contentitems-3355","title":"New Strains Alert: Orange Creamsicle, Bluniverse, ICED Grapefruit, 3D CBD, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1447430400000)\/","text":"Leafly\u0027s strain database was just updated with some new varieties. Have you had a chance to check out Snoop Dogg\u0027s newest line of cannabis strains? Read about those and more below. Also, remember to submit a review if you\u0027ve tried any of these newly added strains!\n \n 1. Orange Creamsicle\n\nTaking the best attributes of parent strains Orange Crush and Juicy Fruit, Orange Creamsicle’s tall structure, heavy colas, and pungent flavor will be sure to keep you coming back for more. This hybrid strain, as the name suggests, has a strong citrus flavor and is used to treat nausea and anxiety. Growers will be happy with this heavy producer that flowers in 9 weeks with beautiful orange-white coloring and a thick coating of resin.\n\nClick here for a full list of locations currently carrying Orange Creamsicle\n \n 2. 3D CBD\n\n3D CBD from Snoop Dogg’s branded line of cannabis strains was crafted with patients in mind. With a THC:CBD ratio of about 5:8, this earthy-flavored sativa is preferred for treating pain, inflammation, and muscle tension. Consumers susceptible to THC-induced anxiety may also appreciate the sobering, relaxing balance CBD has to offer.\n\n3D CBD is currently available at LivWell on Broadway in Denver, CO\n \n 3. Purple Bush\n\nPurple Bush, brought to you by Leafs by Snoop, is an indica-dominant hybrid that carries all the hallmark traits of a kush with a hint of berry flavor. This dense purple-hued strain tests upward of 21% THC and will have you feeling relaxed after a long day.\n\nPurple Bush is currently available at LivWell on Broadway in Denver, CO\n \n 4. Bluniverse\n\nBluniverse, also called Blue Universe, is a 50/50 hybrid strain bred by Dynasty Seeds. Mothered by Blue Magoo and fathered by Ms. Universe, Bluniverse inherits a complex flavor profile of blueberry, cherry, and vanilla spice. Its initial effects focus themselves cerebrally, with high-flying euphoria that tapers into pacifying relaxation over time. This hybrid may express one of three different phenotypes, one that takes after Blue Magoo, another taking after Ms. Universe, and a third that exhibits a balance of each parent’s characteristics.\n\nClick here for a full list of locations currently carrying Bluniverse\n \n 5. Tangerine Man\n\nFrom Leafs by Snoop comes Tangerine Man, a sativa-dominant hybrid that is perhaps the best of his new strains. With a citrus aroma and trichome-coated buds, expect a nice pick-me-up that pairs wonderfully with daytime physical activity.\n\nTangerine Man is currently available at LivWell on Broadway in Denver, CO\n \n 6. Gooberry\n\nGooberry is an indica-dominant strain descended from legendary parents Afgoo and Blueberry. This fruity, spicy strain will leave you giggling on your couch with upward of 20% THC. Consumers highly recommend this strain for night time use to treat pain and insomnia, and it\u0027s sure to leave you with the munchies. Like most indicas, Gooberry will flower in 7-9 weeks with a short, bushy structure.\n\nGooberry is currently available at Orange County Cannabis Club in Santa Ana, CA\n \n 7. ICED Grapefruit\n\nICED Grapefruit by Female Seeds is a hybrid strain that brings together genetics from ICE and Grapefruit. The resulting hybrid leans slightly to the sativa side, offering uplifting and happy effects that keep positivity flowing. The physically relaxing qualities of this strain come from its ICE parent, an indica-dominant hybrid cherished for its sedating effects. Both parents come through in the flavor as hashy notes intermix with sweet citrus and fruit.\n\nClick here for a full list of locations currently carrying ICED Grapefruit\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12002256/new-strains-alert-orange-creamsicle-blueberry-dream-iced-grapefru-f17c.png","urlslug":"/news/strains-products/new-strains-alert-orange-creamsicle-blueberry-dream-iced-grapefru-f17c"}],"reviewCount":189,"flavors":[{"name":"Citrus","score":55.98809199163712},{"name":"Orange","score":32.633396963912368},{"name":"Sweet","score":25.836287610217248},{"name":"Mango","score":22.168439232797013},{"name":"Tropical","score":21.241250795382236}],"effects":[{"name":"Happy","score":65.02817925643123},{"name":"Uplifted","score":59.655940369057355},{"name":"Relaxed","score":54.004181438051077},{"name":"Focused","score":42.591582583401504},{"name":"Energetic","score":37.487501136260335}],"symptoms":[{"name":"Stress","score":28.058812835196797},{"name":"Nausea","score":19.018725570402687},{"name":"Inflammation","score":17.832469775474955},{"name":"Muscle Spasms","score":17.702936096718478},{"name":"Seizures","score":16.925734024179619}],"conditions":[{"name":"Anxiety","score":27.411144441414415},{"name":"Arthritis","score":3.408781019907281},{"name":"PTSD","score":3.408781019907281},{"name":"Gastrointestinal Disorder","score":1.7043905099536405},{"name":"ADD/ADHD","score":1.5544041450777202}],"negatives":[{"name":"Dry Mouth","score":23.722843377874735},{"name":"Paranoid","score":20.075447686573945},{"name":"Anxious","score":19.018725570402687},{"name":"Dizzy","score":18.500590855376778},{"name":"Dry Eyes","score":3.9269157349331874}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/tangerine_100x100_ca35.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/629836/b/tangerine__primary_b360.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/tangerine_100x100_5d81.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/612529/b/tangerine__primary_e02f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/tangerine_100x100_39cf.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/583248/b/tangerine__primary_d3b2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/tangerine_100x100_88ce.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/517867/b/tangerine__primary_6de0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/tangerine_100x100_0beb.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503616/b/tangerine__primary_718c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/tangerine_100x100_be3a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/485995/b/tangerine__primary_7cae.jpg"}],"photoTotalCount":37,"popularCities":["Denver, CO","Seattle, WA","Los Angeles, CA","Portland, OR","Spokane, WA","Vancouver, BC","Las Vegas, NV","Calgary, AB","Chicago, IL","Everett, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/tangerine","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.26455026455026/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":"Hydro","floweringDays":53,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"Outdoor grows provide the greatest yields, of up to 350 grams, comparatively to indoor grows which yield\u0026nbsp;less than 100 grams.\n"}}
