{"sl_translate":"description,descriptionPlain,category","id":75,"slug":"blue-dream","name":"Blue Dream","subtitle":null,"symbol":"Bd","category":"Hybrid","description":"\u003cp\u003eBlue Dream, a sativa-dominant \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e originating in California, has achieved legendary status among West Coast strains. Crossing a \u003ca href=\"http://www.leafly.com/indica/blueberry\"\u003eBlueberry\u003c/a\u003e \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e with the \u003ca href=\"http://leafly.com/sativa\"\u003esativa\u003c/a\u003e \u003ca href=\"http://www.leafly.com/sativa/haze\"\u003eHaze\u003c/a\u003e, Blue Dream balances full-body \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003erelaxation\u003c/a\u003e with gentle cerebral invigoration. Novice and veteran consumers alike enjoy the level effects of Blue Dream, which ease you gently into a calm \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\"\u003eeuphoria\u003c/a\u003e. Some Blue Dream \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\"\u003ephenotypes\u003c/a\u003e express a more indica-like look and feel, but the sativa-leaning variety remains most prevalent.\u003c/p\u003e\n\n\u003cp\u003eWith a \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-berry\"\u003eberry\u003c/a\u003e aroma redolent of its Blueberry parent, Blue Dream delivers swift symptom relief without heavy sedative effects. This makes Blue Dream a popular daytime medicine for patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-depression\"\u003edepression\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\"\u003enausea\u003c/a\u003e, and other ailments requiring a \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabinoids-101-what-makes-cannabis-medicine\"\u003ehigh THC strain\u003c/a\u003e.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Blue Dream, a sativa-dominant hybrid originating in California, has achieved legendary status among West Coast strains. Crossing a Blueberry indica with the sativa Haze, Blue Dream balances full-body relaxation with gentle cerebral invigoration. Novice and veteran consumers alike enjoy the level effects of Blue Dream, which ease you gently into a calm euphoria. Some Blue Dream phenotypes express a more indica-like look and feel, but the sativa-leaning variety remains most prevalent.\n\nWith a sweet berry aroma redolent of its Blueberry parent, Blue Dream delivers swift symptom relief without heavy sedative effects. This makes Blue Dream a popular daytime medicine for patients treating pain, depression, nausea, and other ailments requiring a high THC strain.\u0026nbsp;\n","aka":null,"rating":4.4,"highlightedReviews":[{"id":1418924,"username":"CannabisKook","text":"Friends, stoners, red-eyed countrymen, lend me your ears; for I bring unto thee a tale of the Blue Dream...\n\nT’was a calm April night, 2014 it was, and I had eagerly purchased an eighth of some pungent Blue Dream. It’s abundance of sugary trichomes, paired with the thick density of the bud was enough to bring a tear to your eye. I enthusiastically ground up the cheeba, packed a generous bowl and went to town. Eight minutes and a bowl later, I was beginning to assume that my herb wasn’t all that strong…but then it hit me like a 150-ton locomotive of euphoria.\n\n“Whoooa” was the only thing that I could say, as I looked at everything around the living room. Everything looked as if it were lagging behind by a few frames, and this cerebral adventure lasted for the first few minutes…but just when I thought that Blue Dream had shown me everything there was to experience about her, her sativa effects began to kick in.\n\nAll of a sudden, I felt as if I was briskly cruising on a warm cloud, which was followed by an amazing burst of energy. Folks let me tell you, if you’d ever like to find out how an eagle feels when it spreads its majestic wings and takes to the air at 80 mph., this strain is a kickass tool to take you there. Finally, when all of your euphoric energy has been expended, Blue Dream ends her experience with a mellow cruise induced by her indica side.\n\nCall in at Jimmy John’s and order 12 sandwiches, fire up Netflix, and take it easy on the couch until you slowly begin to melt into the furniture, because you\u0027re going to start to drift off into your happy place; and as soon as you reach that critical point of relaxation, you’re going to sleep like a sloth on twelve doses of Ambien.\n\nFolks, I guess the moral of the story here is that Blue Dream is an outstanding and pleasurable strain that is fun for cannabis enthusiasts anywhere on the experience spectrum; from the novice user who is looking to have an easy-going yet memorable experience, to the seasoned smoker who owns a laser pointer and a cat, and anybody in between; but my review alone can’t depict the exquisite effects that Blue Dream has to offer. Roll up a liberal amount of Blue Dream, spark it up, and let her take you on a spectacular trip; you’ll be thankful you did when your mind is blissfully floating through the heavens.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1643001,"username":"Quazymoe","text":"Love blue dream this is a heavy hitter but it helps with pain and so many other things I smoked this strain for a whole month  not bad at all.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/CRaLYHrvs2-5L0zceXXMcPIow_k=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fOTFELGKjRty4Mit0jtkW_B4960026-F6C3-4115-9EBE-11C5A8A04FB0.jpeg"}],"relatedStrains":[],"articles":[{"id":"contentitems-52994","title":"5 Strains to Help You Reach Your Goals in the New Year","author":"Rae Lland","category":null,"date":"\/Date(1514495213000)\/","text":"New Year’s resolutions are an excellent way to jump-start your goals and keep you focused for the year ahead. But they can also be difficult to maintain as time moves forward—motivation wanes and life gets in the way. We get it, so to help you accomplish your goals, we gathered a few cannabis strains that will keep you on the right track (long past January).\n\nWhether you want to get fit, obtain a healthy weight, increase your productivity, get more sleep, or lower your stress levels, there’s a strain that can help you stay on top of these resolutions and enhance your overall well-being. Head to your favorite dispensary to load up on these picks before the clock strikes midnight on December 31st.\nWhat strains do you use to stay motivated? Tell us about them in the comments.\nUp Your Fitness Game With Green Crack\nIf your goals include running a 10K, bench pressing your partner, or simply increasing your confidence, there are plenty of reasons why working out is such a popular New Year’s resolution. It can be hard to stay motivated when it comes to fitness, so choosing a strain that offers an abundance of energy is a great way to boost morale and steer you away from winter hibernation.\nStrain Recommendation: Green Crack is the perfect strain for spiking your energy, holding your focus, and warding off fatigue. With a fruity, sweet flavor that pairs perfectly with a healthy breakfast, this bright sativa will kick you into high gear and stick with you on your morning run.\n\nEmbrace Self Care and Get More Sleep With Northern Lights\nIt’s a busy world, and too many of us get so wrapped up in our responsibilities that we forget about one of the most important things we can do for our health: sleep. Lack of sleep increases your risk for a variety of health issues, while quality sleep can improve focus, concentration, memory, and physical well-being. The first step to a great day is a good night’s sleep; to ensure you are performing at your best, avoid strains that will keep you wired into the late evening and opt for ones that promote a healing slumber.\nStrain Recommendation: Northern Lights is the optimal strain for bedtime bliss. This pure indica melts into the body and calms the mind. Make a cup of tea, light up a joint, and sink into pure alleviation.\nStay Focused and Be Productive With Durban Poison\nIf you’re like me, you’re constantly thinking about how to be a more productive person, but maintaining focus doesn’t always come easy. The New Year is the perfect time to reassess your productivity goals so you can be your best self in work, school, or any other important obligations. If this is your goal, reach for a strain that complements and enhances a sharp mind.\nStrain Recommendation: Durban Poison is the cure for de-motivation. Known for its energizing properties and aid to creativity, this sativa will uplift your mood and give you the push you need to become a productivity machine.\n\nObtain a Healthy Weight With Remedy and Banana OG\nOne of the top goals on everyone’s New Year’s resolutions lists is to lose weight. But for some, it can be equally important to maintain or put on a few pounds. Whatever your goal, reaching a healthy weight can seem a daunting task that is especially difficult to sustain. With a little help from cannabis, you may be able to cross this resolution off your list sooner than you think.\nStrain Recommendation: Remedy is a great strain for avoiding the munchies. A high-CBD indica, this strain has trace amounts of THC, but packs a powerful punch against pain, anxiety, and superfluous hunger. Its sweet, floral, and citrus notes will leave you free to indulge in a tasty treat—without all the calories.\nBanana OG steps up to the plate for those who need a little help stimulating their appetite. If you have a hard time keeping weight on or maintaining your weight without the scale dropping, Banana OG will open you up to the munchies and keep you feeling comfortable in indulging. This strong hybrid suits its name with powerful banana flavors and a 25% THC content that will get your stomach rumbling in no time.\n\nLower Your Stress Levels With Blue Dream\nWhen looking back over the past year, with all of its trials and tribulations, you may feel that all you did was stress. You’re not alone, and that’s why the promise of a new year can bring renewed peace and tranquility for so many. If your New Year’s resolution is to stress less and live more, then you’ll want a cannabis strain that can take the edge off.\nStrain Recommendation: Blue Dream is a legendary strain for a reason, and when it comes to conquering stress, few do it as well as a bowl packed with this long-time favorite. This buzzy hybrid works wonders for embracing full-body relaxation without a sedating mental fog—replacing stress with euphoric calm.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/28130345/strains-new-year-resolution.jpg","urlslug":"/news/strains-products/5-strains-goals-in-the-new-year"},{"id":"contentitems-29102","title":"Tips for Growing Blue Dream Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1496272612000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nhttps://www.youtube.com/watch?v=l2_ddVIER-0\u0026feature=youtu.be\nStrain Overview: Blue Dream is a hybrid cross between Blueberry and Haze. It is deemed the most popular cannabis strain based on reviews and widespread availability. Blue Dream’s popularity stems primarily from its sweet berry fragrance and even-keel effects that entice both connoisseurs and first-time consumers.\nGrow Techniques: Sativa-dominant genetics ensure that Blue Dream will grow tall. With proper pruning and training, this plant will grow beautifully and easily. Give Blue Dream plenty of trellis support as the sativa structure has a hard time supporting heavier indica-like buds. Blue Dream is known for its ability to grow high yielding plants in quality soils.\nFlowering Time: 9 to 10 weeks\nYield: High\nGrow Difficulty: A vigorous plant that allows for a large margin of error, Blue Dream is an easy strain to cultivate.\nClimate: Thrives in most climates and handles cold nightly temperatures well. Blue Dream’s ideal temperature ranges between 65-85 degrees Fahrenheit.\nIndoor/Outdoor: Can be grown successfully both indoors and out. Blue Dream is best known for its successful growth outdoors in California, but transitions easily into indoor environments. Consider topping and training to prevent Blue Dream from outgrowing your indoor space. \nFeeding: Heavy feeding. Blue Dream can take high levels of nitrogen without burning.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/05/28140753/blue-dream-strain-article.jpg","urlslug":"/news/growing/how-to-grow-blue-dream-marijuana"}],"reviewCount":11219,"flavors":[{"name":"Blueberry","score":22.20889391508446},{"name":"Berry","score":17.103495004380054},{"name":"Sweet","score":15.999034630933764},{"name":"Earthy","score":8.5967830402845617},{"name":"Flowery","score":7.5432332908626263}],"effects":[{"name":"Happy","score":62.028281517797581},{"name":"Relaxed","score":57.258639208480894},{"name":"Euphoric","score":52.073361729687882},{"name":"Uplifted","score":47.699967284889105},{"name":"Creative","score":36.33877073677602}],"symptoms":[{"name":"Stress","score":31.232831769753655},{"name":"Depression","score":27.432621290207898},{"name":"Pain","score":21.082064041096523},{"name":"Lack of Appetite","score":11.972122818702916},{"name":"Headaches","score":11.565804841060896}],"conditions":[{"name":"Anxiety","score":24.319520324864879},{"name":"PTSD","score":8.765237875425413},{"name":"ADD/ADHD","score":8.6255004553116414},{"name":"Migraines","score":8.6113641161432035},{"name":"Bipolar Disorder","score":6.4651075323465221}],"negatives":[{"name":"Dry Mouth","score":26.852555887389702},{"name":"Dry Eyes","score":14.065964068888302},{"name":"Anxious","score":5.6407389189402668},{"name":"Dizzy","score":5.4660018511236892},{"name":"Paranoid","score":4.5156812572893124}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/blue-dream/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/blue-dream/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_189e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003578/b/blue-dream__primary_d601.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_19a3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003421/b/blue-dream__primary_1aa9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_2c9f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003362/b/blue-dream__primary_b1b3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_1323.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003348/b/blue-dream__primary_6f39.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_4565.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003148/b/blue-dream__primary_bf02.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_5968.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002060/b/blue-dream__primary_bc12.jpg"}],"photoTotalCount":2508,"popularCities":["Portland, OR","Denver, CO","Los Angeles, CA","Toronto, ON","Seattle, WA","Eugene, OR","Calgary, AB","Montréal, QC","Vancouver, BC","Phoenix, AZ"],"permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.39807469471432/240","testGraph":"https://leafly.s3.amazonaws.com/strains/testing/9HJf5cEESdCdXt9h5PF0_blue-dream.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"},{"name":"Haze","subtitle":null,"slug":"haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/haze","symbol":"H","applink":"leafly://strain/haze"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":67,"outdoorFinish":"Early - Mid October","height":"Tall","averageYield":"High","environment":null,"growNotes":"\n\tWell suited for sea of green (SOG)\n\tYields typically reach up to 430g/m\u0026sup2;\n\tCan exhibit different indica and sativa\u0026nbsp;phenotypes\n\tKnown to be susceptible to powdery mildew and spider mites\n\tCan stretch when flowering\n\n"}}
{"sl_translate":"description,descriptionPlain,category","id":75,"slug":"blue-dream","name":"Blue Dream","subtitle":null,"symbol":"Bd","category":"Hybrid","description":"\u003cp\u003eBlue Dream, a sativa-dominant \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e originating in California, has achieved legendary status among West Coast strains. Crossing a \u003ca href=\"http://www.leafly.com/indica/blueberry\"\u003eBlueberry\u003c/a\u003e \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e with the \u003ca href=\"http://leafly.com/sativa\"\u003esativa\u003c/a\u003e \u003ca href=\"http://www.leafly.com/sativa/haze\"\u003eHaze\u003c/a\u003e, Blue Dream balances full-body \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003erelaxation\u003c/a\u003e with gentle cerebral invigoration. Novice and veteran consumers alike enjoy the level effects of Blue Dream, which ease you gently into a calm \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\"\u003eeuphoria\u003c/a\u003e. Some Blue Dream \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\"\u003ephenotypes\u003c/a\u003e express a more indica-like look and feel, but the sativa-leaning variety remains most prevalent.\u003c/p\u003e\n\n\u003cp\u003eWith a \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-berry\"\u003eberry\u003c/a\u003e aroma redolent of its Blueberry parent, Blue Dream delivers swift symptom relief without heavy sedative effects. This makes Blue Dream a popular daytime medicine for patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-depression\"\u003edepression\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\"\u003enausea\u003c/a\u003e, and other ailments requiring a \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabinoids-101-what-makes-cannabis-medicine\"\u003ehigh THC strain\u003c/a\u003e.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Blue Dream, a sativa-dominant hybrid originating in California, has achieved legendary status among West Coast strains. Crossing a Blueberry indica with the sativa Haze, Blue Dream balances full-body relaxation with gentle cerebral invigoration. Novice and veteran consumers alike enjoy the level effects of Blue Dream, which ease you gently into a calm euphoria. Some Blue Dream phenotypes express a more indica-like look and feel, but the sativa-leaning variety remains most prevalent.\n\nWith a sweet berry aroma redolent of its Blueberry parent, Blue Dream delivers swift symptom relief without heavy sedative effects. This makes Blue Dream a popular daytime medicine for patients treating pain, depression, nausea, and other ailments requiring a high THC strain.\u0026nbsp;\n","aka":null,"rating":4.4,"highlightedReviews":[{"id":1418924,"username":"CannabisKook","text":"Friends, stoners, red-eyed countrymen, lend me your ears; for I bring unto thee a tale of the Blue Dream...\n\nT’was a calm April night, 2014 it was, and I had eagerly purchased an eighth of some pungent Blue Dream. It’s abundance of sugary trichomes, paired with the thick density of the bud was enough to bring a tear to your eye. I enthusiastically ground up the cheeba, packed a generous bowl and went to town. Eight minutes and a bowl later, I was beginning to assume that my herb wasn’t all that strong…but then it hit me like a 150-ton locomotive of euphoria.\n\n“Whoooa” was the only thing that I could say, as I looked at everything around the living room. Everything looked as if it were lagging behind by a few frames, and this cerebral adventure lasted for the first few minutes…but just when I thought that Blue Dream had shown me everything there was to experience about her, her sativa effects began to kick in.\n\nAll of a sudden, I felt as if I was briskly cruising on a warm cloud, which was followed by an amazing burst of energy. Folks let me tell you, if you’d ever like to find out how an eagle feels when it spreads its majestic wings and takes to the air at 80 mph., this strain is a kickass tool to take you there. Finally, when all of your euphoric energy has been expended, Blue Dream ends her experience with a mellow cruise induced by her indica side.\n\nCall in at Jimmy John’s and order 12 sandwiches, fire up Netflix, and take it easy on the couch until you slowly begin to melt into the furniture, because you\u0027re going to start to drift off into your happy place; and as soon as you reach that critical point of relaxation, you’re going to sleep like a sloth on twelve doses of Ambien.\n\nFolks, I guess the moral of the story here is that Blue Dream is an outstanding and pleasurable strain that is fun for cannabis enthusiasts anywhere on the experience spectrum; from the novice user who is looking to have an easy-going yet memorable experience, to the seasoned smoker who owns a laser pointer and a cat, and anybody in between; but my review alone can’t depict the exquisite effects that Blue Dream has to offer. Roll up a liberal amount of Blue Dream, spark it up, and let her take you on a spectacular trip; you’ll be thankful you did when your mind is blissfully floating through the heavens.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1643001,"username":"Quazymoe","text":"Love blue dream this is a heavy hitter but it helps with pain and so many other things I smoked this strain for a whole month  not bad at all.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/CRaLYHrvs2-5L0zceXXMcPIow_k=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fOTFELGKjRty4Mit0jtkW_B4960026-F6C3-4115-9EBE-11C5A8A04FB0.jpeg"}],"relatedStrains":[],"articles":[{"id":"contentitems-52994","title":"5 Strains to Help You Reach Your Goals in the New Year","author":"Rae Lland","category":null,"date":"\/Date(1514495213000)\/","text":"New Year’s resolutions are an excellent way to jump-start your goals and keep you focused for the year ahead. But they can also be difficult to maintain as time moves forward—motivation wanes and life gets in the way. We get it, so to help you accomplish your goals, we gathered a few cannabis strains that will keep you on the right track (long past January).\n\nWhether you want to get fit, obtain a healthy weight, increase your productivity, get more sleep, or lower your stress levels, there’s a strain that can help you stay on top of these resolutions and enhance your overall well-being. Head to your favorite dispensary to load up on these picks before the clock strikes midnight on December 31st.\nWhat strains do you use to stay motivated? Tell us about them in the comments.\nUp Your Fitness Game With Green Crack\nIf your goals include running a 10K, bench pressing your partner, or simply increasing your confidence, there are plenty of reasons why working out is such a popular New Year’s resolution. It can be hard to stay motivated when it comes to fitness, so choosing a strain that offers an abundance of energy is a great way to boost morale and steer you away from winter hibernation.\nStrain Recommendation: Green Crack is the perfect strain for spiking your energy, holding your focus, and warding off fatigue. With a fruity, sweet flavor that pairs perfectly with a healthy breakfast, this bright sativa will kick you into high gear and stick with you on your morning run.\n\nEmbrace Self Care and Get More Sleep With Northern Lights\nIt’s a busy world, and too many of us get so wrapped up in our responsibilities that we forget about one of the most important things we can do for our health: sleep. Lack of sleep increases your risk for a variety of health issues, while quality sleep can improve focus, concentration, memory, and physical well-being. The first step to a great day is a good night’s sleep; to ensure you are performing at your best, avoid strains that will keep you wired into the late evening and opt for ones that promote a healing slumber.\nStrain Recommendation: Northern Lights is the optimal strain for bedtime bliss. This pure indica melts into the body and calms the mind. Make a cup of tea, light up a joint, and sink into pure alleviation.\nStay Focused and Be Productive With Durban Poison\nIf you’re like me, you’re constantly thinking about how to be a more productive person, but maintaining focus doesn’t always come easy. The New Year is the perfect time to reassess your productivity goals so you can be your best self in work, school, or any other important obligations. If this is your goal, reach for a strain that complements and enhances a sharp mind.\nStrain Recommendation: Durban Poison is the cure for de-motivation. Known for its energizing properties and aid to creativity, this sativa will uplift your mood and give you the push you need to become a productivity machine.\n\nObtain a Healthy Weight With Remedy and Banana OG\nOne of the top goals on everyone’s New Year’s resolutions lists is to lose weight. But for some, it can be equally important to maintain or put on a few pounds. Whatever your goal, reaching a healthy weight can seem a daunting task that is especially difficult to sustain. With a little help from cannabis, you may be able to cross this resolution off your list sooner than you think.\nStrain Recommendation: Remedy is a great strain for avoiding the munchies. A high-CBD indica, this strain has trace amounts of THC, but packs a powerful punch against pain, anxiety, and superfluous hunger. Its sweet, floral, and citrus notes will leave you free to indulge in a tasty treat—without all the calories.\nBanana OG steps up to the plate for those who need a little help stimulating their appetite. If you have a hard time keeping weight on or maintaining your weight without the scale dropping, Banana OG will open you up to the munchies and keep you feeling comfortable in indulging. This strong hybrid suits its name with powerful banana flavors and a 25% THC content that will get your stomach rumbling in no time.\n\nLower Your Stress Levels With Blue Dream\nWhen looking back over the past year, with all of its trials and tribulations, you may feel that all you did was stress. You’re not alone, and that’s why the promise of a new year can bring renewed peace and tranquility for so many. If your New Year’s resolution is to stress less and live more, then you’ll want a cannabis strain that can take the edge off.\nStrain Recommendation: Blue Dream is a legendary strain for a reason, and when it comes to conquering stress, few do it as well as a bowl packed with this long-time favorite. This buzzy hybrid works wonders for embracing full-body relaxation without a sedating mental fog—replacing stress with euphoric calm.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/28130345/strains-new-year-resolution.jpg","urlslug":"/news/strains-products/5-strains-goals-in-the-new-year"},{"id":"contentitems-29102","title":"Tips for Growing Blue Dream Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1496272612000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nhttps://www.youtube.com/watch?v=l2_ddVIER-0\u0026feature=youtu.be\nStrain Overview: Blue Dream is a hybrid cross between Blueberry and Haze. It is deemed the most popular cannabis strain based on reviews and widespread availability. Blue Dream’s popularity stems primarily from its sweet berry fragrance and even-keel effects that entice both connoisseurs and first-time consumers.\nGrow Techniques: Sativa-dominant genetics ensure that Blue Dream will grow tall. With proper pruning and training, this plant will grow beautifully and easily. Give Blue Dream plenty of trellis support as the sativa structure has a hard time supporting heavier indica-like buds. Blue Dream is known for its ability to grow high yielding plants in quality soils.\nFlowering Time: 9 to 10 weeks\nYield: High\nGrow Difficulty: A vigorous plant that allows for a large margin of error, Blue Dream is an easy strain to cultivate.\nClimate: Thrives in most climates and handles cold nightly temperatures well. Blue Dream’s ideal temperature ranges between 65-85 degrees Fahrenheit.\nIndoor/Outdoor: Can be grown successfully both indoors and out. Blue Dream is best known for its successful growth outdoors in California, but transitions easily into indoor environments. Consider topping and training to prevent Blue Dream from outgrowing your indoor space. \nFeeding: Heavy feeding. Blue Dream can take high levels of nitrogen without burning.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/05/28140753/blue-dream-strain-article.jpg","urlslug":"/news/growing/how-to-grow-blue-dream-marijuana"}],"reviewCount":11219,"flavors":[{"name":"Blueberry","score":22.20889391508446},{"name":"Berry","score":17.103495004380054},{"name":"Sweet","score":15.999034630933764},{"name":"Earthy","score":8.5967830402845617},{"name":"Flowery","score":7.5432332908626263}],"effects":[{"name":"Happy","score":62.028281517797581},{"name":"Relaxed","score":57.258639208480894},{"name":"Euphoric","score":52.073361729687882},{"name":"Uplifted","score":47.699967284889105},{"name":"Creative","score":36.33877073677602}],"symptoms":[{"name":"Stress","score":31.232831769753655},{"name":"Depression","score":27.432621290207898},{"name":"Pain","score":21.082064041096523},{"name":"Lack of Appetite","score":11.972122818702916},{"name":"Headaches","score":11.565804841060896}],"conditions":[{"name":"Anxiety","score":24.319520324864879},{"name":"PTSD","score":8.765237875425413},{"name":"ADD/ADHD","score":8.6255004553116414},{"name":"Migraines","score":8.6113641161432035},{"name":"Bipolar Disorder","score":6.4651075323465221}],"negatives":[{"name":"Dry Mouth","score":26.852555887389702},{"name":"Dry Eyes","score":14.065964068888302},{"name":"Anxious","score":5.6407389189402668},{"name":"Dizzy","score":5.4660018511236892},{"name":"Paranoid","score":4.5156812572893124}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/blue-dream/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/blue-dream/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_189e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003578/b/blue-dream__primary_d601.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_19a3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003421/b/blue-dream__primary_1aa9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_2c9f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003362/b/blue-dream__primary_b1b3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_1323.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003348/b/blue-dream__primary_6f39.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_4565.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003148/b/blue-dream__primary_bf02.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_5968.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002060/b/blue-dream__primary_bc12.jpg"}],"photoTotalCount":2508,"popularCities":["Portland, OR","Denver, CO","Los Angeles, CA","Toronto, ON","Seattle, WA","Eugene, OR","Calgary, AB","Montréal, QC","Vancouver, BC","Phoenix, AZ"],"permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.39807469471432/240","testGraph":"https://leafly.s3.amazonaws.com/strains/testing/9HJf5cEESdCdXt9h5PF0_blue-dream.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"},{"name":"Haze","subtitle":null,"slug":"haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/haze","symbol":"H","applink":"leafly://strain/haze"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":67,"outdoorFinish":"Early - Mid October","height":"Tall","averageYield":"High","environment":null,"growNotes":"\n\tWell suited for sea of green (SOG)\n\tYields typically reach up to 430g/m\u0026sup2;\n\tCan exhibit different indica and sativa\u0026nbsp;phenotypes\n\tKnown to be susceptible to powdery mildew and spider mites\n\tCan stretch when flowering\n\n"}}
{"sl_translate":"description,descriptionPlain,category","id":75,"slug":"blue-dream","name":"Blue Dream","subtitle":null,"symbol":"Bd","category":"Hybrid","description":"\u003cp\u003eBlue Dream, a sativa-dominant \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e originating in California, has achieved legendary status among West Coast strains. Crossing a \u003ca href=\"http://www.leafly.com/indica/blueberry\"\u003eBlueberry\u003c/a\u003e \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e with the \u003ca href=\"http://leafly.com/sativa\"\u003esativa\u003c/a\u003e \u003ca href=\"http://www.leafly.com/sativa/haze\"\u003eHaze\u003c/a\u003e, Blue Dream balances full-body \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003erelaxation\u003c/a\u003e with gentle cerebral invigoration. Novice and veteran consumers alike enjoy the level effects of Blue Dream, which ease you gently into a calm \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\"\u003eeuphoria\u003c/a\u003e. Some Blue Dream \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\"\u003ephenotypes\u003c/a\u003e express a more indica-like look and feel, but the sativa-leaning variety remains most prevalent.\u003c/p\u003e\n\n\u003cp\u003eWith a \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-berry\"\u003eberry\u003c/a\u003e aroma redolent of its Blueberry parent, Blue Dream delivers swift symptom relief without heavy sedative effects. This makes Blue Dream a popular daytime medicine for patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-depression\"\u003edepression\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\"\u003enausea\u003c/a\u003e, and other ailments requiring a \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabinoids-101-what-makes-cannabis-medicine\"\u003ehigh THC strain\u003c/a\u003e.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Blue Dream, a sativa-dominant hybrid originating in California, has achieved legendary status among West Coast strains. Crossing a Blueberry indica with the sativa Haze, Blue Dream balances full-body relaxation with gentle cerebral invigoration. Novice and veteran consumers alike enjoy the level effects of Blue Dream, which ease you gently into a calm euphoria. Some Blue Dream phenotypes express a more indica-like look and feel, but the sativa-leaning variety remains most prevalent.\n\nWith a sweet berry aroma redolent of its Blueberry parent, Blue Dream delivers swift symptom relief without heavy sedative effects. This makes Blue Dream a popular daytime medicine for patients treating pain, depression, nausea, and other ailments requiring a high THC strain.\u0026nbsp;\n","aka":null,"rating":4.4,"highlightedReviews":[{"id":1418924,"username":"CannabisKook","text":"Friends, stoners, red-eyed countrymen, lend me your ears; for I bring unto thee a tale of the Blue Dream...\n\nT’was a calm April night, 2014 it was, and I had eagerly purchased an eighth of some pungent Blue Dream. It’s abundance of sugary trichomes, paired with the thick density of the bud was enough to bring a tear to your eye. I enthusiastically ground up the cheeba, packed a generous bowl and went to town. Eight minutes and a bowl later, I was beginning to assume that my herb wasn’t all that strong…but then it hit me like a 150-ton locomotive of euphoria.\n\n“Whoooa” was the only thing that I could say, as I looked at everything around the living room. Everything looked as if it were lagging behind by a few frames, and this cerebral adventure lasted for the first few minutes…but just when I thought that Blue Dream had shown me everything there was to experience about her, her sativa effects began to kick in.\n\nAll of a sudden, I felt as if I was briskly cruising on a warm cloud, which was followed by an amazing burst of energy. Folks let me tell you, if you’d ever like to find out how an eagle feels when it spreads its majestic wings and takes to the air at 80 mph., this strain is a kickass tool to take you there. Finally, when all of your euphoric energy has been expended, Blue Dream ends her experience with a mellow cruise induced by her indica side.\n\nCall in at Jimmy John’s and order 12 sandwiches, fire up Netflix, and take it easy on the couch until you slowly begin to melt into the furniture, because you\u0027re going to start to drift off into your happy place; and as soon as you reach that critical point of relaxation, you’re going to sleep like a sloth on twelve doses of Ambien.\n\nFolks, I guess the moral of the story here is that Blue Dream is an outstanding and pleasurable strain that is fun for cannabis enthusiasts anywhere on the experience spectrum; from the novice user who is looking to have an easy-going yet memorable experience, to the seasoned smoker who owns a laser pointer and a cat, and anybody in between; but my review alone can’t depict the exquisite effects that Blue Dream has to offer. Roll up a liberal amount of Blue Dream, spark it up, and let her take you on a spectacular trip; you’ll be thankful you did when your mind is blissfully floating through the heavens.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1643001,"username":"Quazymoe","text":"Love blue dream this is a heavy hitter but it helps with pain and so many other things I smoked this strain for a whole month  not bad at all.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/CRaLYHrvs2-5L0zceXXMcPIow_k=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fOTFELGKjRty4Mit0jtkW_B4960026-F6C3-4115-9EBE-11C5A8A04FB0.jpeg"}],"relatedStrains":[],"articles":[{"id":"contentitems-52994","title":"5 Strains to Help You Reach Your Goals in the New Year","author":"Rae Lland","category":null,"date":"\/Date(1514495213000)\/","text":"New Year’s resolutions are an excellent way to jump-start your goals and keep you focused for the year ahead. But they can also be difficult to maintain as time moves forward—motivation wanes and life gets in the way. We get it, so to help you accomplish your goals, we gathered a few cannabis strains that will keep you on the right track (long past January).\n\nWhether you want to get fit, obtain a healthy weight, increase your productivity, get more sleep, or lower your stress levels, there’s a strain that can help you stay on top of these resolutions and enhance your overall well-being. Head to your favorite dispensary to load up on these picks before the clock strikes midnight on December 31st.\nWhat strains do you use to stay motivated? Tell us about them in the comments.\nUp Your Fitness Game With Green Crack\nIf your goals include running a 10K, bench pressing your partner, or simply increasing your confidence, there are plenty of reasons why working out is such a popular New Year’s resolution. It can be hard to stay motivated when it comes to fitness, so choosing a strain that offers an abundance of energy is a great way to boost morale and steer you away from winter hibernation.\nStrain Recommendation: Green Crack is the perfect strain for spiking your energy, holding your focus, and warding off fatigue. With a fruity, sweet flavor that pairs perfectly with a healthy breakfast, this bright sativa will kick you into high gear and stick with you on your morning run.\n\nEmbrace Self Care and Get More Sleep With Northern Lights\nIt’s a busy world, and too many of us get so wrapped up in our responsibilities that we forget about one of the most important things we can do for our health: sleep. Lack of sleep increases your risk for a variety of health issues, while quality sleep can improve focus, concentration, memory, and physical well-being. The first step to a great day is a good night’s sleep; to ensure you are performing at your best, avoid strains that will keep you wired into the late evening and opt for ones that promote a healing slumber.\nStrain Recommendation: Northern Lights is the optimal strain for bedtime bliss. This pure indica melts into the body and calms the mind. Make a cup of tea, light up a joint, and sink into pure alleviation.\nStay Focused and Be Productive With Durban Poison\nIf you’re like me, you’re constantly thinking about how to be a more productive person, but maintaining focus doesn’t always come easy. The New Year is the perfect time to reassess your productivity goals so you can be your best self in work, school, or any other important obligations. If this is your goal, reach for a strain that complements and enhances a sharp mind.\nStrain Recommendation: Durban Poison is the cure for de-motivation. Known for its energizing properties and aid to creativity, this sativa will uplift your mood and give you the push you need to become a productivity machine.\n\nObtain a Healthy Weight With Remedy and Banana OG\nOne of the top goals on everyone’s New Year’s resolutions lists is to lose weight. But for some, it can be equally important to maintain or put on a few pounds. Whatever your goal, reaching a healthy weight can seem a daunting task that is especially difficult to sustain. With a little help from cannabis, you may be able to cross this resolution off your list sooner than you think.\nStrain Recommendation: Remedy is a great strain for avoiding the munchies. A high-CBD indica, this strain has trace amounts of THC, but packs a powerful punch against pain, anxiety, and superfluous hunger. Its sweet, floral, and citrus notes will leave you free to indulge in a tasty treat—without all the calories.\nBanana OG steps up to the plate for those who need a little help stimulating their appetite. If you have a hard time keeping weight on or maintaining your weight without the scale dropping, Banana OG will open you up to the munchies and keep you feeling comfortable in indulging. This strong hybrid suits its name with powerful banana flavors and a 25% THC content that will get your stomach rumbling in no time.\n\nLower Your Stress Levels With Blue Dream\nWhen looking back over the past year, with all of its trials and tribulations, you may feel that all you did was stress. You’re not alone, and that’s why the promise of a new year can bring renewed peace and tranquility for so many. If your New Year’s resolution is to stress less and live more, then you’ll want a cannabis strain that can take the edge off.\nStrain Recommendation: Blue Dream is a legendary strain for a reason, and when it comes to conquering stress, few do it as well as a bowl packed with this long-time favorite. This buzzy hybrid works wonders for embracing full-body relaxation without a sedating mental fog—replacing stress with euphoric calm.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/28130345/strains-new-year-resolution.jpg","urlslug":"/news/strains-products/5-strains-goals-in-the-new-year"},{"id":"contentitems-29102","title":"Tips for Growing Blue Dream Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1496272612000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nhttps://www.youtube.com/watch?v=l2_ddVIER-0\u0026feature=youtu.be\nStrain Overview: Blue Dream is a hybrid cross between Blueberry and Haze. It is deemed the most popular cannabis strain based on reviews and widespread availability. Blue Dream’s popularity stems primarily from its sweet berry fragrance and even-keel effects that entice both connoisseurs and first-time consumers.\nGrow Techniques: Sativa-dominant genetics ensure that Blue Dream will grow tall. With proper pruning and training, this plant will grow beautifully and easily. Give Blue Dream plenty of trellis support as the sativa structure has a hard time supporting heavier indica-like buds. Blue Dream is known for its ability to grow high yielding plants in quality soils.\nFlowering Time: 9 to 10 weeks\nYield: High\nGrow Difficulty: A vigorous plant that allows for a large margin of error, Blue Dream is an easy strain to cultivate.\nClimate: Thrives in most climates and handles cold nightly temperatures well. Blue Dream’s ideal temperature ranges between 65-85 degrees Fahrenheit.\nIndoor/Outdoor: Can be grown successfully both indoors and out. Blue Dream is best known for its successful growth outdoors in California, but transitions easily into indoor environments. Consider topping and training to prevent Blue Dream from outgrowing your indoor space. \nFeeding: Heavy feeding. Blue Dream can take high levels of nitrogen without burning.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/05/28140753/blue-dream-strain-article.jpg","urlslug":"/news/growing/how-to-grow-blue-dream-marijuana"}],"reviewCount":11219,"flavors":[{"name":"Blueberry","score":22.20889391508446},{"name":"Berry","score":17.103495004380054},{"name":"Sweet","score":15.999034630933764},{"name":"Earthy","score":8.5967830402845617},{"name":"Flowery","score":7.5432332908626263}],"effects":[{"name":"Happy","score":62.028281517797581},{"name":"Relaxed","score":57.258639208480894},{"name":"Euphoric","score":52.073361729687882},{"name":"Uplifted","score":47.699967284889105},{"name":"Creative","score":36.33877073677602}],"symptoms":[{"name":"Stress","score":31.232831769753655},{"name":"Depression","score":27.432621290207898},{"name":"Pain","score":21.082064041096523},{"name":"Lack of Appetite","score":11.972122818702916},{"name":"Headaches","score":11.565804841060896}],"conditions":[{"name":"Anxiety","score":24.319520324864879},{"name":"PTSD","score":8.765237875425413},{"name":"ADD/ADHD","score":8.6255004553116414},{"name":"Migraines","score":8.6113641161432035},{"name":"Bipolar Disorder","score":6.4651075323465221}],"negatives":[{"name":"Dry Mouth","score":26.852555887389702},{"name":"Dry Eyes","score":14.065964068888302},{"name":"Anxious","score":5.6407389189402668},{"name":"Dizzy","score":5.4660018511236892},{"name":"Paranoid","score":4.5156812572893124}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/blue-dream/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/blue-dream/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_189e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003578/b/blue-dream__primary_d601.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_19a3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003421/b/blue-dream__primary_1aa9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_2c9f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003362/b/blue-dream__primary_b1b3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_1323.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003348/b/blue-dream__primary_6f39.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_4565.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003148/b/blue-dream__primary_bf02.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dream_100x100_5968.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002060/b/blue-dream__primary_bc12.jpg"}],"photoTotalCount":2508,"popularCities":["Portland, OR","Denver, CO","Los Angeles, CA","Toronto, ON","Seattle, WA","Eugene, OR","Calgary, AB","Montréal, QC","Vancouver, BC","Phoenix, AZ"],"permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.39807469471432/240","testGraph":"https://leafly.s3.amazonaws.com/strains/testing/9HJf5cEESdCdXt9h5PF0_blue-dream.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"},{"name":"Haze","subtitle":null,"slug":"haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/haze","symbol":"H","applink":"leafly://strain/haze"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":67,"outdoorFinish":"Early - Mid October","height":"Tall","averageYield":"High","environment":null,"growNotes":"\n\tWell suited for sea of green (SOG)\n\tYields typically reach up to 430g/m\u0026sup2;\n\tCan exhibit different indica and sativa\u0026nbsp;phenotypes\n\tKnown to be susceptible to powdery mildew and spider mites\n\tCan stretch when flowering\n\n"}}
