{"sl_translate":"description,descriptionPlain,category","id":152272,"slug":"dutch-queen","name":"Dutch Queen","subtitle":null,"symbol":"Dqu","category":"Hybrid","description":"\u003cp\u003eDutch Queen is a \u003ca href=\"http://www.leafly.com/explore/category-hybrid\"\u003ehybrid\u003c/a\u003e strain bred by Buddy Boy Farms in Washington. A cross between \u003ca href=\"http://leafly.com/hybrid/dutch-treat\"\u003eDutch Treat\u003c/a\u003e and \u003ca href=\"http://leafly.com/hybrid/space-queen\"\u003eSpace Queen\u003c/a\u003e, Dutch Queen inherits a \u003ca href=\"http://www.leafly.com/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore/flavors-pine\"\u003epine\u003c/a\u003e aroma with subtle \u003ca href=\"http://www.leafly.com/explore/flavors-tree-fruit\"\u003efruity\u003c/a\u003e highlights. The \u003ca href=\"http://www.leafly.com/explore/category-sativa\"\u003esativa\u003c/a\u003e in her promises a light, \u003ca href=\"http://www.leafly.com/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore/tags-euphoric\"\u003eeuphoria\u003c/a\u003e that helps you find \u003ca href=\"http://www.leafly.com/explore/tags-energetic\"\u003eenergy\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore/tags-focused\"\u003efocus\u003c/a\u003e. Replacing \u003ca href=\"http://www.leafly.com/explore/symptoms-stress\"\u003estress\u003c/a\u003e with a sense of elevated bliss, Dutch Queen is perfect for unwinding or unraveling bad moods any time of the day.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Dutch Queen is a hybrid strain bred by Buddy Boy Farms in Washington. A cross between Dutch Treat and Space Queen, Dutch Queen inherits a sweet pine aroma with subtle fruity highlights. The sativa in her promises a light, uplifting euphoria that helps you find energy and focus. Replacing stress with a sense of elevated bliss, Dutch Queen is perfect for unwinding or unraveling bad moods any time of the day.\u0026nbsp;\n","aka":null,"rating":4.33,"highlightedReviews":[{"id":1351687,"username":"cascadianpatriot","text":"Good Sativa high. Good for getting things done and being in public. Not too heady. Very clear-headed. Very dense green buds. Gives a lighter high and a general feeling if well-being. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1555370,"username":"NW710","text":"Ok, so I\u0027m not normally  sativa kinda guy first off. I walked in the weed store expecting to get like 2 grams and maybe a cheap J with the 20$ I had. Needles to say, it was 20% off sativa day.I took about 15 minutes browsing the menu, I asked the budtendet about the 20$ 1/8,being a tad weary myself. After talking with I\u0027m I decided on a 20$ 1/8 of sativa , for only 15$. And the strain I got was this Dutch Queen. Its got me super lifted. Feels like my head is floating.. I will be getting this strain again.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3227","title":"New Strains Alert: Black Russian, Dutch Queen, Glad Max, Everlast, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1429297200000)\/","text":"So 4/20 is right around the corner, and the more proactive participants are probably thinking about what strains should be included in this year\u0027s arsenal. Or maybe you\u0027ll just be sitting at home training for the big day with your snap-away sweats and some HBO. That\u0027s cool, too. Either way, we\u0027re going to give you a few strain recommendations. Leave strain reviews for the varieties you\u0027ve already tried so others will know what to expect!\n   1. GRiZ Kush\n\nGRiZ Kush is a custom strain bred by Native Roots in collaboration with Root Cellar Genetics. This exclusive hybrid blend of Tangerine Haze and Pakistani Chitral Kush genetics was hand-selected by the musician GRiZ based on his favorite flavors and desired effects. The strain was developed to have an earthy citrus aroma and a balance between heady sativa energy and relaxing indica effects. The buds present themselves with a hint of purple coloring and carry a robust tangerine flavor with a hint of pine from the Kush undertones.\n\nAvailable at Native Roots South Denver and Native Roots Edgewater\n \n   2. Black Russian\n\nBlack Russian is an 80/20 indica-dominant strain bred by Delicious Seeds, who created this strain by crossing a Black Domina mother with White Russian. Notes of mango and citrus collide with lemon candy to create a medley of sweet tropical aromas that burst from Black Russian’s compact buds. This indica is known for her potency and endurance, making Black Russian the perfect choice for either patients seeking long-lasting symptom relief or anyone in need of deep relaxation of both mind and body.\n\n \n   3. Dutch Queen\n\nDutch Queen is a hybrid strain bred by Buddy Boy Farms in Washington. A cross between Dutch Treat and Space Queen, Dutch Queen inherits a sweet pine aroma with subtle fruity highlights. The sativa in her promises a light, uplifting euphoria that helps you find energy and focus. Replacing stress with a sense of elevated bliss, Dutch Queen is perfect for unwinding or unraveling bad moods.\n\n \n   4. Everlast\n\nEverlast from Machias, Washington is an 80/20 indica-dominant strain that induces deeply relaxing effects with a hashy, skunky aroma. With a THC content that can tower as high as 28%, Everlast is best chosen by experienced, seasoned consumers. It gets its name from the long-lasting euphoria that leaves your body suspended in tingling tranquility while the mind floats to active, happy escapes. Its heavy, body-focused effects are recommended for patients treating stubborn pain or sleeplessness.\n\nAvailable at Herbal Nation Recreational in Bothell, WA\n \n   5. Twisted Citrus\n\nTwisted Citrus is a sativa-dominant strain with a THC content that can climb to heights as high as 27%. With a name like Twisted Citrus, you might anticipate the tropical fruity aromas even before opening your stash jar. A bold fusion of oranges and banana flavors overwhelm the inhale and fade to subtle earthiness on the release. Next comes the upbeat, energized cerebral euphoria coupled with mellow, uplifting body effects, sensations that you can appreciate any time of the day.\n\n \n   6. Kush Cleaner\n\nKush Cleaner is a hybrid strain that combines Kush genetics with Jack’s Cleaner. Exactly which Kush was used in breeding this sativa-leaning strain is up for debate, but OG Kush, Ogre, and Purple Kush are all likely suspects. Its aroma is a strong mix of earthiness and pine, much like that of its Jack Herer ancestor. Expect Kush Cleaner to focus its efforts cerebrally, but its mellow relaxation will eventually permeate throughout the body, easing pain and tension.\n\n \n   7. Glad Max\n\nGlad Max, cultivated by Monarch Wellness in Arizona, is a spin on the classic sativa-dominant Caramelicious. This high-THC hybrid strain is known to have long-lasting euphoria that lifts the mood while relaxing the body. Consumers have compared this strain to Mother’s Helper in its aroma and effects, but Glad Max is said to carry even happier, more lighthearted qualities. Its buds have a sweet, earthy aroma and tend to take on a slight caramel hue with maturation.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12001947/new-strains-alert-black-russian-dutch-queen-glad-max-everlast-and.png","urlslug":"/news/strains-products/new-strains-alert-black-russian-dutch-queen-glad-max-everlast-and"}],"reviewCount":21,"flavors":[{"name":"Earthy","score":53.125},{"name":"Sweet","score":52.083333333333336},{"name":"Pungent","score":26.041666666666668},{"name":"Woody","score":26.041666666666668},{"name":"Pine","score":6.25}],"effects":[{"name":"Happy","score":60.416666666666671},{"name":"Relaxed","score":60.416666666666671},{"name":"Uplifted","score":35.416666666666671},{"name":"Euphoric","score":35.416666666666671},{"name":"Tingly","score":29.166666666666664}],"symptoms":[{"name":"Eye Pressure","score":26.041666666666668},{"name":"Fatigue","score":4.1666666666666661},{"name":"Depression","score":3.125},{"name":"Stress","score":3.125},{"name":"Muscle Spasms","score":2.083333333333333}],"conditions":[{"name":"Anxiety","score":3.125},{"name":"ADD/ADHD","score":2.083333333333333},{"name":"Arthritis","score":2.083333333333333},{"name":"Asthma","score":2.083333333333333},{"name":"Anorexia","score":1.0416666666666665}],"negatives":[{"name":"Dry Mouth","score":30.208333333333336},{"name":"Dry Eyes","score":3.125},{"name":"Headache","score":1.0416666666666665}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dutch-queen_100x100_90bc.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509160/b/dutch-queen__primary_b066.jpg"}],"photoTotalCount":1,"popularCities":["Seattle, WA","Cook, WA","East Wenatchee, WA","Edmonds, WA","Hoquiam, WA","Los Angeles, CA","Renton, WA","Spokane Valley, WA","Spokane, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/dutch-queen","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.33333333333333/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Dutch Treat","subtitle":null,"slug":"dutch-treat","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/dutch-treat","symbol":"Dt","applink":"leafly://strain/dutch-treat"},{"name":"Space Queen","subtitle":null,"slug":"space-queen","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/space-queen","symbol":"Sq","applink":"leafly://strain/space-queen"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
