{"sl_translate":"description,descriptionPlain,category","id":154095,"slug":"the-sauce","name":"The Sauce","subtitle":null,"symbol":"Sau","category":"Hybrid","description":"\u003cp\u003eThe Sauce is a 60/40 \u003ca href=\"http://www.leafly.com/explore/category-sativa\"\u003esativa\u003c/a\u003e-dominant \u003ca href=\"http://www.leafly.com/explore/category-hybrid\"\u003ehybrid\u003c/a\u003e bred by Exotic Genetix. Using a backcross of \u003ca href=\"https://www.leafly.com/hybrid/green-ribbon\"\u003eGreen Ribbon\u003c/a\u003e to pollenate a \u003ca href=\"https://www.leafly.com/hybrid/gorilla-glue-4\"\u003eGorilla Glue #4\u003c/a\u003e mother, the Northwest breeder created a potent blend that emits a mix of chocolate, \u003ca href=\"http://www.leafly.com/explore/flavors-lime\"\u003elime\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore/flavors-diesel\"\u003ediesel\u003c/a\u003e flavors. The Sauce took the prize for Judge\u0026rsquo;s Choice at the 2015 DOPE Cup in Seattle.\u003c/p\u003e\n","descriptionPlain":"The Sauce is a 60/40 sativa-dominant hybrid bred by Exotic Genetix. Using a backcross of Green Ribbon to pollenate a Gorilla Glue #4 mother, the Northwest breeder created a potent blend that emits a mix of chocolate, lime and diesel flavors. The Sauce took the prize for Judge\u0026rsquo;s Choice at the 2015 DOPE Cup in Seattle.\n","aka":null,"rating":4.73,"highlightedReviews":[{"id":1418968,"username":"amartin04","text":"I suffer from major everyday anxiety that will result in me having to walk away from my family/friends to try to chill my body and mind if I smoke a strain that induces too much of a cerebral high. I end up having an anxiety attack so bad that I can see my heart pumping outside of my shirt, I have terrible chest pains, and sometimes feel like I\u0027m having a heart attack and might die. It sounds wildly dramatic, but...I. Bug. Out. I can\u0027t help it and I wish it wasn\u0027t this way. I have ptsd, depression, anxiety, and depersonalization disorder from childhood abuse/trauma. OH. MY. GOD. This strain is HEAVEN SENT FROM ABOVE!  I want to jump up and down and exclaim to the world how amazing The Sauce is. I\u0027m happy, energetic, productive, and silly after smoking this. It\u0027s probably my absolute favorite. Seriously. If you suffer from staggering anxiety or ptsd, this is a must smoke! Hooray!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1642585,"username":"austinBOAjvk","text":"Where do I start? This strain is something special. It’s has a real uniqueness to it. A textbook sativa, but without any chance of the usual worries of paranoia. The smell is piney and citrusy, while the smoke is quite earthy, and chocolatey with notes of sour lime on the exhale. \nNow I’m not much of a sativa fan. I love my heavy hitting indica and very rarely even consider going with the orange instead of the purple. But my friend said I would be insane not to try it. And boy was he right. \nThe smoke is super smooth, with hardly any urges to cough. The high hits very quick, but with a gentle touch too it. The clean buzz it provides has fends off all feelings of paranoia. Clear headed and very, VERY euphoric. After the head settles you feel a warm buzzing feeling of energy in your stomach, and before you know it you’re ass deep in the back of the fridge. \nI strongly recommend this to any and all consumers who suffer, or who have suffered in the past from paranoia, anxiety, stress and depression. It will alleviate all symptoms, while allowing you to remain clear and functional throughout the day. You won’t miss a beat, even after a whole joint! This one may just make it into the top ten! Definitely will be keeping this around for regular day time use. Get you some. Cheers\n\n-BoaReviews\n\n","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-28571","title":"5 Excellent Funk Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1495893637000)\/","text":"Originating in the 1960s, funk music was brought earthside by black American musicians who mixed rhythm, blues, soul, and jazz to give birth to a new genre of music that is as groovy as it is dance-inducing. Placing heavy emphasis on bass and drums, funk music is a distinctive genre that gets its name from the early etymology of the word, meaning “musty,” or “earthy.” Anyone who has watched a funk bassist get down knows the “stank face” all too well—it’s this pure, earth-driven vibe that gave funk its name and magnetic presence in the early scene.\n\nThere is truly no other genre like funk—a genre that can enliven, inspire, rejuvenate, and energize. It is a sound that is both euphoric and grounded. The following is a list of some suggested funk albums to get the bones shaking and heart pumping, best enjoyed with some happy, sativa-dominant strains. Have your own funk albums you love to listen to while high? Tell us all about them in the comments below!\nMothership Connection by Parliament-Funkadelic\n\nStrain Pairing Recommendation: Funfetti\n“Funk not only moves, it can remove,” go the intro lyrics in this delightfully stanky, purely funky iconic album by Parliament-Funkadelic. Led by singer-songwriter George Clinton, whose fresh sound sparked its own genre title known as “P-funk,” Parliament-Funkadelic’s vibe is quintessentially funk, and thus impossible not to groove to. Mothership Connection is an album that plays out like a performance: It begins with a lively introduction, like the opening act to a play, and then dives deep into a medley of groovy bass lines and Clinton’s seamless vocals. Mothership Connection is a collection of pure funk sound that will have the listener looking up, getting up, and feeling up—particularly in conjunction with the lively strain Funfetti.\nFugue State by Vulfpeck\n\nStrain Pairing Recommendation: Monkey Paw\nIf you haven’t heard of Vulfpeck yet, get ready to join the vulfpack. The American funk group with an imaginary German flair have been steadily taking the music scene by storm since they were founded in 2011. Fugue State, released in 2014, is one of their most popular albums despite containing only six songs and lasting about 18 minutes. While mostly instrumental, Vulfpeck does at times feature vocals such as those on the track “1612,” a thoroughly catchy offering.\nDespite its short playlist, Fugue State is not lacking in sound or diversity; and perhaps diversity of sound is what Vulfpeck does best. Each song, even each album, builds a distinctive vibe that somehow manages to be both modern and original while also maintaining a nostalgic and vintage je ne sais quoi.\nBeyond The Sun by Orgone\n\nStrain Pairing Recommendation: Lemon Bubble\nOrgone’s Beyond The Sun is a venerable pleasure from the first note to the last. The music is playful, fierce, and lively, with the powerful vocals of singer Fanny Franklin driving the sound like any of the best conductors. Although much of their music is instrumental, Beyond The Sun especially highlights Franklin’s impeccable tone. However, make no mistake—as riveting as Franklin’s voice may be, instrumentalists are not outmatched but rather perfectly paired, creating a delicious confection of funk for the cannabis-elevated ears to enjoy. This is an album that will delight and invigorate while encouraging participation through song and dance.\n\nNext by Soulive\n\nStrain Pairing Recommendation: The Sauce\nOriginating in the forever famous Woodstock, NY, Soulive is a jazz-funk trio that brings the sounds of soul, R\u0026B, rock, and jazz to their largely instrumental recordings. Soulive is certainly a jazzier take on funk, with Eric Krasno on guitar, Alan Evans on drums and Neal Evans on keys, organ, and clarinet. At times, it’s easy to forget Soulive is a trio with their sound so rich and full. Their album Next, released in 2002, adds saxophonist Sam Kininger to the mix, providing an extra depth to their already wildly intricate sound. The album invites the herbally enraptured listener to go on a smooth ride through funky highs and soulful lows, which wind together a sprinkle of vocals amongst a sea of invigorating instrumentals.\nRowdy Duty by Deep Banana Blackout\n\nStrain Pairing Recommendation: Banana Diesel  \nPunchy and powerful, Deep Banana Blackout’s live album Rowdy Duty transports the listener to a live funk show filled with delightful improvisation, stimulating instrumentals, and robust vocals. Recorded in a single night, the 13-track album truly encapsulates the band’s jazz-funk, New Orleans-style sound. The eight-piece ensemble includes a full horn section, creating a funk experience that is truly dynamic and full. All together, it’s an energetic funk soundscape that will lead the blissed-out listener through a maze of funky highs and spacey lows.\n\nFunk music is a music of joy that moves people physically as well as uplifting them mentally. It is perhaps one of the most distinctive genres and one of the most original to come out of the golden era of music in the 1960s. Funk enlivens, and listening to it is simply good for the soul. At the end of the day, funk is all about happiness.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/05/25124830/funk-albums-while-high.jpg","urlslug":"/news/lifestyle/best-funk-albums-to-listen-to-while-high"},{"id":"contentitems-3525","title":"The 2015 DOPE Cup Winning Cannabis Strains, Concentrates, and Edibles","author":"Will Hyde","category":null,"date":"\/Date(1429812000000)\/","text":"Over the 420 holiday weekend, DOPE Magazine celebrated their 4th annual DOPE Cup at 7-Point Studios in Seattle. The celebration was sponsored by Leafly and showcased some of the region’s best cannabis flower, concentrates, edibles, topicals, glass artists, and accessories. Even a last-minute venue change couldn’t stop the stream of cannabis lovers from overflowing the state fair-themed event that came complete with infused cotton candy, a mechanical joint to ride, magicians, performers, artists, and more. Honestly, the only thing missing was a medicated corn dog to combat my munchies.\nAs expected, the dab bar was the hive that everyone was buzzing around, with a variety of solvent and solventless concentrates to sample from some of the best extract artists in the area. The highlight had to be local artist Scott Deppe’s crystal skull piece that sat at the X-Tracted bar and captured every passer-by with its intricate design and whopping 6-figure price tag. Those who weren’t concentrated around the dab rigs were busy sampling edibles, entering raffles, and relaxing with a massage at one the topical company booths.\n\nA judge’s pass to the event allowed visitors to join the action by sampling each of the strains entered into the People\u0027s Choice category of the Cup. For $99, the judge’s pass gave ticket-holders a half gram sample of all 10 anonymous strains and the opportunity to vote for their favorite. The mystery strains all had amazing flavors, ranging from sweet and tropical to earthy and piney, which made it all the more difficult to choose a favorite.\n\nSo, without further ado, here are the DOPE Cup winners!\n \nFlower Winners\n\n \nPeople\u0027s Choice Flower\n\nWinner: CPC or Cotton Purple Chem by Hesperides Gardens (Strain #4)\n \nJudges\u0027 Choice Flower\n\nWinner: The Sauce by ExoticGenetix (Strain #6)\n \nBest Indica\n\nWinner: Cascadia Kush by Hesperides Gardens\nRunner Up: The White from Cannabis Club by Freak UV Nature\n \nBest Sativa\n\nWinner: Matanuska Thunder Fuck by TJ\u0027s Gardens\nRunner Up: Head Cheese from Cali Connection\n \nBest Hybrid\n\nWinner: Peppermint Cookies by GoldLeaf Gardens\nRunner Up: GSC (f.k.a Girl Scout Cookies) by Rain City Cannabis \u0026 Top Shelf\n \nHighest THC\n\nWinner: The White (29.9%) by Solstice\nRunner Up: DT-13 (28.7%) by Patient 99 Care\n \nHighest CBD\n\nWinner: ACDC (18.05%) by Loaded Soda\nRunner Up: ACDC x Charlotte\u0027s Web (17.02%) by B-EZ and Fweedom\n \nConcentrate Winners\n\n \nBest BHO – THC\nWinner: Marmalade (94.36%) from Platinum Extracts\nRunner Up: Private Reserve OG (83.73%) from The Bakeréé\n \nBest BHO – CBD\n\nWinner: Sour Tsunami (83.7%) from Solstice by Refine\nRunner Up: Sour Tsunami (74.08%) by Stoney Extracts\n \nBest CO2 – THC\nWinner: Mixed Berry (48.56%, 110 ppm) by Evergreen Extracts\nRunner Up: Death Star (69.09%, \u003c10 ppm) by Happy Cats – CO2 Organics\n \nBest CO2 – CBD\n\nWinner: ACDC x Remedy (78% CBD, \u003c10 ppm) by Loaded Soda – CO2 Organics\nRunner Up: Evergreen Extracts (42.81% CBD, \u003c10 ppm)\n \nBest Non-Solvent – THC\n\nWinner: Kimbo Kush (84.37%, dry sift) Cuban Tech from Exotic Genetics\nRunner Up: Fire On the Mountain (82.68%) from NW Alchemy featuring Head Hunter\n \nBest Non-Solvent – CBD\n\nWinner: Remedy (52.5% CBD, 3390 ppm ethanol) by Hesperides Gardens\nRunner Up: ACDC (13.41% CBD bubble hash) Loaded Soda by CO2 Organics\n \nEdible Winners\n\n \nBest Edible – Savory\nWinner: Delux Nut Mix by Laurie and Marry Jane\nRunner Up: Capitol Hill Peanut Butter\n \nBest Edible – Sweet\nWinner: Dark Chocolate Fudge by Mad Monster\nRunner Up: Almond Bites by Laurie and Marry Jane\n \nBest Edible – Drink\nWinner: Loaded Soda Root Beer – 104.85 mg THC\nRunner Up: Sensi Sweet Tropical Punch – 58.68 mg THC\n \nBest Edible – CBD\nWinner: Vanilla Truffles from The Bakeree – Cookie Fam Genetics\nRunner Up: Slips by Oakor\n \nBest Topical\nWinner: Kush Cream Cherry Bomb – 2.01 mg THC\nRunner Up: Liberty Lotion High CBD – 1.67 mg CBD","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12002744/the-2015-dope-cup-winners.jpg","urlslug":"/news/strains-products/the-2015-dope-cup-winners"}],"reviewCount":45,"flavors":[{"name":"Earthy","score":51.1280487804878},{"name":"Pine","score":41.219512195121951},{"name":"Citrus","score":21.829268292682926},{"name":"Lime","score":21.219512195121951},{"name":"Lemon","score":20}],"effects":[{"name":"Euphoric","score":96.0060975609756},{"name":"Creative","score":94.176829268292678},{"name":"Uplifted","score":89.7560975609756},{"name":"Relaxed","score":79.8170731707317},{"name":"Happy","score":77.835365853658544}],"symptoms":[{"name":"Depression","score":75.396341463414629},{"name":"Stress","score":74.786585365853654},{"name":"Fatigue","score":66.707317073170728},{"name":"Pain","score":66.707317073170728},{"name":"Inflammation","score":63.048780487804876}],"conditions":[{"name":"Anxiety","score":92.957317073170728},{"name":"PTSD","score":51.1280487804878},{"name":"Arthritis","score":49.298780487804876},{"name":"Fibromyalgia","score":49.298780487804876},{"name":"ADD/ADHD","score":44.268292682926827}],"negatives":[{"name":"Dry Eyes","score":23.048780487804876},{"name":"Dizzy","score":6.8597560975609753},{"name":"Dry Mouth","score":3.0487804878048781},{"name":"Headache","score":0.6097560975609756},{"name":"Paranoid","score":0.6097560975609756}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/the-sauce_100x100_b97d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/599214/b/the-sauce__primary_13e9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/the-sauce_100x100_ea0f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/588213/b/the-sauce__primary_f86a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/the-sauce_100x100_2fac.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509636/b/the-sauce__primary_19c5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/the-sauce_100x100_2177.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/471084/b/the-sauce__primary_fc1f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/the-sauce_100x100_f26a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/448172/b/the-sauce__primary_c104.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/the-sauce_100x100_a07e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/346571/b/the-sauce__primary_4208.jpg"}],"photoTotalCount":6,"popularCities":["Seattle, WA","Denver, CO","Spokane, WA","Bellingham, WA","Salem, OR","Bremerton, WA","Los Angeles, CA","Spokane Valley, WA","Tacoma, WA","Airway Heights, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/the-sauce","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.73333333333333/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Green Ribbon","subtitle":null,"slug":"green-ribbon","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/green-ribbon","symbol":"Grr","applink":"leafly://strain/green-ribbon"},{"name":"Gorilla Glue #4","subtitle":null,"slug":"gorilla-glue-4","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/gorilla-glue-4","symbol":"Gg4","applink":"leafly://strain/gorilla-glue-4"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":null,"growNotes":"Notes from ExoticGenetix:\n\n\n\tMother: Gorilla Glue #4\n\tFather: Green Ribbon BX\n\tFamily: 60/40 Sativa\n\tSex: Reg\n\tGrowing Conditions: Multi-topped Bush\n\tHeight: Medium/Tall\n\tFlowering Time: 56-63 Dyas\n\tYield: Heavy Producer\n\tAroma: Lime Chocolate Gas\n\tTHC: 28%\n\n"}}
