{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Hannah Meadows",
            "category": null,
            "date": "/Date(1487614225000)/",
            "id": "contentitems-17346",
            "text": "From George Washington’s first presidential year in 1789 all the way up to our present time, cannabis use in the United States has been an interesting and often misunderstood hot button issue. Between the hemp fields owned by Founding Father Benjamin Franklin and the ridiculous “Reefer Madness” scare-mongering that lasted for a good chunk of modern American history, the presence of cannabis in politics and public discussion seems to have no end in sight.\nTo celebrate this wildly debated plant, we decided to take a peek into the history of a few American presidents and their sometimes embracing, sometimes hypocritical stance on the cannabis plant, speculating whether or not we believe they ‘inhaled’. We also provide a strain pairing we think most exudes each president on this list, because why not?\nGeorge Washington\n\nIf Washington were around these days, would he turn down a chance to puff on his indica pairing of Presidential OG? According to his numerous hemp farms, probably not. However, at the time, hemp was a commonly farmed plant used for its sturdy fibers to fashion ropes, clothing, fishing nets, and myriad other fibrous and useful items.\n\nApart from the practical use of hemp, it was noted that Washington included in one of his letters the following passage:\n“Began to separate the male from female plants rather too late…Pulling up the (male) hemp. Was too late for the blossom hemp by three weeks or a month.”\nThis note could indicate that he was planning a yield of higher-THC female plants, but that could be just a bit of our hopeful speculation.\nThomas Jefferson\n\nIt has been rumored that Thomas Jefferson once said, “Some of my finest hours have been spent on my back veranda, smoking hemp and observing as far as my eye can see.” That particular quote, however, has been debunked by a few historians.\nIn truth, Jefferson was an avid gardener with expansive portions of land dedicated to the cultivation of hundreds of plants, some of which some could have been cannabis. In his “Summary of Public Service” published in 1800, he stated, “The greatest service that can be rendered to any country is to add a useful plant to its culture.”\nWe like to take that quote very seriously here and apply it to the cannabis plant with its numerous medicinal contributions. For his acceptance of all things green, we decided to pair Jefferson with the hybrid American Dream, which represents “honest toil, personal improvement, and enjoying the fruits of one’s labor.” \nUlysses S. Grant\n\nHaving been the leading Union general of the North during the Civil War, it was most fitting to pair Grant with the popular indica Northern Lights. Whether or not he would have inhaled this strain seems to sway on the end of the affirmative. Cannabis was not illegal in the country during the Civil War era; in fact, it was (allegedly) used medicinally by many soldiers on both sides to cure a number of ailments.\n\nGrant, possibly being one of those who indulged in the consumption of cannabis, could have easily participated with little to no judgment from his peers.\nFranklin D. Roosevelt\n\nThe United States’ longest running president in history may or may not have participated in the consumption of cannabis. During his time in the oval office, he signed the 1937 Marijuana Tax Act. However, on the other side of the coin, he ended up signing an executive order pushing for hemp production for use during WWII in 1941. He also repealed prohibition, which indicates that he could have been open-minded toward the use of cannabis as much as the consumption of alcohol.\n\nFor FDR, we’re pairing him with the hybrid Lady Liberty for his famous 1936 address on the Statue of Liberty.\nRonald Reagan\n\nIt seems a bit tongue-in-cheek to include one of the fathers of the War on Drugs on this list, but we couldn’t ignore one of Reagan’s most iconic quotes when it comes to cannabis consumption (said after viewing an old botched study of the effects of marijuana on brain cells):\n“I now have absolute proof that smoking even one marijuana cigarette is equal in brain damage to being on Bikini Island during an H-Bomb blast.”\n\nThough we don’t believe Reagan would have touched the stuff (unless in private), we do think the hybrid THC Bomb pairs perfectly with the Great Communicator’s amusing quote.\nBarack Obama\n\nIt’s a no-brainer that we decided to pair Barack Obama with his dedicated indica strain Obama Kush, and his prior relationship with cannabis is definitely no secret. He has admitted to smoking here and there while he was going to school in Hawaii, but he’s pretty tight-lipped on whether or not he currently consumes.\nHowever, in a recent interview with Rolling Stone, the former president noted, in regard to cannabis:\n“I do believe that treating this [marijuana] as a public-health issue, the same way we do with cigarettes or alcohol, is the much smarter way to deal with it.”\nWe’ll light up some Obama Kush and cheers to that!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/02/17141818/presidents-day.jpg",
            "title": "Which U.S. Presidents Would Have Tried Cannabis?",
            "urlslug": "/news/lifestyle/which-presidents-would-have-tried-cannabis"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 6.25
        },
        {
            "name": "Migraines",
            "score": 6.25
        }
    ],
    "description": "<p>Lady Liberty is a balanced 50/50 <a href=\"http://www.leafly.com/explore/category-hybrid\">hybrid</a> strain that delivers a strong blast of <a href=\"http://www.leafly.com/explore/tags-energetic\">energized</a> <a href=\"http://www.leafly.com/explore/tags-euphoric\">euphoria</a> alongside a <a href=\"http://www.leafly.com/explore/flavors-sweet\">sweet</a> <a href=\"http://www.leafly.com/explore/flavors-grapefruit\">grapefruit</a> aroma. Notes of <a href=\"http://www.leafly.com/explore/flavors-citrus\">citrus</a> arrive on the inhale while sweet <a href=\"http://www.leafly.com/explore/flavors-earthy\">earthiness</a> is unleashed on the exhale in a flavorful introduction to Lady Liberty&rsquo;s dual-edged head and body effects. <a href=\"http://www.leafly.com/explore/tags-relaxed\">Relaxation</a> overcomes your physical senses while uplifting euphoria shakes <a href=\"http://www.leafly.com/explore/tags-creative\">creativity</a> and <a href=\"http://www.leafly.com/explore/tags-happy\">happiness</a> wide awake. She wears her potency in a crystal coat of <a href=\"http://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\">trichomes</a>, a shining testament to Lady Liberty&rsquo;s THC content which often surpasses 22%.</p>\n",
    "descriptionPlain": "Lady Liberty is a balanced 50/50 hybrid strain that delivers a strong blast of energized euphoria alongside a sweet grapefruit aroma. Notes of citrus arrive on the inhale while sweet earthiness is unleashed on the exhale in a flavorful introduction to Lady Liberty&rsquo;s dual-edged head and body effects. Relaxation overcomes your physical senses while uplifting euphoria shakes creativity and happiness wide awake. She wears her potency in a crystal coat of trichomes, a shining testament to Lady Liberty&rsquo;s THC content which often surpasses 22%.\n",
    "effects": [
        {
            "name": "Sleepy",
            "score": 6.25
        },
        {
            "name": "Hungry",
            "score": 6.25
        },
        {
            "name": "Relaxed",
            "score": 6.25
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 6.25
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1265944,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "super heady oil!!!! watch out for the spins!!!! lol",
            "username": "420Experience"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1265944,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "super heady oil!!!! watch out for the spins!!!! lol",
            "username": "420Experience"
        }
    ],
    "id": 151952,
    "name": "Lady Liberty",
    "negatives": [],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/hybrid/lady-liberty",
    "photoTotalCount": 3,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/621941/b/lady-liberty__primary_0290.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/lady-liberty_100x100_bcac.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503095/b/lady-liberty__primary_d8a8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/lady-liberty_100x100_a9f3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/427707/b/lady-liberty__primary_3026.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/lady-liberty_100x100_5103.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR"
    ],
    "rating": 4.25,
    "relatedStrains": [],
    "reviewCount": 4,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "lady-liberty",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.25/240",
    "subtitle": null,
    "symbol": "Llb",
    "symptoms": [],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
