{"sl_translate":"description,descriptionPlain,category","id":256,"slug":"sage","name":"SAGE","subtitle":null,"symbol":"Sg","category":"Hybrid","description":"\u003cp\u003eS.A.G.E. stands for Sativa Afghani Genetic Equilibrium, it is a well balanced Haze crossed with a robust indica strain. \u0026nbsp;Containing over 20% THC it took 2nd place in the blind test at the 2001 Cannabis Cup. \u0026nbsp;Spicy sandalwood flavor combined with a long lasting and uplifting high make this the plant for those who like the best.\u003c/p\u003e\n","descriptionPlain":"S.A.G.E. stands for Sativa Afghani Genetic Equilibrium, it is a well balanced Haze crossed with a robust indica strain. \u0026nbsp;Containing over 20% THC it took 2nd place in the blind test at the 2001 Cannabis Cup. \u0026nbsp;Spicy sandalwood flavor combined with a long lasting and uplifting high make this the plant for those who like the best.\n","aka":null,"rating":4.21,"highlightedReviews":[{"id":1393780,"username":"42ObiWanCannabinoid","text":"Woah... I didn\u0027t sign on for this. Lasted so damn long. I got the bottom of the jar of some other bud, which had some of this mixed in with it. Holy smokes! I got high, two hours later I drove home once it ebbed and it hit again when I got home. It went on for the rest of the day like that with the high coming and going. I went to sleep, woke up still high. Went back to sleep again. It took hours before I was completely sober.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png"},{"id":1628565,"username":"SparklePuss","text":"Ladies-Let me tell you. This sage gives me sparklers in my hey nanny....nuff said.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/IO6ZNMIIvj7xcAa8Fr0VAjjHLyU=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2fWNoI3lfvA14ZQ4d-yktJv-8BvnQ%3d%2f120x120%2fhttps%253A%252F%252Fddd33q3967xhi.cloudfront.net%252FU6Nqogng587i6N2kU2cN0bxOALM%253D%252F120x120%252Fhttps%25253A%25252F%25252Fs3.amazonaws.com%25252Fleafly%25252Fbin%25252FUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-58783","title":"5 Vibrant Pop Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1519855191000)\/","text":"Pop music is a diverse and lenient genre that often accompanies many influences such as hip-hop, soul, dance, rap, and rock. The term “pop” is short for “popular,” so the recognized sound of this genre has continually shifted over time. From the 60s, when The Beatles and rock music was considered pop, to today’s landscape where you’ll find pop artists ranging from soul singers to rappers, this lively genre will always be changing and evolving as the years wane on.\n\nPop music takes many forms, which means that there’s probably an album out there that speaks solely to you. Below, explore five modern pop albums—paired with their perfect strains—for an elevating experience of our modern-day manifestation of an evolving genre.\nSeat at the Table by Solange\n(Columbia Records)\nStrain Pairing Recommendation: Dream Queen\nSolange released her third album, Seat at the Table, in 2016, and it quickly shot to the number one spot on Billboard 200. The 21-song album is an infusion of Solange’s neo-soul, r\u0026b sound. It’s a refreshing number one album in a world of top 40 hits that often adhere to rigid, narrow hooks and phrasing. Seat at the Table has a deep, serene beauty from each calculated note to Solange’s effortlessly melodic voice. With lyrics that speak to the black American experience and touch on topics such as prejudice and racism, A Seat at the Table is poignant, meaningful, and an important contribution to the artistic landscape of our times.\n\nMore Life by Drake\n(Republic Records)\nStrain Pairing Recommendation: Sage N Sour\nMore Life, Drake’s 13th album, dropped in 2017. With over 80 minutes of music, it delivers an expressive and vibrant soundscape that is a delight to dive into. With songs such as “Madiba Riddim,” “Lose You,” “Can’t Have Everything,” and “Passionfruit,” Drake explores a wide variety of sounds that keeps it fresh and engaging throughout. Yet—despite the variety—each track contains Drake’s quintessential style, tying it together with the genuine heart he puts into his work.\nLemonade by Beyonce\n(Columbia Records)\nStrain Pairing Recommendation: Electric Lemonade\nReleased in 2016, Lemonade took the music scene by storm—and with good reason. A modern masterpiece, Lemonade is a deeply personal musical journey through romantic tribulations and black American life in the modern age. The album moves seamlessly through each song, leading the listener along a ride of emotional ups and downs. Anger, grief, joy, triumph, self-love—Lemonade has it all. Paired with the visual album, it’s easy to see why it made a major, lasting impact on the musical world.\n\nRainbow by Kesha\n(Kemosabe)\nStrain Pairing Recommendation: Cherry Thunder Fuck\nRainbow is Kesha’s first album since 2014 due to her long legal battle with producer and abuser, Dr. Luke. Having now won back the rights to her own music, Kesha’s album, Rainbow, is an anthem of freedom, triumph, and a spirit that refuses to quit. With songs such as “Praying” and “Bastard,” which directly addresses the trials Kesha went through over the last few years, the album is deeply personal. On the other end, songs such as “Boogie Shoes” and “Woman” (featuring Dap Kings) are bursting with joy and strength, making Rainbow a well-rounded, emotional hit.\nThe Pinkprint (Deluxe) by Nicki Minaj\n(Republic)\nStrain Pairing Recommendation: Boss OG\nThe Pinkprint was released in 2014, but with Minaj hinting at a new 2018 release, there’s plenty of reason to get hyped about this album all over again. With 23 songs on the roster, Pinkprint gives fans plenty to unwrap during her hiatus, and for those who only know her from the hit “Anaconda,” it’s time to take a deeper look. The Pinkprint features a wide breadth of sound; the diverse tracks range in genre from hip-hop, soul, rap, to dance. Minaj brings all her talent to the table, showing off her skills as a great rapper and soulful singer. The contrast between songs such as “Feeling Myself” and “Grand Piano” exemplify Minaj’s ability to embrace any sound she wants and she packages it all into one fire album.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28131717/pop-albums-while-high.jpg","urlslug":"/news/lifestyle/5-vibrant-pop-albums-to-listen-to-while-high"},{"id":"contentitems-26295","title":"Best Folk Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1494079206000)\/","text":"Folk music is a unique genre in that it can sometimes be difficult to pinpoint. Having been passed down through oral tradition, folk is usually characterized by its vibrant vocals, familiar lyrics and “old world” feel. This definition is fluid, however, with many disagreeing about what exactly classifies something as “folk music.” Perhaps Louis Armstrong said it best when he declared, “All music is folk music; I ain’t never heard a horse sing a song.”\nStill, folk music has a certain down-to-earth, down-home, family vibe that can at least be recognized by the feeling the sounds elicit. The following is a list of some suggested folk albums to offer such moods, best enjoyed while relaxing with some earthy, perhaps home-grown grass.\nDead \u0026 Born \u0026 Grown – The Staves\n\nThe Staves are an English folk rock band comprised of sisters Jessica, Camilla and Emily Staveley-Taylor. If there were ever such a thing as the mythological creatures known as sirens, you can be sure their voices would sound like this. The Staveley sisters’ bright, elegant vocals intertwine seamlessly, transporting the listener instantly into a world of their own creation. The songs on their album, Dead \u0026 Born \u0026 Grown, move together like a river, evoking a timeless sound that is at once both hypnotically peaceful and excitingly lively.\nStrain Pairing Recommendation: Super Silver Haze\nPushin’ Against a Stone – Valerie June\n\nValerie June’s unique and crystal clear vocals rise in this album like a sun breaking over the sea. The sound that cradles her ethereal voice is at once both folk, soul, blues, and Appalachian, but that down-home vibe shines through as the prominent feel of the album. Pushin’ Against a Stone is June’s breakthrough album, catapulting her from Tennessee to a worldwide stage, and it’s easy to understand why. June’s soulful and vibrant voice is as much a powerful instrument as any played by the musicians who join her project.\nStrain Pairing Recommendation: Cherry Pie\nElectric Dirt – Levon Helm\n\nElectric Dirt is drummer and singer-songwriter Levon Helm’s final studio album, produced in 2009. The album is a collection of covers and two original songs, including “Growing Trade,” an original song about a poor farmer who turns to growing cannabis to make ends meet despite it being illegal. The album is eclectic, powerful, joyful, sorrowful, and raw. Helm’s post-recovery vocals are gruff yet flawless, evoking a truly southern, folky feel. He is joined by a full band and his daughter, harmony vocalist Amy Helm. Listening to this album feels like a perfect summer day in the deep south, sitting on an old weathered porch with a good dog snoozing at your feet.\nStrain Pairing Recommendation: S.A.G.E\nSemper Femina – Laura Marling\n\nBritish singer-songwriter Laura Marling has been producing albums since 2008. Her latest work, released this past March and titled Semper Femina, delivers a raw and haunting sound that evokes femininity, grace, and purpose. Marling’s vocals are precise, deep, and melodious, a perfect complement to the graceful instrumentals of her music. There is a hint of traditional English classical in her style, and suggestions of jazz that add subtle textures to this otherwise lovingly folk music. Semper Femina, which translates to “always woman,” feels more personal than her previous albums, inviting the listener into the heart of her home to explore the sounds of her being.\nStrain Pairing Recommendation: Plushberry\nWays Not to Lose – The Wood Brothers\n\nWays Not to Lose features brothers Oliver and Chris Wood. The acoustic album contains twelve songs and offers a fresh take on traditional folk with a hint of rock tucked under the down-to-earth folk vibe. Chris Wood’s deep, prominent standup bass complements Oliver’s twangy and bright guitar. When Oliver’s rustic voice and poignant lyrics combine with Chris’ backing vocals, the duo comprise an album that feels as though the pair slipped back in time to add a modern taste to traditional old world music.\nStrain Pairing Recommendation: Blue Moonshine\nThe world of folk music is as vast and diverse as the people of this world. The above is, truthfully, merely a taste of the endless possibilities of folk music. One thing is to be sure, though: folk is a music meant to be enjoyed and passed down from person to person, family to family. One may even say it is a genre that seeks to preserve how it feels to have a human experience in a particular moment of time, and to share that feeling for generations to come.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/05/04141814/folk-albums.jpg","urlslug":"/news/lifestyle/best-folk-albums-listen-high"}],"reviewCount":254,"flavors":[{"name":"Earthy","score":30.338541666666668},{"name":"Diesel","score":30.15625},{"name":"Woody","score":25.755208333333332},{"name":"Pungent","score":24.661458333333332},{"name":"Spicy/Herbal","score":21.953125}],"effects":[{"name":"Relaxed","score":91.614583333333329},{"name":"Happy","score":70.625},{"name":"Euphoric","score":66.197916666666657},{"name":"Talkative","score":53.828125},{"name":"Focused","score":45.390625}],"symptoms":[{"name":"Pain","score":59.583333333333336},{"name":"Insomnia","score":45.911458333333336},{"name":"Stress","score":44.322916666666664},{"name":"Inflammation","score":41.640625},{"name":"Headaches","score":28.619791666666668}],"conditions":[{"name":"Anxiety","score":30.130208333333332},{"name":"PMS","score":21.09375},{"name":"Multiple Sclerosis","score":20.078125},{"name":"ADD/ADHD","score":5.2083333333333339},{"name":"PTSD","score":5.2083333333333339}],"negatives":[{"name":"Dry Mouth","score":69.583333333333343},{"name":"Dizzy","score":44.583333333333336},{"name":"Dry Eyes","score":23.90625},{"name":"Paranoid","score":1.09375},{"name":"Headache","score":0.625}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sage_100x100_71b8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/638866/b/sage__primary_0efb.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sage_100x100_25b1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/631659/b/sage__primary_e26b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sage_100x100_1a2a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/629648/b/sage__primary_6680.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sage_100x100_f4fd.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/522865/b/sage__primary_4ab2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sage_100x100_c47a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/510414/b/sage__primary_60ee.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sage_100x100_743a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503822/b/sage__primary_fb18.jpg"}],"photoTotalCount":60,"popularCities":["Denver, CO","Portland, OR","Los Angeles, CA","Eugene, OR","Seattle, WA","Vancouver, BC","Aurora, CO","Calgary, AB","Edmonton, AB","Montréal, QC"],"permalink":"https://mobileapi.leafly.com/hybrid/sage","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.21259842519685/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Haze","subtitle":null,"slug":"haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/haze","symbol":"H","applink":"leafly://strain/haze"},{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
