{"sl_translate":"description,descriptionPlain,category","id":4425,"slug":"blueberry-diesel","name":"Blueberry Diesel","subtitle":null,"symbol":"Bbd","category":"Hybrid","description":"\u003cp\u003eBlueberry Diesel is a cross of two favorite strains, \u003ca href=\"http://www.leafly.com/hybrid/blueberry\"\u003eBlueberry\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/sativa/sour-diesel\"\u003eSour Diesel\u003c/a\u003e. It is probably best known for its strong blueberry smell with hints of fuel from its Diesel lineage. Blueberry also overwhelms the flavor of these sticky flowers, which should have plenty of trichomes and long orange hairs. Effects tend to be happy and relaxing but not too overwhelming, making this a popular choice for many kinds of patients.\u003c/p\u003e\n","descriptionPlain":"Blueberry Diesel is a cross of two favorite strains, Blueberry and Sour Diesel. It is probably best known for its strong blueberry smell with hints of fuel from its Diesel lineage. Blueberry also overwhelms the flavor of these sticky flowers, which should have plenty of trichomes and long orange hairs. Effects tend to be happy and relaxing but not too overwhelming, making this a popular choice for many kinds of patients.\n","aka":"Blueberry Sour Diesel","rating":4.24,"highlightedReviews":[{"id":1413840,"username":"StretchyMinaj","text":"Picked up an 1/8th at Bloom because they didn\u0027t have the strain I wanted originally. This strain is KILLER! The Blueberry influences are heavy as you can tell by how the nugs smell. Strong smell of Blueberries, even through a glass nug jar. The smoke was smooth and expansive and a strong blueberry aroma on the exhale. The Diesel lineage is noticeable by the strong sativa effects. The body high becomes noticeable about ten minutes after medicating. Overall this smooth smoke was perfect for unwinding after a long hard day with sore muscles and a tired mind. I would recommend this strain for all patients out there. The nugs from Bloom were once again connoisseur grade, and a perfect specimen of Blueberry Diesel.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png"},{"id":1638095,"username":"Portlandpreview","text":"Wow! It\u0027s hard to find a good NYC sour d anymore, but this is close! A high potency sativa, BBSD has a strong smell of diesel/gas combined with blueberry. A cross between crows pleasers blueberry and NY Sour D, the buds are sticky, dense, coated in crystals, and highly potent smelling. The smoke is smooth, the high is energetic, but not paranoid, and will leave you wanting to go on a run, then eat a lot of food. Helps me with anxiety, PTSD, and pain.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3603","title":"What Are the Best Cannabis Strains for Cancer-Related Symptoms?","author":"Bailey Rahn","category":null,"date":"\/Date(1445356800000)\/","text":"Almost every state with medical marijuana laws allows the use of cannabis for cancer patients, and considering the myriad of side effects associated with the disease and its treatments, it’s easy to see why. Cannabis can remedy pain, curb nausea, encourage the appetite, boost the mood, offer energy and motivation, assist with sleep, promote weight gain, and rekindle social enjoyment.\n\nEach strain has its own unique effect profile, and what might be effective for one symptom might not be right for another. For you and your loved ones going through a cancer battle, we’ve compiled a list of strain suggestions for each symptom type, as well as some general guidance for managing pain, nausea, appetite loss, depression, and fatigue with cannabis.\nTreating Pain with Cannabis\nStrains containing high levels of both THC and CBD tend to be the most effective pain relievers due to their synergistic effects, but strains abundant in either of these cannabinoids may also do the trick.\n \nBlackberry Kush is a THC-heavy indica strain that crushes pain with a tidal wave of full-body euphoria and physical relief. This one will keep you thoroughly tranquilized, so save it for nights and restful days.\n \nACDC is one of the most highly-acclaimed pain slayers in the cannabis world. This sweet, citrusy hybrid strain is a perfect choice for patients trying to avoid the psychoactive effects of THC.\n \nWith a one-two punch of THC and CBD, Harlequin annihilates pain with minimal mental cloudiness. Keep this sativa on deck for clear-headed relief throughout the day.\nFor more pain-relieving strain suggestions, check out this expanded list of suggestions or use Leafly’s search filters.\nTreating Nausea with Cannabis\nNausea is best treated with strains containing some degree of THC, and this relief is typically delivered most quickly and effectively when smoked or vaporized.\n \nThe indica power of Northern Lights will keep you glued in one spot for a while, but your nausea will stand no chance against its stomach-calming properties. With impressive THC contents that have won it numerous awards, Northern Lights is some of the most potent herbal medicine available for sour stomachs.\n \nThe Blueberry Diesel hybrid offers a fine balance of effects that are neither racy nor lethargic. Upset stomachs will settle while moods are lifted to new heights, making this strain a fantastic medicine for both mind and body.\n \nNeed to stay up and active, but your stomach is keeping you down? Try Super Lemon Haze, a classic citrus-smelling strain with potent antiemetic properties and an energetic cerebral high.\nFor more nausea-relieving strain suggestions, check out Leafly’s search filters.\nTreating Appetite Loss with Cannabis\nWhen it comes to dealing with appetite loss, high-THC strains are the way to go. Indicas tend to be the best hunger enhancers out there, but some hybrids can offer comparable relief with less of a toll on your overall energy.\n \nA descendent of the resin-packed hash plants of Afghanistan, appetite loss stands no chance against the high-THC indica Bubba Kush. It’ll help you work up a ravenous hunger, but beware of the notorious couchlock tendencies of this strain if you’re looking to stay up and active.\n \nSo you need an appetite boost but not at the expense of your energy. A hybrid like Skywalker OG is a great option if you’re looking to sharpen the appetite without feeling overly lethargic. Instead, this strain offers a blissfully uplifting state of mind to keep you as positive as you are hungry.\n \nThe high-THC content of this classic indica strain isn’t the only thing that will get your appetite going – Granddaddy Purple’s sweet aroma of berries and grapes will have you craving a fruit medley (and quite possibly a fridge full of various carbs as well).\nFor more appetite-inducing strain suggestions, check out this expanded list of suggestions or use Leafly’s search filters.\nTreating Depression with Cannabis\nFor depression symptoms, strains that boost both energy and mood tend to be the most effective medicines. The terpene called limonene that’s found in many citrus-smelling strains is also known to alleviate depression, so try sniffing out some other potential options on your next dispensary visit.\n \nSuper Silver Haze is an esteemed sativa strain that revitalizes and invigorates happiness and creativity with a strong citrus flavor.\n \nChernobyl comes loaded with a sweet aroma of lemons and limes, and has the remarkable ability to jumpstart your energy and mood any time of the day.\n \nPennywise is the strain you’ll want if you’re looking for a more relaxed mindset, as opposed to the active and high-energy effects of sativas. What makes Pennywise a unique indica, however, is its high CBD content, so its effects are very clear-headed and focused as opposed to sleepy.\nFor more depression-curbing strain suggestions, check out this expanded list of suggestions or use Leafly’s search filters.\nTreating Fatigue with Cannabis\nAs a general rule, fatigue is best met with a sativa strain due to their rejuvenating and energetic buzz, but there are plenty of uplifting hybrids to choose from as well.\n \nWith a sweet strawberry aroma matched by no other strain, Strawberry Cough brings new life to both mind and body. This fragrant hybrid not only boosts energy levels, it also carries moods to heights that are hard to achieve when your energy is low.\n \nHop aboard the Pineapple Express and it’ll take you straight to a place where euphoria meets newfound energy. Its tropical flavors are an added bonus, offering a spectrum of pineapple, mango, and papaya aromas.\n \nWhen you’re tired, it’s hard to motivate yourself into the hobbies and activities you once enjoyed. The high-energy sativa Chocolope can help you change that, as enhanced sensory awareness and focus help you rediscover your happy, creative side.\nFor more fatigue-curbing strain suggestions, use Leafly’s search filters.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002951/what-are-the-best-strains-for-cancer-related-symptoms.jpg","urlslug":"/news/strains-products/what-are-the-best-strains-for-cancer-related-symptoms"}],"reviewCount":282,"flavors":[{"name":"Blueberry","score":58.76233376233376},{"name":"Diesel","score":39.596739596739596},{"name":"Sweet","score":26.447876447876446},{"name":"Berry","score":22.619047619047617},{"name":"Pine","score":9.0948090948090936}],"effects":[{"name":"Happy","score":82.217932217932216},{"name":"Uplifted","score":77.327327327327325},{"name":"Relaxed","score":68.232518232518231},{"name":"Euphoric","score":63.352638352638351},{"name":"Creative","score":41.334191334191338}],"symptoms":[{"name":"Depression","score":35.006435006435005},{"name":"Stress","score":34.105534105534105},{"name":"Pain","score":26.072501072501073},{"name":"Lack of Appetite","score":19.015444015444015},{"name":"Insomnia","score":12.398112398112396}],"conditions":[{"name":"PTSD","score":22.61904761904762},{"name":"Anxiety","score":22.007722007722009},{"name":"ADD/ADHD","score":16.001716001716},{"name":"Arthritis","score":10.746460746460745},{"name":"Gastrointestinal Disorder","score":10.371085371085369}],"negatives":[{"name":"Dry Mouth","score":23.069498069498071},{"name":"Dry Eyes","score":16.902616902616902},{"name":"Dizzy","score":5.33033033033033},{"name":"Headache","score":1.8018018018018018},{"name":"Paranoid","score":0.60060060060060061}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/blueberry-diesel/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/blueberry-diesel/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-diesel_100x100_eec5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/647434/b/blueberry-diesel__primary_f183.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-diesel_100x100_0fc5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/629901/b/blueberry-diesel__primary_edda.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-diesel_100x100_c6c1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/610829/b/blueberry-diesel__primary_3006.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-diesel_100x100_b294.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/608078/b/blueberry-diesel__primary_383c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-diesel_100x100_7707.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/592879/b/blueberry-diesel__primary_dfde.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-diesel_100x100_e88f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/586736/b/blueberry-diesel__primary_b405.jpg"}],"photoTotalCount":93,"popularCities":["Los Angeles, CA","Seattle, WA","Denver, CO","Tacoma, WA","Bellevue, WA","Spokane, WA","Vancouver, BC","Bothell, WA","Bremerton, WA","Everett, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/blueberry-diesel","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.23758865248227/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"},{"name":"Sour Diesel","subtitle":null,"slug":"sour-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/sour-diesel","symbol":"Sd","applink":"leafly://strain/sour-diesel"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"\n\t63-72 days flowering\n\n"}}
