{
    "aka": "Beastmode OG. Beast Mode OG Kush, Beast Mode 1.0",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1422556140000)/",
            "id": "contentitems-3475",
            "text": "For all you football and crazy commercial enthusiasts out there, the big game is this Sunday and as the national media frenzy swirls around NFL players, it grabs hold of anything worth mentioning, from what hat a player wears to their thoughts on Katy Perry. In fact, this year even a cannabis strain has captured the media's attention. \nYou may have already caught wind of the reports of a new strain of cannabis named Beast Mode 2.0 in honor of the Seattle Seahawks’ star running back Marshawn Lynch. Everyone from local newspapers to TMZ and Bleacher Report have been reporting on the new strain. Most attribute it as just another cannabis marketing ploy, like the one Peyton Manning squashed last year, but I wanted to know more. So, I contacted Nate “Diggity” Johnson, owner of Green Umbrella, to get an in depth look at the new strain.\n\nBeast Mode 2.0 was developed after the success of another Beast Mode variety last year. The original Beast Mode strain, Beast Mode OG, was a happy accident that occurred when Zion Gardens was gifted what they believed to be a cut of GSC (f.k.a Girl Scout Cookies) from a source in Northern California. However, after flowering the clone they quickly realized that these were not GSC genetics, and by autumn of 2013 the plant was dried, cured, and ready for market. The team was certain their new strain was either a compelling but mysterious hybrid of OG Kush, or simply an exceptional phenotype of the superstar strain. After trying the strain for the first time, the growers decided that the potent effects hit hard much like Marshawn Lynch attacking a running lane on the football field.\nAfter the success of both Beast Mode OG and the Seahawks' championship run last year, Nate decided it was only proper to truly develop a strain from scratch that would align with the running style and personality of Seattle’s beloved Beast Mode. Without much pushback or threat of legal action, he decided to pursue the project with the help of Grass Roots Pharm.\n\nBeast Mode 2.0 was refined during the summer through selective breeding while working with Master Kush and White Fire OG genetics. The end result is an indica-dominant hybrid that hits hard and relaxes away pain, like the aches and agony defenders must feel after battling Beast Mode for four quarters. According to Green Umbrella, the strain has registered as high as 23% THC, just shy of the number 24 that Marshawn wears.\nThe aroma of Beast Mode 2.0 is fruity and sweet. It has a berry note that sparks memories of fresh blueberry muffins, and produces an earthy flavor of sweet herbs that is followed by a mellow pine aftertaste that I attribute to the influence of OG Kush genetics.\nThe effects from the first bong toke are led by an instant rush of warmth to the forehead and ears. Shortly after, the muscles around my eyes loosened up and a calming indica wave extended down the spine, relaxing the lower extremities. The aggressive sedating properties are a great way to decompress at the end of a long day, but it might be best to avoid this strain when you are trying to cross things off your to-do list.\n\nCurrently Beast Mode 2.0 is only available medicinally in the Seattle area, with exclusive distribution handled by Nate at Green Umbrella. You can also find it at a few select dispensaries like Greenside Medical in Lake City, Delta 9 in Wallingford, and Conscious Care in Ballard.\nIf you live in Seattle or if you come to visit, make sure to look out for both of the Beast Mode strains. And if you get a chance to try either of these (or any other exciting or effective strains) varieties, be sure to leave a review on the strains’ detail page. If you don’t think Beast Mode 2.0 is for you, you can find other popular strains on the Leafly Strain Explorer. Be safe this weekend, enjoy the game, and go Seahawks!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/01/12002608/strain-highlight-beast-mode-20-makes-for-a-super-bowl-of-cannabis.jpg",
            "title": "Strain Highlight: Beast Mode 2.0 Makes for a Super Bowl of Cannabis",
            "urlslug": "/news/strains-products/strain-highlight-beast-mode-20-makes-for-a-super-bowl-of-cannabis"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 16.849816849816847
        },
        {
            "name": "Alzheimer's",
            "score": 7.142857142857142
        },
        {
            "name": "Cancer",
            "score": 7.142857142857142
        },
        {
            "name": "Fibromyalgia",
            "score": 7.142857142857142
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 7.142857142857142
        }
    ],
    "description": "<p>Beast Mode OG is a proprietary strain of cannabis distributed by <a href=\"http://www.leafly.com/dispensary-info/green-umbrella\">Green Umbrella</a>, a Seattle-based delivery service. When the grower, Zion Gardens, first received the strain they believed it was a <a href=\"http://www.leafly.com/hybrid/girl-scout-cookie\">Girl Scout Cookies</a> cut, but after growing it out it became apparent that this strain was either an exceptional <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\">phenotype</a> of <a href=\"http://www.leafly.com/hybrid/og-kush\">OG Kush</a> or it was an OG-dominant <a href=\"http://www.leafly.com/hybrid\">hybrid</a> of some kind. The strain was dubbed Beast Mode OG after tasting and testing showed that the potent effects induced a powerful punch similar to the running style of NFL Running Back Marshawn Lynch, nicknamed Beast Mode. The popularity of the strain was amplified to celebrity status as Seattle&rsquo;s football team claimed its first championship following the 2013 season. The strain itself stays true to OG genetics with a <a href=\"http://www.leafly.com/explore#!/explore/flavors-pungent\">pungent</a>, <a href=\"http://www.leafly.com/explore#!/explore/flavors-pine\">piney</a> <a href=\"http://www.leafly.com/indica/hindu-kush\">Kush</a> aroma that provides a balance between <a href=\"http://www.leafly.com/indica\">indica</a> and <a href=\"http://www.leafly.com/sativa\">sativa</a> effects. Beast Mode OG is a great <a href=\"http://www.leafly.com/explore#!/explore/tags-happy\">mood elevator</a> and serves as a great answer to <a href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\">stress</a> and body <a href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\">pain</a>.</p>\n",
    "descriptionPlain": "Beast Mode OG is a proprietary strain of cannabis distributed by Green Umbrella, a Seattle-based delivery service. When the grower, Zion Gardens, first received the strain they believed it was a Girl Scout Cookies cut, but after growing it out it became apparent that this strain was either an exceptional phenotype of OG Kush or it was an OG-dominant hybrid of some kind. The strain was dubbed Beast Mode OG after tasting and testing showed that the potent effects induced a powerful punch similar to the running style of NFL Running Back Marshawn Lynch, nicknamed Beast Mode. The popularity of the strain was amplified to celebrity status as Seattle&rsquo;s football team claimed its first championship following the 2013 season. The strain itself stays true to OG genetics with a pungent, piney Kush aroma that provides a balance between indica and sativa effects. Beast Mode OG is a great mood elevator and serves as a great answer to stress and body pain.\n",
    "effects": [
        {
            "name": "Talkative",
            "score": 129.2124542124542
        },
        {
            "name": "Energetic",
            "score": 112.27106227106226
        },
        {
            "name": "Relaxed",
            "score": 38.18681318681318
        },
        {
            "name": "Happy",
            "score": 29.76190476190476
        },
        {
            "name": "Uplifted",
            "score": 27.838827838827836
        }
    ],
    "flavors": [
        {
            "name": "Pine",
            "score": 23.992673992673993
        },
        {
            "name": "Apricot",
            "score": 14.926739926739925
        },
        {
            "name": "Earthy",
            "score": 11.63003663003663
        },
        {
            "name": "Woody",
            "score": 8.424908424908423
        },
        {
            "name": "Flowery",
            "score": 7.783882783882783
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1352745,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "When I got a 1/4th of this, the nuggets were packed so tight that it fit in a standard 1/8th size capsule--because of that, I was able to appreciate the aroma, which places me in the middle of some vivid pine forest. It's the type of smell that warrants a \"close your eyes and inhale\".\n\nThe overall look is as follows: short yet wide, dense buds that are pale grey in color, yielding plentiful trichomes that can be illuminated by a cellphone's flash. A patch of plentiful pistils can be found all around the bud's surface. Very neat, as I like dense buds in particular.\n\nOnce grounded and packed into my bowl, I took three smooth tokes and it was on. Give it four minutes (to be precise), and this strain will give you what I consider to be the best aspects of an indica-like hybrid: that heady, zoomy-like head space that makes you interested in whatever it is that's going on in front of your eyes. \n\nBehavior wise--a very distracted sort of focus, in-depth curiosity and positive attitude, which is easier to understand by experiencing it yourself rather than reading a description. One thing I would mention for novice users is that this strain can be too potent for your own good. Get too fucked up and you might get paranoid by the sound of your house settling, etc. Needless to say, novices approach with caution.\n\nTo sum it up, this strain gives the best of the indica high for a hybrid, which to my surprise did not end up with sleepiness despite the other indica-like effects I experienced. However, like any bud that packs a punch, the right amount will put anyone to sleep. \n\nTL;DR: Smoke if you want a nice cerebral, relaxing and potent high that increases curiosity and creativity. Not too much, or you might start trippin!\n\nP.S. I wrote this review under the influence of this strain, so if it seems off a little, that goes to show where my mind went during the time I wrote this.",
            "username": "ganja_goyim"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png",
            "id": 1631668,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I like the taste.  I got the red label and it hit the spot. Just what I needed to get my day started.",
            "username": "kdastid"
        }
    ],
    "id": 133583,
    "name": "Beastmode OG",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 23.35164835164835
        },
        {
            "name": "Dry Eyes",
            "score": 15.567765567765566
        },
        {
            "name": "Dizzy",
            "score": 7.142857142857142
        },
        {
            "name": "Paranoid",
            "score": 2.564102564102564
        },
        {
            "name": "Anxious",
            "score": 2.564102564102564
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/og-kush",
            "category": "Hybrid",
            "name": "OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/og-kush",
            "slug": "og-kush",
            "subtitle": null,
            "symbol": "Ogk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/beast-mode-og",
    "photoTotalCount": 4,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/438063/b/beastmode-og__primary_7fac.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/beastmode-og_100x100_6259.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/318905/b/beastmode-og__primary_28e4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/beastmode-og_100x100_4ef1.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/294268/b/beastmode-og__primary_ffe0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/beastmode-og_100x100_d1cc.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/288397/b/beastmode-og__primary_ce5d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/beastmode-og_100x100_4e83.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Bothell, WA",
        "Oakland, CA"
    ],
    "rating": 4.39,
    "relatedStrains": [],
    "reviewCount": 36,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "beast-mode-og",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.38888888888889/240",
    "subtitle": null,
    "symbol": "Bsm",
    "symptoms": [
        {
            "name": "Stress",
            "score": 25.274725274725274
        },
        {
            "name": "Lack of Appetite",
            "score": 15.567765567765566
        },
        {
            "name": "Inflammation",
            "score": 14.926739926739925
        },
        {
            "name": "Pain",
            "score": 10.989010989010989
        },
        {
            "name": "Fatigue",
            "score": 9.065934065934066
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
