{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1475440520000)/",
            "id": "contentitems-8229",
            "text": "Honey is an amazing substance — it’s a natural sweetener, a super-food with a nearly endless shelf life (if sealed properly), and has outstanding nutritional and medicinal benefits that can even help people adapt to local allergens (not to mention how delicious it is on baklava, peanut butter sandwiches, and in a cup of hot coffee or tea!).\nLeafly is home to over 60 specific strains that exhibit notes of honey. As your strain researcher and a passionate purveyor of fine cannabis, I’ve curated a shortlist of honey-flavored strains that will make your fingers sticky and your taste buds smile. Enjoy!\n   Panama Red\nPanama Red is best described as an old-school cannabis classic. Originating from Panama, this pure sativa rose to stardom in the late 1960’s thanks to its typical sativa effects: speedy and intense, bordering on psychedelic. As cannabis cultivation matured, Panama Red, which has a lengthy flowering time of at least 11 weeks, was left behind for faster growing strains and increased profits. However, those who fondly recall days of its prominence love its smooth medicating experience and loftily contemplate its revival. If you can get your hands on this sentimental throwback, do not hesitate to groove down memory lane and enjoy the ride.\n   Chocolate Thunder\nWhen you combine the sweet cocoa flavor of Chocolope with the strength and potency of Alaskan Thunder Fuck, you get none other than Chocolate Thunder. This clear-headed, active sativa may be all you need to inspire creativity or promote concentration, and patients will appreciate its ability to dull symptoms without fogging mental faculties. True to its name, Chocolate Thunder has a subtle sweet, earthy aroma similar to that of chocolate.\n   Thor’s Hammer\nThor’s Hammer by SnowHigh Seeds is an uplifting sativa strain that combines genetics from Vortex, Cinderella 99, and Acapulco Gold. Like a bolt of lightning commanded by the Norse god himself, Thor’s Hammer delivers an electrifying blast of cerebral energy that awakens creativity and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush fatigue and depression like the giants of Jotunheimr will likely find Thor’s Hammer to be the perfect weapon. You may also find a genetic variant of Thor’s Hammer from Alaska that instead combines God Bud and Sour Diesel in a more balanced indica-sativa hybrid cross.\n   Honey Banana\nHoney Bananas from Elemental Seeds is a heavy-handed hybrid strain bred from Strawberry Banana and Honey Boo Boo. This cannabis strain earns its name with a resinous coat as sticky as honey and an unmistakable banana aroma. She leans heavily toward the indica side of the family, providing weighty full-body effects coupled with an invigorating buzz of cerebral euphoria.\n   Lodi Dodi\nLodi Dodi is a sativa-dominant hybrid popular in Washington State. Exclusively bred by The Clone Zone, the genetic heritage of Lodi Dodi is undefined and closely guarded. Lodi Dodi carries a sweet, unique flavor of tropical fruit and fresh wildflowers. The pungent aroma leads the way towards a cerebral buzz, known to spark creativity and a boost of energy that will turn any task into a more enjoyable adventure.\n   Nebula\nThe Nebula marijuana strain was bred by Paradise Seeds in 1996. Its name means “Starcloud” and it has been known to “twinkle” with THC coating, with a head and body buzz described as intense and almost psychedelic. The buds have been known to smell and taste like honey, and flowering time is a minimum of 9 weeks. Nebula has won many awards, including 3rd place in the sativa category at the High Times Cannabis Cup in 1999 and 2nd place in 2005. It also took 3rd place at the Highlife Cup in 2004 in the Hydro category, and 1st place at the Copa La Bella Flor Spain in 2005.\n   Fortune Cookies\nFortune Cookies is a hybrid cannabis strain that combines the famed genetics of GSC (f.k.a Girl Scout Cookies) and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in GSC (f.k.a Girl Scout Cookies), but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty “couch-lock” effects typically associated with indica strains.\n   BC Sweet Tooth\nDeveloped in British Columbia by BC Bud Depot, BC Sweet tooth is an indica-dominant hybrid known for its quick flowering time and candy taste.  A hardy plant, this strain can be grown outdoors where it can flower in under 7 weeks, but it prefers the indoors where it may flower as soon as 6 weeks. The result of a cross with earlier generations of BC Sweet Tooth and classic Sweet Tooth, these sugary flowers are sure to satisfy your craving. The crystalline buds have a strong, sweet smell with a hint of citrus, and consumers report that this treat satisfies with a long-lasting, potent feeling that hits fast.\n   Danky Doodle\nOriginally named Double D as a reference to the large buds on these plants (we’ll let you make the connection there), breeder KC Brains decided to rename the strain Danky Doodle at the suggestion of some American friends in order to avoid confusion with the similarly named Double Dutch. Danky Doodle certainly isn’t a shy plant; it grows like the weed it is and will make its presence known with its pungent sweet smell. Plants flower at 9 to 11 weeks and should provide a high yield of large buds covered in a rich frost. This plant is a cross between several strains, and it’s no surprise that Big Bud is included in its lineage along with the strains Viking and the breeder’s own KC 636. The result is a strong indica that provides full body relief no matter what you call it.\n   Cream Caramel\nCream Caramel, named after its sweet caramel aroma, is a 90% indica cross between BlueBlack, Maple Leaf Indica, and White Rhino. Covered in a sugary coat of THC-rich resin, Cream Caramel delivers heavy, relaxing indica effects that soothe the mind and body. Though originally bred by Sweet Seeds in Spain, Royal Queen Seeds have also championed their own rendition called Royal Caramel. Early October is the finish line for outdoor Cream Caramel flowers, while indoor gardens should be harvested after a 7 to 8 week flowering period.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/02131126/cannabis-strains-that-taste-like-honey.jpg",
            "title": "Try These Cannabis Strains That Are as Sweet as Honey",
            "urlslug": "/news/strains-products/cannabis-strains-that-taste-like-honey"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1469051100000)/",
            "id": "contentitems-3061",
            "text": "Space: the final frontier. The massively empty wonder which has tantalized the imagination of mankind since first gazing upwards to witness the brilliance of the celestial. Whether for discovery, in reaction to climate change, or because you’re an overly excited core that wants to go to space, exploration is more relevant and possible than ever. With private space companies reigniting the torch of space travel and helmed by incredibly smart and innovative individuals (like Elon Musk, founder of SpaceX, or Sir Richard Branson of Virgin Galactic), it’s not hard to believe we are entering a golden age of cosmological discovery.\nOn the shoulders of giants we stride forward into a future not grounded on Earth. Here at Leafly, we’d like to reengage the booster switch and combust a little propellant in honor of the men and women around the world making the dream of space exploration a reality. We’ve compiled a list of outer space-themed cannabis strains to help you celebrate the scientists, star formations, conspiratorial UFO hunters, Apollo missions, and others on this Space Exploration Day.\n  Project Blue Book\nOriginating in 1952, Project Blue Book kicked off a series of studies conducted by the U.S. Air Force to determine if UFOs were a threat to national security. Its strain counterpart is a sativa-leaning hybrid offering a serene body high and calm, focused effects that are perfect for star-gazing.\n  Sputnik\nThis rocket was used by the Soviet Union to perform the world’s first satellite launch in 1957. Strain-wise, the spunky Sputnik sativa (say that three times fast!) has hints of sour and diesel, perhaps from that rocket boost of uplifting effects you may experience.\n“2 hits to liftoff. Decent buzz out of the launchpad. mid buzz nice and headize, no burn out at the end. good strain to kick back, and rate strains.” – sonofabrokenman\n  Apollo 11\nThe first space flight that brought humans on the Moon, Apollo 11 is the reason we’re celebrating this date today since it occurred on July 20th, 1969. Neil Armstrong and Buzz Aldrin took one small step for man and one giant leap for mankind. The strain, meanwhile, offers strong cerebral effects that are good for treating stress and moderate pain.\n“I love this strain. It takes you on a cosmic journey while leaving you grounded on planet earth. –symbol9991\n  Stephen Hawking Kush\nThe iconic theoretical physicist brought us predictions on black holes, gravitational singularity theorems, and cosmology. His strainsake, Stephen Hawking Kush, is an indica-dominant offering that helps with pain, nausea, and relaxation.\n“Healing codes from the universe immediately came to me when I smoked a hit of this high 11.4 CBD strain. Absolutely Smiles and TOTAL RELEIF are endrenching me in this dream. My love of indica just got greater because I have had a crush on Stephen Hawking and now I can smoke bud named after his fine ass and mind. WOW I think this strain will make me more intelligent. It is so much stonier and higher than I thought it …” – StellarStoner\n  Apollo 13\nThe seventh manned mission in the Apollo space program, Apollo 13 was the United States’ third intended Moon landing. Unfortunately, an oxygen tank exploded and crippled the Service Module. The crew managed to cobble together some makeshift repairs and return safely to Earth on April 17th. Not only did this historical event result in a blockbuster film of the same name, it also inspired the popular Apollo 13 hybrid strain featuring cerebral, energizing effects and an appropriately earthy scent.\n“WOW! Such an appropriate name, because I’m blasted light years past the moon. Light speed ahead, on a rocket ship I said, catch me if you can, I’m your spaceman…” –NunoFreak\n  Cosmic Collision\nThis sativa collided Cosmic Charlie with Piña Collision to create a fusion that’s out of this world. Enjoy the pineapple-kiwi flavors of Cosmic Collision and its uplifting, euphoric effects while you ponder exactly how far the universe extends.\n  Carl Sagan\nThe American astronomer, cosmologist, astrophysicist, and astrobiologist dedicated his efforts to researching extraterrestrial life and sent the first physical messages into space. His Carl Sagan strain counterpart offers balanced effects and relaxation.\n  Outer Space\nDefined as the void that exists between celestial bodies, the mystery of outer space will keep scientists hunting for answers well into the next millennium. The sativa Outer Space is widely touted for its creative, uplifting, and energetic effects.\n“Really makes you feel like taking off into space. More of a head uplifting feeling and focus.” – robmorales\n  Nebula\nA nebula is an interstellar cloud comprised of dust, helium, hydrogen, and other ionized gases. Its hybrid Nebula strain version twinkles with THC coating and offers intense, almost psychedelic effects.\n“Out of this world!” – hermantheworm420",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001512/cannabis-strains-for-space-exploration-day.jpg",
            "title": "Celebrate Space Exploration Day With These Cannabis Strains",
            "urlslug": "/news/strains-products/cannabis-strains-for-space-exploration-day"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 59.10144927536231
        },
        {
            "name": "PTSD",
            "score": 43.537549407114625
        },
        {
            "name": "Arthritis",
            "score": 22.541501976284582
        },
        {
            "name": "Crohn's Disease",
            "score": 21.17786561264822
        },
        {
            "name": "Parkinson's",
            "score": 21.08695652173913
        }
    ],
    "description": "<p>The Nebula marijuana strain was bred by Paradise Seeds in 1996. Its name means &quot;Starcloud&quot; and it has been known to &quot;twinkle&quot; with THC coating, with a head and body buzz described as intense and almost psychedelic. The buds have been known to smell and taste like honey, and flowering time is a minimum of 9 weeks. Nebula has won many awards, including 3rd place in the sativa category at the High Times Cannabis Cup in 1999 and 2nd place in 2005. It also took 3rd place at the Highlife Cup in 2004 in the Hydro category, and 1st place at the Copa La Bella Flor Spain in 2005.</p>\n",
    "descriptionPlain": "The Nebula marijuana strain was bred by Paradise Seeds in 1996. Its name means &quot;Starcloud&quot; and it has been known to &quot;twinkle&quot; with THC coating, with a head and body buzz described as intense and almost psychedelic. The buds have been known to smell and taste like honey, and flowering time is a minimum of 9 weeks. Nebula has won many awards, including 3rd place in the sativa category at the High Times Cannabis Cup in 1999 and 2nd place in 2005. It also took 3rd place at the Highlife Cup in 2004 in the Hydro category, and 1st place at the Copa La Bella Flor Spain in 2005.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 92.7022397891963
        },
        {
            "name": "Uplifted",
            "score": 79.64163372859025
        },
        {
            "name": "Euphoric",
            "score": 71.5243741765481
        },
        {
            "name": "Energetic",
            "score": 71.38076416337286
        },
        {
            "name": "Tingly",
            "score": 66.71146245059288
        }
    ],
    "flavors": [
        {
            "name": "Woody",
            "score": 41.90513833992095
        },
        {
            "name": "Diesel",
            "score": 35.59815546772068
        },
        {
            "name": "Earthy",
            "score": 35.37022397891963
        },
        {
            "name": "Sweet",
            "score": 34.65480895915679
        },
        {
            "name": "Honey",
            "score": 29.616600790513836
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1392377,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Probably one of my favourite strains of all time. \nIt lifts any depression, stress, or worry you may have at the time -- I've felt quite relieved on several occasions.  It's also quite nice if you are introverted like me and find it uncomfortable to get a conversation started at a social event. \n\nThe attributes of the strain:\nQuite nice for creativity.  I've dicked around and made various types of music on this strain, and have had the inspiration to redecorate and move furniture around, etc. \nI've also sparked interest in a few projects after \"seeing the light\" during the inspiration that this strain has to offer. \n\nAlso, it kind of has a quirky flavour.  I'm sure it's slightly different from grower to grower so I won't go too deep in the details but it has this sort of....sweeter....spice to it.  The smoke itself tasted airy and sugary, if that makes any sense.   It sounds weird, but it almost had an Angel-Food cake taste and consistency to the smoke.  \n\nYou can't go wrong with this strain.",
            "username": "Audio_Geek"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1615745,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This strain is chill as f***. My housemate who also smoked it with me, has decided she is a weed connoisseur after smoking this strain. It hits as heavy as an indica, but your head stays clear throughout. Everything is just a lot more confusing and a lot more fun. As my housemate says : \"I can do a lot of tasks, but the tasks make no f***ing sense.\" 10/10, one of the best strains I've smoked yet.",
            "username": "sexyrexy866"
        }
    ],
    "id": 959,
    "name": "Nebula",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 51.3399209486166
        },
        {
            "name": "Dry Eyes",
            "score": 18.961791831357047
        },
        {
            "name": "Anxious",
            "score": 9.658761528326746
        },
        {
            "name": "Paranoid",
            "score": 9.299077733860342
        },
        {
            "name": "Dizzy",
            "score": 3.4466403162055332
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/hybrid/nebula",
    "photoTotalCount": 49,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002803/b/nebula__primary_731e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nebula_100x100_9cf3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/666634/b/nebula__primary_eaa8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nebula_100x100_a996.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/578570/b/nebula__primary_09b8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nebula_100x100_e517.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/578417/b/nebula__primary_3cad.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nebula_100x100_d085.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509780/b/nebula__primary_e68c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nebula_100x100_6468.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509611/b/nebula__primary_e558.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nebula_100x100_0de7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Calgary, AB",
        "Montréal, QC",
        "Toronto, ON",
        "Vancouver, BC",
        "Bremerton, WA",
        "Chandler, AZ",
        "Halifax, NS",
        "Mesa, AZ",
        "Phoenix, AZ"
    ],
    "rating": 4.43,
    "relatedStrains": [],
    "reviewCount": 240,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "nebula",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.42916666666667/240",
    "subtitle": null,
    "symbol": "Neb",
    "symptoms": [
        {
            "name": "Stress",
            "score": 52.616600790513836
        },
        {
            "name": "Depression",
            "score": 44.49538866930171
        },
        {
            "name": "Pain",
            "score": 24.454545454545453
        },
        {
            "name": "Fatigue",
            "score": 17.689064558629777
        },
        {
            "name": "Nausea",
            "score": 16.511198945981555
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
