{
    "aka": "DTB",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1513714353000)/",
            "id": "contentitems-52330",
            "text": "Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis concentrates of 2017. How many have you tried? What was your favorite concentrate of 2017? Share with us in the comments below!\n\nDouble Tangie Banana Sugar Resin by Oleum Extracts\nAvailable in: Washington\nBursting with citrus aroma, Oleum Extracts’ delicious Double Tangie Banana Sugar Resin brings maximum flavor along with buzzy sativa-dominant qualities. We love it for its huge terpene profile, and find it to beget a subtle, controllable high with each and every dab.\nSpace Queen Cartridge by Artizen Cannabis\nAvailable in: Washington\nNotes of bold cherry mixed with a soft vanilla scent are found in Artizen’s hybrid Space Queen Cartridge. We recommend this delectable concentrate for beginners and newbies as it delivers a well-balanced high and sweet taste that will keep you (and us) coming back for more.\nHarley Twin CBD Sap by Cannavative\nAvailable in: Nevada\nPacked with 57.6mg CBD to 23.3mg THC, we’re loving Cannavative’s pain-crushing Harley Twin CBD Sap. Wrap yourself in a stimulating buzz with a healthy dab of this sativa strain before taking on the day.\n\nCHILL Cartridge by SuicideGirls Cannabis\nAvailable in: California\nThe Suicide Girls released a line of effects-based cartridges that will perfectly match your mood, and we’ve been getting up close and personal with their relaxing CHILL Cartridge filled with a whopping 80% THC and mouthwatering fruity terpenes.\nAlso featured in: We Tried the Suicide Girls’ New Cannabis Vape Line\nGreen Crack Distillate Cartridge by Bullet Concentrates\nAvailable in: Nevada\nBullet Concentrates’ Silver Bullet Distillate Cartridges are as effective as they are elevating, and the Green Crack Cartridge is no exception. We’ve been including it as part of a balanced wake and bake morning for its burst of energy and robust terpene profile.\nTHCA Crystalline Distillate by Oleum Extracts\nAvailable in: Washington\nOleum Extracts comes up time and again when we talk great local concentrates, and their potent THCA Crystalline Distillate is a favorite amongst our more experienced concentrate lovers. When pressed on a hot dab nail, THCA decarboxylates into strong and active THC. With little to no terpene content in a crystalline distillate, the rush is smooth and tasteless, and these crystals can be added to standard dabs for an intense high-potency experience (trust us, it’ll feel like you’re taking your first dab all over again).\n\nTropical Trainwreck 1g Kit by Orchid Essentials\nAvailable in: California and Oregon\nLeafly’s office is located in Seattle, which means we clamor for any product that lets us escape from the clouds and rain. Enter the Tropical Trainwreck Cartridge Kit by Orchid Essentials, loaded with tropical terpenes boasting citrus and pineapple flavors. It’s as close to sitting on a sunny beach as we can get.\nFreshTerps by Evolab\nAvailable in: Colorado\nEvolab’s FreshTerps is a step up in the world of cannabis flavors and aroma. We’ve fallen head over heels for this concentrate, which contains about 90% terpenes (plus 10% THC) and can be vaped individually or blended with your favorite oils to produce the most delicious dabs you’ve ever had.\nAlso featured in: Best Products to Pick Up Before 4/20\nEureka Clear Disposable Vape Pen in Indica by Eureka Vapor\nAvailable in: California and Colorado\nWith 300mg of cannabinoids, Eureka’s calming Disposable Vape Pen has our indica lovers singing its praises. Featuring classic indica strains like Granddaddy Purple and Skywalker and a full test analysis for each pen, we admire Eureka Vapor’s attention to quality and ease of use.\nAlso featured in: 10 Brands Making Awesome Disposable Cannabis Vape Pens\n\nRed Apple Clear Cartridge by The Clear\nAvailable in: California, Colorado, and Oregon\nThe Clear brings the sweet and crisp fragrance of a fresh apple orchard right to your lips with their half-gram Red Apple Clear Cartridge. We can also get down with The Clear’s other cartridges featuring a wide range of delicious flavors (once you’re done with Red Apple, try the lush Orange Cream).\nAlso featured in: In Photos: These ‘Dragon Balls’ Contain 3,000 Grams of Pure Cannabis Oil\nChemmy Jones Blonde BHO by Dorado Extracts\nAvailable in: Washington\nDorado Extracts’ extra-terpy Chemmy Jones Blonde BHO provides an ultra-rich taste with a high-energy buzz. We especially love their innovative soft lid packaging and quality concentrate at a budget-friendly price point.\nAlso featured in: What Are Your Smoking? Episode 17\nSuper Lemon Haze Vape Cartridge by The Bloom Brand\nAvailable in: California and Washington\nFree of solvents, lipids, waxes, and impurities, The Bloom Brand’s Super Lemon Haze Vape Cartridges are triple distilled and contain only oil and terpenes, giving you an ultra-pure cannabis concentrate.\nLead image by rgbspace/iStock",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/19120551/leafly-faves-concentrate.jpg",
            "title": "Leafly’s Faves 2017: Concentrates",
            "urlslug": "/news/strains-products/leaflys-faves-2017-concentrates"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1442592000000)/",
            "id": "contentitems-3235",
            "text": "The weekend is drawing near, which means it's just about time to kick back and relax with a bowl of your favorite strain. We'd like to introduce you to a few varieties recently added to the Leafly Explorer, and if you like the sound of any of these, check the links to see if any are available near you.\nRemember, if you do have a chance to try one of these newly added strains, give 'em a review. Happy strain hunting!\n \n 1. Blueberry Jack\n\nA cross between the legendary Jack Herer and DJ Short Blueberry, Blueberry Jack has something special to offer in both flavor and effect. Sweet, candied blueberry flavors invade on the inhale while the earthy, piney exhale reminds you of this strain’s Jack heritage. A lively sativa buzz typically dominates Blueberry Jack’s effect profile, with just enough physical relaxation to keep you grounded. Blueberry Jack offers an easy escape from stress and bad moods, keeping you positive and motivated through the day.\n\nFind out which locations are currently carrying Blueberry Jack\n \n 2. Crouching Tiger Hidden Alien\n\nCrouching Tiger Hidden Alien is another indica staple from Exotic Genetix, who combined Tiger’s Milk with Starfighter to create this powerhouse strain. Flavors of pine and spice come through on the inhale while ushering in full-body tranquility. Its heavy-handed sedation makes Crouching Tiger Hidden Alien a perfect choice for sleepless nights or for getting rest and relaxation.\n\nFind out which locations are currently carrying Crouching Tiger Hidden Alien\n \n 3. Double Tangie Banana\n\nDouble Tangie Banana is a sativa-dominant hybrid strain developed by Crockett Family Farms. Supposedly a cross between Banana Sherbert and DNA Genetics’ orange-flavored Tangie, Double Tangie Banana oozes with crystal resin and citrus aromas. Anyone who has tried Tangie knows that this strain was primarily bred for the flavor enthusiasts, so if you’re searching for a strain with an impressive terpene profile, look no further.\n\n \n \n 4. Chocolate Diesel\n\nChocolate Diesel is a sativa cannabis strain that brings together genetics from the original Sour Diesel and Chocolate Thai. With soaring euphoria that shoots straight to the head, Chocolate Diesel could easily be compared to a cup of coffee. Its flavors offer a little part of both parents, with notes of both earthy chocolate and skunky diesel.\n\nFind out which locations are currently carrying Chocolate Diesel\n \n 5. Hellfire OG\n\nHellfire OG is a California hybrid strain that crosses Rascal’s OG Kush with SFV OG Kush. Another robust and powerfully euphoric addition to the OG family tree, Hellfire OG is the perfect THC powerhouse for the cannabis veteran or the patient needing potent relief. In a show of its genetic line, Hellfire OG carries that signature OG smell of lemon diesel and earthy spice.\n\nHellfire OG is currently available at Green Door (medical) in San Francisco, CA\n \n 6. Blue Power\n\nThe indica-dominant Blue Power is one of Sin City Seeds’ signature strains, bred from Sour Double, Master Kush, The White, and Blue Moonshine genetics. Cherished for its fragrant buds, Blue Power offers a sweet fusion of lemon and berry flavors with an earthy finish. It should be noted that another genetic variation released by Vision Seeds crosses Blueberry, White Widow, and Skunk #1. This rendition is described as a happy and uplifting indica that helps focus the mind while fighting stress.\n\nBlue Power is currently available at Jackson County Compassion Club (medical) in Jackson, MI\n \n 7. Cactus Cooler\n\nCactus Cooler is a sativa-dominant strain that’s said to be a cross between Blue Dream and OG Kush. The sativa in Cactus Cooler lends an upbeat cerebral kick to help you stay focused and productive throughout the day, while the OG boosts the senses with buzzing euphoria. With notes of sharp lemon and sweet wildflowers, Cactus Cooler takes after both parents in its fragrance.\n\nCactus Cooler is currently available through Grandma's Goodies Delivery (medical) in San Francisco, CA and Los Angeles, CA\n \nCheck out our other new strains recently added to the Leafly Explorer, or catch up on last week's New Strains Alert!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/09/12001958/new-strains-alert-blueberry-jack-hellfire-og-double-tangie-banana.png",
            "title": "New Strains Alert: Blueberry Jack, Hellfire OG, Double Tangie Banana, and More",
            "urlslug": "/news/strains-products/new-strains-alert-blueberry-jack-hellfire-og-double-tangie-banana"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "PTSD",
            "score": 22.85299943406904
        },
        {
            "name": "Anxiety",
            "score": 11.088709677419356
        },
        {
            "name": "Crohn's Disease",
            "score": 8.333333333333332
        },
        {
            "name": "Migraines",
            "score": 3.586587436332767
        },
        {
            "name": "PMS",
            "score": 2.9286926994906617
        }
    ],
    "description": "<p>Double Tangie Banana is a sativa-dominant hybrid strain developed by Crockett Family Farms. Supposedly a cross between Banana Sherbert and DNA Genetics&rsquo; orange-flavored <a href=\"https://www.leafly.com/sativa/tangie\">Tangie</a>, Double Tangie Banana oozes with crystal resin and citrus aromas. Anyone who has tried Tangie knows that this strain was primarily bred for the flavor enthusiasts, so if you&rsquo;re searching for a strain with an impressive terpene profile, look no further.</p>\n",
    "descriptionPlain": "Double Tangie Banana is a sativa-dominant hybrid strain developed by Crockett Family Farms. Supposedly a cross between Banana Sherbert and DNA Genetics&rsquo; orange-flavored Tangie, Double Tangie Banana oozes with crystal resin and citrus aromas. Anyone who has tried Tangie knows that this strain was primarily bred for the flavor enthusiasts, so if you&rsquo;re searching for a strain with an impressive terpene profile, look no further.\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 83.40407470288625
        },
        {
            "name": "Happy",
            "score": 73.16072439162423
        },
        {
            "name": "Energetic",
            "score": 60.81989247311829
        },
        {
            "name": "Relaxed",
            "score": 56.13327674023769
        },
        {
            "name": "Euphoric",
            "score": 46.75297113752122
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 39.940577249575554
        },
        {
            "name": "Citrus",
            "score": 38.09069043576683
        },
        {
            "name": "Tropical",
            "score": 28.710384833050366
        },
        {
            "name": "Orange",
            "score": 24.22891907187323
        },
        {
            "name": "Lemon",
            "score": 18.937464629315222
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 63,
        "growNotes": "\n\tYields about 400-600 grams per square meter\n\n",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1417076,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I've got to say I'm writing this review blazed and whatever puns I make in the future, girl I do not apologize for. This strain not only gives me a euphoric high, but damn dude am I like soaring. \n\nyou know what's odd though, I get the munchies right, and every time I light the bowl, the smoke smells like papa Murphys pizza. My girl tells me right now, as I relay my review to her for laughs to make me feel appreciated, that that was the highest thing I could've ever said. \n\nAnywho, this stuff also before smoking it smells of fruit, so it's odd that it smells like a veggie table later, weird huh?! \n\nanyways I noticed I didn't make any puns and that's just terrible. \n\nlast thing before I go I think, negatives include\ncotton mouth and dry eyes. \n\nmy review was also recommended by four out of five people. have a splendid day \n\n#GiggleBushSmokerOut",
            "username": "KiKatPaddyWhack"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/BAHO8pEszscczBasvcQqCmMpykU=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fs2dKkQcRlG5r0OXnQJq1_33785664_401082700407679_4104153061658722304_n.jpg",
            "id": 1642966,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Today I have this Double Tangie Banana from Venom Extracts.  The taste is a sweet, earthy, citrus taste at first with a smooth, sweet, banana, and tangerine aftertaste that hangs on for a few minutes. https://freemycure.org/2018/05/venoms-extracts-double-tangie-banana-shatter/",
            "username": "DocGreenhaze"
        }
    ],
    "id": 180207,
    "name": "Double Tangie Banana",
    "negatives": [
        {
            "name": "Dry Eyes",
            "score": 35.07003395585739
        },
        {
            "name": "Dry Mouth",
            "score": 11.682937181663837
        },
        {
            "name": "Dizzy",
            "score": 5.49660441426146
        },
        {
            "name": "Anxious",
            "score": 3.8837011884550083
        },
        {
            "name": "Headache",
            "score": 1.644736842105263
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/tangie",
            "category": "Sativa",
            "name": "Tangie",
            "permalink": "https://mobileapi.leafly.com/sativa/tangie",
            "slug": "tangie",
            "subtitle": null,
            "symbol": "Tg"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/double-tangie-banana",
    "photoTotalCount": 13,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002226/b/double-tangie-banana__primary_4bec.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/double-tangie-banana_100x100_0827.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/670730/b/double-tangie-banana__primary_dad5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/double-tangie-banana_100x100_810c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630508/b/double-tangie-banana__primary_8a81.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/double-tangie-banana_100x100_c90a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/591501/b/double-tangie-banana__primary_3222.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/double-tangie-banana_100x100_fa7d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/553316/b/double-tangie-banana__primary_e0fe.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/double-tangie-banana_100x100_1385.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/526925/b/double-tangie-banana__primary_1793.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/double-tangie-banana_100x100_5324.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Seattle, WA",
        "Eugene, OR",
        "Spokane, WA",
        "Bellevue, WA",
        "Tucson, AZ",
        "Los Angeles, CA",
        "Phoenix, AZ",
        "Shoreline, WA",
        "Airway Heights, WA"
    ],
    "rating": 4.43,
    "relatedStrains": [],
    "reviewCount": 90,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "double-tangie-banana",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.43333333333333/240",
    "subtitle": null,
    "symbol": "Dtb",
    "symptoms": [
        {
            "name": "Stress",
            "score": 46.75297113752122
        },
        {
            "name": "Depression",
            "score": 45.10823429541596
        },
        {
            "name": "Fatigue",
            "score": 30.23132427843803
        },
        {
            "name": "Nausea",
            "score": 30.19949066213922
        },
        {
            "name": "Lack of Appetite",
            "score": 28.31777023203169
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
