{"sl_translate":"description,descriptionPlain,category","id":172783,"slug":"jenny-kush","name":"Jenny Kush","subtitle":null,"symbol":"Jnk","category":"Hybrid","description":"\u003cp\u003eJenny Kush is a hybrid cannabis strain named in memory of Jenny Monson, a cannabis activist who passed away in 2013. The strain was originally bred by Rare Dankness Seeds with all proceeds going toward the Jenny Kush Foundation, a charity established to help support her children. This hybrid introduces herself with a sweet earthy aroma cut with the sharp zesty sweetness of citrus and lemon. \u003ca href=\"https://www.leafly.com/sativa/amnesia-haze\"\u003eAmnesia Haze\u003c/a\u003e and Rare Dankness #2 are believed to have parented Jenny Kush, giving this strain a balance of sativa and indica effects. Providing soothing relaxation with an uplifting burst, Jenny Kush is suitable for use any time of the day.\u003c/p\u003e\n","descriptionPlain":"Jenny Kush is a hybrid cannabis strain named in memory of Jenny Monson, a cannabis activist who passed away in 2013. The strain was originally bred by Rare Dankness Seeds with all proceeds going toward the Jenny Kush Foundation, a charity established to help support her children. This hybrid introduces herself with a sweet earthy aroma cut with the sharp zesty sweetness of citrus and lemon. Amnesia Haze and Rare Dankness #2 are believed to have parented Jenny Kush, giving this strain a balance of sativa and indica effects. Providing soothing relaxation with an uplifting burst, Jenny Kush is suitable for use any time of the day.\n","aka":"Jenny\u0027s Kush, Jennys Kush, Jenny Cush, Jenny\u0027s Cush, Jennys Cush","rating":4.55,"highlightedReviews":[{"id":1390414,"username":"chronicallymedicated","text":"Initial impression: My bud-tender told me about this strain, and how it was named after a cannabis activist, the late Jenny Monson. Anything named after an activist in my experience has been always top quality, (cannaseur) quality take for example the late Jack Herer, that strain is one of the hardest hitting sativas in the industry. My initial impression was nothing short of dreamy and here is why.\n\nI use a scale of 10 points, 10 being the highest possible score in any category, with 3 total categories, Taste / Aroma / Potency.\n\nAroma: 9.5\nWhen I first stuck my nose into the large glass jar containing all of the sticky, dense buds I could barely contain my enthusiasm. I don\u0027t normally remark out loud, but I did quietly mutter \"damn\". That is a first for me, I hope anyone that has a similar experience to mine to please share. This in my humble opinion is in my personal top 5 strains EVER.\n\nTaste: 10\nThe taste was angelic. I actually smiled as I exhaled what tasted like a warm coco-nuts. The tropical tones in this strain are potent and almost seem to dance on my taste buds. Hands down the best tasting cannabis I have had to date. The people over at \"Rare Darkness Seeds\" should be proud of their creation. I would encourage the growers to enter this into the Cannabis Cup and see what happens, you never know.\n\nPotency: 8.5\nThe strength of this euphoria was splendiferious. I was surprised at how quick my head went into the clouds and seemed to stay there. I really did enjoy the high I got from this strain. This strain is truly unique, I would encourage anyone to try this strain. I offer my personal guarantee, if you do not like it, send it to me and Ill smoke it for you.\n\nFinal opinion: This strain was awarded the highest possible marks for taste. Overall this score is reflective of the high quality of this product. I will be purchasing this strain again, and in bulk. I refuse to let a strain like this get away, I might even grow it.\n\nTotal points awarded:  28 out of 30, this is the highest score I have awarded a strain to date; seriously, try the Jenny Kush, you will not be disappointed, this strain is seriously a cannabis aficionado\u0027s dream.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1617937,"username":"GCS18","text":"Very relaxing.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-19058","title":"6 Movie Soundtracks to Listen to While High","author":"Hannah Meadows","category":null,"date":"\/Date(1487715733000)\/","text":"Since the dawn of the silver screen, music and movies have gone together like Thelma and Louise. In the old films of yesteryear, when audio technology for spoken dialogue was not yet established, music brought to life the actions and scenes presented to an audience without the use of speech. Since then, tunes in movies have played a large part in manipulating audience emotion and setting tones for dramatic, comedic, horrific, and all manner of theatrical movements.\nTo celebrate the upcoming Oscars awards ceremony (which airs Sunday, February 26), we compiled a range of movie soundtracks to listen to while high. From past Academy Award winners to general good beats, turn off your screens and instead opt for a pair of headphones to truly soak in these incredible scores.\nThe Lord of the Rings\n\nThis entire adventure series was composed, conducted, produced, and orchestrated by Howard Shore, who contributed more than 10 hours of music for the epic saga. The films’ scores were so enigmatic that two of them took home Academy awards for Best Original Score – one for The Fellowship of the Ring (2002) and one for The Return of the King (2004).\nBased on our own personal experience, we couldn’t possibly turn our noses up at one of the best and most emotional instrumental scores punctuating The Lord of the Rings series. From the moment we hear those familiar Hobbit-inspired flutes to the dramatic deep strings regaling Sauron’s lair, listening to this broad soundtrack is a mix of nostalgia and a new sense of adventure. Clear your schedule for hours of bold and beautiful tunes, and be sure to pair this daring collection with the hybrid Hobbit.\nPretty in Pink\n\nThough this film’s soundtrack didn’t take home any awards, it’d be a mistake not to include it in our collection of picks. You’ll be bringing back the ’80s with now-classics (considered “new wave” at the time) played in one of John Hughes’ biggest hits. From bands New Order to The Smiths, we don’t think you’ll mind getting any of these tracks stuck in your head. Dance your heart out and pair this movie soundtrack with the sweet hybrid Pink Kush.\nWilly Wonka and the Chocolate Factory\n\nThis 1971 children’s classic gave audiences around the world a wild ride that also extends to its assorted soundtrack. From sticky-sweet “The Candy Man” to Charlie’s mother’s lamenting “Cheer-Up Charlie,” all the way to the odd fear-driven track accompanying the infamous tunnel scene, the original Willy Wonka touches on all facets of human emotion. Gather up your favorite candy and pair this soundtrack with its perfect match, sativa Willy Wonka.\nLife of Pi\n\nWorldly, charismatic, and just plain beautiful, the Life of Pi score won the 2013 Academy Award for Best Original Music Score as well as the Golden Globe for the same title (composed by Mychael Danna). Cranking up this soundtrack is sure to transport you to faraway lands. We recommend pairing Life of Pi’s gorgeous pieces with the cerebral indica Tiger’s Milk.\nForrest Gump\n\nReaching gold and platinum status from countries around the world, the Forrest Gump soundtrack is flanked with its own original score as well as a huge array of classic rock pieces. It was nominated for Best Music and Original Score in 1995 (beat out by The Lion King), and it’s definitely not difficult to see why. From Scott McKenzie’s “San Francisco” to Simon and Garfunkel’s “Mrs. Robinson,” be sure to light up the hybrid Jenny Kush and sink into the various tunes of the late greats.\nInterstellar\n\nIf you’re looking to smoke up alongside tracks that could transport you across planes of time, look no further than the music of Interstellar. We recommend you invest in a little star projector, shut off all the lights in your room, and bask in the mind-blowing complexities of the universe while the Interstellar score quietly plays in your ears. Pair this haunting soundtrack with the indica StarBud or the intense sativa Timewreck.\nHave your own soundtrack suggestions? Leave them in the comments below!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/02/21142338/soundtracks-to-listen-to.jpg","urlslug":"/news/lifestyle/6-movie-soundtracks-listen-high"},{"id":"contentitems-3357","title":"New Strains Alert: Pearl Scout Cookies, Jenny Kush, NightFire OG, Ken\u0027s Kush and More","author":"Bailey Rahn","category":null,"date":"\/Date(1437763020000)\/","text":"More strains were just added to the Leafly strain database, and based on the number of requests we\u0027ve gotten for these, we know at least some of you have given them a try. Go leave a strain review if you\u0027ve run into any of these in your strain hunting!\nDid one of these catch your eye? Check if it\u0027s carried at a nearby shop or dispensary by navigating to the strain page and clicking the \"Availability\" tab.\n 1. Pearl Scout Cookies\n\nPearl Scout Cookies, a GSC (f.k.a Girl Scout Cookies) hybrid, is a cannabis strain developed by Fireline for recreational shops in Washington State. With a THC content that tends to push past 23%, Pearl Scout Cookies is best suited for consumers with a high tolerance. Its dense, chunky buds take on a zesty citrus aroma that brings to mind fresh lemons and oranges. Uplifting euphoria floods the mind and provides a boost of cerebral energy to fuel creativity and happiness.\n\n \n 2. Sweet and Sour Widow\n\nBred by CBD Crew, Sweet and Sour Widow is a 70/30 indica-dominant cannabis strain with a 1:1 CBD-THC ratio and a subtle sweet onion aroma. Because of its balanced cannabinoid profile, Sweet and Sour Widow’s psychoactive effects are mild, making this strain suitable for novice consumers and patients needing to medicate without a foggy head. Sweet and Sour Widow is derived from White Widow genetics and an unnamed sativa-hybrid to accentuate its CBD profile.\n\n \n 3. NightFire OG\n\nNightFire OG by Sin City Seeds is a sativa-dominant hybrid that descends from parent strains White Fire OG and White Nightmare. With strong roots in the White family, you can depend on this cannabis strain to deliver a disorienting dose of euphoria that lets you forget life’s stressors as relaxation takes over mind and body. Earthy pine, sharp lemon, and sweet berry aromas radiate from NightFire OG’s crystal-coated buds, inviting you to indulge in this hard-hitting hybrid.\n\n \n 4. Jenny Kush\n\nJenny Kush is a hybrid cannabis strain named in memory of Jenny Monson, a cannabis activist who passed away in 2013. The strain was originally bred by Rare Dankness Seeds with all proceeds going toward the Jenny Kush Foundation, a charity established to help support her children. This hybrid introduces herself with a sweet earthy aroma cut with the sharp zesty sweetness of citrus and lemon. Amnesia Haze and Rare Dankness #2 are believed to have parented Jenny Kush, giving this strain a balance of sativa and indica effects. Providing soothing relaxation with an uplifting burst, Jenny Kush is suitable for use any time of the day.\n\n \n 5. Dance World\n\nDance World is a high-CBD sativa strain bred by Royal Queen Seeds in Spain. A cross between Dancehall and Juanita La Lagrimosa, Dance World’s heritage stems primarily from Afghani and Mexican genetics. From its Dancehall parent, Dance World inherits active, uplifting effects that motivate productivity and a positive mindset. Earthy and spicy flavors dominate the palate, but subtle fruity notes bring Dance World sweet undertones. While Dance World shows its sativa genetics in its energetic effects, Dance World plants are more indica in stature and flower after just 8 weeks.\n\n \n 6. Chemdawg Sour Diesel\n\nChemdawg Sour Diesel (or Chem Sour) from Reservoir Seeds is a sativa-dominant hybrid cannabis strain that combines champion genetics from Chemdawg D and Sour Diesel. With a sharp sour bite, Chemdawg Sour Diesel has a funky fuel and earthy pine aroma that stuns the senses. Its buzzing euphoria leaves you feeling elevated and uplifted, but anxiety-prone individuals should tread carefully with this high-flying sativa.\n\n \n 7. Ken\u0027s Kush\n\nKen’s Kush is a potent hybrid cannabis strain bred by Ken Estes that crosses his famous Granddaddy Purple with the equally esteemed OG Kush and Sour Diesel. Together these parents pass on a flavor profile of sweet berries, sour skunk, and grassy earth. Dreamy relaxation pours over the mind and body, helping you feel serene without the sedation typically associated with heavy indica varieties.\n\nClick on the image to check out other new strains recently added to the Leafly Explorer!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/07/12002258/new-strains-alert-pearl-scout-cookies-jenny-kush-nightfire-og-ken.jpg","urlslug":"/news/strains-products/new-strains-alert-pearl-scout-cookies-jenny-kush-nightfire-og-ken"}],"reviewCount":69,"flavors":[{"name":"Sweet","score":47.600596125186286},{"name":"Citrus","score":36.460506706408353},{"name":"Earthy","score":26.959761549925489},{"name":"Pine","score":20.730253353204176},{"name":"Pungent","score":15.730253353204173}],"effects":[{"name":"Happy","score":94.88077496274218},{"name":"Relaxed","score":73.248882265275711},{"name":"Uplifted","score":67.928464977645291},{"name":"Euphoric","score":60.469448584202674},{"name":"Energetic","score":60.0521609538003}],"symptoms":[{"name":"Stress","score":52.511177347242921},{"name":"Pain","score":52.190760059612515},{"name":"Depression","score":47.600596125186286},{"name":"Nausea","score":35.230998509687041},{"name":"Insomnia","score":30.640834575260808}],"conditions":[{"name":"Anxiety","score":50.0521609538003},{"name":"Hypertension","score":19.500745156482864},{"name":"Migraines","score":16.549925484351714},{"name":"Bipolar Disorder","score":14.500745156482862},{"name":"Tinnitus","score":14.090909090909092}],"negatives":[{"name":"Dry Eyes","score":19.001490312965725},{"name":"Dry Mouth","score":17.779433681073026},{"name":"Paranoid","score":5.4098360655737707},{"name":"Dizzy","score":0.819672131147541},{"name":"Headache","score":0.819672131147541}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jenny-kush_100x100_f65f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630316/b/jenny-kush__primary_0fc1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jenny-kush_100x100_17c1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/618477/b/jenny-kush__primary_c7e2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jenny-kush_100x100_2651.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/615565/b/jenny-kush__primary_e8c4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jenny-kush_100x100_94a9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/615154/b/jenny-kush__primary_edc6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jenny-kush_100x100_3a2e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/496752/b/jenny-kush__primary_d2c8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jenny-kush_100x100_2ebf.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/429707/b/jenny-kush__primary_65c9.jpg"}],"photoTotalCount":8,"popularCities":["Las Vegas, NV","Seattle, WA","Spokane, WA","Tucson, AZ","Tacoma, WA","Airway Heights, WA","Bothell, WA","Buckley, WA","Casa Grande, AZ","Denver, CO"],"permalink":"https://mobileapi.leafly.com/hybrid/jenny-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.55072463768116/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Amnesia Haze","subtitle":null,"slug":"amnesia-haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/amnesia-haze","symbol":"Amh","applink":"leafly://strain/amnesia-haze"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":172783,"slug":"jenny-kush","name":"Jenny Kush","subtitle":null,"symbol":"Jnk","category":"Hybrid","description":"\u003cp\u003eJenny Kush is a hybrid cannabis strain named in memory of Jenny Monson, a cannabis activist who passed away in 2013. The strain was originally bred by Rare Dankness Seeds with all proceeds going toward the Jenny Kush Foundation, a charity established to help support her children. This hybrid introduces herself with a sweet earthy aroma cut with the sharp zesty sweetness of citrus and lemon. \u003ca href=\"https://www.leafly.com/sativa/amnesia-haze\"\u003eAmnesia Haze\u003c/a\u003e and Rare Dankness #2 are believed to have parented Jenny Kush, giving this strain a balance of sativa and indica effects. Providing soothing relaxation with an uplifting burst, Jenny Kush is suitable for use any time of the day.\u003c/p\u003e\n","descriptionPlain":"Jenny Kush is a hybrid cannabis strain named in memory of Jenny Monson, a cannabis activist who passed away in 2013. The strain was originally bred by Rare Dankness Seeds with all proceeds going toward the Jenny Kush Foundation, a charity established to help support her children. This hybrid introduces herself with a sweet earthy aroma cut with the sharp zesty sweetness of citrus and lemon. Amnesia Haze and Rare Dankness #2 are believed to have parented Jenny Kush, giving this strain a balance of sativa and indica effects. Providing soothing relaxation with an uplifting burst, Jenny Kush is suitable for use any time of the day.\n","aka":"Jenny\u0027s Kush, Jennys Kush, Jenny Cush, Jenny\u0027s Cush, Jennys Cush","rating":4.55,"highlightedReviews":[{"id":1390414,"username":"chronicallymedicated","text":"Initial impression: My bud-tender told me about this strain, and how it was named after a cannabis activist, the late Jenny Monson. Anything named after an activist in my experience has been always top quality, (cannaseur) quality take for example the late Jack Herer, that strain is one of the hardest hitting sativas in the industry. My initial impression was nothing short of dreamy and here is why.\n\nI use a scale of 10 points, 10 being the highest possible score in any category, with 3 total categories, Taste / Aroma / Potency.\n\nAroma: 9.5\nWhen I first stuck my nose into the large glass jar containing all of the sticky, dense buds I could barely contain my enthusiasm. I don\u0027t normally remark out loud, but I did quietly mutter \"damn\". That is a first for me, I hope anyone that has a similar experience to mine to please share. This in my humble opinion is in my personal top 5 strains EVER.\n\nTaste: 10\nThe taste was angelic. I actually smiled as I exhaled what tasted like a warm coco-nuts. The tropical tones in this strain are potent and almost seem to dance on my taste buds. Hands down the best tasting cannabis I have had to date. The people over at \"Rare Darkness Seeds\" should be proud of their creation. I would encourage the growers to enter this into the Cannabis Cup and see what happens, you never know.\n\nPotency: 8.5\nThe strength of this euphoria was splendiferious. I was surprised at how quick my head went into the clouds and seemed to stay there. I really did enjoy the high I got from this strain. This strain is truly unique, I would encourage anyone to try this strain. I offer my personal guarantee, if you do not like it, send it to me and Ill smoke it for you.\n\nFinal opinion: This strain was awarded the highest possible marks for taste. Overall this score is reflective of the high quality of this product. I will be purchasing this strain again, and in bulk. I refuse to let a strain like this get away, I might even grow it.\n\nTotal points awarded:  28 out of 30, this is the highest score I have awarded a strain to date; seriously, try the Jenny Kush, you will not be disappointed, this strain is seriously a cannabis aficionado\u0027s dream.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1617937,"username":"GCS18","text":"Very relaxing.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-19058","title":"6 Movie Soundtracks to Listen to While High","author":"Hannah Meadows","category":null,"date":"\/Date(1487715733000)\/","text":"Since the dawn of the silver screen, music and movies have gone together like Thelma and Louise. In the old films of yesteryear, when audio technology for spoken dialogue was not yet established, music brought to life the actions and scenes presented to an audience without the use of speech. Since then, tunes in movies have played a large part in manipulating audience emotion and setting tones for dramatic, comedic, horrific, and all manner of theatrical movements.\nTo celebrate the upcoming Oscars awards ceremony (which airs Sunday, February 26), we compiled a range of movie soundtracks to listen to while high. From past Academy Award winners to general good beats, turn off your screens and instead opt for a pair of headphones to truly soak in these incredible scores.\nThe Lord of the Rings\n\nThis entire adventure series was composed, conducted, produced, and orchestrated by Howard Shore, who contributed more than 10 hours of music for the epic saga. The films’ scores were so enigmatic that two of them took home Academy awards for Best Original Score – one for The Fellowship of the Ring (2002) and one for The Return of the King (2004).\nBased on our own personal experience, we couldn’t possibly turn our noses up at one of the best and most emotional instrumental scores punctuating The Lord of the Rings series. From the moment we hear those familiar Hobbit-inspired flutes to the dramatic deep strings regaling Sauron’s lair, listening to this broad soundtrack is a mix of nostalgia and a new sense of adventure. Clear your schedule for hours of bold and beautiful tunes, and be sure to pair this daring collection with the hybrid Hobbit.\nPretty in Pink\n\nThough this film’s soundtrack didn’t take home any awards, it’d be a mistake not to include it in our collection of picks. You’ll be bringing back the ’80s with now-classics (considered “new wave” at the time) played in one of John Hughes’ biggest hits. From bands New Order to The Smiths, we don’t think you’ll mind getting any of these tracks stuck in your head. Dance your heart out and pair this movie soundtrack with the sweet hybrid Pink Kush.\nWilly Wonka and the Chocolate Factory\n\nThis 1971 children’s classic gave audiences around the world a wild ride that also extends to its assorted soundtrack. From sticky-sweet “The Candy Man” to Charlie’s mother’s lamenting “Cheer-Up Charlie,” all the way to the odd fear-driven track accompanying the infamous tunnel scene, the original Willy Wonka touches on all facets of human emotion. Gather up your favorite candy and pair this soundtrack with its perfect match, sativa Willy Wonka.\nLife of Pi\n\nWorldly, charismatic, and just plain beautiful, the Life of Pi score won the 2013 Academy Award for Best Original Music Score as well as the Golden Globe for the same title (composed by Mychael Danna). Cranking up this soundtrack is sure to transport you to faraway lands. We recommend pairing Life of Pi’s gorgeous pieces with the cerebral indica Tiger’s Milk.\nForrest Gump\n\nReaching gold and platinum status from countries around the world, the Forrest Gump soundtrack is flanked with its own original score as well as a huge array of classic rock pieces. It was nominated for Best Music and Original Score in 1995 (beat out by The Lion King), and it’s definitely not difficult to see why. From Scott McKenzie’s “San Francisco” to Simon and Garfunkel’s “Mrs. Robinson,” be sure to light up the hybrid Jenny Kush and sink into the various tunes of the late greats.\nInterstellar\n\nIf you’re looking to smoke up alongside tracks that could transport you across planes of time, look no further than the music of Interstellar. We recommend you invest in a little star projector, shut off all the lights in your room, and bask in the mind-blowing complexities of the universe while the Interstellar score quietly plays in your ears. Pair this haunting soundtrack with the indica StarBud or the intense sativa Timewreck.\nHave your own soundtrack suggestions? Leave them in the comments below!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/02/21142338/soundtracks-to-listen-to.jpg","urlslug":"/news/lifestyle/6-movie-soundtracks-listen-high"},{"id":"contentitems-3357","title":"New Strains Alert: Pearl Scout Cookies, Jenny Kush, NightFire OG, Ken\u0027s Kush and More","author":"Bailey Rahn","category":null,"date":"\/Date(1437763020000)\/","text":"More strains were just added to the Leafly strain database, and based on the number of requests we\u0027ve gotten for these, we know at least some of you have given them a try. Go leave a strain review if you\u0027ve run into any of these in your strain hunting!\nDid one of these catch your eye? Check if it\u0027s carried at a nearby shop or dispensary by navigating to the strain page and clicking the \"Availability\" tab.\n 1. Pearl Scout Cookies\n\nPearl Scout Cookies, a GSC (f.k.a Girl Scout Cookies) hybrid, is a cannabis strain developed by Fireline for recreational shops in Washington State. With a THC content that tends to push past 23%, Pearl Scout Cookies is best suited for consumers with a high tolerance. Its dense, chunky buds take on a zesty citrus aroma that brings to mind fresh lemons and oranges. Uplifting euphoria floods the mind and provides a boost of cerebral energy to fuel creativity and happiness.\n\n \n 2. Sweet and Sour Widow\n\nBred by CBD Crew, Sweet and Sour Widow is a 70/30 indica-dominant cannabis strain with a 1:1 CBD-THC ratio and a subtle sweet onion aroma. Because of its balanced cannabinoid profile, Sweet and Sour Widow’s psychoactive effects are mild, making this strain suitable for novice consumers and patients needing to medicate without a foggy head. Sweet and Sour Widow is derived from White Widow genetics and an unnamed sativa-hybrid to accentuate its CBD profile.\n\n \n 3. NightFire OG\n\nNightFire OG by Sin City Seeds is a sativa-dominant hybrid that descends from parent strains White Fire OG and White Nightmare. With strong roots in the White family, you can depend on this cannabis strain to deliver a disorienting dose of euphoria that lets you forget life’s stressors as relaxation takes over mind and body. Earthy pine, sharp lemon, and sweet berry aromas radiate from NightFire OG’s crystal-coated buds, inviting you to indulge in this hard-hitting hybrid.\n\n \n 4. Jenny Kush\n\nJenny Kush is a hybrid cannabis strain named in memory of Jenny Monson, a cannabis activist who passed away in 2013. The strain was originally bred by Rare Dankness Seeds with all proceeds going toward the Jenny Kush Foundation, a charity established to help support her children. This hybrid introduces herself with a sweet earthy aroma cut with the sharp zesty sweetness of citrus and lemon. Amnesia Haze and Rare Dankness #2 are believed to have parented Jenny Kush, giving this strain a balance of sativa and indica effects. Providing soothing relaxation with an uplifting burst, Jenny Kush is suitable for use any time of the day.\n\n \n 5. Dance World\n\nDance World is a high-CBD sativa strain bred by Royal Queen Seeds in Spain. A cross between Dancehall and Juanita La Lagrimosa, Dance World’s heritage stems primarily from Afghani and Mexican genetics. From its Dancehall parent, Dance World inherits active, uplifting effects that motivate productivity and a positive mindset. Earthy and spicy flavors dominate the palate, but subtle fruity notes bring Dance World sweet undertones. While Dance World shows its sativa genetics in its energetic effects, Dance World plants are more indica in stature and flower after just 8 weeks.\n\n \n 6. Chemdawg Sour Diesel\n\nChemdawg Sour Diesel (or Chem Sour) from Reservoir Seeds is a sativa-dominant hybrid cannabis strain that combines champion genetics from Chemdawg D and Sour Diesel. With a sharp sour bite, Chemdawg Sour Diesel has a funky fuel and earthy pine aroma that stuns the senses. Its buzzing euphoria leaves you feeling elevated and uplifted, but anxiety-prone individuals should tread carefully with this high-flying sativa.\n\n \n 7. Ken\u0027s Kush\n\nKen’s Kush is a potent hybrid cannabis strain bred by Ken Estes that crosses his famous Granddaddy Purple with the equally esteemed OG Kush and Sour Diesel. Together these parents pass on a flavor profile of sweet berries, sour skunk, and grassy earth. Dreamy relaxation pours over the mind and body, helping you feel serene without the sedation typically associated with heavy indica varieties.\n\nClick on the image to check out other new strains recently added to the Leafly Explorer!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/07/12002258/new-strains-alert-pearl-scout-cookies-jenny-kush-nightfire-og-ken.jpg","urlslug":"/news/strains-products/new-strains-alert-pearl-scout-cookies-jenny-kush-nightfire-og-ken"}],"reviewCount":69,"flavors":[{"name":"Sweet","score":47.600596125186286},{"name":"Citrus","score":36.460506706408353},{"name":"Earthy","score":26.959761549925489},{"name":"Pine","score":20.730253353204176},{"name":"Pungent","score":15.730253353204173}],"effects":[{"name":"Happy","score":94.88077496274218},{"name":"Relaxed","score":73.248882265275711},{"name":"Uplifted","score":67.928464977645291},{"name":"Euphoric","score":60.469448584202674},{"name":"Energetic","score":60.0521609538003}],"symptoms":[{"name":"Stress","score":52.511177347242921},{"name":"Pain","score":52.190760059612515},{"name":"Depression","score":47.600596125186286},{"name":"Nausea","score":35.230998509687041},{"name":"Insomnia","score":30.640834575260808}],"conditions":[{"name":"Anxiety","score":50.0521609538003},{"name":"Hypertension","score":19.500745156482864},{"name":"Migraines","score":16.549925484351714},{"name":"Bipolar Disorder","score":14.500745156482862},{"name":"Tinnitus","score":14.090909090909092}],"negatives":[{"name":"Dry Eyes","score":19.001490312965725},{"name":"Dry Mouth","score":17.779433681073026},{"name":"Paranoid","score":5.4098360655737707},{"name":"Dizzy","score":0.819672131147541},{"name":"Headache","score":0.819672131147541}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jenny-kush_100x100_f65f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630316/b/jenny-kush__primary_0fc1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jenny-kush_100x100_17c1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/618477/b/jenny-kush__primary_c7e2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jenny-kush_100x100_2651.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/615565/b/jenny-kush__primary_e8c4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jenny-kush_100x100_94a9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/615154/b/jenny-kush__primary_edc6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jenny-kush_100x100_3a2e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/496752/b/jenny-kush__primary_d2c8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jenny-kush_100x100_2ebf.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/429707/b/jenny-kush__primary_65c9.jpg"}],"photoTotalCount":8,"popularCities":["Las Vegas, NV","Seattle, WA","Spokane, WA","Tucson, AZ","Tacoma, WA","Airway Heights, WA","Bothell, WA","Buckley, WA","Casa Grande, AZ","Denver, CO"],"permalink":"https://mobileapi.leafly.com/hybrid/jenny-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.55072463768116/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Amnesia Haze","subtitle":null,"slug":"amnesia-haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/amnesia-haze","symbol":"Amh","applink":"leafly://strain/amnesia-haze"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
