{"sl_translate":"description,descriptionPlain,category","id":167,"slug":"cotton-candy-kush","name":"Cotton Candy Kush","subtitle":null,"symbol":"Cck","category":"Hybrid","description":"\u003cp\u003eNamed for its soft, fluffy appearance and intense candied aroma, Cotton Candy Kush is a \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e that crosses \u003ca href=\"http://www.leafly.com/indica/lavender\"\u003eLavender\u003c/a\u003e with \u003ca href=\"http://www.leafly.com/sativa/power-plant\"\u003ePower Plant\u003c/a\u003e. The result is a \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-pungent\"\u003epungent\u003c/a\u003e palate of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-berry\"\u003eberry\u003c/a\u003e flavors and a \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-flowery\"\u003efloral\u003c/a\u003e scent. The \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\"\u003eeuphoric\u003c/a\u003e effects will have you feeling like a kid in a candy store, while the \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003erelaxing\u003c/a\u003e powers will keep \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e\u0026nbsp;to\u0026nbsp;a minimum.\u003c/p\u003e\n","descriptionPlain":"Named for its soft, fluffy appearance and intense candied aroma, Cotton Candy Kush is a hybrid that crosses Lavender with Power Plant. The result is a pungent palate of sweet, berry flavors and a floral scent. The euphoric effects will have you feeling like a kid in a candy store, while the relaxing powers will keep stress and pain\u0026nbsp;to\u0026nbsp;a minimum.\n","aka":"Cotton Candy","rating":4.31,"highlightedReviews":[{"id":1415434,"username":"SpeedyOnion","text":"Maybe it\u0027s just the first time in a while since I\u0027ve really been mindful of how I feel when I\u0027m high. Or maybe I\u0027m just really high. At any rate, I feel spectacular right now. I got a half ounce of this, brought it home, and was taken aback by how beautiful this bud was. It\u0027s absolutely covered in trichomes, and some of these buds are the deepest purple I\u0027ve seen. That was something I was not expecting. The smell is something ethereal. I won\u0027t even bother trying to describe it as I\u0027m sure I would fall short. There\u0027s some trippy effects here when I close my eyes. I\u0027m going to focus on that now. Buy this weed if you are ever so lucky as I was to find some. You will not regret it. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"},{"id":1642059,"username":"WhoGirl","text":"I love this strain I\u0027m a newbie but I like felt one with everything. I remember everything clearly ...At one point I thought I was floating and then remembered I was on the floor...so then I was convinced my floor was a magic carpet... which of course made my room a Transformer...lol I know that seems like my mind was racing but it totally wasn\u0027t that was the weird part. I just felt sooo chill ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-66121","title":"Try These Strains Before Attending Your Next Sporting Event","author":"Dante Jordan","category":null,"date":"\/Date(1526423695000)\/","text":"If you don’t get high before attending a sporting event, then you’re doing it all wrong. I mean, sure, you can have a good time while being sober, but you can have a great time while being lifted.\nSo with that said, I curated a list of suggested strains for you to indulge in, depending on which sport you’re going to see. Peep the list, use Leafly’s Finder to locate the dispensaries stocking these strains, purchase, and enjoy some good ol’ sportsball.\nStrains to Pair With Exciting Sports (Basketball, Football, Soccer, Hockey)\nSports that fall under this category are the types of sports that include constant back and forth action, which keeps you engaged from start to finish. A big play is always looming, so you’re stuck to the edge of your seat because you don’t want to miss that big dunk or the chance to yell “GOOOOAAALLLLL” in the face of whoever’s sitting next to you. For that reason, you should indulge in strains that’ll have you uplifted and energetic, feeling hyped and ready for that big moment.\n  Candyland\nCandyland’s a high-THC, sativa-dominant hybrid that’ll have you super smacked without the paranoia. As a mix of Grandaddy Purple and Platinum GSC, it’s got an earthy type of scent and a sweet flavor, with effects that will have you uplifted, engaged, and in a whole entire world of euphoria. Smoke these before an exciting sport and those big plays will feel that much bigger.\nFind Candyland Nearby\n  Green Crack\nEveryone knows how good, energized, and focused Green Crack can make you feel. It’s one of those strains that you can smoke and power through the day like you drank 84 cold brews, so it’s perfect to smoke before a sporting event that you want to be locked into.\nFind Green Crack Nearby\n  Cotton Candy Kush\nCotton Candy Kush is another high-THC strain that leaves you feeling good, feeling great, feeling great, feeling good, like Outkast on “GhettoMusick.” As a mix of Power Plant and Lavender, its powerful effects are relaxing yet still energetic while inducing happiness, freedom, and overall euphoria, so you’ll be that much more excited when you see that Ronaldo bicycle kick for the game-winning goal live and in person.\nFind Cotton Candy Kush Nearby\n  Stardawg\nStardawg is one of the best smelling, best tasting, most euphoric, most energetic, most everything strains I’ve ever come across. Gifted to me by LTRMN in Portland, I smoked this and walked around the city for hours, falling in love with everything and everybody. It’s definitely a strain I’d recommend smoking before a sporting event, because every single dunk, touchdown, and goal will likely feel like the greatest moment in sports history for you.\nFind Stardawg Nearby\nStrains to Pair With Chill Sports (Baseball, Golf, Tennis)\nSports that fall under this category tend to be a lot more laid-back and reserved. Baseball games can be long and boring, and golf and tennis matches require damn near complete silence, with light clapping being the most excited you can get, so if you’re overly hyped at any of them, you may feel a bit uncomfortable or out-of-place. These strains will help you lean a little more towards the indica side of things.\n  Obama Kush\nObama Kush is a great indica with a relatively mild THC percentage that’ll chill you out without knocking you out. I smoked a gram joint of Obama Kush a few weeks ago and knocked out the entire first season of Girls Incarcerated on Netflix, which is still shorter than one full-length baseball game.\nFind Obama Kush Nearby\n  Larry OG\nLarry OG is a hybrid of OG Kush and SFV OG, whose indica effects will overtake your body and have you with your feet in the air like your Cares-to-Give Meter is at zero. Smoke a little of this and you’ll have no problem sitting through an entire round of golf, where the most exciting thing possible is a fox running across the course.\nFind Larry OG Nearby\n  Cheese\nCheese is an indica-dominant hybrid that:\n\nactually smells like Cheese, which is wild; and\nwill have you feeling relaxed while avoiding the sleepy sleepy nap nap state of mind.\n\nYou can smoke some Cheese and kick back in comfort for hours, so if you’re going to see one of the chill sports where everything’s deathly silent and calm, Cheese is a good strain to indulge in beforehand.\nFind Cheese Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/05/15152818/strains-before-sports-event.jpg","urlslug":"/news/strains-products/try-these-strains-before-attending-your-next-sporting-event"},{"id":"contentitems-2969","title":"10 Strain Pairings to Help You Celebrate Spring","author":"Kayla Williams","category":null,"date":"\/Date(1395349200000)\/","text":"After a brutal winter that ravaged most of the United States, many of you are probably thrilled that the first day of spring is finally upon us. To celebrate the arrival of an extra hour of sunlight, blossoming flowers, and warmer weather, here are 10 strains that come in like a lion but stick with you like a lamb.\nPeach Spice\n\nStrain combination: Cotton Candy Kush and Green Queen\n\nThe sweet pear flavor in Cotton Candy Kush is balanced wonderfully by the spicy, nutty character of Green Queen.\nCherry Creamsicle\n\nStrain combination: Vanilla Kush and Cherry Bomb\n\nThe heavier, smooth Vanilla Kush is beautifully complemented by the sweet cherry flavor of the lighter Cherry Bomb.\nStrawberry Mojito\n\nStrain combination: Strawberry Kush and Thin Mint\n\nThe unmistakable Thin Mint flavor and hybrid effects are perfectly balanced by the more physical Strawberry Kush.\nBerry Tartlet\n\nStrain combination: Blackberry Kush and Lemon Haze\n\nThese two strong flavors coupled with contrasting effects provide a balanced, memorable experience.\nBanana Brush\n\nStrain combination: Banana Kush and Durban Poison\n\nThe distinct sweetness of Banana Kush could only be matched with an earthy, uplifting flower like Durban Poison.\nBlue Bayou\n\nStrain combination: Blue Cheese and Blue Haze\n\nBlue cheese and peppered pear is the name of the game with these two acclaimed hybrids.\nWaldorf\n\nStrain combination: SAGE and Island Sweet Skunk\n\nThe spicy sandalwood and earthy flavors of SAGE combined with Island Sweet Skunk’s buttery apple taste creates a pairing reminiscent of a classic Waldorf salad.\nRubies ‘n Roses\n\nStrain combination: White Russian and Grapefruit\n\nIn a happy synthesis of citrus, floral, and earthy undertones, this pair provides a pleasant, invigorating lift.\nTropical Vacation\n\nStrain combination: Pineapple Express and Cannalope Haze\n\nLet this fruity coalescence of sweet pineapple, mango, and berry take you far, far away.\nChocolate Peel\n\nStrain combination: Orange Kush and Chocolope\n\nOrange and chocolate, with additional sweet and earthy undertones, make this pair a no-brainer.\nPhoto credits: header strawberry mint, pear blue cheese, grapefruit, blackberry lemon, cherry vanilla, banana pine, chocolate orange, peach and spices, mango pineapple, apple sage ","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/03/12001233/10-strains-to-help-you-celebrate-spring.jpg","urlslug":"/news/strains-products/10-strains-to-help-you-celebrate-spring"}],"reviewCount":749,"flavors":[{"name":"Sweet","score":56.767611422082581},{"name":"Flowery","score":24.450822827518351},{"name":"Berry","score":24.253978139185079},{"name":"Lavender","score":20.125311755910356},{"name":"Vanilla","score":13.635883959916884}],"effects":[{"name":"Happy","score":79.5184913243421},{"name":"Relaxed","score":74.5748377680209},{"name":"Euphoric","score":67.052398030921424},{"name":"Uplifted","score":56.3074277424859},{"name":"Giggly","score":33.420084958130325}],"symptoms":[{"name":"Stress","score":40.143236791805023},{"name":"Depression","score":30.950153239734725},{"name":"Pain","score":29.955711338551311},{"name":"Headaches","score":21.386566924592973},{"name":"Insomnia","score":14.895132594730693}],"conditions":[{"name":"Anxiety","score":37.106273465298855},{"name":"PMS","score":13.963394876947451},{"name":"Arthritis","score":13.821135341452612},{"name":"Migraines","score":13.394040891673924},{"name":"PTSD","score":12.372622257365466}],"negatives":[{"name":"Dry Mouth","score":35.790433143777811},{"name":"Dry Eyes","score":8.7605082921870032},{"name":"Anxious","score":4.8617758270635338},{"name":"Paranoid","score":2.8343219847741237},{"name":"Dizzy","score":2.528306990763999}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cotton-candy-kush_100x100_f9e7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003409/b/cotton-candy-kush__primary_3fdb.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cotton-candy-kush_100x100_bcf7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002749/b/cotton-candy-kush__primary_d7ce.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cotton-candy-kush_100x100_414c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/673198/b/cotton-candy-kush__primary_42c2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cotton-candy-kush_100x100_d455.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/643357/b/cotton-candy-kush__primary_ace9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cotton-candy-kush_100x100_3715.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/619894/b/cotton-candy-kush__primary_a151.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cotton-candy-kush_100x100_309d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/591884/b/cotton-candy-kush__primary_93f3.jpg"}],"photoTotalCount":231,"popularCities":["Portland, OR","Vancouver, BC","Montréal, QC","Calgary, AB","Los Angeles, CA","China","Eugene, OR","Edmonton, AB","Mississauga, ON","Ottawa, ON"],"permalink":"https://mobileapi.leafly.com/hybrid/cotton-candy-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.30841121495327/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Lavender","subtitle":null,"slug":"lavender","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/lavender","symbol":"Lar","applink":"leafly://strain/lavender"},{"name":"Power Plant","subtitle":null,"slug":"power-plant","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/power-plant","symbol":"Pwp","applink":"leafly://strain/power-plant"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":"Tall","averageYield":"High","environment":null,"growNotes":""}}
