{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1489193666000)/",
            "id": "contentitems-20787",
            "text": "My friends, we made it. The long-awaited weekend is here. But two pressing questions remain: How are you going to spend the weekend and which Washington state cannabis products are going to make it the best ever?\nThe Leafly team (and our industry friends) got together to discuss what our favorites are and how they’ll be enhancing our weekend. Whether you’re planning to kick back at home or get outside (rain or shine), let us help you branch out so you don’t have to take a shot in the dark at some new strains, products, and brands.\nBrowse the Latest Cannabis Products\nFor Your Weekend Gaming Binge\n \nProduct: GaGa Peanut Butter Cups (10mg) \nType: Edible\n“I got myself a Nintendo Switch and the new Zelda game this weekend, and I wanted an edible that would basically cryogenically freeze me to my couch, rendering me unaware of my physical form and immerse me fully in the lush grassy fields of Hyrule. These peanut butter cups by GaGa did just that. I was utterly and completely stoned into oblivion for six to eight hours. The filling tasted more like cannabis than peanut butter, but the experience is what matters most to me.” – Bailey, Leafly Editor\nProduct: The Clear’s Golden Goat\nType: Vape Pen Cartridge\n“The Clear’s Golden Goat vape pen from Fweedom Collective tastes fantastic and you don’t have to hit it as often to get super high – meaning more time for my hands to be on the controller while playing Zelda in bed.” – Fermin, Leafly Developer\n\nFor Spring Cleaning\n\nProduct: Headlight’s Moon Cookies\nType: High-THC Flower, Hybrid\n“I tried Moon Cookies flower by Headlight over the weekend. A few puffs in had me motivated to do all the dishes in the sink! A few more puffs and I was motivated to meal plan for the week. I did both and felt happy about it. Moon Cookies: Get your life on track.” – Diana, Leafly Customer Service Specialist\nProduct: Errl’s Dutch Treat\nType: Dabbable Oil\n“Dutch Treat is a must-have sativa-dominant hybrid for concentrate consumers seeking quality terpenes and functional effects. Errl’s Dutch Treat is sweet and pungent, leaving the hallmark ‘dutchy’ flavor spread across the palate. The moderate energy and uplifted mental state make it a perfect companion for cleaning the house, finishing chores, or kicking off the day.” – Jeremiah, Leafly Strain Researcher\n\nFor Fueling Creativity\n\nProduct: Puffin Farm’s Dancehall\nType: High-CBD Flower, Sativa\n“I recommend Puffin Farm’s Dancehall for playing or listening to music. It’s called Dancehall for a reason. It makes it so easy to lock in to the sounds, but since it’s barely got any THC in it, you can stay sharp and remember how your cymbal stand works before you play.“ – Saba, Leafly Software Engineer\nProduct: Private Reserve’s Pink Cookies\nType: High-THC Flower, Hybrid\n“Whether I’m making jewelry, coloring in my adult coloring books, or cutting up pictures for a collage, I’ve found that cannabis always boosts my creativity and makes the activity that much more enjoyable. I tend to prefer hybrids while crafting, since straight sativas can make me anxious. A budtender at Trees Pot Shop recommended a lovely strain, Pink Cookies from Private Reserve, a delightful combination of GSC (f.k.a Girl Scout Cookies) and Cherry Pie (already two of my favorite hybrids), and it’s the perfect blend for relaxation and concentration. I can focus on my crafting with a soothing calmness that envelops you like a happy hug.” – Lisa, Leafly Editor\n\nFor Health & Wellness\n\nProduct: Ethos CBD Tincture (250mg/bottle)\nType: Tincture \n“A dropper of this tincture is good with a cup of coffee to curb anxiety before work, at the end of the day to help relax the body before bed, the morning after a party to help with a hangover, or any time you are seeking general anti-inflammatory effects that won’t mess with your head.” – Jeremiah, Leafly Strain Researcher\nProduct: Craft Elixirs Ginger Grass Syrup (60mg THC/bottle)\nType: Infused Syrup\n“I recently tried Craft Elixir’s ginger flavored syrup since they were out of my favorite simple syrup. I think I accidentally found a new favorite. The combination of ginger and THC calms my perma-fussy stomach really well. I can dissolve a micro-dose (<5mg) of the elixir in some hot water and sip it for mild nausea and anxiety relief – all without a detectable high.” – Bailey, Leafly Editor\n\nFor Hiking, Exercise, and Getting Out \nProduct: The Rig Stick\nType: Portable Dab Pen\n“I’m really impressed by The Rig Stick. In my opinion, it’s a way easier method of dabbing on-the-go than a Nectar Collector or small rig. It requires no water but it doesn’t taste or feel like doing a dry dab at all!” – Randi, Budtender\nProduct: Pioneer Nuggets’ Lodi Dodi\nType: High-THC Flower, Hybrid\n“Lodi Dodi by Pioneer Nuggets is my go-to workout strain. A bowl or two before suiting up, and by the time I hit the treadmill my limbs are buzzing with a complementary physical energy. Lodi Dodi adequately hazes my mind alongside these lightening physical effects, allowing the music to transport me into ‘The Zone.’ This strain makes the repetition of running in place significantly more enjoyable, and its physical effects seem to improve my overall endurance.” – Jeremiah, Leafly Strain Researcher\nProduct: Headlight’s GG4 (f.k.a Gorilla Glue #4) \nType: Vape Pen Cartridge\n“Headlight’s GG (f.k.a. Gorilla Glue) vape cartridge is great for a busy weekend. Simple and potent dosing make it easy to dial in your effects and its flavor profile stays true to the flower. A couple puffs create an uplifting, focused buzz, perfect before a workout. The pungent, piney flavors will draw you back, and after a few more puffs it’s time to curl up with a good book or the latest episodes of Planet Earth.” – Will, Leafly Digital Content Producer\n\nWhat’s the weekend have in store for you? Let us know what we should check out next!\nCheck Out More Cannabis Products",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/03/10160701/weekend-product.jpg",
            "title": "Your Guide to the Perfect Weekend: Moon Cookies, The Rig Stick, and More",
            "urlslug": "/news/strains-products/weekend-marijuana-product-picks-washington-3-10-2017"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1498406430000)/",
            "id": "contentitems-32167",
            "text": "Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: The sativa-dominant Golden Goat gives an energetic, cerebral high that can be intimidating for new users. It’s a clone-only strain that was accidentally produced by crossing Hawaiian Romulan with Island Sweet Skunk. A popular strain in Colorado, Golden Goat is best known for its strong fruity smell and high THC content.\nGrow Techniques: Grow this plant with lots of space for the roots, as they like to stretch and grow big. Golden Goat is a branchy plant, making it ideal for a SOG (sea of green) if you put in the time to train the plant. If growing indoors, allow for stretch.\nFlowering Time: 9-10 weeks\nYield: Moderate\nGrow Difficulty: Moderate\nClimate: Prefers warm temperatures between 70-80 degrees Fahrenheit\nIndoor/Outdoor: In a warm climate, grow Golden Goat outdoors in a big pot to see the plant truly take off. When growing indoors, be sure to give your plants plenty of space.\nFeeding: Moderate feeding should be adequate. Bud development can be kicked into full gear toward the end of the season by allowing for cooler temperatures and letting the roots receive plenty of oxygen.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/24131516/golden-goat-cannabis.jpg",
            "title": "Tips for Growing Golden Goat Cannabis",
            "urlslug": "/news/growing/how-to-grow-golden-goat-marijuana"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 35.29888944476958
        },
        {
            "name": "ADD/ADHD",
            "score": 20.529932602088014
        },
        {
            "name": "PTSD",
            "score": 19.001168922703215
        },
        {
            "name": "Arthritis",
            "score": 11.225256753950424
        },
        {
            "name": "Spinal Cord Injury",
            "score": 8.795356718080386
        }
    ],
    "description": "<p>Golden Goat was created by accident in Topeka, Kansas, when a male <a href=\"http://www.leafly.com/sativa/hawaiian\">Hawaiian</a>-<a href=\"http://www.leafly.com/indica/romulan\">Romulan</a> pollinated Mr. Dank&#39;s <a href=\"http://www.leafly.com/sativa/island-sweet-skunk\">Island Sweet Skunk</a> mother. The strain is often light green and pink in color, which is&nbsp;indicative&nbsp;of its Hawaiian <a href=\"http://www.leafly.com/sativa\">sativa</a> side. The scent is described as being a combination of <a href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\">sweet</a>, sour, and <a href=\"http://www.leafly.com/explore#!/explore/flavors-spicyherbal\">spicy</a>, with a <a href=\"http://www.leafly.com/explore#!/explore/flavors-tropical\">tropical</a> <a href=\"http://www.leafly.com/explore#!/explore/flavors-tree-fruit\">fruit</a> flavor. Effects are strong&nbsp;and felt from head to toe, lasting about 1-2 hours.&nbsp;Flowering time is 9-11 weeks, with a golden appearance closer to harvest. This sativa-dominant hybrid has a THC level of&nbsp;up to 23% and a CBD of 1.07%.</p>\n",
    "descriptionPlain": "Golden Goat was created by accident in Topeka, Kansas, when a male Hawaiian-Romulan pollinated Mr. Dank&#39;s Island Sweet Skunk mother. The strain is often light green and pink in color, which is&nbsp;indicative&nbsp;of its Hawaiian sativa side. The scent is described as being a combination of sweet, sour, and spicy, with a tropical fruit flavor. Effects are strong&nbsp;and felt from head to toe, lasting about 1-2 hours.&nbsp;Flowering time is 9-11 weeks, with a golden appearance closer to harvest. This sativa-dominant hybrid has a THC level of&nbsp;up to 23% and a CBD of 1.07%.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 76.74787768946616
        },
        {
            "name": "Uplifted",
            "score": 58.01390514577709
        },
        {
            "name": "Energetic",
            "score": 50.623340224156266
        },
        {
            "name": "Creative",
            "score": 46.22286935125577
        },
        {
            "name": "Relaxed",
            "score": 45.58242006330747
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 24.816716695929067
        },
        {
            "name": "Citrus",
            "score": 19.98741795515616
        },
        {
            "name": "Tropical",
            "score": 17.561175719131317
        },
        {
            "name": "Earthy",
            "score": 16.857835872554386
        },
        {
            "name": "Skunk",
            "score": 11.26315234697024
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": "Moderate",
        "environment": null,
        "floweringDays": 80,
        "growNotes": "\n\tPrefers moderate amounts of fertilizer\n\tMay express fruity or diesel-smelling phenotypes\n\tTrains well as a multi-branched plant or with sea of green (SOG) operations\n\tAverage yield falls between 25-30 grams per plant\n\n",
        "height": "Tall",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1417208,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I decided to visit a local dispensary here in Denver. I am not from this area and haven't smoked in over 7 years. I am a normal individual working a well paying job, but I have serious stress and anxiety issues that I refuse to go get drugs from the doctors, so before I went back to my state I decided to give  it a shot. I told the budtender what I needed (Something that is energetic and has stress relief) he gave me the Golden Goat (I'm like wtf is a golden goat..)I rolled up a joint and decided to walk to find a bus stop. Before I knew It I was jamming to some Father John Misty radio with my Hotel programmed into my GPS. I ended up walking about 4.5 miles back to my hotel in the snow and never felt more uplifted and stress free. I came back and dove right into some snacks.(Man food never tasted so good) After about 2 hours the feeling was wearing off, but yet... I felt normal.. a normal I have never felt before. No stress, no worries. I jumped on my laptop and knocked some work out... then I got bored and went back out and smoked some more. I smoked another joint.. ended up walking in the snow some more and was noticing the slightest of details in things. It has now been about 3 hours since I last smoked and I feel no high except.. my stress is gone and my body is relaxed. Still fully functional.. ? No dry mouth.. no headache.. I rolled up in some \"organic hemp\" rolling paper and there was no burn in the throat. It was cold and I had to keep hitting it to see if I was actually inhaling because I thought my breathe was smoke. Nope..I was inhaling it just didn't hurt. Something must have changed in the weed over the years, or this is just what real weed is about. Why is this illegal again?I just rolled my last joint and what might be the last joint for several years to go come. I'm hoping that this can become legal on the east coast, so I can become a functional person without all the stress and anxiety.. I'd love to see the world with these glasses on everyday.. its so beautiful. I'll pass on the Benzos.. and SSRIs.. I'm smiling when I write this because it's so beautiful and sad at the same time that I cannot participate... One love my friends and keep this going. Spread the word about this beautiful plant. Its our time.",
            "username": "forabetterfreeworld"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png",
            "id": 1642490,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Pleasant, easy, fun, a bit of energy.  Makes you really stupid though.",
            "username": "showhadoing"
        }
    ],
    "id": 1074,
    "name": "Golden Goat",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 21.531009489827383
        },
        {
            "name": "Dry Eyes",
            "score": 9.740052357668322
        },
        {
            "name": "Anxious",
            "score": 7.356248466083936
        },
        {
            "name": "Dizzy",
            "score": 6.799869577803369
        },
        {
            "name": "Headache",
            "score": 5.313622905221292
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/hawaiian",
            "category": "Sativa",
            "name": "Hawaiian",
            "permalink": "https://mobileapi.leafly.com/sativa/hawaiian",
            "slug": "hawaiian",
            "subtitle": null,
            "symbol": "Haw"
        },
        {
            "applink": "leafly://strain/romulan",
            "category": "Indica",
            "name": "Romulan",
            "permalink": "https://mobileapi.leafly.com/indica/romulan",
            "slug": "romulan",
            "subtitle": null,
            "symbol": "Rom"
        },
        {
            "applink": "leafly://strain/island-sweet-skunk",
            "category": "Sativa",
            "name": "Island Sweet Skunk",
            "permalink": "https://mobileapi.leafly.com/sativa/island-sweet-skunk",
            "slug": "island-sweet-skunk",
            "subtitle": null,
            "symbol": "Iss"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/golden-goat",
    "photoTotalCount": 225,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/golden-goat/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/golden-goat/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002820/b/golden-goat__primary_d35f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-goat_100x100_7492.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002016/b/golden-goat__primary_e262.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-goat_100x100_73b1.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001004/b/golden-goat__primary_7400.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-goat_100x100_1633.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/670570/b/golden-goat__primary_dfa6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-goat_100x100_24b3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/650447/b/golden-goat__primary_c3b4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-goat_100x100_a56a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/640252/b/golden-goat__primary_ecc8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-goat_100x100_0b34.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Portland, OR",
        "Colorado Springs, CO",
        "Boulder, CO",
        "Detroit, MI",
        "Montréal, QC",
        "Calgary, AB",
        "Chicago, IL",
        "Eugene, OR",
        "Toronto, ON"
    ],
    "rating": 4.47,
    "relatedStrains": [],
    "reviewCount": 1039,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "golden-goat",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.47449470644851/240",
    "subtitle": null,
    "symbol": "Gdg",
    "symptoms": [
        {
            "name": "Stress",
            "score": 42.80491104860076
        },
        {
            "name": "Depression",
            "score": 32.65736798882365
        },
        {
            "name": "Pain",
            "score": 20.345154713134097
        },
        {
            "name": "Fatigue",
            "score": 17.247883195831523
        },
        {
            "name": "Headaches",
            "score": 13.056260894737173
        }
    ],
    "testGraph": "https://leafly.s3.amazonaws.com/strains/testing/ClyUV6RwQGSH5JWCGEgc_golden-goat.png",
    "videoUrl": null,
    "weakDescription": false
}
