{
    "aka": "Blue Universe",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1517865543000)/",
            "id": "contentitems-56274",
            "text": "The blues is a timeless genre full of heart and soul. Starting in the 19th century, blues formed in black communities of the deep south and has strong roots in African musical traditions. Early blues songs were accompanied by lyrics recounting experiences of racial discrimination and other similar hardships faced by black Americans. The genre has persisted through the years, often being combined with elements of jazz, soul, rock, spirituals, and R&B.\n\nWhatever form it takes, the blues is a genre that grabs you by the heart and demands an emotional response. Below, enjoy five impactful blues albums with our recommended strains and tune in to your emotional center.\nSouthern Avenue by Southern Avenue\n(Spotify)\nStrain Pairing Recommendation: Bluniverse\nSouthern Avenue released its lively self-titled album in 2017 and burst onto the blues scene with a refreshing style. The 10-track album features a full electric band, backup vocals, and versatile lead singer Tierinii Jackson, who wows with her strong, harmonious voice. Jackson is joined by her sister Tikyra Jackson on drums, Ori Naftaly on guitar, Jeremy Powell on keys, and Gage Markey on bass. Together, the five create an upbeat, energetic soundscape on Southern Avenue with an added influence of soul and R&B.\nFind Bluniverse Nearby\nDidn’t It Rain by Amy Helm\n(Spotify)\nStrain Pairing Recommendation: Blue Lights\nAmy Helm released her breakout album, Didn’t It Rain, in 2015, and has left fans eager for her next project. Helm’s voice, light with a tinge of roughness, is a powerful instrument that pulls your heart out of your chest with each upward lilt. Didn’t It Rain has a southern blues feel with elements of rock that keep it fresh and interesting with each new track. Helm’s lyrics are engaging and soulful, making it a joy to sing along and pour your emotions into every note.\nFind Blue Lights Nearby\n\nThe Marcus King Band by The Marcus King Band\n(Spotify)\nStrain Pairing Recommendation: Blue Diesel\nThe Marcus King Band is a powerful, hard-hitting album released in 2016, and also marks frontman Marcus King’s second album. Relatively new to the scene, The Marcus King Band has swept the blues world by storm, with its album reaching No. 2 on Billboard’s blues album chart. The Marcus Kind Band has an intricately rich sound accompanied by gritty heart and King’s soulful, raw vocals. Each track on the album features the band’s perfectly orchestrated and impactful instrumentation with a sweet, mournful essence of blues.\nFind Blue Diesel Nearby\nBy My Side by Kat Wright\n(Spotify)\nStrain Pairing Recommendation: Blue Mystic\nBy My Side, released in 2016, is Kat Wright’s first album, and it wastes no time getting right to the heart of the matter. Wright’s soulful, longing voice is effortless, whisking you away and holding you close. The music shoots straight to your center as it churns with emotion, all while the eight-piece band captures your attention with playful transitions. By My Side is a breakout album that carves out a prominent spot for Wright and her band in the world of blues.\nFind Blue Mystic Nearby\n\nMigration Blues by Eric Bibb\n(Spotify)\nStrain Pairing Recommendation: Blue Dragon\nMigration Blues is smooth like silk. This acoustic blues album, released in 2017, is a raw, more organic approach to blues that eases you back in time to a simpler place. Eric Bibb’s voice is pristine and rich as he sings over his melodic guitar playing. Occasionally accompanied by harmonica, the album is stripped down but drips so heavily with emotion that it feels full and rounded. It’s the perfect collection of songs to sink into after a long day, cradling you as it drifts you away from your hardships in every note.\nFind Blue Dragon Nearby",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/02150511/soul-albums-while-high.jpg",
            "title": "5 Soulful Blues Albums to Listen to While High",
            "urlslug": "/news/lifestyle/soulful-blues-albums-listen-while-high"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1447430400000)/",
            "id": "contentitems-3355",
            "text": "Leafly's strain database was just updated with some new varieties. Have you had a chance to check out Snoop Dogg's newest line of cannabis strains? Read about those and more below. Also, remember to submit a review if you've tried any of these newly added strains!\n \n 1. Orange Creamsicle\n\nTaking the best attributes of parent strains Orange Crush and Juicy Fruit, Orange Creamsicle’s tall structure, heavy colas, and pungent flavor will be sure to keep you coming back for more. This hybrid strain, as the name suggests, has a strong citrus flavor and is used to treat nausea and anxiety. Growers will be happy with this heavy producer that flowers in 9 weeks with beautiful orange-white coloring and a thick coating of resin.\n\nClick here for a full list of locations currently carrying Orange Creamsicle\n \n 2. 3D CBD\n\n3D CBD from Snoop Dogg’s branded line of cannabis strains was crafted with patients in mind. With a THC:CBD ratio of about 5:8, this earthy-flavored sativa is preferred for treating pain, inflammation, and muscle tension. Consumers susceptible to THC-induced anxiety may also appreciate the sobering, relaxing balance CBD has to offer.\n\n3D CBD is currently available at LivWell on Broadway in Denver, CO\n \n 3. Purple Bush\n\nPurple Bush, brought to you by Leafs by Snoop, is an indica-dominant hybrid that carries all the hallmark traits of a kush with a hint of berry flavor. This dense purple-hued strain tests upward of 21% THC and will have you feeling relaxed after a long day.\n\nPurple Bush is currently available at LivWell on Broadway in Denver, CO\n \n 4. Bluniverse\n\nBluniverse, also called Blue Universe, is a 50/50 hybrid strain bred by Dynasty Seeds. Mothered by Blue Magoo and fathered by Ms. Universe, Bluniverse inherits a complex flavor profile of blueberry, cherry, and vanilla spice. Its initial effects focus themselves cerebrally, with high-flying euphoria that tapers into pacifying relaxation over time. This hybrid may express one of three different phenotypes, one that takes after Blue Magoo, another taking after Ms. Universe, and a third that exhibits a balance of each parent’s characteristics.\n\nClick here for a full list of locations currently carrying Bluniverse\n \n 5. Tangerine Man\n\nFrom Leafs by Snoop comes Tangerine Man, a sativa-dominant hybrid that is perhaps the best of his new strains. With a citrus aroma and trichome-coated buds, expect a nice pick-me-up that pairs wonderfully with daytime physical activity.\n\nTangerine Man is currently available at LivWell on Broadway in Denver, CO\n \n 6. Gooberry\n\nGooberry is an indica-dominant strain descended from legendary parents Afgoo and Blueberry. This fruity, spicy strain will leave you giggling on your couch with upward of 20% THC. Consumers highly recommend this strain for night time use to treat pain and insomnia, and it's sure to leave you with the munchies. Like most indicas, Gooberry will flower in 7-9 weeks with a short, bushy structure.\n\nGooberry is currently available at Orange County Cannabis Club in Santa Ana, CA\n \n 7. ICED Grapefruit\n\nICED Grapefruit by Female Seeds is a hybrid strain that brings together genetics from ICE and Grapefruit. The resulting hybrid leans slightly to the sativa side, offering uplifting and happy effects that keep positivity flowing. The physically relaxing qualities of this strain come from its ICE parent, an indica-dominant hybrid cherished for its sedating effects. Both parents come through in the flavor as hashy notes intermix with sweet citrus and fruit.\n\nClick here for a full list of locations currently carrying ICED Grapefruit\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12002256/new-strains-alert-orange-creamsicle-blueberry-dream-iced-grapefru-f17c.png",
            "title": "New Strains Alert: Orange Creamsicle, Bluniverse, ICED Grapefruit, 3D CBD, and More",
            "urlslug": "/news/strains-products/new-strains-alert-orange-creamsicle-blueberry-dream-iced-grapefru-f17c"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 43.75
        },
        {
            "name": "PTSD",
            "score": 29.166666666666664
        },
        {
            "name": "ADD/ADHD",
            "score": 18.75
        },
        {
            "name": "Fibromyalgia",
            "score": 14.583333333333332
        },
        {
            "name": "Spinal Cord Injury",
            "score": 12.5
        }
    ],
    "description": "<p>Bluniverse, also called Blue Universe, is a 50/50 hybrid strain bred by Dynasty Seeds. Mothered by <a href=\"https://www.leafly.com/hybrid/blue-magoo\">Blue Magoo</a> and fathered by <a href=\"https://www.leafly.com/hybrid/ms-universe\">Ms. Universe</a>, Bluniverse inherits a complex flavor profile of blueberry, cherry, and vanilla spice. Its initial effects focus themselves cerebrally, with high-flying euphoria that tapers into pacifying relaxation over time. This hybrid may express one of three different <a href=\"https://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\">phenotypes</a>, one that takes after Blue Magoo, another taking after Ms. Universe, and a third that exhibits a balance of each parent&rsquo;s characteristics.</p>\n",
    "descriptionPlain": "Bluniverse, also called Blue Universe, is a 50/50 hybrid strain bred by Dynasty Seeds. Mothered by Blue Magoo and fathered by Ms. Universe, Bluniverse inherits a complex flavor profile of blueberry, cherry, and vanilla spice. Its initial effects focus themselves cerebrally, with high-flying euphoria that tapers into pacifying relaxation over time. This hybrid may express one of three different phenotypes, one that takes after Blue Magoo, another taking after Ms. Universe, and a third that exhibits a balance of each parent&rsquo;s characteristics.\n",
    "effects": [
        {
            "name": "Euphoric",
            "score": 95.83333333333333
        },
        {
            "name": "Happy",
            "score": 85.41666666666667
        },
        {
            "name": "Uplifted",
            "score": 72.91666666666667
        },
        {
            "name": "Relaxed",
            "score": 72.91666666666667
        },
        {
            "name": "Creative",
            "score": 56.25
        }
    ],
    "flavors": [
        {
            "name": "Berry",
            "score": 54.166666666666664
        },
        {
            "name": "Sweet",
            "score": 29.166666666666664
        },
        {
            "name": "Blueberry",
            "score": 22.916666666666668
        },
        {
            "name": "Flowery",
            "score": 12.5
        },
        {
            "name": "Nutty",
            "score": 12.5
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 60,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1418634,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "• Presently smoking this T-18% hybrid from Theraplant in CT. Beautifully tri-colorful —> 🍊orange, purple & bright green crystallized buds are lovely just to look at! (I uploaded a pic of buds in my hand.) Aroma is sweet of berries and taste is equally-so.. & spicy 🌶 note @ back-end of hit was a welcome surprise! 🔥 Love this for its' true hybrid qualities + blast of euphoria with every toke. This is a great one for those new to MMJ community, as well as us-ol'timers looking for something unique + new. Solid 4✨for this gorgeous 🌺 •",
            "username": "hunter9231"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1638373,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Blue Magoo is one of my all time favorite strains - has a fragrance akin to Afghooey, sweet with a distinct lack of “stank.” Bluniverse continues the hereditary tradition with a wonderful smell, taste to match, and an uplifting high. (Brand: Cascadia Natural)",
            "username": "Chronfucius"
        }
    ],
    "id": 187248,
    "name": "Bluniverse",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 16.666666666666664
        },
        {
            "name": "Dry Eyes",
            "score": 12.5
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/blue-magoo",
            "category": "Hybrid",
            "name": "Blue Magoo",
            "permalink": "https://mobileapi.leafly.com/hybrid/blue-magoo",
            "slug": "blue-magoo",
            "subtitle": null,
            "symbol": "Bmg"
        },
        {
            "applink": "leafly://strain/ms-universe",
            "category": "Hybrid",
            "name": "Ms. Universe",
            "permalink": "https://mobileapi.leafly.com/hybrid/ms-universe",
            "slug": "ms-universe",
            "subtitle": null,
            "symbol": "Msu"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/bluniverse",
    "photoTotalCount": 2,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/422986/b/bluniverse__primary_1b22.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bluniverse_100x100_1d6b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/411297/b/bluniverse__primary_c5a3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bluniverse_100x100_1263.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Eugene, OR",
        "Bellingham, WA",
        "Seattle, WA",
        "Mount Vernon, WA",
        "Portland, OR",
        "Anacortes, WA",
        "Astoria, OR",
        "Beaverton, OR",
        "Bellevue, WA",
        "Bend, OR"
    ],
    "rating": 4.65,
    "relatedStrains": [],
    "reviewCount": 17,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "bluniverse",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.64705882352941/240",
    "subtitle": null,
    "symbol": "Buv",
    "symptoms": [
        {
            "name": "Stress",
            "score": 70.83333333333333
        },
        {
            "name": "Depression",
            "score": 56.25
        },
        {
            "name": "Headaches",
            "score": 18.75
        },
        {
            "name": "Pain",
            "score": 18.75
        },
        {
            "name": "Cramps",
            "score": 14.583333333333332
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
