{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1514934606000)/",
            "id": "contentitems-53439",
            "text": "I’m a firm believer that quality cannabis should captivate all of the senses, starting with the nose. Aroma has always been an important characteristic when choosing a cannabis strain, and it’s generally the first thing that will attract you to a specific variety. A strain’s smell is a major indicator the flower’s flavor profile and gives you some semblance of what tastes can be expected when you inhale.\nMost connoisseurs will tell you that cannabis should be purchased with your nose, letting the natural harmony of terpenes guide your decision. One of the flaws with state regulations requiring pre-packaged cannabis is that it removes the nose from the equation and forces you to wait until you get home to find out how pungent the purchased flower may be. To help overcome this roadblock the legal cannabis market presents, I’ll share some of my favorite strains available in Washington that carry truly exceptional and complex aromas.\n\n#1 | Lemonder by Seattle’s Private Reserve\n\nLemonder from Seattle’s Private Reserve is a 91-point strain that was awarded the Best Aroma in Washington State using Leafly’s Cannabis Rating System. While somewhat wispy in appearance, it was the only qualifying strain that scored perfectly for its aroma. The strain is a hybrid of Super Lemon Haze, OG Kush, and Lavender, and it produces a sweet citrus aroma with the added pungent zest of fruit when ground up. Its flavor is a fruity, floral experience that reminds me of candied orange.\nFind Lemonder Nearby\nFrom the Tasting Notebook:\n “Lemon, cream, spice, and some middle savory note that is mellowing the lemon in an unexpected way.” –Jeremiah Wilhelm, Strain Researcher\n\n#2 | White Tahoe Cookies by Royal Tree Gardens\n\nRoyal Tree Gardens has a diverse mix of aromas and flavors coming from their flowering rooms. Their White Tahoe Cookies is a prime example of the quality and consistency their garden produces. A 94-point strain overall, White Tahoe Cookies’ aroma is a compelling mix of its parent genetics, The White, Tahoe OG, and an unspecified GSC cut. This flower has a grape and berry sweetness that blends with notes of musky mint, pine, and skunky earth to complete its enchanting bouquet.\nFind White Tahoe Cookies Nearby\nFrom the Tasting Notebook:\n“Robust grape and berry notes charged with a hint of dank, musky Kush and a sweet finish. Aromas of mint, eucalyptus, and pine forest erupt when this bud is broken down into shake.” –Will Hyde, Cannabis Expert\n\n#3 | Gummo by Gabriel Cannabis\n\nGummo from Gabriel Cannabis is an irresistible 92-point strain that crosses the sweetness of Bubble Gum with the intricate citrus aroma of Orange Bud. The tight buds covered in fiery orange hairs emit an intense citrus sour with soft floral sweetness. The flavor follows suit with a sharper, spiced finish reminiscent of cinnamon and sandalwood. The resulting effects are immediate, heady, and introspective.\nFind Gummo Nearby\nFrom the Tasting Notebook:\n“Loud, ripe berry aroma that expands into a sweet citrus medley of mandarin and tangerine.” –Bailey Rahn, Strains & Products Editor\n\nGummo grown by Gabriel Cannabis.\n#4 | Blueberry Pancakes by Nebula Gardens\n\nA truly amazing flower with a captivating, nuanced, and unique terpene profile, Blueberry Pancakes from Nebula Gardens really does emulate its namesake: a mix of berry notes that finish with a creamy touch of citrus, evoking memories of fresh baked muffins. Scoring 89 points overall and near perfect for its aroma, Blueberry Pancakes provides soothing effects that pair nicely with its pungent essence.\nFind Blueberry Pancakes Nearby\nFrom the Tasting Notebook:\n“Bright strawberry, wildflower, and sweet pine with doughy vanilla. Its aroma feels clarifying with diverse nuance.”–Bailey Rahn, Strains & Products Editor\n\n#5 | Golden Ticket by Khush Kush\n\nAn 87-point strain overall, Golden Ticket from Khush Kush is a flower with fragrant fruity notes of citrus and subtle undertones of tropical flowers. The nuanced smells of Golden Ticket were just a couple points shy of a perfect aroma score. Its complex smell gives way to fresh pine and spearmint flavors with just a touch of sharp lime upon exhale.\nFind Golden Ticket Nearby\nFrom the Tasting Notebook:\n“Sweet, floral, and sort of tropical like a papaya\u2028. Reminds me of a Trainwreck\u2028 cross. When I grind it up, the aroma is even sweeter like a sour green apple or an overripe pineapple\u2028.” –Will Hyde, Cannabis Expert",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/02145135/lemonader-macro.jpg",
            "title": "5 Best-Smelling Cannabis Strains in Washington",
            "urlslug": "/news/strains-products/best-smelling-strains-in-washington-fall-2017"
        },
        {
            "author": "Randi Wooten",
            "category": null,
            "date": "/Date(1490457627000)/",
            "id": "contentitems-22526",
            "text": "As a budtender, trying and evaluating new strains, products, and brands is all a part of the job. This March, I set out to try a bunch of new-to-me products and narrow them down to my top five favorites. Two of the strains I tried, however, were so good that I couldn’t make myself choose between them, which is a wonderful problem to have. These six flowers and concentrates were my favorite finds in March, and I highly recommend making a trip to one of these shops to pick some up for yourself!\n\nBlueberry Pancakes by Nebula Gardens\n(Image courtesy of Nebula Gardens)\nProduct Type: Flower\nPrice: $45/eighth\nLocation: Fweedom Cannabis (Mountlake Terrace)\nIt has been a long time since I opened a package of flower with the word “Blueberry” on the label and actually thought, “Wow, that smells like blueberries.” Enter Nebula Gardens to save the day! I picked up an eighth of Blueberry Pancakes based on the recommendation of a friend and fellow budtender and was extremely glad I did. Its smell and flavor were both exactly what I expected—sweet and mild with a genuinely berry-esque aftertaste. The high was well balanced between a mild body buzz and classic, giggly euphoria.\nJack’s Cleaner BHO by Mother Nature’s Own\n(Image courtesy of Mother Nature’s Own)\nProduct Type: Concentrate/Butane Hash Oil\nPrice: $25/gram\nLocation: Green Lady (Everett)\nWhen I worked for a medical dispensary, Jack’s Cleaner was my absolute favorite strain that we carried. From the first time I tried it, the sharp and piney citrus taste and incredibly clear-headed high had me amazed. It has never once let me down, so when I see it on the shelves, I’ll always give it a try.\nThis wax was priced so well that I admit I was a little hesitant to try it, despite my friend’s recommendation. But the quality is shockingly impressive for the price point and the high is just as clear-headed and focused as I remember. I’m letting that serve as an important reminder to myself: A low price doesn’t always mean low quality, and the same is definitely true in the other direction; pricey cannabis doesn’t necessarily ensure quality.\nDutch Treat by Clandestine Gardens\n(Image courtesy of Clandestine Gardens)\nProduct Type: Flower\nPrice: $13/gram\nLocation: Ruckus (Capitol Hill)\nSeeing classic strains done the right way is surprisingly rare in the adult-use market (I said something similar about the Blueberry strain I tried this month, but it bears repeating). This Dutch Treat was a great representation of the traditional strain, providing a well-balanced, primarily cerebral high accompanied by a sharp, piney flavor profile.\nWhite Widow Ice Wax by TerpCo\n(Image courtesy of TerpCo)\nProduct Type: Bubble Hash\nPrice: $40/gram\nLocation: Fweedom Cannabis (Seattle)\nGenerally speaking, I’m not a big fan of bubble hash. I know it’s cleaner. I know it’s overall better for me. But it’s just not my thing. I don’t care for the residue that even full-melt hash leaves on my nail, and the flavor tends to be similar across the board, leaving little strain-specific flavor to be had.\nThere are some definite exceptions to this rule (such as Polar Icestracts, a former medical producer that makes amazing hash with high-quality flower from stellar cultivator Gold Leaf Gardens), and I’m glad to have found another. This White Widow from TerpCo gave me a whole new perspective on ice wax–and you don’t even have to pay top dollar to experience it.\nDragon OG by Avitas\n(Image courtesy of Avitas)\nProduct Type: Flower\nPrice: $54/eighth\nLocation: Higher Leaf (Bellevue)\nI have to admit, I chose this one purely based on name (something I often discourage my customers from doing) and I did not expect it to be nearly as good as it was. I was impressed as soon as my budtender showed me the package, and it fully lived up to how it looked.\nThis strain was frosty with trichomes, the nugs were dense, and the scent was pure OG goodness. I found the high to be strong with a mild sativa-dominant effect, paired with a very pleasant body buzz. It’s perfectly versatile, suitable for a day of errands followed by an evening of movies. Of all the products I tried this month, this is the only one that drove me back for more, and I will be adding Dragon OG to my regular repertoire of strains.\nLemon Meringue by Avitas\n(Image courtesy of Avitas)\nProduct Type: Flower\nPrice: $16/gram\nLocation: Green Fire (SODO)\nThis citrusy-sweet sativa was delicious! As soon as I cracked open the bag, my living room was saturated with the smell of fresh lemons with a hint of that classically spicy cannabis scent underneath. The flavor matched up with it perfectly; sweet and mild on the inhale with a tangy lemon aftertaste. Lemon Meringue’s high was delightfully cerebral, which led to a batch of homemade pop tarts and me reading an entire sci-fi novel in one day.\nBeing adventurous, trying new things, and exploring new options is an important part of every aspect of life, so this month was a great reminder to keep incorporating that attitude into my cannabis use as well. Variety is the spice of life, after all…or is that cannabis?",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/03/24121444/as-a-budtender.jpg",
            "title": "Ask a Budtender: Best WA Cannabis Products for March 2017",
            "urlslug": "/news/strains-products/best-wa-marijuana-strains-and-products-march-2017"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 44.969969969969966
        },
        {
            "name": "Migraines",
            "score": 24.24924924924925
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 22.8978978978979
        },
        {
            "name": "Crohn's Disease",
            "score": 22.22222222222222
        },
        {
            "name": "PMS",
            "score": 22.22222222222222
        }
    ],
    "description": "<p>Blueberry Pancakes is a delicious indica-dominant hybrid that miraculously tastes like blueberry pancakes. With dense, slightly purple buds, this strain exhibits an aroma of blueberries, grape, and dough. Flavors of syrup and tart berry are especially present when vaporized or when utilizing non-butane combustion techniques, like hemp wick or herb irons. Blueberry Pancakes offers classic indica effects, including a weighted, relaxing physical buzz that can curb physical discomfort, nausea, joint pain, and insomnia.&nbsp;</p>\n",
    "descriptionPlain": "Blueberry Pancakes is a delicious indica-dominant hybrid that miraculously tastes like blueberry pancakes. With dense, slightly purple buds, this strain exhibits an aroma of blueberries, grape, and dough. Flavors of syrup and tart berry are especially present when vaporized or when utilizing non-butane combustion techniques, like hemp wick or herb irons. Blueberry Pancakes offers classic indica effects, including a weighted, relaxing physical buzz that can curb physical discomfort, nausea, joint pain, and insomnia.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 106.60660660660659
        },
        {
            "name": "Happy",
            "score": 87.23723723723722
        },
        {
            "name": "Euphoric",
            "score": 67.1921921921922
        },
        {
            "name": "Uplifted",
            "score": 65.16516516516516
        },
        {
            "name": "Sleepy",
            "score": 31.831831831831828
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 60.96096096096096
        },
        {
            "name": "Blueberry",
            "score": 55.25525525525525
        },
        {
            "name": "Berry",
            "score": 29.804804804804803
        },
        {
            "name": "Earthy",
            "score": 20.045045045045043
        },
        {
            "name": "Vanilla",
            "score": 18.693693693693692
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1383396,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I think this strain is probably some of the best smoke I've ever had. Definitely an indica!! Tastes like it's actually a pancake, no joke, it really does. Get it if you get a chance!",
            "username": "420Tom024"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Vt5M48GWTthyYLbmsfpetoWhvCA=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmlu7GeVZTteolLKW62f8_old-school-green.png",
            "id": 1628763,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Love the smell. Love the taste. Love the high.",
            "username": "Phattious420"
        }
    ],
    "id": 237200,
    "name": "Blueberry Pancakes",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 8.258258258258259
        },
        {
            "name": "Dry Eyes",
            "score": 2.7027027027027026
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/dj-short-blueberry",
            "category": "Indica",
            "name": "DJ Short Blueberry",
            "permalink": "https://mobileapi.leafly.com/indica/dj-short-blueberry",
            "slug": "dj-short-blueberry",
            "subtitle": null,
            "symbol": "Dsb"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/blueberry-pancakes",
    "photoTotalCount": 2,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/577621/b/blueberry-pancakes__primary_4809.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pancakes_100x100_650a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/573834/b/blueberry-pancakes__primary_f961.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-pancakes_100x100_53bb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Portland, OR",
        "Bellevue, WA",
        "Bothell, WA",
        "Everett, WA",
        "Hillsboro, OR",
        "Kirkland, WA",
        "Longview, WA",
        "Mount Vernon, WA",
        "Mountlake Terrace, WA"
    ],
    "rating": 4.45,
    "relatedStrains": [],
    "reviewCount": 38,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "blueberry-pancakes",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.44736842105263/240",
    "subtitle": null,
    "symbol": "Bbp",
    "symptoms": [
        {
            "name": "Pain",
            "score": 54.57957957957958
        },
        {
            "name": "Stress",
            "score": 54.57957957957958
        },
        {
            "name": "Nausea",
            "score": 47.147147147147145
        },
        {
            "name": "Lack of Appetite",
            "score": 37.387387387387385
        },
        {
            "name": "Insomnia",
            "score": 30.480480480480477
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
