{
    "aka": "Dog Walker OG, Dogwalker, Dog Walker, Dawgwalker, Dawgwalker OG, Dawg Walker, Dawg Walker OG",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Catherine LeClair",
            "category": null,
            "date": "/Date(1459692000000)/",
            "id": "contentitems-2689",
            "text": "April is a great month. The hours of light are stretching longer into the evening, the trees start to bud, and that sweet, sweet tax return arrives in the mail, which basically feels like free money even though it’s definitely not. Maybe you’ll prematurely stuff your peacoat far into the depths of your closet and find yourself going for walks, taking deep inhalations of that springy, earthy smell, and turning to your friends and yelling, “This is life! This is living!” Hey, when spring grabs hold, there’s not much you can do to stop it.\n\nThis month’s new-to-Netflix lineup is further proof that April rocks and that T.S. Eliot was very incorrect when he said, “April is the cruelest month.” Poor guy probably always owed to the IRS at the end of the year. Here are some of the best new things for your eyeballs.\n \nFor the Lover of Both Dogs and Mockumentaries\n\nWatch: Best in Show\nWho are the types of people who breed dogs for kennel club shows? This mockumentary by writer and director Christopher Guest shows you the seedy and hilarious underbelly of the high-brow world of dog breeding and showing. Guest, who is known for popularizing the “mockumentary” style of shooting, relies largely on improvisation for Best in Show, as well as his other popular mockumentary films, including A Mighty Wind, This Is Spinal Tap and Waiting for Guffman. If you love The Office or Parks and Rec, you will absolutely love this movie, as Guest’s style arguably laid the foundation for the success of the mockumentary sitcom. It’s got a Portlandia-style sense of self-aware humor to it, plus it has people who look like their dogs.\nAvailable: April 1st\nStrain Pairing: Dogwalker OG\nMunchies: In the spirit of canines, why not whip up a batch of Puppy Chow?\n \nFor Fans of Post-Bunker Humor\n\nWatch: Unbreakable Kimmy Schmidt Season 2\nThe brains behind 30 Rock, Tina Fey and Robert Carlock, bring us season two of their wacky Netflix original Unbreakable Kimmy Schmidt on April 15. The jokes are just as fast and funny in this sitcom starring Ellie Kemper as a cult survivor who strikes out on her own to start a life in New York City after spending years underground in a bunker. While in season one we see Kimmy navigate some of the basics of life – getting a job, dating, and finding a roommate – we can expect that no matter what new life troubles are thrown her way in season two, she’ll face them with the same combination of naïveté, grit and determination that makes her such a strange yet lovable character.\nAvailable: April 15th\nStrain Pairing: NYC Diesel\nMunchies: Since Kimmy still has the palate of a child, load up on plenty of chocolate and candy.\n \nFor Those of You Yearning for Zihuatanejo\n\nWatch: The Shawshank Redemption\nThe Shawshank Redemption was selected by the Library of Congress in 2015 to be preserved in the National Film Registry due to its cultural and aesthetic significance. In short: this is a really good movie. Based on a novella by Stephen King, the movie takes place in his home state of Maine and tells the story of Andy Dufresne, who is sentenced to life in prison for murdering his wife and child. The movie takes us inside the walls of Shawshank State Penitentiary to learn about the alliances, betrayal and oppression that inmates face in a high-security facility. If you’re a fan of Orange Is the New Black but have never sat down to watch Shawshank, you’re in for a treat.\nAvailable: April 1st\nStrain Pairing: Star Killer\nMunchies: To celebrate your freedom, why not go for the least prison-type food possible: sushi.\n \nFor Folks Who Want to Learn About Law as Salaciously as Possible\n\nWatch: How to Get Away with Murder Season 2\nThis TV drama series on ABC centers around law school professor Annalise Keating (Viola Davis), who teaches a class on criminal defense that she refers to as “How to Get Away with Murder 101.” The second season of this murder- and betrayal-filled show has earned Viola Davis the Screen Actors Guild Award for Outstanding Performance in a Drama Series and secured executive producer Shonda Rhimes as an unstoppable creator of salacious and ensnaring dramas (she’s also behind Grey’s Anatomy and Scandal). Of course, this is nothing like the boring Torts classes you heard so much about from your friends slogging through law school.\nAvailable: April 16th\nStrain Pairing: Outlaw\nMunchies: Rhimes’ one controversial opinion might be that she hates thin crust pizza. Order in a deep dish in her honor.\n \nFor Those of You Who Have Never Caught a Glimpse of Dirk's \"Diggler\"\n\nWatch: Boogie Nights\nFrom a nightclub dishwasher to a wealthy porn star, Boogie Nights tracks the rise of Eddie Adams (Mark Wahlburg), a baby-faced high school dropout who takes on the porn star persona of Dirk Diggler after a director (Burt Reynolds) takes him under his wing based on his good looks and natural charm. The film, set in southern California’s San Fernando Valley, helped director Paul Thomas Anderson get on the map during his twenties. (He then went on to create well-regarded classics including Magnolia, There Will Be Blood and The Master.) Watching young Eddie succumb to the addiction to money, power and sex feels like witnessing a slow-motion trainwreck in a similar vein as The Wolf of Wall Street. For many reasons, you can’t look away.\nAvailable: April 1st\nStrain Pairing: Money Maker\nMunchies: It’s set in Los Angeles – what better excuse do you need for chips and guac?\n\nImage Sources: IMDb",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/04/11235904/april-netflix-and-chill-tax-returns-for-all-of-us.jpg",
            "title": "April Netflix and Chill: Tax Returns for All of Us!",
            "urlslug": "/news/lifestyle/april-netflix-and-chill-tax-returns-for-all-of-us"
        },
        {
            "author": "Emily Grosvenor",
            "category": null,
            "date": "/Date(1459224000000)/",
            "id": "contentitems-6025",
            "text": "To make a truly informed cannabis-buying decision, you have to smell the product. And I don’t mean taking a dainty whiff. You’ve got get in there and really inhale, because smelling it — really focusing on the fragrance — may just be the best way to choose your cannabis.\n“Depending on what the scent is, it can make or break a strain for people,” said Tyson Dieter, a manager at the Southwest Portland outlet of Nectar, an Oregon cannabis retailer.\nI’m a home perfumer trained by a world-class nose. Years ago I trained at home using natural perfumer Mandy Aftel’s workbooks, and later I studied with her at her studio in Berkeley, Calif. For me scent is the ultimate in pleasure experiences. On a recent Tuesday morning, I stopped in at Nectar to talk scent and learn about the role it plays in the burgeoning cannabis industry.\nWhat Do Cannabis and Perfumes Have in Common?\nIt turns out perfume and pot have a lot in common.\nBoth products come with outlandish, sometimes arbitrary titles. Burberry Weekend, meet Blackberry Kush. Practically no one buys the product without smelling it first. (Where it’s allowed, that is. In Washington state, pre-purchase smelling for recreational cannabis is against the law.) We don’t talk about them using the same language, although that’s changing as consumers learn more about scent’s connection to the cannabis experience.\n\nAs I stepped through Nectar’s front door, the first thing I noticed was the air, which smelled lightly of sweet herb. The employees — perhaps the happiest service professionals I’ve ever encountered — were all eager to talk to me about their favorite-smelling strains.\nCommercial perfumes are composed of top notes, middle notes (also called heart notes) and base notes, so named based on their relative evaporation rates. A perfume with a top note of essential oil of bergamot (citrus) might be paired with a middle note of lavender oil and a base note of thick, resiny oakmoss. Together they make up the full scent experience of the perfume.\nIn the cannabis world, the language hasn’t yet evolved to describe the plant’s fragrance notes with such specificity. But budtenders and growers are expanding their vocabulary to describe the scent experience. So you may see two main, often contrasting odors: sweet and fruity paired with earthy, like in an Afgooey.\nAt Nectar the jars open dozens of times a day for olfactory sampling. Some strains are more fragrant than others. A Blackberry Kush may not remind anyone of blackberries, but it does have a subtle sweetness to balance the hashy, diesel-fume center it’s known for. GSC (f.k.a Girl Scout Cookies), another potent strain, smells oily and pungent in the middle and slightly sweet on top.\nAll cannabis strains carry their own scent signature, a fact that often surprises cannabis consumers who come to a shop for the first time.\n\n“First-timers generally know about THC content and little else,” Dieter said. “But then they usually stand there smelling all day to find a perfect match.”\nSome strains share some of their scent identity with the world of aromatherapy. An activating hybrid sativa like Orange Crush has much in common with a bitter orange essential oil — one often used by aromatherapists for energizing. In the same vein, the citrus-scented J1, a sativa hybrid, smells like a traditional fougère-style perfume, opening with a citrus note and moving into an herby heart.\nBecause scent is deeply personal, no one really agrees on which strains smell best. A savory, cheesy strain like OG99 might send some running for the hills, but for consumers who like to “smoke savory,” the associated mellow vibe is well worth it.\nOther consumers prefer the so-called “authentic-smelling” pot strains. For them, something like The Perps, which gives off the odor of a grape Jolly Rancher, might feel like spraying your face with Britney Spears’ Curious.\nWhy Consumption Methods Matter When It Comes to Scent Preservation\nWhen it comes to harnessing the scent of cannabis, consumption methods matter.\n\nA cannabis flower’s scent comes directly from its terpenes, volatile aromatic organic compounds found in the oils of all flowers. Terpenes in the cannabis flower evolved to attract pollinators or repel enemies. More than 100 possible terpenes are thought to exist in various strains of the cannabis flower.\nThe unique combination of terpenes in a particular strain produces its aromatic properties and, some believe, is thought to influence the body’s high. To heighten the experience of the terpenes, therefore, consumers should reach for consumption methods involving less combustion. The higher the burn temperature, the more likely the most volatile and aromatic terpenes will combust before being consumed.\nIn other words, to get the full scent experience, vape it, don’t smoke it.\n“When you have a vaping machine, it can hinder the effect of the flavor,” said Myles Hyde, a budtender at Nectar who specializes in medicinal use. For flower, Hyde suggested using a vaporizer in at least the $250 range. “With a lower-quality machine, you may end up smelling some of the machine itself.”\n\nThose who do want to smoke it would be advised to do it indoors, according to Hyde, where the scent lingers, affecting the high.\nOther methods, like using hash oil, produces a concentrated scent experience so aromatic it feels like smelling an aged perfume. Dieter pulled a Dogwalker resin with a smell reminiscent of jasmine concentrate: dirty, floral, even slightly fecal. In this way, fragrance obsessives are much like cheese hounds or any other aficionados who move with passion into a sensual pursuit — as they explore their olfactory world, they become more and more enamored with scents that might repel the layperson.\nEmphasizing Fragrance as Part of the Purchasing Decision\nThe importance of scent is beginning to take on a bigger role in the purchasing decision at some of Portland’s leading retail shops. During a recent visit to Oregon’s Finest, a store tucked into the city’s swanky Pearl District, manager Selena Toomey pulled flower-filled apothecary jars off a shelf for me.\n“Strains sell themselves based on their scent,” Toomey said. “It makes a huge difference in the experience.”\n\nPerfumers are taught to smell coffee beans between samples in order to cleanse their palates. Oregon’s Finest has adapted the practice for the cannabis connoisseur. Toomey invited me to sniff single-origin beans (this is Portland, after all) while passing between strain jars.\nToomey often suggests patients spend up to 10 minutes working the flower in their hands before smoking or vaping it. Doing so, she said, allows you to smell more of the terpenes and enhance the way it tastes when consumed.\n“The terpenoids and flavonoids play a huge part in opening up your receptors to all of the effects of the cannabis,” Toomey explained. “It’s like steaming in a hot shower before you moisturize.”\nScent scientists often talk about the cognitive barriers to talking about our often ignored fifth sense — that we don’t really practice the language needed to really discuss scent.\n\nWhen Toomey talks about scent to her customers, she sometimes avoids scent talk and focuses on taste, which offers a vocabulary more familiar to most consumers. She’ll speak of a strain like Dutch Treat as being like “mint chocolate chip ice cream.”\nToomey has been at Oregon’s Finest since its 2014 opening. She’s seen her customer base grow from curiosity to connoisseurship, even as the shop retains its focus on pot’s medicinal effects.\nShe sells individual terpenes as an additive to other marijuana products for medicinal users. Once you have enough experience to identify specific terpenes by smell alone, you can anticipate the associated high, she said.\n“If I’m in a dispensary, I can tell by the aroma if a strain will work with my body,” Toomey added. “The nose knows.”\nEmily Grosvenor is a writer and perfumer based in Oregon. You can follow her on Twitter.\nImage Source: Sara Dilley",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/03/29195541/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea.jpg",
            "title": "Cannabis Scents and Sensibility: Why Marijuana's Fragrance Is a Feast for the Nose",
            "urlslug": "/news/cannabis-101/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 38.04213669414962
        },
        {
            "name": "PTSD",
            "score": 23.825458336687248
        },
        {
            "name": "Bipolar Disorder",
            "score": 23.785115508894588
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 19.439493424406546
        },
        {
            "name": "PMS",
            "score": 16.21791259884472
        }
    ],
    "description": "<p>Dogwalker OG is a balanced hybrid bred by combining <a href=\"http://www.leafly.com/hybrid/albert-walker\">Albert Walker</a> OG and <a href=\"http://www.leafly.com/hybrid/chemdawg-91\">Chemdawg 91</a>. With a complex profile of woody and skunky aromas, Dogwalker OG delivers a strong cerebral calm that radiates throughout the body over time. The sativa side of Dogwalker OG promotes <a href=\"http://www.leafly.com/explore#!/explore/tags-focused\">focus</a>, while its indica counterpart induces deep <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\">relaxation</a> that easily converts to <a href=\"http://www.leafly.com/explore#!/explore/tags-sleepy\">sleep</a> in high doses. This THC-rich hybrid can be used for a variety of issues, particularly <a href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\">pain</a>, mood disorders, and <a href=\"http://www.leafly.com/explore#!/explore/symptoms-lack-of-appetite\">appetite loss</a>.</p>\n",
    "descriptionPlain": "Dogwalker OG is a balanced hybrid bred by combining Albert Walker OG and Chemdawg 91. With a complex profile of woody and skunky aromas, Dogwalker OG delivers a strong cerebral calm that radiates throughout the body over time. The sativa side of Dogwalker OG promotes focus, while its indica counterpart induces deep relaxation that easily converts to sleep in high doses. This THC-rich hybrid can be used for a variety of issues, particularly pain, mood disorders, and appetite loss.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 81.65244605943523
        },
        {
            "name": "Euphoric",
            "score": 69.56483408652723
        },
        {
            "name": "Happy",
            "score": 57.275124669878764
        },
        {
            "name": "Sleepy",
            "score": 51.33687123642621
        },
        {
            "name": "Uplifted",
            "score": 36.95623426054759
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 34.910249186435614
        },
        {
            "name": "Pungent",
            "score": 33.49020081337274
        },
        {
            "name": "Pine",
            "score": 20.529803862945542
        },
        {
            "name": "Lemon",
            "score": 19.273522455910367
        },
        {
            "name": "Skunk",
            "score": 18.690132585122406
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1414300,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Dogwalker is my \"go to\" strain for all my medical needs & believe me I have a few & DW cures them all!! It's very pungent, fuely aroma makes it easy to know you've got the real McCoy. It's always very high in THC % and has a phenomenal taste when done all organic. And I have to say I did some digging on the breeder of this strain & it was created in my hometown of Portland,Or and by one of the best growers in the PNW, the legendary \"One Eye\". PEACE",
            "username": "JOHNNYBL8ZE503"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1633336,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Beautiful bud that tastes amazing and gets you Stoney baloney. It instantly relaxed my back and got rid of all pain I was holding. ",
            "username": "gilldevin"
        }
    ],
    "id": 67184,
    "name": "Dogwalker OG",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 36.370832039679705
        },
        {
            "name": "Anxious",
            "score": 14.048503386497705
        },
        {
            "name": "Paranoid",
            "score": 13.420362682980118
        },
        {
            "name": "Dry Eyes",
            "score": 7.986634162421566
        },
        {
            "name": "Headache",
            "score": 4.97596679047411
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/albert-walker",
            "category": "Hybrid",
            "name": "Albert Walker",
            "permalink": "https://mobileapi.leafly.com/hybrid/albert-walker",
            "slug": "albert-walker",
            "subtitle": null,
            "symbol": "Abw"
        },
        {
            "applink": "leafly://strain/chemdawg-91",
            "category": "Hybrid",
            "name": "Chemdawg 91",
            "permalink": "https://mobileapi.leafly.com/hybrid/chemdawg-91",
            "slug": "chemdawg-91",
            "subtitle": null,
            "symbol": "C91"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/dogwalker-og",
    "photoTotalCount": 18,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1004768/b/dogwalker-og__primary_6559.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dogwalker-og_100x100_9773.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/583633/b/dogwalker-og__primary_3cf2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dogwalker-og_100x100_540d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/552215/b/dogwalker-og__primary_f275.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dogwalker-og_100x100_04f2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/526361/b/dogwalker-og__primary_618f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dogwalker-og_100x100_6252.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/494211/b/dogwalker-og__primary_29cd.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dogwalker-og_100x100_c790.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/490453/b/dogwalker-og__primary_2381.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dogwalker-og_100x100_8452.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Eugene, OR",
        "Salem, OR",
        "Medford, OR",
        "Beaverton, OR",
        "Bend, OR",
        "Hood River, OR",
        "Springfield, OR",
        "Lincoln City, OR",
        "Oregon City, OR"
    ],
    "rating": 4.64,
    "relatedStrains": [],
    "reviewCount": 211,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "dogwalker-og",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.63507109004739/240",
    "subtitle": null,
    "symbol": "Dwk",
    "symptoms": [
        {
            "name": "Stress",
            "score": 50.49781707929426
        },
        {
            "name": "Insomnia",
            "score": 40.593029985932716
        },
        {
            "name": "Depression",
            "score": 40.382116532318335
        },
        {
            "name": "Pain",
            "score": 37.292775854865475
        },
        {
            "name": "Lack of Appetite",
            "score": 28.514234022898627
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
