{"sl_translate":"description,descriptionPlain,category","id":297265,"slug":"og-sour-diesel","name":"OG Sour Diesel","subtitle":null,"symbol":"Gsd","category":"Hybrid","description":"\u003cp\u003eOG Sour Diesel by The Cali Connection is a riff on where \u003ca href=\"https://www.leafly.com/sativa/sour-diesel\"\u003eSour Diesel\u003c/a\u003e has been and where it is going. By combining \u003ca href=\"https://www.leafly.com/hybrid/sour-og\"\u003eSour OG\u003c/a\u003e and Cali Connection\u0026rsquo;s \u003ca href=\"https://www.leafly.com/sativa/east-coast-sour-diesel\"\u003eEast Coast Sour Diesel\u003c/a\u003e precursor, OG Sour Diesel adopts the historical ECSD lineage while offering a nod to the West Coast\u0026rsquo;s tradition of Kush-heavy crosses. The fuel aroma the buds emit is intense and astringent. The long-lasting cerebral effects mute stress without encumbering the body.\u003c/p\u003e\n","descriptionPlain":"OG Sour Diesel by The Cali Connection is a riff on where Sour Diesel has been and where it is going. By combining Sour OG and Cali Connection\u0026rsquo;s East Coast Sour Diesel precursor, OG Sour Diesel adopts the historical ECSD lineage while offering a nod to the West Coast\u0026rsquo;s tradition of Kush-heavy crosses. The fuel aroma the buds emit is intense and astringent. The long-lasting cerebral effects mute stress without encumbering the body.\n","aka":null,"rating":4,"highlightedReviews":[{"id":1412572,"username":"JrCroom","text":"Tight structure, lemon and spruce pine tree scent. light green, yellow tricome. some purpling ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1637910,"username":"fantastic21","text":"Love the colors of the bud \u0026 the taste and how it always be bustin in the backwood","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3027","title":"The Best Cannabis Strains for Focus and ADD/ADHD","author":"Bailey Rahn","category":null,"date":"\/Date(1452633240000)\/","text":"Whether or not you’ve been diagnosed with ADD or ADHD, sometimes we need a little help concentrating. You’ve probably noticed that certain varieties of cannabis help you stay focused and productive while others can send your mind completely off the rails. Finding that perfect focusing strain requires a little self-analysis first: What is it that’s impeding your concentration? Are you disengaged? Do your thoughts race? Think of the below sections as your roadmap to the right strain.\nWe’re still waiting for research to provide more guidance on why cannabis might or might not help someone with ADD/ADHD, but we’re limited mostly to personal anecdotes. It’s not a bad idea to try a few different strains – a high-THC strain, a low-THC strain, high-CBD, balanced THC-CBD, and so on. At the end of this list, you’ll also find some appetite-boosting, sleep-inducing strains for those of you experiencing the negative side effects of stimulant ADD/ADHD medications.\n \nStrains for Mental Energy and Engagement\n \nCinex is the strain you reach for when that cup of coffee didn’t do the job. Providing wired euphoria that feeds creativity, this sativa can rekindle interest in tasks that may otherwise be a drag. Take caution with this one if you’re prone to anxiety and racing thoughts; Cinex can turn that up in some individuals.\n \n \nIt’s famous for a reason. Sour Diesel is one of the highest-rated strains on Leafly for treatment of ADD/ADHD, quite possibly due to its ability to shine a new, engaging light on activities and tasks. Speedy euphoria lets your mind stay nimble, but remember that dosing is key. Overdoing a potent sativa like Sour Diesel can have the opposite of your desired effect.\n\n“It makes your frontal lobe act in ways you could never have imagined. It’s almost like Sour Diesel is a key, a key that opens up whole realms of your mind that you were once ignorant of.”\n \n \nAccording to lore, this sativa was dubbed Green Crack by Snoop Dogg because its effects were so intensely stimulating. Green Crack had to make the list because, in my experience, few other strains can match its energy and focus. It sharpens the senses and brings vibrancy to the dull, all with an enticing tropical citrus flavor.\nClick here to browse more strains with stimulating, focused effects.\n \nStrains for Calming Focus\n \nSometimes what you need to concentrate isn’t a strain that speeds your brain up, it’s one that can slow the brain down. The indica-dominant True OG is touted among reviewers for knocking down stress and distractions for easier focus.\n\n“Comes on kind of slowly. Is a chilling high, but you can easily focus and do things like schoolwork, cleaning, etc.”\n \n \nBlueberry Headband captures the perfect synergy of its two parents. From Headband, it inherits a supercharged cerebral effect that lends a spark of creativity. The Blueberry parent softens the euphoric intensity of Headband, providing a mellow, full-body experience that allows your thoughts run at a more manageable pace.\nClick here to browse more strains with relaxing, focused effects.\n \nStrains for Cognitive Clarity\n \nA cross between Sour Tsunami and Harlequin, Harle-Tsu is a high-CBD strain that contains minimal levels of THC. It eases you into a sober, clear-headed calm as its relaxing effects come with minimal psychoactive impact, so you can keep your cognitive faculties intact. If you’re having trouble finding Harle-Tsu near you, try finding its high-CBD parent strains or close relative, Canna-Tsu.\n\n“A good herb for relaxation. Not much of a cerebral high, but what little high you do get is focused and energetic but calm. Its good to mix with some powerful indicas to even it out.”\n \n \nCalming physical sensations coupled with agile cerebral focus, Harlequin is another high-CBD strain that should be on your radar if concentration is hard to come by. Although this ratio can fluctuate, Harlequin typically expresses a 5:2 ratio of CBD:THC, so expect some euphoric stimulation in the mind.\nClick here to browse more strains with a high CBD content.\n \nStrains for ADD/ADHD Medication Side Effects*\n \nA genetic cross between Blueberry and Hindu Kush, Goo provides the golden trifecta of effects for those treating ADD/ADHD: appetite, sleepiness, and focus. This strain is meant for winding down, which can be difficult if you’re prescribed psychostimulant drugs that may stunt the appetite and keep you tossing and turning at night.\n\n“Currently one of my favorite strains. When my brain is too active I smoke this and it helps calm it down.”\n \n \nJupiter OG is another indica strain that can help restore appetite and restfulness when the side effects of your medications are at their worst. This indica may still provide a little kick of focus, but it should definitely be saved for later in the night when you’re ready to help your brain shut down.\nClick here to browse more appetite-enhancing, sedating strains.\n*Please consult with your doctor if you are being prescribed medication to treat your ADD/ADHD or another medical condition and ask if it’s advisable to supplement your regimen with medical marijuana.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12001420/best-cannabis-strains-for-focus-and-addadhd.jpg","urlslug":"/news/strains-products/best-cannabis-strains-for-focus-and-addadhd"},{"id":"contentitems-3583","title":"Top 10 Cannabis Strains in California","author":"Bailey Rahn","category":null,"date":"\/Date(1451937600000)\/","text":"California has its own unique strain landscape compared to the rest of the world. With a geography that favors outdoor grows, the Golden State has championed some of the world’s finest strain genetics. OG Kush crosses flourished throughout the state, and today you’d be hard-pressed to find a strain that hasn’t been crossed with this illustrious hybrid. What other strains have risen to the top of California’s market? You’re about to find out.\n\nUsing Leafly menu data from California dispensaries, we determined which strains appeared most often and synchronized these results with local search terms. Here are the top 10 according to our data – dispensary owners and budtenders, are these strains on your shelves?\n1. Blue Dream\n \nThis hybrid tops the charts in every major market, California included. Even in the state where OG Kush is expected to reign supreme, it would appear that Blue Dream still maintains a stranglehold. Leafly reviewers rant and rave over this uplifting berry-flavored hybrid, but do you think Blue Dream’s quality justifies its notoriety?\n2. GSC (f.k.a Girl Scout Cookies)\n \nThis California native has sprinted its way to fame in recent years, gobbling up awards left and right for its potency. Itself a descendent of OG Kush, GSC (f.k.a Girl Scout Cookies) is given an extra sativa lift from a Durban Poison parent. In masterful balance of soaring euphoria and deeply relaxing physical effects, it’s no wonder that GSC (f.k.a Girl Scout Cookies) ranks #2 in the California market.\n\n3. Sour Diesel\n \nNo doubt, Sour Diesel is a staple sativa that holds an esteemed position in most major markets. While some don’t like the strain’s funky fuel flavor, its weightless cerebral high is often worth it. The uplifting effects can help you get up and out, making this strain a perfect pair for those warm, sunny California days.\n4. OG Kush\n \nOG Kush, the flagship strain of California genetics, ranks #4 among its top strains. Reviewing this list, however, you’ll notice many of the forerunners are bred using OG Kush genetics. Countless other hybrids not mentioned here also contain OG genetics, so much so that you can attach “OG” to the end of almost any strain name and assume that some California breeder has already made it. OG Kush phenotypes are also marketed under a variety of monikers, many of which play off celebrity names and pop culture references. If we were to include all those branded OG Kushes, OG Kush might actually be the top California strain, period.\n5. Green Crack\n \nThough rare in many markets, Californians are lucky to enjoy better access to this ridiculously stimulating sativa strain. Green Crack’s racy cerebral high seems to have no ceiling, and hands down, no other strain on Leafly seems to yield as hilarious reviews as this one. California’s warm climate could very well be the reason for the abundance of this delicacy, because it sure isn’t due to lack of demand up in the cold north.\n\n6. Jack Herer\n \nJack Herer is the tried-and-true sativa you’d expect to find on any market’s top 10 list. Beautifully crafted genetics from Sensi Seeds give way to a balanced effect profile that promotes happiness, creativity, and an uplifting sense of energy. That, plus its rich woody pine aroma, explains why this Amsterdam transplant has been so widely embraced overseas.\n7. Skywalker OG\n \nWhen Skywalker met OG Kush, a beautiful baby was born. That baby is Skywalker OG, a strain that has earned its way to fame not by name (although that probably helped), but through potency and flavor. The THC content of this indica-dominant hybrid is certainly one to write home about, and I’ve seen the loud earthy and lemon flavors of this hybrid literally raise eyebrows.\n8. Bubba Kush\n \nBubba Kush has roots in California, so it’s not hard to imagine how this powerhouse indica carved a name for itself since its inception in the 90s. Earthy sweet aromas introduce tranquilizing mind and body effects, making this strain a perfect companion for lazy day relaxation or for a smooth transition into a restful night’s sleep.\n\n9. Fire OG\n \nThe predominant OG family has another prestigious strain in California, and its name is Fire OG. A cross of different OG Kush phenotypes, Fire OG takes on a fiery appearance with vibrant orange hair stretching out from a bed of crystal resin.\n10. SFV OG\n \nBorn and bred in California’s San Fernando Valley, this OG Kush phenotype is another unsurprising appearance on this list. Oozing trichomes as sticky as glue blanket the buds in a show of this hybrid’s potency. Sweet lemon and woody aromas lift from SFV OG’s crystal-covered buds in a testament to this strain’s true OG heritage.\nAre you a business looking to get a leg up on the competition in the crowded California market? Leafly can help you stand out among the others!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12002919/top-10-cannabis-strains-in-california.jpg","urlslug":"/news/strains-products/top-10-cannabis-strains-in-california"}],"reviewCount":3,"flavors":[{"name":"Flowery","score":40},{"name":"Diesel","score":27.142857142857142},{"name":"Pungent","score":20},{"name":"Citrus","score":3.5714285714285712},{"name":"Lemon","score":3.5714285714285712}],"effects":[{"name":"Happy","score":81.428571428571431},{"name":"Relaxed","score":57.857142857142861},{"name":"Talkative","score":30.714285714285715},{"name":"Giggly","score":30.714285714285715},{"name":"Creative","score":27.142857142857142}],"symptoms":[{"name":"Pain","score":47.142857142857139},{"name":"Stress","score":27.142857142857142},{"name":"Inflammation","score":7.1428571428571423},{"name":"Lack of Appetite","score":7.1428571428571423},{"name":"Nausea","score":7.1428571428571423}],"conditions":[{"name":"Anxiety","score":23.571428571428569},{"name":"ADD/ADHD","score":7.1428571428571423},{"name":"Arthritis","score":3.5714285714285712},{"name":"Cancer","score":3.5714285714285712},{"name":"Fibromyalgia","score":3.5714285714285712}],"negatives":[{"name":"Dry Eyes","score":20},{"name":"Dry Mouth","score":20}],"articlesAvailable":true,"articleTotalCount":3,"photos":[],"photoTotalCount":0,"popularCities":["Albany, OR","Beaverton, OR","Bellingham, WA","Everett, WA","Gold Bar, WA","Long Beach, CA","Mountlake Terrace, WA","Sedro-Woolley, WA","Spokane, WA","Tacoma, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/og-sour-diesel","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Sour OG","subtitle":null,"slug":"sour-og","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/sour-og","symbol":"Sog","applink":"leafly://strain/sour-og"},{"name":"East Coast Sour Diesel","subtitle":null,"slug":"east-coast-sour-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/east-coast-sour-diesel","symbol":"Eas","applink":"leafly://strain/east-coast-sour-diesel"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":297265,"slug":"og-sour-diesel","name":"OG Sour Diesel","subtitle":null,"symbol":"Gsd","category":"Hybrid","description":"\u003cp\u003eOG Sour Diesel by The Cali Connection is a riff on where \u003ca href=\"https://www.leafly.com/sativa/sour-diesel\"\u003eSour Diesel\u003c/a\u003e has been and where it is going. By combining \u003ca href=\"https://www.leafly.com/hybrid/sour-og\"\u003eSour OG\u003c/a\u003e and Cali Connection\u0026rsquo;s \u003ca href=\"https://www.leafly.com/sativa/east-coast-sour-diesel\"\u003eEast Coast Sour Diesel\u003c/a\u003e precursor, OG Sour Diesel adopts the historical ECSD lineage while offering a nod to the West Coast\u0026rsquo;s tradition of Kush-heavy crosses. The fuel aroma the buds emit is intense and astringent. The long-lasting cerebral effects mute stress without encumbering the body.\u003c/p\u003e\n","descriptionPlain":"OG Sour Diesel by The Cali Connection is a riff on where Sour Diesel has been and where it is going. By combining Sour OG and Cali Connection\u0026rsquo;s East Coast Sour Diesel precursor, OG Sour Diesel adopts the historical ECSD lineage while offering a nod to the West Coast\u0026rsquo;s tradition of Kush-heavy crosses. The fuel aroma the buds emit is intense and astringent. The long-lasting cerebral effects mute stress without encumbering the body.\n","aka":null,"rating":4,"highlightedReviews":[{"id":1412572,"username":"JrCroom","text":"Tight structure, lemon and spruce pine tree scent. light green, yellow tricome. some purpling ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1637910,"username":"fantastic21","text":"Love the colors of the bud \u0026 the taste and how it always be bustin in the backwood","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3027","title":"The Best Cannabis Strains for Focus and ADD/ADHD","author":"Bailey Rahn","category":null,"date":"\/Date(1452633240000)\/","text":"Whether or not you’ve been diagnosed with ADD or ADHD, sometimes we need a little help concentrating. You’ve probably noticed that certain varieties of cannabis help you stay focused and productive while others can send your mind completely off the rails. Finding that perfect focusing strain requires a little self-analysis first: What is it that’s impeding your concentration? Are you disengaged? Do your thoughts race? Think of the below sections as your roadmap to the right strain.\nWe’re still waiting for research to provide more guidance on why cannabis might or might not help someone with ADD/ADHD, but we’re limited mostly to personal anecdotes. It’s not a bad idea to try a few different strains – a high-THC strain, a low-THC strain, high-CBD, balanced THC-CBD, and so on. At the end of this list, you’ll also find some appetite-boosting, sleep-inducing strains for those of you experiencing the negative side effects of stimulant ADD/ADHD medications.\n \nStrains for Mental Energy and Engagement\n \nCinex is the strain you reach for when that cup of coffee didn’t do the job. Providing wired euphoria that feeds creativity, this sativa can rekindle interest in tasks that may otherwise be a drag. Take caution with this one if you’re prone to anxiety and racing thoughts; Cinex can turn that up in some individuals.\n \n \nIt’s famous for a reason. Sour Diesel is one of the highest-rated strains on Leafly for treatment of ADD/ADHD, quite possibly due to its ability to shine a new, engaging light on activities and tasks. Speedy euphoria lets your mind stay nimble, but remember that dosing is key. Overdoing a potent sativa like Sour Diesel can have the opposite of your desired effect.\n\n“It makes your frontal lobe act in ways you could never have imagined. It’s almost like Sour Diesel is a key, a key that opens up whole realms of your mind that you were once ignorant of.”\n \n \nAccording to lore, this sativa was dubbed Green Crack by Snoop Dogg because its effects were so intensely stimulating. Green Crack had to make the list because, in my experience, few other strains can match its energy and focus. It sharpens the senses and brings vibrancy to the dull, all with an enticing tropical citrus flavor.\nClick here to browse more strains with stimulating, focused effects.\n \nStrains for Calming Focus\n \nSometimes what you need to concentrate isn’t a strain that speeds your brain up, it’s one that can slow the brain down. The indica-dominant True OG is touted among reviewers for knocking down stress and distractions for easier focus.\n\n“Comes on kind of slowly. Is a chilling high, but you can easily focus and do things like schoolwork, cleaning, etc.”\n \n \nBlueberry Headband captures the perfect synergy of its two parents. From Headband, it inherits a supercharged cerebral effect that lends a spark of creativity. The Blueberry parent softens the euphoric intensity of Headband, providing a mellow, full-body experience that allows your thoughts run at a more manageable pace.\nClick here to browse more strains with relaxing, focused effects.\n \nStrains for Cognitive Clarity\n \nA cross between Sour Tsunami and Harlequin, Harle-Tsu is a high-CBD strain that contains minimal levels of THC. It eases you into a sober, clear-headed calm as its relaxing effects come with minimal psychoactive impact, so you can keep your cognitive faculties intact. If you’re having trouble finding Harle-Tsu near you, try finding its high-CBD parent strains or close relative, Canna-Tsu.\n\n“A good herb for relaxation. Not much of a cerebral high, but what little high you do get is focused and energetic but calm. Its good to mix with some powerful indicas to even it out.”\n \n \nCalming physical sensations coupled with agile cerebral focus, Harlequin is another high-CBD strain that should be on your radar if concentration is hard to come by. Although this ratio can fluctuate, Harlequin typically expresses a 5:2 ratio of CBD:THC, so expect some euphoric stimulation in the mind.\nClick here to browse more strains with a high CBD content.\n \nStrains for ADD/ADHD Medication Side Effects*\n \nA genetic cross between Blueberry and Hindu Kush, Goo provides the golden trifecta of effects for those treating ADD/ADHD: appetite, sleepiness, and focus. This strain is meant for winding down, which can be difficult if you’re prescribed psychostimulant drugs that may stunt the appetite and keep you tossing and turning at night.\n\n“Currently one of my favorite strains. When my brain is too active I smoke this and it helps calm it down.”\n \n \nJupiter OG is another indica strain that can help restore appetite and restfulness when the side effects of your medications are at their worst. This indica may still provide a little kick of focus, but it should definitely be saved for later in the night when you’re ready to help your brain shut down.\nClick here to browse more appetite-enhancing, sedating strains.\n*Please consult with your doctor if you are being prescribed medication to treat your ADD/ADHD or another medical condition and ask if it’s advisable to supplement your regimen with medical marijuana.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12001420/best-cannabis-strains-for-focus-and-addadhd.jpg","urlslug":"/news/strains-products/best-cannabis-strains-for-focus-and-addadhd"},{"id":"contentitems-3583","title":"Top 10 Cannabis Strains in California","author":"Bailey Rahn","category":null,"date":"\/Date(1451937600000)\/","text":"California has its own unique strain landscape compared to the rest of the world. With a geography that favors outdoor grows, the Golden State has championed some of the world’s finest strain genetics. OG Kush crosses flourished throughout the state, and today you’d be hard-pressed to find a strain that hasn’t been crossed with this illustrious hybrid. What other strains have risen to the top of California’s market? You’re about to find out.\n\nUsing Leafly menu data from California dispensaries, we determined which strains appeared most often and synchronized these results with local search terms. Here are the top 10 according to our data – dispensary owners and budtenders, are these strains on your shelves?\n1. Blue Dream\n \nThis hybrid tops the charts in every major market, California included. Even in the state where OG Kush is expected to reign supreme, it would appear that Blue Dream still maintains a stranglehold. Leafly reviewers rant and rave over this uplifting berry-flavored hybrid, but do you think Blue Dream’s quality justifies its notoriety?\n2. GSC (f.k.a Girl Scout Cookies)\n \nThis California native has sprinted its way to fame in recent years, gobbling up awards left and right for its potency. Itself a descendent of OG Kush, GSC (f.k.a Girl Scout Cookies) is given an extra sativa lift from a Durban Poison parent. In masterful balance of soaring euphoria and deeply relaxing physical effects, it’s no wonder that GSC (f.k.a Girl Scout Cookies) ranks #2 in the California market.\n\n3. Sour Diesel\n \nNo doubt, Sour Diesel is a staple sativa that holds an esteemed position in most major markets. While some don’t like the strain’s funky fuel flavor, its weightless cerebral high is often worth it. The uplifting effects can help you get up and out, making this strain a perfect pair for those warm, sunny California days.\n4. OG Kush\n \nOG Kush, the flagship strain of California genetics, ranks #4 among its top strains. Reviewing this list, however, you’ll notice many of the forerunners are bred using OG Kush genetics. Countless other hybrids not mentioned here also contain OG genetics, so much so that you can attach “OG” to the end of almost any strain name and assume that some California breeder has already made it. OG Kush phenotypes are also marketed under a variety of monikers, many of which play off celebrity names and pop culture references. If we were to include all those branded OG Kushes, OG Kush might actually be the top California strain, period.\n5. Green Crack\n \nThough rare in many markets, Californians are lucky to enjoy better access to this ridiculously stimulating sativa strain. Green Crack’s racy cerebral high seems to have no ceiling, and hands down, no other strain on Leafly seems to yield as hilarious reviews as this one. California’s warm climate could very well be the reason for the abundance of this delicacy, because it sure isn’t due to lack of demand up in the cold north.\n\n6. Jack Herer\n \nJack Herer is the tried-and-true sativa you’d expect to find on any market’s top 10 list. Beautifully crafted genetics from Sensi Seeds give way to a balanced effect profile that promotes happiness, creativity, and an uplifting sense of energy. That, plus its rich woody pine aroma, explains why this Amsterdam transplant has been so widely embraced overseas.\n7. Skywalker OG\n \nWhen Skywalker met OG Kush, a beautiful baby was born. That baby is Skywalker OG, a strain that has earned its way to fame not by name (although that probably helped), but through potency and flavor. The THC content of this indica-dominant hybrid is certainly one to write home about, and I’ve seen the loud earthy and lemon flavors of this hybrid literally raise eyebrows.\n8. Bubba Kush\n \nBubba Kush has roots in California, so it’s not hard to imagine how this powerhouse indica carved a name for itself since its inception in the 90s. Earthy sweet aromas introduce tranquilizing mind and body effects, making this strain a perfect companion for lazy day relaxation or for a smooth transition into a restful night’s sleep.\n\n9. Fire OG\n \nThe predominant OG family has another prestigious strain in California, and its name is Fire OG. A cross of different OG Kush phenotypes, Fire OG takes on a fiery appearance with vibrant orange hair stretching out from a bed of crystal resin.\n10. SFV OG\n \nBorn and bred in California’s San Fernando Valley, this OG Kush phenotype is another unsurprising appearance on this list. Oozing trichomes as sticky as glue blanket the buds in a show of this hybrid’s potency. Sweet lemon and woody aromas lift from SFV OG’s crystal-covered buds in a testament to this strain’s true OG heritage.\nAre you a business looking to get a leg up on the competition in the crowded California market? Leafly can help you stand out among the others!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12002919/top-10-cannabis-strains-in-california.jpg","urlslug":"/news/strains-products/top-10-cannabis-strains-in-california"}],"reviewCount":3,"flavors":[{"name":"Flowery","score":40},{"name":"Diesel","score":27.142857142857142},{"name":"Pungent","score":20},{"name":"Citrus","score":3.5714285714285712},{"name":"Lemon","score":3.5714285714285712}],"effects":[{"name":"Happy","score":81.428571428571431},{"name":"Relaxed","score":57.857142857142861},{"name":"Talkative","score":30.714285714285715},{"name":"Giggly","score":30.714285714285715},{"name":"Creative","score":27.142857142857142}],"symptoms":[{"name":"Pain","score":47.142857142857139},{"name":"Stress","score":27.142857142857142},{"name":"Inflammation","score":7.1428571428571423},{"name":"Lack of Appetite","score":7.1428571428571423},{"name":"Nausea","score":7.1428571428571423}],"conditions":[{"name":"Anxiety","score":23.571428571428569},{"name":"ADD/ADHD","score":7.1428571428571423},{"name":"Arthritis","score":3.5714285714285712},{"name":"Cancer","score":3.5714285714285712},{"name":"Fibromyalgia","score":3.5714285714285712}],"negatives":[{"name":"Dry Eyes","score":20},{"name":"Dry Mouth","score":20}],"articlesAvailable":true,"articleTotalCount":3,"photos":[],"photoTotalCount":0,"popularCities":["Albany, OR","Beaverton, OR","Bellingham, WA","Everett, WA","Gold Bar, WA","Long Beach, CA","Mountlake Terrace, WA","Sedro-Woolley, WA","Spokane, WA","Tacoma, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/og-sour-diesel","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Sour OG","subtitle":null,"slug":"sour-og","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/sour-og","symbol":"Sog","applink":"leafly://strain/sour-og"},{"name":"East Coast Sour Diesel","subtitle":null,"slug":"east-coast-sour-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/east-coast-sour-diesel","symbol":"Eas","applink":"leafly://strain/east-coast-sour-diesel"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":297265,"slug":"og-sour-diesel","name":"OG Sour Diesel","subtitle":null,"symbol":"Gsd","category":"Hybrid","description":"\u003cp\u003eOG Sour Diesel by The Cali Connection is a riff on where \u003ca href=\"https://www.leafly.com/sativa/sour-diesel\"\u003eSour Diesel\u003c/a\u003e has been and where it is going. By combining \u003ca href=\"https://www.leafly.com/hybrid/sour-og\"\u003eSour OG\u003c/a\u003e and Cali Connection\u0026rsquo;s \u003ca href=\"https://www.leafly.com/sativa/east-coast-sour-diesel\"\u003eEast Coast Sour Diesel\u003c/a\u003e precursor, OG Sour Diesel adopts the historical ECSD lineage while offering a nod to the West Coast\u0026rsquo;s tradition of Kush-heavy crosses. The fuel aroma the buds emit is intense and astringent. The long-lasting cerebral effects mute stress without encumbering the body.\u003c/p\u003e\n","descriptionPlain":"OG Sour Diesel by The Cali Connection is a riff on where Sour Diesel has been and where it is going. By combining Sour OG and Cali Connection\u0026rsquo;s East Coast Sour Diesel precursor, OG Sour Diesel adopts the historical ECSD lineage while offering a nod to the West Coast\u0026rsquo;s tradition of Kush-heavy crosses. The fuel aroma the buds emit is intense and astringent. The long-lasting cerebral effects mute stress without encumbering the body.\n","aka":null,"rating":4,"highlightedReviews":[{"id":1412572,"username":"JrCroom","text":"Tight structure, lemon and spruce pine tree scent. light green, yellow tricome. some purpling ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1637910,"username":"fantastic21","text":"Love the colors of the bud \u0026 the taste and how it always be bustin in the backwood","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3027","title":"The Best Cannabis Strains for Focus and ADD/ADHD","author":"Bailey Rahn","category":null,"date":"\/Date(1452633240000)\/","text":"Whether or not you’ve been diagnosed with ADD or ADHD, sometimes we need a little help concentrating. You’ve probably noticed that certain varieties of cannabis help you stay focused and productive while others can send your mind completely off the rails. Finding that perfect focusing strain requires a little self-analysis first: What is it that’s impeding your concentration? Are you disengaged? Do your thoughts race? Think of the below sections as your roadmap to the right strain.\nWe’re still waiting for research to provide more guidance on why cannabis might or might not help someone with ADD/ADHD, but we’re limited mostly to personal anecdotes. It’s not a bad idea to try a few different strains – a high-THC strain, a low-THC strain, high-CBD, balanced THC-CBD, and so on. At the end of this list, you’ll also find some appetite-boosting, sleep-inducing strains for those of you experiencing the negative side effects of stimulant ADD/ADHD medications.\n \nStrains for Mental Energy and Engagement\n \nCinex is the strain you reach for when that cup of coffee didn’t do the job. Providing wired euphoria that feeds creativity, this sativa can rekindle interest in tasks that may otherwise be a drag. Take caution with this one if you’re prone to anxiety and racing thoughts; Cinex can turn that up in some individuals.\n \n \nIt’s famous for a reason. Sour Diesel is one of the highest-rated strains on Leafly for treatment of ADD/ADHD, quite possibly due to its ability to shine a new, engaging light on activities and tasks. Speedy euphoria lets your mind stay nimble, but remember that dosing is key. Overdoing a potent sativa like Sour Diesel can have the opposite of your desired effect.\n\n“It makes your frontal lobe act in ways you could never have imagined. It’s almost like Sour Diesel is a key, a key that opens up whole realms of your mind that you were once ignorant of.”\n \n \nAccording to lore, this sativa was dubbed Green Crack by Snoop Dogg because its effects were so intensely stimulating. Green Crack had to make the list because, in my experience, few other strains can match its energy and focus. It sharpens the senses and brings vibrancy to the dull, all with an enticing tropical citrus flavor.\nClick here to browse more strains with stimulating, focused effects.\n \nStrains for Calming Focus\n \nSometimes what you need to concentrate isn’t a strain that speeds your brain up, it’s one that can slow the brain down. The indica-dominant True OG is touted among reviewers for knocking down stress and distractions for easier focus.\n\n“Comes on kind of slowly. Is a chilling high, but you can easily focus and do things like schoolwork, cleaning, etc.”\n \n \nBlueberry Headband captures the perfect synergy of its two parents. From Headband, it inherits a supercharged cerebral effect that lends a spark of creativity. The Blueberry parent softens the euphoric intensity of Headband, providing a mellow, full-body experience that allows your thoughts run at a more manageable pace.\nClick here to browse more strains with relaxing, focused effects.\n \nStrains for Cognitive Clarity\n \nA cross between Sour Tsunami and Harlequin, Harle-Tsu is a high-CBD strain that contains minimal levels of THC. It eases you into a sober, clear-headed calm as its relaxing effects come with minimal psychoactive impact, so you can keep your cognitive faculties intact. If you’re having trouble finding Harle-Tsu near you, try finding its high-CBD parent strains or close relative, Canna-Tsu.\n\n“A good herb for relaxation. Not much of a cerebral high, but what little high you do get is focused and energetic but calm. Its good to mix with some powerful indicas to even it out.”\n \n \nCalming physical sensations coupled with agile cerebral focus, Harlequin is another high-CBD strain that should be on your radar if concentration is hard to come by. Although this ratio can fluctuate, Harlequin typically expresses a 5:2 ratio of CBD:THC, so expect some euphoric stimulation in the mind.\nClick here to browse more strains with a high CBD content.\n \nStrains for ADD/ADHD Medication Side Effects*\n \nA genetic cross between Blueberry and Hindu Kush, Goo provides the golden trifecta of effects for those treating ADD/ADHD: appetite, sleepiness, and focus. This strain is meant for winding down, which can be difficult if you’re prescribed psychostimulant drugs that may stunt the appetite and keep you tossing and turning at night.\n\n“Currently one of my favorite strains. When my brain is too active I smoke this and it helps calm it down.”\n \n \nJupiter OG is another indica strain that can help restore appetite and restfulness when the side effects of your medications are at their worst. This indica may still provide a little kick of focus, but it should definitely be saved for later in the night when you’re ready to help your brain shut down.\nClick here to browse more appetite-enhancing, sedating strains.\n*Please consult with your doctor if you are being prescribed medication to treat your ADD/ADHD or another medical condition and ask if it’s advisable to supplement your regimen with medical marijuana.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12001420/best-cannabis-strains-for-focus-and-addadhd.jpg","urlslug":"/news/strains-products/best-cannabis-strains-for-focus-and-addadhd"},{"id":"contentitems-3583","title":"Top 10 Cannabis Strains in California","author":"Bailey Rahn","category":null,"date":"\/Date(1451937600000)\/","text":"California has its own unique strain landscape compared to the rest of the world. With a geography that favors outdoor grows, the Golden State has championed some of the world’s finest strain genetics. OG Kush crosses flourished throughout the state, and today you’d be hard-pressed to find a strain that hasn’t been crossed with this illustrious hybrid. What other strains have risen to the top of California’s market? You’re about to find out.\n\nUsing Leafly menu data from California dispensaries, we determined which strains appeared most often and synchronized these results with local search terms. Here are the top 10 according to our data – dispensary owners and budtenders, are these strains on your shelves?\n1. Blue Dream\n \nThis hybrid tops the charts in every major market, California included. Even in the state where OG Kush is expected to reign supreme, it would appear that Blue Dream still maintains a stranglehold. Leafly reviewers rant and rave over this uplifting berry-flavored hybrid, but do you think Blue Dream’s quality justifies its notoriety?\n2. GSC (f.k.a Girl Scout Cookies)\n \nThis California native has sprinted its way to fame in recent years, gobbling up awards left and right for its potency. Itself a descendent of OG Kush, GSC (f.k.a Girl Scout Cookies) is given an extra sativa lift from a Durban Poison parent. In masterful balance of soaring euphoria and deeply relaxing physical effects, it’s no wonder that GSC (f.k.a Girl Scout Cookies) ranks #2 in the California market.\n\n3. Sour Diesel\n \nNo doubt, Sour Diesel is a staple sativa that holds an esteemed position in most major markets. While some don’t like the strain’s funky fuel flavor, its weightless cerebral high is often worth it. The uplifting effects can help you get up and out, making this strain a perfect pair for those warm, sunny California days.\n4. OG Kush\n \nOG Kush, the flagship strain of California genetics, ranks #4 among its top strains. Reviewing this list, however, you’ll notice many of the forerunners are bred using OG Kush genetics. Countless other hybrids not mentioned here also contain OG genetics, so much so that you can attach “OG” to the end of almost any strain name and assume that some California breeder has already made it. OG Kush phenotypes are also marketed under a variety of monikers, many of which play off celebrity names and pop culture references. If we were to include all those branded OG Kushes, OG Kush might actually be the top California strain, period.\n5. Green Crack\n \nThough rare in many markets, Californians are lucky to enjoy better access to this ridiculously stimulating sativa strain. Green Crack’s racy cerebral high seems to have no ceiling, and hands down, no other strain on Leafly seems to yield as hilarious reviews as this one. California’s warm climate could very well be the reason for the abundance of this delicacy, because it sure isn’t due to lack of demand up in the cold north.\n\n6. Jack Herer\n \nJack Herer is the tried-and-true sativa you’d expect to find on any market’s top 10 list. Beautifully crafted genetics from Sensi Seeds give way to a balanced effect profile that promotes happiness, creativity, and an uplifting sense of energy. That, plus its rich woody pine aroma, explains why this Amsterdam transplant has been so widely embraced overseas.\n7. Skywalker OG\n \nWhen Skywalker met OG Kush, a beautiful baby was born. That baby is Skywalker OG, a strain that has earned its way to fame not by name (although that probably helped), but through potency and flavor. The THC content of this indica-dominant hybrid is certainly one to write home about, and I’ve seen the loud earthy and lemon flavors of this hybrid literally raise eyebrows.\n8. Bubba Kush\n \nBubba Kush has roots in California, so it’s not hard to imagine how this powerhouse indica carved a name for itself since its inception in the 90s. Earthy sweet aromas introduce tranquilizing mind and body effects, making this strain a perfect companion for lazy day relaxation or for a smooth transition into a restful night’s sleep.\n\n9. Fire OG\n \nThe predominant OG family has another prestigious strain in California, and its name is Fire OG. A cross of different OG Kush phenotypes, Fire OG takes on a fiery appearance with vibrant orange hair stretching out from a bed of crystal resin.\n10. SFV OG\n \nBorn and bred in California’s San Fernando Valley, this OG Kush phenotype is another unsurprising appearance on this list. Oozing trichomes as sticky as glue blanket the buds in a show of this hybrid’s potency. Sweet lemon and woody aromas lift from SFV OG’s crystal-covered buds in a testament to this strain’s true OG heritage.\nAre you a business looking to get a leg up on the competition in the crowded California market? Leafly can help you stand out among the others!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12002919/top-10-cannabis-strains-in-california.jpg","urlslug":"/news/strains-products/top-10-cannabis-strains-in-california"}],"reviewCount":3,"flavors":[{"name":"Flowery","score":40},{"name":"Diesel","score":27.142857142857142},{"name":"Pungent","score":20},{"name":"Citrus","score":3.5714285714285712},{"name":"Lemon","score":3.5714285714285712}],"effects":[{"name":"Happy","score":81.428571428571431},{"name":"Relaxed","score":57.857142857142861},{"name":"Talkative","score":30.714285714285715},{"name":"Giggly","score":30.714285714285715},{"name":"Creative","score":27.142857142857142}],"symptoms":[{"name":"Pain","score":47.142857142857139},{"name":"Stress","score":27.142857142857142},{"name":"Inflammation","score":7.1428571428571423},{"name":"Lack of Appetite","score":7.1428571428571423},{"name":"Nausea","score":7.1428571428571423}],"conditions":[{"name":"Anxiety","score":23.571428571428569},{"name":"ADD/ADHD","score":7.1428571428571423},{"name":"Arthritis","score":3.5714285714285712},{"name":"Cancer","score":3.5714285714285712},{"name":"Fibromyalgia","score":3.5714285714285712}],"negatives":[{"name":"Dry Eyes","score":20},{"name":"Dry Mouth","score":20}],"articlesAvailable":true,"articleTotalCount":3,"photos":[],"photoTotalCount":0,"popularCities":["Albany, OR","Beaverton, OR","Bellingham, WA","Everett, WA","Gold Bar, WA","Long Beach, CA","Mountlake Terrace, WA","Sedro-Woolley, WA","Spokane, WA","Tacoma, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/og-sour-diesel","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Sour OG","subtitle":null,"slug":"sour-og","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/sour-og","symbol":"Sog","applink":"leafly://strain/sour-og"},{"name":"East Coast Sour Diesel","subtitle":null,"slug":"east-coast-sour-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/east-coast-sour-diesel","symbol":"Eas","applink":"leafly://strain/east-coast-sour-diesel"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":297265,"slug":"og-sour-diesel","name":"OG Sour Diesel","subtitle":null,"symbol":"Gsd","category":"Hybrid","description":"\u003cp\u003eOG Sour Diesel by The Cali Connection is a riff on where \u003ca href=\"https://www.leafly.com/sativa/sour-diesel\"\u003eSour Diesel\u003c/a\u003e has been and where it is going. By combining \u003ca href=\"https://www.leafly.com/hybrid/sour-og\"\u003eSour OG\u003c/a\u003e and Cali Connection\u0026rsquo;s \u003ca href=\"https://www.leafly.com/sativa/east-coast-sour-diesel\"\u003eEast Coast Sour Diesel\u003c/a\u003e precursor, OG Sour Diesel adopts the historical ECSD lineage while offering a nod to the West Coast\u0026rsquo;s tradition of Kush-heavy crosses. The fuel aroma the buds emit is intense and astringent. The long-lasting cerebral effects mute stress without encumbering the body.\u003c/p\u003e\n","descriptionPlain":"OG Sour Diesel by The Cali Connection is a riff on where Sour Diesel has been and where it is going. By combining Sour OG and Cali Connection\u0026rsquo;s East Coast Sour Diesel precursor, OG Sour Diesel adopts the historical ECSD lineage while offering a nod to the West Coast\u0026rsquo;s tradition of Kush-heavy crosses. The fuel aroma the buds emit is intense and astringent. The long-lasting cerebral effects mute stress without encumbering the body.\n","aka":null,"rating":4,"highlightedReviews":[{"id":1412572,"username":"JrCroom","text":"Tight structure, lemon and spruce pine tree scent. light green, yellow tricome. some purpling ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1637910,"username":"fantastic21","text":"Love the colors of the bud \u0026 the taste and how it always be bustin in the backwood","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3027","title":"The Best Cannabis Strains for Focus and ADD/ADHD","author":"Bailey Rahn","category":null,"date":"\/Date(1452633240000)\/","text":"Whether or not you’ve been diagnosed with ADD or ADHD, sometimes we need a little help concentrating. You’ve probably noticed that certain varieties of cannabis help you stay focused and productive while others can send your mind completely off the rails. Finding that perfect focusing strain requires a little self-analysis first: What is it that’s impeding your concentration? Are you disengaged? Do your thoughts race? Think of the below sections as your roadmap to the right strain.\nWe’re still waiting for research to provide more guidance on why cannabis might or might not help someone with ADD/ADHD, but we’re limited mostly to personal anecdotes. It’s not a bad idea to try a few different strains – a high-THC strain, a low-THC strain, high-CBD, balanced THC-CBD, and so on. At the end of this list, you’ll also find some appetite-boosting, sleep-inducing strains for those of you experiencing the negative side effects of stimulant ADD/ADHD medications.\n \nStrains for Mental Energy and Engagement\n \nCinex is the strain you reach for when that cup of coffee didn’t do the job. Providing wired euphoria that feeds creativity, this sativa can rekindle interest in tasks that may otherwise be a drag. Take caution with this one if you’re prone to anxiety and racing thoughts; Cinex can turn that up in some individuals.\n \n \nIt’s famous for a reason. Sour Diesel is one of the highest-rated strains on Leafly for treatment of ADD/ADHD, quite possibly due to its ability to shine a new, engaging light on activities and tasks. Speedy euphoria lets your mind stay nimble, but remember that dosing is key. Overdoing a potent sativa like Sour Diesel can have the opposite of your desired effect.\n\n“It makes your frontal lobe act in ways you could never have imagined. It’s almost like Sour Diesel is a key, a key that opens up whole realms of your mind that you were once ignorant of.”\n \n \nAccording to lore, this sativa was dubbed Green Crack by Snoop Dogg because its effects were so intensely stimulating. Green Crack had to make the list because, in my experience, few other strains can match its energy and focus. It sharpens the senses and brings vibrancy to the dull, all with an enticing tropical citrus flavor.\nClick here to browse more strains with stimulating, focused effects.\n \nStrains for Calming Focus\n \nSometimes what you need to concentrate isn’t a strain that speeds your brain up, it’s one that can slow the brain down. The indica-dominant True OG is touted among reviewers for knocking down stress and distractions for easier focus.\n\n“Comes on kind of slowly. Is a chilling high, but you can easily focus and do things like schoolwork, cleaning, etc.”\n \n \nBlueberry Headband captures the perfect synergy of its two parents. From Headband, it inherits a supercharged cerebral effect that lends a spark of creativity. The Blueberry parent softens the euphoric intensity of Headband, providing a mellow, full-body experience that allows your thoughts run at a more manageable pace.\nClick here to browse more strains with relaxing, focused effects.\n \nStrains for Cognitive Clarity\n \nA cross between Sour Tsunami and Harlequin, Harle-Tsu is a high-CBD strain that contains minimal levels of THC. It eases you into a sober, clear-headed calm as its relaxing effects come with minimal psychoactive impact, so you can keep your cognitive faculties intact. If you’re having trouble finding Harle-Tsu near you, try finding its high-CBD parent strains or close relative, Canna-Tsu.\n\n“A good herb for relaxation. Not much of a cerebral high, but what little high you do get is focused and energetic but calm. Its good to mix with some powerful indicas to even it out.”\n \n \nCalming physical sensations coupled with agile cerebral focus, Harlequin is another high-CBD strain that should be on your radar if concentration is hard to come by. Although this ratio can fluctuate, Harlequin typically expresses a 5:2 ratio of CBD:THC, so expect some euphoric stimulation in the mind.\nClick here to browse more strains with a high CBD content.\n \nStrains for ADD/ADHD Medication Side Effects*\n \nA genetic cross between Blueberry and Hindu Kush, Goo provides the golden trifecta of effects for those treating ADD/ADHD: appetite, sleepiness, and focus. This strain is meant for winding down, which can be difficult if you’re prescribed psychostimulant drugs that may stunt the appetite and keep you tossing and turning at night.\n\n“Currently one of my favorite strains. When my brain is too active I smoke this and it helps calm it down.”\n \n \nJupiter OG is another indica strain that can help restore appetite and restfulness when the side effects of your medications are at their worst. This indica may still provide a little kick of focus, but it should definitely be saved for later in the night when you’re ready to help your brain shut down.\nClick here to browse more appetite-enhancing, sedating strains.\n*Please consult with your doctor if you are being prescribed medication to treat your ADD/ADHD or another medical condition and ask if it’s advisable to supplement your regimen with medical marijuana.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12001420/best-cannabis-strains-for-focus-and-addadhd.jpg","urlslug":"/news/strains-products/best-cannabis-strains-for-focus-and-addadhd"},{"id":"contentitems-3583","title":"Top 10 Cannabis Strains in California","author":"Bailey Rahn","category":null,"date":"\/Date(1451937600000)\/","text":"California has its own unique strain landscape compared to the rest of the world. With a geography that favors outdoor grows, the Golden State has championed some of the world’s finest strain genetics. OG Kush crosses flourished throughout the state, and today you’d be hard-pressed to find a strain that hasn’t been crossed with this illustrious hybrid. What other strains have risen to the top of California’s market? You’re about to find out.\n\nUsing Leafly menu data from California dispensaries, we determined which strains appeared most often and synchronized these results with local search terms. Here are the top 10 according to our data – dispensary owners and budtenders, are these strains on your shelves?\n1. Blue Dream\n \nThis hybrid tops the charts in every major market, California included. Even in the state where OG Kush is expected to reign supreme, it would appear that Blue Dream still maintains a stranglehold. Leafly reviewers rant and rave over this uplifting berry-flavored hybrid, but do you think Blue Dream’s quality justifies its notoriety?\n2. GSC (f.k.a Girl Scout Cookies)\n \nThis California native has sprinted its way to fame in recent years, gobbling up awards left and right for its potency. Itself a descendent of OG Kush, GSC (f.k.a Girl Scout Cookies) is given an extra sativa lift from a Durban Poison parent. In masterful balance of soaring euphoria and deeply relaxing physical effects, it’s no wonder that GSC (f.k.a Girl Scout Cookies) ranks #2 in the California market.\n\n3. Sour Diesel\n \nNo doubt, Sour Diesel is a staple sativa that holds an esteemed position in most major markets. While some don’t like the strain’s funky fuel flavor, its weightless cerebral high is often worth it. The uplifting effects can help you get up and out, making this strain a perfect pair for those warm, sunny California days.\n4. OG Kush\n \nOG Kush, the flagship strain of California genetics, ranks #4 among its top strains. Reviewing this list, however, you’ll notice many of the forerunners are bred using OG Kush genetics. Countless other hybrids not mentioned here also contain OG genetics, so much so that you can attach “OG” to the end of almost any strain name and assume that some California breeder has already made it. OG Kush phenotypes are also marketed under a variety of monikers, many of which play off celebrity names and pop culture references. If we were to include all those branded OG Kushes, OG Kush might actually be the top California strain, period.\n5. Green Crack\n \nThough rare in many markets, Californians are lucky to enjoy better access to this ridiculously stimulating sativa strain. Green Crack’s racy cerebral high seems to have no ceiling, and hands down, no other strain on Leafly seems to yield as hilarious reviews as this one. California’s warm climate could very well be the reason for the abundance of this delicacy, because it sure isn’t due to lack of demand up in the cold north.\n\n6. Jack Herer\n \nJack Herer is the tried-and-true sativa you’d expect to find on any market’s top 10 list. Beautifully crafted genetics from Sensi Seeds give way to a balanced effect profile that promotes happiness, creativity, and an uplifting sense of energy. That, plus its rich woody pine aroma, explains why this Amsterdam transplant has been so widely embraced overseas.\n7. Skywalker OG\n \nWhen Skywalker met OG Kush, a beautiful baby was born. That baby is Skywalker OG, a strain that has earned its way to fame not by name (although that probably helped), but through potency and flavor. The THC content of this indica-dominant hybrid is certainly one to write home about, and I’ve seen the loud earthy and lemon flavors of this hybrid literally raise eyebrows.\n8. Bubba Kush\n \nBubba Kush has roots in California, so it’s not hard to imagine how this powerhouse indica carved a name for itself since its inception in the 90s. Earthy sweet aromas introduce tranquilizing mind and body effects, making this strain a perfect companion for lazy day relaxation or for a smooth transition into a restful night’s sleep.\n\n9. Fire OG\n \nThe predominant OG family has another prestigious strain in California, and its name is Fire OG. A cross of different OG Kush phenotypes, Fire OG takes on a fiery appearance with vibrant orange hair stretching out from a bed of crystal resin.\n10. SFV OG\n \nBorn and bred in California’s San Fernando Valley, this OG Kush phenotype is another unsurprising appearance on this list. Oozing trichomes as sticky as glue blanket the buds in a show of this hybrid’s potency. Sweet lemon and woody aromas lift from SFV OG’s crystal-covered buds in a testament to this strain’s true OG heritage.\nAre you a business looking to get a leg up on the competition in the crowded California market? Leafly can help you stand out among the others!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12002919/top-10-cannabis-strains-in-california.jpg","urlslug":"/news/strains-products/top-10-cannabis-strains-in-california"}],"reviewCount":3,"flavors":[{"name":"Flowery","score":40},{"name":"Diesel","score":27.142857142857142},{"name":"Pungent","score":20},{"name":"Citrus","score":3.5714285714285712},{"name":"Lemon","score":3.5714285714285712}],"effects":[{"name":"Happy","score":81.428571428571431},{"name":"Relaxed","score":57.857142857142861},{"name":"Talkative","score":30.714285714285715},{"name":"Giggly","score":30.714285714285715},{"name":"Creative","score":27.142857142857142}],"symptoms":[{"name":"Pain","score":47.142857142857139},{"name":"Stress","score":27.142857142857142},{"name":"Inflammation","score":7.1428571428571423},{"name":"Lack of Appetite","score":7.1428571428571423},{"name":"Nausea","score":7.1428571428571423}],"conditions":[{"name":"Anxiety","score":23.571428571428569},{"name":"ADD/ADHD","score":7.1428571428571423},{"name":"Arthritis","score":3.5714285714285712},{"name":"Cancer","score":3.5714285714285712},{"name":"Fibromyalgia","score":3.5714285714285712}],"negatives":[{"name":"Dry Eyes","score":20},{"name":"Dry Mouth","score":20}],"articlesAvailable":true,"articleTotalCount":3,"photos":[],"photoTotalCount":0,"popularCities":["Albany, OR","Beaverton, OR","Bellingham, WA","Everett, WA","Gold Bar, WA","Long Beach, CA","Mountlake Terrace, WA","Sedro-Woolley, WA","Spokane, WA","Tacoma, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/og-sour-diesel","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Sour OG","subtitle":null,"slug":"sour-og","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/sour-og","symbol":"Sog","applink":"leafly://strain/sour-og"},{"name":"East Coast Sour Diesel","subtitle":null,"slug":"east-coast-sour-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/east-coast-sour-diesel","symbol":"Eas","applink":"leafly://strain/east-coast-sour-diesel"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":297265,"slug":"og-sour-diesel","name":"OG Sour Diesel","subtitle":null,"symbol":"Gsd","category":"Hybrid","description":"\u003cp\u003eOG Sour Diesel by The Cali Connection is a riff on where \u003ca href=\"https://www.leafly.com/sativa/sour-diesel\"\u003eSour Diesel\u003c/a\u003e has been and where it is going. By combining \u003ca href=\"https://www.leafly.com/hybrid/sour-og\"\u003eSour OG\u003c/a\u003e and Cali Connection\u0026rsquo;s \u003ca href=\"https://www.leafly.com/sativa/east-coast-sour-diesel\"\u003eEast Coast Sour Diesel\u003c/a\u003e precursor, OG Sour Diesel adopts the historical ECSD lineage while offering a nod to the West Coast\u0026rsquo;s tradition of Kush-heavy crosses. The fuel aroma the buds emit is intense and astringent. The long-lasting cerebral effects mute stress without encumbering the body.\u003c/p\u003e\n","descriptionPlain":"OG Sour Diesel by The Cali Connection is a riff on where Sour Diesel has been and where it is going. By combining Sour OG and Cali Connection\u0026rsquo;s East Coast Sour Diesel precursor, OG Sour Diesel adopts the historical ECSD lineage while offering a nod to the West Coast\u0026rsquo;s tradition of Kush-heavy crosses. The fuel aroma the buds emit is intense and astringent. The long-lasting cerebral effects mute stress without encumbering the body.\n","aka":null,"rating":4,"highlightedReviews":[{"id":1412572,"username":"JrCroom","text":"Tight structure, lemon and spruce pine tree scent. light green, yellow tricome. some purpling ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1637910,"username":"fantastic21","text":"Love the colors of the bud \u0026 the taste and how it always be bustin in the backwood","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3027","title":"The Best Cannabis Strains for Focus and ADD/ADHD","author":"Bailey Rahn","category":null,"date":"\/Date(1452633240000)\/","text":"Whether or not you’ve been diagnosed with ADD or ADHD, sometimes we need a little help concentrating. You’ve probably noticed that certain varieties of cannabis help you stay focused and productive while others can send your mind completely off the rails. Finding that perfect focusing strain requires a little self-analysis first: What is it that’s impeding your concentration? Are you disengaged? Do your thoughts race? Think of the below sections as your roadmap to the right strain.\nWe’re still waiting for research to provide more guidance on why cannabis might or might not help someone with ADD/ADHD, but we’re limited mostly to personal anecdotes. It’s not a bad idea to try a few different strains – a high-THC strain, a low-THC strain, high-CBD, balanced THC-CBD, and so on. At the end of this list, you’ll also find some appetite-boosting, sleep-inducing strains for those of you experiencing the negative side effects of stimulant ADD/ADHD medications.\n \nStrains for Mental Energy and Engagement\n \nCinex is the strain you reach for when that cup of coffee didn’t do the job. Providing wired euphoria that feeds creativity, this sativa can rekindle interest in tasks that may otherwise be a drag. Take caution with this one if you’re prone to anxiety and racing thoughts; Cinex can turn that up in some individuals.\n \n \nIt’s famous for a reason. Sour Diesel is one of the highest-rated strains on Leafly for treatment of ADD/ADHD, quite possibly due to its ability to shine a new, engaging light on activities and tasks. Speedy euphoria lets your mind stay nimble, but remember that dosing is key. Overdoing a potent sativa like Sour Diesel can have the opposite of your desired effect.\n\n“It makes your frontal lobe act in ways you could never have imagined. It’s almost like Sour Diesel is a key, a key that opens up whole realms of your mind that you were once ignorant of.”\n \n \nAccording to lore, this sativa was dubbed Green Crack by Snoop Dogg because its effects were so intensely stimulating. Green Crack had to make the list because, in my experience, few other strains can match its energy and focus. It sharpens the senses and brings vibrancy to the dull, all with an enticing tropical citrus flavor.\nClick here to browse more strains with stimulating, focused effects.\n \nStrains for Calming Focus\n \nSometimes what you need to concentrate isn’t a strain that speeds your brain up, it’s one that can slow the brain down. The indica-dominant True OG is touted among reviewers for knocking down stress and distractions for easier focus.\n\n“Comes on kind of slowly. Is a chilling high, but you can easily focus and do things like schoolwork, cleaning, etc.”\n \n \nBlueberry Headband captures the perfect synergy of its two parents. From Headband, it inherits a supercharged cerebral effect that lends a spark of creativity. The Blueberry parent softens the euphoric intensity of Headband, providing a mellow, full-body experience that allows your thoughts run at a more manageable pace.\nClick here to browse more strains with relaxing, focused effects.\n \nStrains for Cognitive Clarity\n \nA cross between Sour Tsunami and Harlequin, Harle-Tsu is a high-CBD strain that contains minimal levels of THC. It eases you into a sober, clear-headed calm as its relaxing effects come with minimal psychoactive impact, so you can keep your cognitive faculties intact. If you’re having trouble finding Harle-Tsu near you, try finding its high-CBD parent strains or close relative, Canna-Tsu.\n\n“A good herb for relaxation. Not much of a cerebral high, but what little high you do get is focused and energetic but calm. Its good to mix with some powerful indicas to even it out.”\n \n \nCalming physical sensations coupled with agile cerebral focus, Harlequin is another high-CBD strain that should be on your radar if concentration is hard to come by. Although this ratio can fluctuate, Harlequin typically expresses a 5:2 ratio of CBD:THC, so expect some euphoric stimulation in the mind.\nClick here to browse more strains with a high CBD content.\n \nStrains for ADD/ADHD Medication Side Effects*\n \nA genetic cross between Blueberry and Hindu Kush, Goo provides the golden trifecta of effects for those treating ADD/ADHD: appetite, sleepiness, and focus. This strain is meant for winding down, which can be difficult if you’re prescribed psychostimulant drugs that may stunt the appetite and keep you tossing and turning at night.\n\n“Currently one of my favorite strains. When my brain is too active I smoke this and it helps calm it down.”\n \n \nJupiter OG is another indica strain that can help restore appetite and restfulness when the side effects of your medications are at their worst. This indica may still provide a little kick of focus, but it should definitely be saved for later in the night when you’re ready to help your brain shut down.\nClick here to browse more appetite-enhancing, sedating strains.\n*Please consult with your doctor if you are being prescribed medication to treat your ADD/ADHD or another medical condition and ask if it’s advisable to supplement your regimen with medical marijuana.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12001420/best-cannabis-strains-for-focus-and-addadhd.jpg","urlslug":"/news/strains-products/best-cannabis-strains-for-focus-and-addadhd"},{"id":"contentitems-3583","title":"Top 10 Cannabis Strains in California","author":"Bailey Rahn","category":null,"date":"\/Date(1451937600000)\/","text":"California has its own unique strain landscape compared to the rest of the world. With a geography that favors outdoor grows, the Golden State has championed some of the world’s finest strain genetics. OG Kush crosses flourished throughout the state, and today you’d be hard-pressed to find a strain that hasn’t been crossed with this illustrious hybrid. What other strains have risen to the top of California’s market? You’re about to find out.\n\nUsing Leafly menu data from California dispensaries, we determined which strains appeared most often and synchronized these results with local search terms. Here are the top 10 according to our data – dispensary owners and budtenders, are these strains on your shelves?\n1. Blue Dream\n \nThis hybrid tops the charts in every major market, California included. Even in the state where OG Kush is expected to reign supreme, it would appear that Blue Dream still maintains a stranglehold. Leafly reviewers rant and rave over this uplifting berry-flavored hybrid, but do you think Blue Dream’s quality justifies its notoriety?\n2. GSC (f.k.a Girl Scout Cookies)\n \nThis California native has sprinted its way to fame in recent years, gobbling up awards left and right for its potency. Itself a descendent of OG Kush, GSC (f.k.a Girl Scout Cookies) is given an extra sativa lift from a Durban Poison parent. In masterful balance of soaring euphoria and deeply relaxing physical effects, it’s no wonder that GSC (f.k.a Girl Scout Cookies) ranks #2 in the California market.\n\n3. Sour Diesel\n \nNo doubt, Sour Diesel is a staple sativa that holds an esteemed position in most major markets. While some don’t like the strain’s funky fuel flavor, its weightless cerebral high is often worth it. The uplifting effects can help you get up and out, making this strain a perfect pair for those warm, sunny California days.\n4. OG Kush\n \nOG Kush, the flagship strain of California genetics, ranks #4 among its top strains. Reviewing this list, however, you’ll notice many of the forerunners are bred using OG Kush genetics. Countless other hybrids not mentioned here also contain OG genetics, so much so that you can attach “OG” to the end of almost any strain name and assume that some California breeder has already made it. OG Kush phenotypes are also marketed under a variety of monikers, many of which play off celebrity names and pop culture references. If we were to include all those branded OG Kushes, OG Kush might actually be the top California strain, period.\n5. Green Crack\n \nThough rare in many markets, Californians are lucky to enjoy better access to this ridiculously stimulating sativa strain. Green Crack’s racy cerebral high seems to have no ceiling, and hands down, no other strain on Leafly seems to yield as hilarious reviews as this one. California’s warm climate could very well be the reason for the abundance of this delicacy, because it sure isn’t due to lack of demand up in the cold north.\n\n6. Jack Herer\n \nJack Herer is the tried-and-true sativa you’d expect to find on any market’s top 10 list. Beautifully crafted genetics from Sensi Seeds give way to a balanced effect profile that promotes happiness, creativity, and an uplifting sense of energy. That, plus its rich woody pine aroma, explains why this Amsterdam transplant has been so widely embraced overseas.\n7. Skywalker OG\n \nWhen Skywalker met OG Kush, a beautiful baby was born. That baby is Skywalker OG, a strain that has earned its way to fame not by name (although that probably helped), but through potency and flavor. The THC content of this indica-dominant hybrid is certainly one to write home about, and I’ve seen the loud earthy and lemon flavors of this hybrid literally raise eyebrows.\n8. Bubba Kush\n \nBubba Kush has roots in California, so it’s not hard to imagine how this powerhouse indica carved a name for itself since its inception in the 90s. Earthy sweet aromas introduce tranquilizing mind and body effects, making this strain a perfect companion for lazy day relaxation or for a smooth transition into a restful night’s sleep.\n\n9. Fire OG\n \nThe predominant OG family has another prestigious strain in California, and its name is Fire OG. A cross of different OG Kush phenotypes, Fire OG takes on a fiery appearance with vibrant orange hair stretching out from a bed of crystal resin.\n10. SFV OG\n \nBorn and bred in California’s San Fernando Valley, this OG Kush phenotype is another unsurprising appearance on this list. Oozing trichomes as sticky as glue blanket the buds in a show of this hybrid’s potency. Sweet lemon and woody aromas lift from SFV OG’s crystal-covered buds in a testament to this strain’s true OG heritage.\nAre you a business looking to get a leg up on the competition in the crowded California market? Leafly can help you stand out among the others!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12002919/top-10-cannabis-strains-in-california.jpg","urlslug":"/news/strains-products/top-10-cannabis-strains-in-california"}],"reviewCount":3,"flavors":[{"name":"Flowery","score":40},{"name":"Diesel","score":27.142857142857142},{"name":"Pungent","score":20},{"name":"Citrus","score":3.5714285714285712},{"name":"Lemon","score":3.5714285714285712}],"effects":[{"name":"Happy","score":81.428571428571431},{"name":"Relaxed","score":57.857142857142861},{"name":"Talkative","score":30.714285714285715},{"name":"Giggly","score":30.714285714285715},{"name":"Creative","score":27.142857142857142}],"symptoms":[{"name":"Pain","score":47.142857142857139},{"name":"Stress","score":27.142857142857142},{"name":"Inflammation","score":7.1428571428571423},{"name":"Lack of Appetite","score":7.1428571428571423},{"name":"Nausea","score":7.1428571428571423}],"conditions":[{"name":"Anxiety","score":23.571428571428569},{"name":"ADD/ADHD","score":7.1428571428571423},{"name":"Arthritis","score":3.5714285714285712},{"name":"Cancer","score":3.5714285714285712},{"name":"Fibromyalgia","score":3.5714285714285712}],"negatives":[{"name":"Dry Eyes","score":20},{"name":"Dry Mouth","score":20}],"articlesAvailable":true,"articleTotalCount":3,"photos":[],"photoTotalCount":0,"popularCities":["Albany, OR","Beaverton, OR","Bellingham, WA","Everett, WA","Gold Bar, WA","Long Beach, CA","Mountlake Terrace, WA","Sedro-Woolley, WA","Spokane, WA","Tacoma, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/og-sour-diesel","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Sour OG","subtitle":null,"slug":"sour-og","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/sour-og","symbol":"Sog","applink":"leafly://strain/sour-og"},{"name":"East Coast Sour Diesel","subtitle":null,"slug":"east-coast-sour-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/east-coast-sour-diesel","symbol":"Eas","applink":"leafly://strain/east-coast-sour-diesel"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
