{
    "aka": "CannaTsu, Canna Tsu, CannaSue, Canna Sue, Canna Su, Canna-Su, CannaSu",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1476380337000)/",
            "id": "contentitems-8593",
            "text": "Cannabidiol, or CBD, is the second most common cannabinoid found in cannabis. Unlike its psychoactive sister, THC (or tetrahydrocannabinol), CBD plays it cool, offering relaxing, non-intoxicating effects that lend themselves to a variety of personal and medicinal uses. Because CBD lacks the stoney side effects typical of high-THC strains, it’s a great choice for patients needing to keep a clear head while treating pain, nausea, headaches, stress, anxiety, muscle spasms, epilepsy, and more.\nBut with so many high-CBD strains hitting the market today, it can be difficult to choose one. These high-CBD strains are the most popular and easy-to-find based on Leafly user-submitted reviews. Just click the strain tile to check if a strain is available near you!\nHarlequin\n \nHarlequin is one of the most popular CBD strains available. Typically testing around the 5:2 CBD/THC ratio, it exhibits a sativa-dominant alertness with only mild euphoria. Harlequin has a happy bent that most will find enhances whatever activity they are engaged in.\nRingo’s Gift\n \nRingo’s Gift – named for activist, CBD specialist, and founder of SoHum Seeds, Lawrence Ringo – is a hybrid cross of Harle-Tsu and ACDC. It keeps on giving to patients seeking a nearly full-on CBD-driven strain, with an average ratio of 24:1 CBD/THC.\nSweet and Sour Widow\n \nSweet and Sour Widow lands in the middle ground with a 1:1 CBD/THC ratio. This even split offers first-time cannabis consumers an enjoyable entry point to both THC and CBD without sending them into orbit. It also makes for good medicine while being slightly euphoric and stoney.\nStephen Hawking Kush\n \nStephen Hawking Kush offers mild, relaxing effects while doling out a healthy dose of CBD, too. This indica-dominant strain is one of the more unique CBD cuts out there, offering both heady and soothing effects.\nACDC\n \nACDC is easily my favorite CBD strain. The cannabinoid content is usually heavily CBD-dominant, sitting on average at 20:1 in its CBD/THC ratio. An imperceptible amount of THC makes ACDC an outstanding companion for daily medicinal cannabis consumers seeking to relieve tension, pain, or anxiety.\nCannatonic\n \nCannatonic isn’t nearly as sedative as the name implies. This strain usually brings a smaller CBD/THC split, ranging from 5:1 down to 1:1. This even-keeled cannabinoid profile gives consumers a great deal of flexibility to use Cannatonic as medicine or as an enjoyable, mild mannered strain to unwind with.\nHarle-Tsu\n \nHarle-Tsu, one of a few lovingly handcrafted strains created by the late Lawrence Ringo, is an outstandingly functional CBD cut. By combining Harlequin and Sour Tsunami, Harle-Tsu achieves a pleasant disposition without encumbering the consumer with strong sedation.\nCanna-Tsu\n \nCanna-Tsu is a more balanced CBD/THC strain that offers a unique bouquet of smells. With aromas of citrus and sweet earth, Canna-Tsu gives the CBD enthusiast a complex palate of flavor and terpenes to enjoy.\nSour Tsunami\n \nCreated by the larger-than-life grower and activist Lawrence Ringo, Sour Tsunami was brought into being by combining Sour Diesel and NYC Diesel. This unlikely pair of stimulating plants bred the high-CBD phenotype that has since redefined the medicinal qualities of cannabis.\nPennywise\n \nPennywise certainly has the scariest of all the names that made this list, or at least it does for those familiar with the Stephen King book responsible for its namesake. But fear not, Pennywise truly gets its name from its genetic cross of Harlequin and Jack the Ripper. It synthesizes Jack the Ripper’s mental clarity and an even 1:1 CBD/THC to make a strain that is functional and enjoyable at almost any dose.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/10/23143140/cbd-week-7.jpg",
            "title": "The 10 Best CBD Cannabis Strains According to Leafly Users",
            "urlslug": "/news/strains-products/10-best-cbd-cannabis-strains-according-to-leafly-users"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1455998400000)/",
            "id": "contentitems-2955",
            "text": "“There’s weed that don’t make you hungry? For real? Honey, this changes everything.”\nThat was my Lyft driver’s response when I told her not all cannabis makes your gullet an insatiable black hole. Most cannabis consumers – especially first-time experimenters – have only tried high-THC strains, so it’s no wonder that the dispelling of this common misconception comes to the surprise of many who have long associated cannabis with the inevitable “munchies” syndrome.\nThe munchies can be a beautiful thing, and I’m not just talking about the pure ecstasy that comes with dual-wielding a fried chicken leg and an ice cream sandwich once in a while. That appetite stimulation is life-changing for patients dealing with cancer, depression, and other gastrointestinal/appetite disorders. But not everyone wants uncontrollable food lust, and some will actively avoid cannabis because of this one side effect – particularly those struggling with pre-existing eating and weight issues.\nFor those of you interested in reaping the myriad of benefits cannabis has to offer without the unbridled gluttony, we hope you find this list helpful. Remember, you can click the strain to see if it’s available at a store or dispensary near you!\n\n \nHigh-CBD Strains\nIf you’ve ever tried a high-CBD strain before, you’ve probably noticed that they don’t summon the munchies monster like THC-rich varieties. A Yale study published last year found that THC – the same chemical responsible for cannabis’ euphoric high – stimulated a group of nerve cells in the hypothalamus, the area of the brain that governs instincts like hunger and arousal.\n\nWhile less is known about CBD’s influence on appetite, we do know that this non-psychoactive constituent counteracts many effects of THC and researchers have even eyed CBD as an anti-obesity treatment based on its activity in the brain. Our own anecdotal evidence leads us to recommend high-CBD, low-THC strains for the best “munchie-less” experience, but a strain with equal parts CBD and THC can also induce less hunger with the added benefit of mild euphoria.\n\n \n\nA popular strain found in many Oregon shops, Harle-Tsu is hybrid cross between two high-CBD parents, Harlequin and Sour Tsunami (which are also worth looking into for minimal munchies strains). Harle-Tsu typically expresses a high-CBD profile with very little THC, making it a perfect choice for anyone who wants the relaxing and therapeutic effects of cannabis minus the euphoria or paranoia.\n \n\nThe “Remedy” for your over-excited appetite is this indica cross between Cannatonic and Afghan Skunk. With a THC content that rarely squeaks past 1%, Remedy delivers mental tranquility and physical relief without the psychoactive burden. This Pacific Northwest strain is perfect for the patient needing to curb pain, anxiety, tension, headaches, or insomnia, but doesn’t want to interrupt their day with hourly snack breaks.\n \n\nCanna-Tsu is taking off across the U.S., discoverable in Oregon, California, Illinois, Washington, Colorado, and many other medical marijuana states. Sweet and earthy in flavor, Canna-Tsu provides a boost to both mood and focus. Though this strain may calm upset tummies, you shouldn’t feel any extra rumblings of hunger.\n \n\nFor uncompromised energy and clarity, we recommend the low-munchies sativa MediHaze. This one can sometimes exhibit equal levels of THC and CBD, but compared to high-THC, low-CBD strains, MediHaze is much better for keeping the appetite at bay.\n \n\nSimilar to the widely coveted ACDC hybrid, Cannatonic is a high-CBD strain that relaxes the body while leaving the mind free to focus. On average, Cannatonic has a 2:1 ratio of CBD:THC, meaning you probably won’t feel much in the way of a high or hunger.\n \nHigh THCV Sativa Strains\nBy now you know what THC and CBD is, but you may not be familiar with the less ubiquitous THCV, a related chemical that suppresses appetite. While most strains on the market today tend to test anywhere between 10-20% THC, what’s considered a high THCV content might only hit a high-water mark of 5%. THCV tends to be more abundant in sativa strains, and it’s possible you’ve noticed that sativas tend to provoke hunger less than indica strains. The unique metabolic effects of THCV even have researchers considering its utility in treating obesity and diabetes.\n\nWhile high-CBD strains tend to induce little to no high, these THCV-rich sativas produce high-energy, psychoactive effects. That’s good news if you like the euphoria associated with cannabis, but don’t want the raging appetite.\n \n\nWith an average THCV content that ranges between 0.2 to 1.8%, Durban Poison is the perfect weapon against overactive appetites and can be found in most major markets. Cherished for its active, upbeat high that can fuel productivity, this pure African sativa keeps you focused on what matters more than snacks.\n \n\nResist the call of the pizza with Power Plant, an electrifying sativa that descends from African landrace strains. Its spicy, peppery aroma perks up the senses, leaving you with inspiration and positivity instead of a demanding stomach. You can find Power Plant in many different markets across the U.S. and beyond, so check to see if a shop near you is carrying it.\n \n\nKill the temptation to order half Taco Bell’s menu with Jack the Ripper, a sativa strain that carries a tantalizing lemon scent. A favorite in the Pacific Northwest, this invigorating sativa is sure to summon a talkative mood long before a talkative tum.\n \n\nAnother African sativa, Red Congolese focuses all of its psychoactive energy in the head, helping creativity and focus to thrive. Among the list of activities this sativa motivates, you’ll sooner find hiking, painting, and reading more appealing than eating the entire contents of your fridge. Though most frequently found in Vancouver, BC and Ontario, you might be delightfully surprised by its occasional appearance on the West Coast and in other areas of the U.S..\n \n\nAs sweet and citrusy as this sativa might taste, Moby Dick doesn’t coerce the appetite as much as other strains. Expect instead to feel your mood and energy elevate to a place in which it’s easy to feel satisfied whether or not you treated yourself to an entire cheesecake. This sativa is lovingly embraced in Canada and Spain, although Americans have also reported sightings of the legendary Moby Dick in many markets.\nInterested in strains that do make you hungry? Try these 10!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/10173255/iStock-526148526.jpg",
            "title": "10 Cannabis Strains That Won’t Make You (As) Hungry",
            "urlslug": "/news/strains-products/10-cannabis-strains-that-wont-make-you-as-hungry"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 57.82657941102442
        },
        {
            "name": "PTSD",
            "score": 52.27032469166876
        },
        {
            "name": "Migraines",
            "score": 28.721369242386103
        },
        {
            "name": "Arthritis",
            "score": 25.455575132141956
        },
        {
            "name": "ADD/ADHD",
            "score": 6.6322678077019885
        }
    ],
    "description": "<p>Canna-Tsu is a <a href=\"http://www.leafly.com/explore/category-hybrid\">hybrid</a> cannabis strain that combines genetics from two <a href=\"https://www.leafly.com/news/cannabis-101/whats-the-deal-with-these-high-cbd-strains\">CBD</a>-rich parents, <a href=\"http://leafly.com/hybrid/cannatonic\">Cannatonic</a> and <a href=\"http://leafly.com/hybrid/sour-tsunami\">Sour Tsunami</a>. <a href=\"http://www.leafly.com/explore/flavors-sweet\">Sweet</a> <a href=\"http://www.leafly.com/explore/flavors-earthy\">earthy</a> flavors activate on the exhale, complementing the subtle <a href=\"http://www.leafly.com/explore/flavors-citrus\">citrus</a> aroma that radiates from Canna-Tsu&rsquo;s buds. Because of its high-CBD, low-THC <a href=\"https://www.leafly.com/news/cannabis-101/cannabinoids-101-what-makes-cannabis-medicine\">cannabinoid</a> profile, Canna-Tsu delivers its mellow effects with mental clarity. Strains high in CBD like Canna-Tsu are highly demanded by patients treating <a href=\"http://www.leafly.com/explore/symptoms-pain\">pain</a>, <a href=\"http://www.leafly.com/explore/symptoms-inflammation\">inflammation</a>, <a href=\"http://www.leafly.com/explore/conditions-anxiety\">anxiety</a>, and <a href=\"http://www.leafly.com/explore/symptoms-seizures\">seizures</a>.&nbsp;</p>\n",
    "descriptionPlain": "Canna-Tsu is a hybrid cannabis strain that combines genetics from two CBD-rich parents, Cannatonic and Sour Tsunami. Sweet earthy flavors activate on the exhale, complementing the subtle citrus aroma that radiates from Canna-Tsu&rsquo;s buds. Because of its high-CBD, low-THC cannabinoid profile, Canna-Tsu delivers its mellow effects with mental clarity. Strains high in CBD like Canna-Tsu are highly demanded by patients treating pain, inflammation, anxiety, and seizures.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 75.36999748301032
        },
        {
            "name": "Focused",
            "score": 40.36244651396929
        },
        {
            "name": "Happy",
            "score": 39.81500125849484
        },
        {
            "name": "Uplifted",
            "score": 35.00755096904103
        },
        {
            "name": "Euphoric",
            "score": 28.74024666498867
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 13.912660458092123
        },
        {
            "name": "Woody",
            "score": 12.270324691668765
        },
        {
            "name": "Spicy/Herbal",
            "score": 4.725648124842688
        },
        {
            "name": "Citrus",
            "score": 3.5489554492826576
        },
        {
            "name": "Pungent",
            "score": 3.3664736974578404
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1386980,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I have had this strain from four different dispensaries here in Arizona. It has been consistently good from each time I have tried it. I get a very earthy and woodsy exhale, and a soft mental (clear) euphoria and feel my stress and/or anxiety simply melt away.\n\nI suffer from anxiety disorder. I have had my share of anxiety and panic attacks. This stuff, at least for me, has been a much needed relief. I start off with a puff. Move up to a bigger one, and finally full bong hit. Each time you assess how you feel. It's nice and relaxing and it let's you ease into it if you don't like that instant rush of high feeling.\n\nThis is a great hybrid. You get the clarity, euphoria, and stress/anxiety relief. The soft smooth body high is relaxing as it soothes the muscles and washes away the aches. Very amazing strain, and one of my regulars in the rotation.",
            "username": "Dalek"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1632887,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I’ve tried this strain a couple of times now and I absolutely adore it! It really helped kick my migraine out. After three good hits on the Vaporizer and a very mild high that only lasted about 10 minutes what remained was just pain relief and focused energy to get stuff done.  It’s also helped me with anxiety. I’ve only used it on its own but am excited to try mixing it with other high THC strains to see how it helps them work. AC/DC is usually my go-to high CBD strain but this might just be my new favorite. ",
            "username": "lyndalouk"
        }
    ],
    "id": 154513,
    "name": "Canna-Tsu",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 7.097910898565315
        },
        {
            "name": "Dry Eyes",
            "score": 5.638056883966776
        },
        {
            "name": "Dizzy",
            "score": 2.271583186508935
        },
        {
            "name": "Anxious",
            "score": 2.0891014346841175
        },
        {
            "name": "Headache",
            "score": 0.36496350364963503
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/cannatonic",
            "category": "Hybrid",
            "name": "Cannatonic",
            "permalink": "https://mobileapi.leafly.com/hybrid/cannatonic",
            "slug": "cannatonic",
            "subtitle": null,
            "symbol": "Ct"
        },
        {
            "applink": "leafly://strain/sour-tsunami",
            "category": "Hybrid",
            "name": "Sour Tsunami",
            "permalink": "https://mobileapi.leafly.com/hybrid/sour-tsunami",
            "slug": "sour-tsunami",
            "subtitle": null,
            "symbol": "Sts"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/canna-tsu",
    "photoTotalCount": 14,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/680879/b/canna-tsu__primary_883d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/canna-tsu_100x100_cf03.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/664719/b/canna-tsu__primary_d331.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/canna-tsu_100x100_ecad.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/632848/b/canna-tsu__primary_d3f2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/canna-tsu_100x100_2450.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/621841/b/canna-tsu__primary_3793.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/canna-tsu_100x100_6372.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/464805/b/canna-tsu__primary_a8d1.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/canna-tsu_100x100_58cd.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/464029/b/canna-tsu__primary_261e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/canna-tsu_100x100_3365.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Eugene, OR",
        "Tucson, AZ",
        "Beaverton, OR",
        "Buckley, WA",
        "Calgary, AB",
        "Cathlamet, WA",
        "Collinsville, IL",
        "Denver, CO",
        "George, WA"
    ],
    "rating": 4.53,
    "relatedStrains": [],
    "reviewCount": 140,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "canna-tsu",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.52857142857143/240",
    "subtitle": null,
    "symbol": "Cts",
    "symptoms": [
        {
            "name": "Pain",
            "score": 67.54215957714574
        },
        {
            "name": "Inflammation",
            "score": 40.261766926755605
        },
        {
            "name": "Depression",
            "score": 39.53183991945633
        },
        {
            "name": "Stress",
            "score": 35.067958721369244
        },
        {
            "name": "Headaches",
            "score": 28.457085325950164
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
