{"sl_translate":"description,descriptionPlain,category","id":165,"slug":"jillybean","name":"Jillybean","subtitle":null,"symbol":"Jil","category":"Hybrid","description":"\u003cp\u003e\u003cspan style=\"line-height: 1.6em;\"\u003eJillybean is described as being an upbeat and happy hybrid, with flavors of tangy orange and mango. This strain is a top choice for creative minds and social butterflies looking for unencumbered euphoria during daytime hours. Bred by crossing \u003c/span\u003e\u003ca href=\"http://www.leafly.com/hybrid/orange-velvet\" style=\"line-height: 1.6em;\"\u003eOrange Velvet\u003c/a\u003e\u003cspan style=\"line-height: 1.6em;\"\u003e and \u003c/span\u003e\u003ca href=\"http://www.leafly.com/hybrid/space-queen\" style=\"line-height: 1.6em;\"\u003eSpace Queen\u003c/a\u003e\u003cspan style=\"line-height: 1.6em;\"\u003e, Jillybean often expresses herself in deep hues of maroon on the leaves.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Jillybean is described as being an upbeat and happy hybrid, with flavors of tangy orange and mango. This strain is a top choice for creative minds and social butterflies looking for unencumbered euphoria during daytime hours. Bred by crossing Orange Velvet and Space Queen, Jillybean often expresses herself in deep hues of maroon on the leaves.\n\n\u0026nbsp;\n","aka":"Jilly Bean, Jilliebean, Jillie Bean","rating":4.28,"highlightedReviews":[{"id":1415097,"username":"JohnBoysReviews","text":"Wonderful lemon/orange citrus and sweet Jelly bean flavor from start to finish.. Overindulging will leave you drowsy and starving. This strain is great for shoulder pain and muscle spasms. A great day time napper or bed time med.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1639227,"username":"paranoid-alien","text":"710 Kingpen Jilly Belly\nA very cerebrally-happy high with a vicious fucking dark side. The calm slightly tingly euphoria will bring you to a place where life is good, and everything is right with the world. But around every merry corner is a nasty paranoid fear that will chase you down some dark alleys, and leave you so emotionally drained that there\u0027s nowhere to the left to go but back to fucking happy-town.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-40128","title":"Hungover? These Cannabis Strains Can Help","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1514822427000)\/","text":"For most of us in the Western hemisphere, drinking is usually the first step into the wide and varied world of intoxicants. Drinking, like cannabis, can give a person access to a wide range of sensations–but in all fairness, only one of these significantly increases your chance of barfing. And yes, I mean alcohol. Alcohol can be a lot of fun, but one of the primary deterrents for getting lit on liquor or wrecked on red wine (especially after age 30) is the fierce hangover the next day.\nHangovers can feel like a vampire drained your body of all life-giving fluids just before throwing you in front of a speeding city bus. And somehow you miraculously survived.\nEnter cannabis and its soothing cocktail of cannabinoids. These unique chemical compounds can induce pleasurable euphoria while tempering nausea, reducing inflammation, and stimulating appetite. Cannabis is not a silver bullet for removing a hangover, but it’s often a step toward recovery. Cannabis mixed with a good breakfast and the steady intake of water can revive and rejuvenate even the most wretched party monster.\n\nA cannabis oil cartridge and pen battery is my preferred cannabis consumption method following a long night of drinking. This method is convenient for a few reasons:\n\nYou don’t have to get out of bed\nThe potency and variety of cartridges are at my disposal\nNo need for extra steps like lighting a bowl\nThey are generally less harsh (i.e., you’re less likely to cough and exacerbate your current discomfort)\n\nBrowse Cannabis Vape Pens\nGoing a step further, I would recommend a CBD-dominant cartridge with a 1:1 or 3:1 CBD/THC ratio. This mixture of cannabinoids is utilized by cannabis consumers in and outside the medicinal cannabis community for its anti-inflammatory, anti-anxiety, and analgesic (pain reducing) qualities.\nI encourage you to explore and experiment with strains and products that work best for you. Some folks would rather snap off a zippy sativa to front-load their body and mind with energy. Others seek out strains that help dull the pounding headache of a hangover. My point is, there is no one way. Just be sure to supplement all cannabis consumption with plenty of water and food (and maybe a multivitamin after said food) to assist in the recovery process.\n\nExplore your local dispensary beforehand, and who knows, you might find a deal or two that prepares you for a long Saturday or Sunday of post-party recuperation.\nCannabis Strain Recommendations for Alleviating Hangovers\nHigh-CBD Cannabis Strains\n   Harlequin\nOne of the most popular, and thus, readily available CBD-dominant strains in many cannabis markets, Harlequin offers a solid CBD:THC ratio and a gentle, but noticeable mood boost. This strain’s soothing, happy buzz can work wonders after a solid holiday brunch.\nFind Harlequin Nearby\n   Sour Tsunami\nSour Tusnami is another popular CBD strain that can help tone down nausea and temper inflammation. The bouquet can be a little flat, but the overall effects (especially when mixed with food and water) are stunningly apparent and not mentally or physically cumbersome, which some THC-dominant strain can be.\nFind Sour Tsunami Nearby\n   Dancehall\nHangover or no hangover, Dancehall is curently my favorite CBD dominant flower, period. With usually less than 2% THC and upwards of 20% CBD, Dancehall hits all the right notes at the perfect pitch and volume. The terpene profile is surprisingly dank, reeking of skunk and swamp grass, but the flavor is sweet and herbaceous on the tongue. In a pipe, joint, or vaporizer, Dancehall will be your host at the after-after-after party come New Years Day.\nFind Dancehall Nearby\n   Cannatonic\nCannatonic is known for having a 3:1 CBD/THC ratio, which is perfect for consumers looking for a little headiness with their dose of wellness. This strain is also a popular concentrate, giving vapers, dabber, and other high-potency consumers a good option if smoke inhalation is too harsh. But beware of the dreaded dab cough! Uncontrollable post-hit hacking is the absolute worst with a hangover–trust me!\nFind Cannatonic Nearby\nTHC-Dominant Cannabis Strains\n   Lavender\nLavender is a natural choice for this list: 1) it is indica-dominant in effect, 2) its high concentrations of the terpene linalool should help with the discomfort caused by a hangover, 3) Lavender is sedative at a higher dose, but can be quite functional with only a hit or two. This allows consumer modulate their dosage depending on the severity of their hangover.\nFind Lavender Nearby\n   Hindu Kush\nHindu Kush is one of the more mellow options on this list. The goal is to reduce the overall physical discomfort caused by a hangover, and Hindu Kush dulls just about every sense a person could have. This isn’t a one-and-done painkiller, but consumption should lead to some degree of physical and mental relief from a hangover.\nFind Hindu Kush Nearby\n   Jillybean\nJillybean is a joyous strain with delicious flavors that can add a little pep to your step post-NYE. This strain’s sweet citrus flavor and sativa-dominant bent give the consumer a nudge toward alertness and a slight boost of energy.\nFind Jillybean Nearby\n   Chocolope\nChocolope is a spicy, nutty flower with good energy in store. This strain is pungent and invigorating, leaving the consumer with a happy feeling right between the ears. Mood elevation is a great way to stem the down-and-out feeling of a hangover. Chocolope is a great rallying call on New Years Day to bring your fellow hungover party goers out and back to life.\nFind Chocolope Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/29164217/hangover.jpg","urlslug":"/news/strains-products/best-cannabis-strains-for-hangovers"},{"id":"contentitems-36015","title":"Tips for Growing Jillybean Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1501689118000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Jillybean is a fruity sativa-dominant strain that came from crossing Orange Velvet and Space Queen. It was created by MzJill, who works with TGA Subcool Seeds, a famous collective of breeders. The high is invigorating and upbeat, making Jillybean the perfect strain for creative escapes and social gatherings.\nGrow Techniques: A SOG (sea of green) or SCROG (screen of green) method is recommended due to Jillybean’s short stature and dense growth. It can be grown easily in any medium and is a strong, resilient plant. Top once to promote a bushy growth, then trimming is easy.\nFlowering Time: 7-8 weeks\nYield: High\nGrow Difficulty: Easy to moderate \nClimate: Outdoors, avoid moisture that can cause the buds to mold while flowering. Jillybean prefers temperatures between 68 and 80 degrees Fahrenheit.\nIndoor/Outdoor: Jillybean can be grown indoors or out, but be vigilant of mold production if growing outdoors in a wet climate.\nFeeding: Give it a boost when flowering by top-dressing Jillybean with phosphorus-rich nutrients.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/02084422/jillybean-strain.jpg","urlslug":"/news/growing/how-to-grow-jillybean-marijuana"}],"reviewCount":790,"flavors":[{"name":"Citrus","score":44.814655727369995},{"name":"Sweet","score":37.994965437327686},{"name":"Orange","score":30.610163245916631},{"name":"Tropical","score":15.4354408350093},{"name":"Mango","score":13.780450446850733}],"effects":[{"name":"Happy","score":72.074825854743551},{"name":"Creative","score":66.674713531608091},{"name":"Euphoric","score":64.541683870308958},{"name":"Uplifted","score":64.400336525441418},{"name":"Energetic","score":52.474161239195}],"symptoms":[{"name":"Stress","score":46.603446056037257},{"name":"Depression","score":41.735703218302014},{"name":"Pain","score":24.674240708923254},{"name":"Nausea","score":21.943467721527416},{"name":"Fatigue","score":18.633486945210283}],"conditions":[{"name":"Anxiety","score":31.599039703786573},{"name":"PTSD","score":19.260309976336668},{"name":"ADD/ADHD","score":13.059728826201036},{"name":"Arthritis","score":10.553435622860642},{"name":"PMS","score":9.1881323725931541}],"negatives":[{"name":"Dry Mouth","score":30.324416297065831},{"name":"Dry Eyes","score":15.453643398462992},{"name":"Headache","score":9.5175543746087552},{"name":"Dizzy","score":7.2032760174567025},{"name":"Anxious","score":6.204077374213627}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/jillybean/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/jillybean/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jillybean_100x100_023b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/668399/b/jillybean__primary_23ec.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jillybean_100x100_38ea.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/629012/b/jillybean__primary_64bd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jillybean_100x100_04e7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/628906/b/jillybean__primary_0070.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jillybean_100x100_43ed.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/605199/b/jillybean__primary_aad0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jillybean_100x100_4435.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/603474/b/jillybean__primary_a850.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jillybean_100x100_0058.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/599823/b/jillybean__primary_055e.jpg"}],"photoTotalCount":117,"popularCities":["Portland, OR","Eugene, OR","Las Vegas, NV","Seattle, WA","Montréal, QC","Bend, OR","Calgary, AB","Denver, CO","San Francisco, CA","Toronto, ON"],"permalink":"https://mobileapi.leafly.com/hybrid/jillybean","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.28354430379747/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Orange Velvet","subtitle":null,"slug":"orange-velvet","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/orange-velvet","symbol":"Ov","applink":"leafly://strain/orange-velvet"},{"name":"Space Queen","subtitle":null,"slug":"space-queen","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/space-queen","symbol":"Sq","applink":"leafly://strain/space-queen"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":65,"outdoorFinish":null,"height":"Short","averageYield":"High","environment":null,"growNotes":"\n\tSuitable for sea of green (SOG) or screen of green (SCROG) methods\n\tYields are highest when plants are topped at least once\n\tShould be grown under 85\u0026deg;F (30\u0026deg;C) during light cycle\u0026nbsp;for best yields\n\tCooler nighttime temperatures may induce a dark burgundy coloration\n\tTwo phenotypes: one is short/bushy with heavy side branching, while the second grows tall with less lateral stretch\n\n"}}
