{"sl_translate":"description,descriptionPlain,category","id":136977,"slug":"fortune-cookies","name":"Fortune Cookies","subtitle":null,"symbol":"Ftc","category":"Hybrid","description":"\u003cp\u003eFortune Cookies is a \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e cannabis strain that combines the famed genetics of \u003ca href=\"http://www.leafly.com/hybrid/girl-scout-cookie\"\u003eGirl Scout Cookies\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003eOG Kush\u003c/a\u003e in a potent mix of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eearthy\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-honey\"\u003ehoneyed\u003c/a\u003e flavors. OG Kush genes are already present in Girl Scout Cookies, but Fortune Cookies has pronounced characteristics that OG fans will appreciate. \u003ca href=\"http://leafly.com/sativa\"\u003eSativa\u003c/a\u003e genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-creative\"\u003ecreative\u003c/a\u003e escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty \u0026ldquo;couch-lock\u0026rdquo; effects typically associated with \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e strains.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Fortune Cookies is a hybrid cannabis strain that combines the famed genetics of Girl Scout Cookies and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in Girl Scout Cookies, but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty \u0026ldquo;couch-lock\u0026rdquo; effects typically associated with indica strains.\u0026nbsp;\n","aka":"Fortune Cookie","rating":4.63,"highlightedReviews":[{"id":1413662,"username":"thgdbtmn","text":"I just bought a 1/4 of this stuff just because it looked and smelled so good at the store. Normally I\u0027ll only buy a gram for a new strain just in case I don\u0027t like it. \n\nMan, I am the best kind of high right now, after three good hits of this stuff from my bubbler.\n\nI\u0027ve got Panda Bear - Tomboy turning right now at volume number 47. I don\u0027t even care that it\u0027s Monday. I\u0027m super chill right now. Got my slippers on.\n\nSo what makes this stain worth rambling about is that I am in a tremendously-happy mood, and that\u0027s coming from someone who has been trying to release a bunch of self-hate. And helping others more. I feel like I am going to be the person I\u0027m working toward. Keep on the LEGO. Build dem bricks.\n\nIt was also smooth inhaling, and I love the coated honey stickiness.\n\nDense, and intense.\n\nWould do again.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1554629,"username":"Andrew812","text":"Amazingly dank sativa,  insanely purple inside and out and smells like a strong indica,  but upon hitting it,  it makes itself very clear what it\u0027s here for... To put you right where you need to be.  not overly energetic but energetic for sure.  A very long lasting high very cerebral and long lasting.  Not the best for pain in my opinion but for anxiety headaches and my nausea it\u0027s been doing wonders!!  Also very Euphoric so definitely a great strain for depression!!  stay medicated all!!  ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-62050","title":"5 Fantastic Instrumental Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1522705256000)\/","text":"Instrumental music exists outside the realm of vocalists, with guitar, horns, and keys filling the space with innovative instrumentation (known as instrumental interludes) where lyrics would normally reside. Though commonly associated with jazz, instrumental music is not limited to any single genre, and can even transcend genre altogether.\nThe beauty in instrumental music is its ability to push the boundaries of sound—exploring and weaving in and out of its structure—with an ease not afforded to lyrical constructs.\n\nBelow, discover five fantastic instrumental albums paired with the perfect strain and explore the vast range of sounds and possibilities instrumental music provides.\nFeeling Good by Dorothy Ashby\n\nStrain Pairing Recommendation: Euforia\nReleased posthumously in 2015, Feeling Good is an incredible collection of harpist Dorothy Ashby’s music that can’t be missed. The 30-track album runs for nearly two hours and will leave no question as to why Ashby’s prowess makes her one of the top instrumental artists to know and love. Her light, lovely, and versatile sound relaxes yet enlivens. Feeling Good is a feel-good instrumental jazz album with a fresh twist, as Ashby demonstrates the harp’s use as a bebop instrument that is as engaging as any saxophone.\nFind Euforia Nearby\nJuice by Medeski, Martin, Scofield \u0026 Wood\n\nStrain Pairing Recommendation: Candy Jack\nJuice, released in 2014, is the latest album from the dynamite quartet, Medeski, Martin, Scofield \u0026 Wood. The album contains all the signature versatility that Medeski, Martin \u0026 Wood bring to their albums, with the expert finesse and precision of legendary guitarist John Scofield. The eclectic 10-track album will keep you on your toes as it bends and twists through experimental and improvisational jazz fusion. Medeski’s wizard-like ability to manipulate the keys and organ provokes creativity and a sense of playfulness that will keep you guessing and surprised from “Sham Time” to “The Times They Are A-Changing.”\nFind Candy Jack Nearby\n\nNomad (Remastered) by Lotus\n\nStrain Pairing Recommendation: Fortune Cookies\nNomad was originally released in 2005, but the latest remastered and live version—released in 2014—is here to remind us all over again why we will always love this album. With funky, upbeat stylings and a full, rounded sound, Nomad wastes no time pulling you into its world—and what a joyful world it is. Songs such as “Travel” incorporate light, melodic vocalizations, blended seamlessly so that they become a sort of instrumentation of their own. Nomad traverses landscapes, delivering transcendental bliss and danceable rhythms in a single album.\nFind Fortune Cookies Nearby\nMigration by Bonobo\n\nStrain Pairing Recommendation: 303 OG\nBonobo’s Migration, released in 2017, is an extension of his unique sound and musical stylings. Each song is masterfully manipulated and crafted, flowing from one track to the next with versatility. Though Migration is electronically styled, Bonobo’s use of real instruments creates a depth and soul within the music that is often lacking amongst electronic artists. And while the album incorporates lyrics on a few tracks, it is deftly woven into the soundscape the way any other instrument is intertwined. Migration explores a range of sounds and feelings, from upbeat tribal rhythms to soft, melodic, wordless ballads, making it an album that tells endless stories with every note.\nFind 303 OG Nearby\n\nGentlemen, I Neglected To Inform You You Will Not Be Getting Paid by Charlie Hunter\n\nStrain Pairing Recommendation: Sweet Cheese\nWith a title reflecting the playfulness instilled in this instrumental album, Gentlemen, I Neglected To Inform You You Will Not Be Getting Paid is a modern jazz collection with a funky twist. Released in 2010, the album runs short at only 38 mins, but the pointed, swampy vibe and full sound, makes up for it. Hunter’s guitar sails beside  a medley of drums, horns, and bass, creating a sound that is both precisely orchestrated and experimentally fun. This album will leave your mind stimulated even as you relax into every note.\nFind Sweet Cheese Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/04/02132016/best-instrumental-albums-to-listen-to-while-high-header.jpg","urlslug":"/news/lifestyle/5-instrumental-albums-to-listen-to-while-high"},{"id":"contentitems-8229","title":"Try These Cannabis Strains That Are as Sweet as Honey","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1475440520000)\/","text":"Honey is an amazing substance — it’s a natural sweetener, a super-food with a nearly endless shelf life (if sealed properly), and has outstanding nutritional and medicinal benefits that can even help people adapt to local allergens (not to mention how delicious it is on baklava, peanut butter sandwiches, and in a cup of hot coffee or tea!).\nLeafly is home to over 60 specific strains that exhibit notes of honey. As your strain researcher and a passionate purveyor of fine cannabis, I’ve curated a shortlist of honey-flavored strains that will make your fingers sticky and your taste buds smile. Enjoy!\n   Panama Red\nPanama Red is best described as an old-school cannabis classic. Originating from Panama, this pure sativa rose to stardom in the late 1960’s thanks to its typical sativa effects: speedy and intense, bordering on psychedelic. As cannabis cultivation matured, Panama Red, which has a lengthy flowering time of at least 11 weeks, was left behind for faster growing strains and increased profits. However, those who fondly recall days of its prominence love its smooth medicating experience and loftily contemplate its revival. If you can get your hands on this sentimental throwback, do not hesitate to groove down memory lane and enjoy the ride.\n   Chocolate Thunder\nWhen you combine the sweet cocoa flavor of Chocolope with the strength and potency of Alaskan Thunder Fuck, you get none other than Chocolate Thunder. This clear-headed, active sativa may be all you need to inspire creativity or promote concentration, and patients will appreciate its ability to dull symptoms without fogging mental faculties. True to its name, Chocolate Thunder has a subtle sweet, earthy aroma similar to that of chocolate.\n   Thor’s Hammer\nThor’s Hammer by SnowHigh Seeds is an uplifting sativa strain that combines genetics from Vortex, Cinderella 99, and Acapulco Gold. Like a bolt of lightning commanded by the Norse god himself, Thor’s Hammer delivers an electrifying blast of cerebral energy that awakens creativity and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush fatigue and depression like the giants of Jotunheimr will likely find Thor’s Hammer to be the perfect weapon. You may also find a genetic variant of Thor’s Hammer from Alaska that instead combines God Bud and Sour Diesel in a more balanced indica-sativa hybrid cross.\n   Honey Banana\nHoney Bananas from Elemental Seeds is a heavy-handed hybrid strain bred from Strawberry Banana and Honey Boo Boo. This cannabis strain earns its name with a resinous coat as sticky as honey and an unmistakable banana aroma. She leans heavily toward the indica side of the family, providing weighty full-body effects coupled with an invigorating buzz of cerebral euphoria.\n   Lodi Dodi\nLodi Dodi is a sativa-dominant hybrid popular in Washington State. Exclusively bred by The Clone Zone, the genetic heritage of Lodi Dodi is undefined and closely guarded. Lodi Dodi carries a sweet, unique flavor of tropical fruit and fresh wildflowers. The pungent aroma leads the way towards a cerebral buzz, known to spark creativity and a boost of energy that will turn any task into a more enjoyable adventure.\n   Nebula\nThe Nebula marijuana strain was bred by Paradise Seeds in 1996. Its name means “Starcloud” and it has been known to “twinkle” with THC coating, with a head and body buzz described as intense and almost psychedelic. The buds have been known to smell and taste like honey, and flowering time is a minimum of 9 weeks. Nebula has won many awards, including 3rd place in the sativa category at the High Times Cannabis Cup in 1999 and 2nd place in 2005. It also took 3rd place at the Highlife Cup in 2004 in the Hydro category, and 1st place at the Copa La Bella Flor Spain in 2005.\n   Fortune Cookies\nFortune Cookies is a hybrid cannabis strain that combines the famed genetics of GSC (f.k.a Girl Scout Cookies) and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in GSC (f.k.a Girl Scout Cookies), but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty “couch-lock” effects typically associated with indica strains.\n   BC Sweet Tooth\nDeveloped in British Columbia by BC Bud Depot, BC Sweet tooth is an indica-dominant hybrid known for its quick flowering time and candy taste.  A hardy plant, this strain can be grown outdoors where it can flower in under 7 weeks, but it prefers the indoors where it may flower as soon as 6 weeks. The result of a cross with earlier generations of BC Sweet Tooth and classic Sweet Tooth, these sugary flowers are sure to satisfy your craving. The crystalline buds have a strong, sweet smell with a hint of citrus, and consumers report that this treat satisfies with a long-lasting, potent feeling that hits fast.\n   Danky Doodle\nOriginally named Double D as a reference to the large buds on these plants (we’ll let you make the connection there), breeder KC Brains decided to rename the strain Danky Doodle at the suggestion of some American friends in order to avoid confusion with the similarly named Double Dutch. Danky Doodle certainly isn’t a shy plant; it grows like the weed it is and will make its presence known with its pungent sweet smell. Plants flower at 9 to 11 weeks and should provide a high yield of large buds covered in a rich frost. This plant is a cross between several strains, and it’s no surprise that Big Bud is included in its lineage along with the strains Viking and the breeder’s own KC 636. The result is a strong indica that provides full body relief no matter what you call it.\n   Cream Caramel\nCream Caramel, named after its sweet caramel aroma, is a 90% indica cross between BlueBlack, Maple Leaf Indica, and White Rhino. Covered in a sugary coat of THC-rich resin, Cream Caramel delivers heavy, relaxing indica effects that soothe the mind and body. Though originally bred by Sweet Seeds in Spain, Royal Queen Seeds have also championed their own rendition called Royal Caramel. Early October is the finish line for outdoor Cream Caramel flowers, while indoor gardens should be harvested after a 7 to 8 week flowering period.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/02131126/cannabis-strains-that-taste-like-honey.jpg","urlslug":"/news/strains-products/cannabis-strains-that-taste-like-honey"}],"reviewCount":121,"flavors":[{"name":"Honey","score":16.558441558441558},{"name":"Sweet","score":15.692640692640691},{"name":"Earthy","score":14.637445887445889},{"name":"Vanilla","score":10.091991341991342},{"name":"Pungent","score":7.6028138528138527}],"effects":[{"name":"Relaxed","score":145.7521645021645},{"name":"Happy","score":136.03896103896105},{"name":"Euphoric","score":131.57467532467533},{"name":"Hungry","score":114.74567099567099},{"name":"Creative","score":28.436147186147185}],"symptoms":[{"name":"Pain","score":17.884199134199132},{"name":"Depression","score":16.63961038961039},{"name":"Stress","score":14.637445887445889},{"name":"Muscle Spasms","score":11.417748917748918},{"name":"Headaches","score":9.0367965367965368}],"conditions":[{"name":"Anxiety","score":114.74567099567099},{"name":"Gastrointestinal Disorder","score":102.94913419913419},{"name":"Arthritis","score":7.9004329004329},{"name":"PTSD","score":6.0876623376623371},{"name":"ADD/ADHD","score":5.7088744588744591}],"negatives":[{"name":"Dry Mouth","score":112.55411255411255},{"name":"Dry Eyes","score":8.4686147186147185},{"name":"Dizzy","score":5.51948051948052},{"name":"Headache","score":2.5703463203463204},{"name":"Paranoid","score":1.5151515151515151}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_05b4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001184/b/fortune-cookies__primary_a9c4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_7c1c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607690/b/fortune-cookies__primary_d70d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_f201.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/596982/b/fortune-cookies__primary_95b4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_cef1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/597298/b/fortune-cookies__primary_885f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_f8bf.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/516062/b/fortune-cookies__primary_f4d8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_84a9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/485876/b/fortune-cookies__primary_607a.jpg"}],"photoTotalCount":29,"popularCities":["Detroit, MI","Portland, OR","Los Angeles, CA","Montréal, QC","Eugene, OR","Las Vegas, NV","Seattle, WA","Vancouver, BC","Albany, OR","Ann Arbor, MI"],"permalink":"https://mobileapi.leafly.com/hybrid/fortune-cookies","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.62809917355372/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Girl Scout Cookies","subtitle":null,"slug":"girl-scout-cookie","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/girl-scout-cookie","symbol":"Gsc","applink":"leafly://strain/girl-scout-cookie"},{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":136977,"slug":"fortune-cookies","name":"Fortune Cookies","subtitle":null,"symbol":"Ftc","category":"Hybrid","description":"\u003cp\u003eFortune Cookies is a \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e cannabis strain that combines the famed genetics of \u003ca href=\"http://www.leafly.com/hybrid/girl-scout-cookie\"\u003eGirl Scout Cookies\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003eOG Kush\u003c/a\u003e in a potent mix of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eearthy\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-honey\"\u003ehoneyed\u003c/a\u003e flavors. OG Kush genes are already present in Girl Scout Cookies, but Fortune Cookies has pronounced characteristics that OG fans will appreciate. \u003ca href=\"http://leafly.com/sativa\"\u003eSativa\u003c/a\u003e genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-creative\"\u003ecreative\u003c/a\u003e escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty \u0026ldquo;couch-lock\u0026rdquo; effects typically associated with \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e strains.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Fortune Cookies is a hybrid cannabis strain that combines the famed genetics of Girl Scout Cookies and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in Girl Scout Cookies, but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty \u0026ldquo;couch-lock\u0026rdquo; effects typically associated with indica strains.\u0026nbsp;\n","aka":"Fortune Cookie","rating":4.63,"highlightedReviews":[{"id":1413662,"username":"thgdbtmn","text":"I just bought a 1/4 of this stuff just because it looked and smelled so good at the store. Normally I\u0027ll only buy a gram for a new strain just in case I don\u0027t like it. \n\nMan, I am the best kind of high right now, after three good hits of this stuff from my bubbler.\n\nI\u0027ve got Panda Bear - Tomboy turning right now at volume number 47. I don\u0027t even care that it\u0027s Monday. I\u0027m super chill right now. Got my slippers on.\n\nSo what makes this stain worth rambling about is that I am in a tremendously-happy mood, and that\u0027s coming from someone who has been trying to release a bunch of self-hate. And helping others more. I feel like I am going to be the person I\u0027m working toward. Keep on the LEGO. Build dem bricks.\n\nIt was also smooth inhaling, and I love the coated honey stickiness.\n\nDense, and intense.\n\nWould do again.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1554629,"username":"Andrew812","text":"Amazingly dank sativa,  insanely purple inside and out and smells like a strong indica,  but upon hitting it,  it makes itself very clear what it\u0027s here for... To put you right where you need to be.  not overly energetic but energetic for sure.  A very long lasting high very cerebral and long lasting.  Not the best for pain in my opinion but for anxiety headaches and my nausea it\u0027s been doing wonders!!  Also very Euphoric so definitely a great strain for depression!!  stay medicated all!!  ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-62050","title":"5 Fantastic Instrumental Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1522705256000)\/","text":"Instrumental music exists outside the realm of vocalists, with guitar, horns, and keys filling the space with innovative instrumentation (known as instrumental interludes) where lyrics would normally reside. Though commonly associated with jazz, instrumental music is not limited to any single genre, and can even transcend genre altogether.\nThe beauty in instrumental music is its ability to push the boundaries of sound—exploring and weaving in and out of its structure—with an ease not afforded to lyrical constructs.\n\nBelow, discover five fantastic instrumental albums paired with the perfect strain and explore the vast range of sounds and possibilities instrumental music provides.\nFeeling Good by Dorothy Ashby\n\nStrain Pairing Recommendation: Euforia\nReleased posthumously in 2015, Feeling Good is an incredible collection of harpist Dorothy Ashby’s music that can’t be missed. The 30-track album runs for nearly two hours and will leave no question as to why Ashby’s prowess makes her one of the top instrumental artists to know and love. Her light, lovely, and versatile sound relaxes yet enlivens. Feeling Good is a feel-good instrumental jazz album with a fresh twist, as Ashby demonstrates the harp’s use as a bebop instrument that is as engaging as any saxophone.\nFind Euforia Nearby\nJuice by Medeski, Martin, Scofield \u0026 Wood\n\nStrain Pairing Recommendation: Candy Jack\nJuice, released in 2014, is the latest album from the dynamite quartet, Medeski, Martin, Scofield \u0026 Wood. The album contains all the signature versatility that Medeski, Martin \u0026 Wood bring to their albums, with the expert finesse and precision of legendary guitarist John Scofield. The eclectic 10-track album will keep you on your toes as it bends and twists through experimental and improvisational jazz fusion. Medeski’s wizard-like ability to manipulate the keys and organ provokes creativity and a sense of playfulness that will keep you guessing and surprised from “Sham Time” to “The Times They Are A-Changing.”\nFind Candy Jack Nearby\n\nNomad (Remastered) by Lotus\n\nStrain Pairing Recommendation: Fortune Cookies\nNomad was originally released in 2005, but the latest remastered and live version—released in 2014—is here to remind us all over again why we will always love this album. With funky, upbeat stylings and a full, rounded sound, Nomad wastes no time pulling you into its world—and what a joyful world it is. Songs such as “Travel” incorporate light, melodic vocalizations, blended seamlessly so that they become a sort of instrumentation of their own. Nomad traverses landscapes, delivering transcendental bliss and danceable rhythms in a single album.\nFind Fortune Cookies Nearby\nMigration by Bonobo\n\nStrain Pairing Recommendation: 303 OG\nBonobo’s Migration, released in 2017, is an extension of his unique sound and musical stylings. Each song is masterfully manipulated and crafted, flowing from one track to the next with versatility. Though Migration is electronically styled, Bonobo’s use of real instruments creates a depth and soul within the music that is often lacking amongst electronic artists. And while the album incorporates lyrics on a few tracks, it is deftly woven into the soundscape the way any other instrument is intertwined. Migration explores a range of sounds and feelings, from upbeat tribal rhythms to soft, melodic, wordless ballads, making it an album that tells endless stories with every note.\nFind 303 OG Nearby\n\nGentlemen, I Neglected To Inform You You Will Not Be Getting Paid by Charlie Hunter\n\nStrain Pairing Recommendation: Sweet Cheese\nWith a title reflecting the playfulness instilled in this instrumental album, Gentlemen, I Neglected To Inform You You Will Not Be Getting Paid is a modern jazz collection with a funky twist. Released in 2010, the album runs short at only 38 mins, but the pointed, swampy vibe and full sound, makes up for it. Hunter’s guitar sails beside  a medley of drums, horns, and bass, creating a sound that is both precisely orchestrated and experimentally fun. This album will leave your mind stimulated even as you relax into every note.\nFind Sweet Cheese Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/04/02132016/best-instrumental-albums-to-listen-to-while-high-header.jpg","urlslug":"/news/lifestyle/5-instrumental-albums-to-listen-to-while-high"},{"id":"contentitems-8229","title":"Try These Cannabis Strains That Are as Sweet as Honey","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1475440520000)\/","text":"Honey is an amazing substance — it’s a natural sweetener, a super-food with a nearly endless shelf life (if sealed properly), and has outstanding nutritional and medicinal benefits that can even help people adapt to local allergens (not to mention how delicious it is on baklava, peanut butter sandwiches, and in a cup of hot coffee or tea!).\nLeafly is home to over 60 specific strains that exhibit notes of honey. As your strain researcher and a passionate purveyor of fine cannabis, I’ve curated a shortlist of honey-flavored strains that will make your fingers sticky and your taste buds smile. Enjoy!\n   Panama Red\nPanama Red is best described as an old-school cannabis classic. Originating from Panama, this pure sativa rose to stardom in the late 1960’s thanks to its typical sativa effects: speedy and intense, bordering on psychedelic. As cannabis cultivation matured, Panama Red, which has a lengthy flowering time of at least 11 weeks, was left behind for faster growing strains and increased profits. However, those who fondly recall days of its prominence love its smooth medicating experience and loftily contemplate its revival. If you can get your hands on this sentimental throwback, do not hesitate to groove down memory lane and enjoy the ride.\n   Chocolate Thunder\nWhen you combine the sweet cocoa flavor of Chocolope with the strength and potency of Alaskan Thunder Fuck, you get none other than Chocolate Thunder. This clear-headed, active sativa may be all you need to inspire creativity or promote concentration, and patients will appreciate its ability to dull symptoms without fogging mental faculties. True to its name, Chocolate Thunder has a subtle sweet, earthy aroma similar to that of chocolate.\n   Thor’s Hammer\nThor’s Hammer by SnowHigh Seeds is an uplifting sativa strain that combines genetics from Vortex, Cinderella 99, and Acapulco Gold. Like a bolt of lightning commanded by the Norse god himself, Thor’s Hammer delivers an electrifying blast of cerebral energy that awakens creativity and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush fatigue and depression like the giants of Jotunheimr will likely find Thor’s Hammer to be the perfect weapon. You may also find a genetic variant of Thor’s Hammer from Alaska that instead combines God Bud and Sour Diesel in a more balanced indica-sativa hybrid cross.\n   Honey Banana\nHoney Bananas from Elemental Seeds is a heavy-handed hybrid strain bred from Strawberry Banana and Honey Boo Boo. This cannabis strain earns its name with a resinous coat as sticky as honey and an unmistakable banana aroma. She leans heavily toward the indica side of the family, providing weighty full-body effects coupled with an invigorating buzz of cerebral euphoria.\n   Lodi Dodi\nLodi Dodi is a sativa-dominant hybrid popular in Washington State. Exclusively bred by The Clone Zone, the genetic heritage of Lodi Dodi is undefined and closely guarded. Lodi Dodi carries a sweet, unique flavor of tropical fruit and fresh wildflowers. The pungent aroma leads the way towards a cerebral buzz, known to spark creativity and a boost of energy that will turn any task into a more enjoyable adventure.\n   Nebula\nThe Nebula marijuana strain was bred by Paradise Seeds in 1996. Its name means “Starcloud” and it has been known to “twinkle” with THC coating, with a head and body buzz described as intense and almost psychedelic. The buds have been known to smell and taste like honey, and flowering time is a minimum of 9 weeks. Nebula has won many awards, including 3rd place in the sativa category at the High Times Cannabis Cup in 1999 and 2nd place in 2005. It also took 3rd place at the Highlife Cup in 2004 in the Hydro category, and 1st place at the Copa La Bella Flor Spain in 2005.\n   Fortune Cookies\nFortune Cookies is a hybrid cannabis strain that combines the famed genetics of GSC (f.k.a Girl Scout Cookies) and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in GSC (f.k.a Girl Scout Cookies), but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty “couch-lock” effects typically associated with indica strains.\n   BC Sweet Tooth\nDeveloped in British Columbia by BC Bud Depot, BC Sweet tooth is an indica-dominant hybrid known for its quick flowering time and candy taste.  A hardy plant, this strain can be grown outdoors where it can flower in under 7 weeks, but it prefers the indoors where it may flower as soon as 6 weeks. The result of a cross with earlier generations of BC Sweet Tooth and classic Sweet Tooth, these sugary flowers are sure to satisfy your craving. The crystalline buds have a strong, sweet smell with a hint of citrus, and consumers report that this treat satisfies with a long-lasting, potent feeling that hits fast.\n   Danky Doodle\nOriginally named Double D as a reference to the large buds on these plants (we’ll let you make the connection there), breeder KC Brains decided to rename the strain Danky Doodle at the suggestion of some American friends in order to avoid confusion with the similarly named Double Dutch. Danky Doodle certainly isn’t a shy plant; it grows like the weed it is and will make its presence known with its pungent sweet smell. Plants flower at 9 to 11 weeks and should provide a high yield of large buds covered in a rich frost. This plant is a cross between several strains, and it’s no surprise that Big Bud is included in its lineage along with the strains Viking and the breeder’s own KC 636. The result is a strong indica that provides full body relief no matter what you call it.\n   Cream Caramel\nCream Caramel, named after its sweet caramel aroma, is a 90% indica cross between BlueBlack, Maple Leaf Indica, and White Rhino. Covered in a sugary coat of THC-rich resin, Cream Caramel delivers heavy, relaxing indica effects that soothe the mind and body. Though originally bred by Sweet Seeds in Spain, Royal Queen Seeds have also championed their own rendition called Royal Caramel. Early October is the finish line for outdoor Cream Caramel flowers, while indoor gardens should be harvested after a 7 to 8 week flowering period.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/02131126/cannabis-strains-that-taste-like-honey.jpg","urlslug":"/news/strains-products/cannabis-strains-that-taste-like-honey"}],"reviewCount":121,"flavors":[{"name":"Honey","score":16.558441558441558},{"name":"Sweet","score":15.692640692640691},{"name":"Earthy","score":14.637445887445889},{"name":"Vanilla","score":10.091991341991342},{"name":"Pungent","score":7.6028138528138527}],"effects":[{"name":"Relaxed","score":145.7521645021645},{"name":"Happy","score":136.03896103896105},{"name":"Euphoric","score":131.57467532467533},{"name":"Hungry","score":114.74567099567099},{"name":"Creative","score":28.436147186147185}],"symptoms":[{"name":"Pain","score":17.884199134199132},{"name":"Depression","score":16.63961038961039},{"name":"Stress","score":14.637445887445889},{"name":"Muscle Spasms","score":11.417748917748918},{"name":"Headaches","score":9.0367965367965368}],"conditions":[{"name":"Anxiety","score":114.74567099567099},{"name":"Gastrointestinal Disorder","score":102.94913419913419},{"name":"Arthritis","score":7.9004329004329},{"name":"PTSD","score":6.0876623376623371},{"name":"ADD/ADHD","score":5.7088744588744591}],"negatives":[{"name":"Dry Mouth","score":112.55411255411255},{"name":"Dry Eyes","score":8.4686147186147185},{"name":"Dizzy","score":5.51948051948052},{"name":"Headache","score":2.5703463203463204},{"name":"Paranoid","score":1.5151515151515151}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_05b4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001184/b/fortune-cookies__primary_a9c4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_7c1c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607690/b/fortune-cookies__primary_d70d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_f201.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/596982/b/fortune-cookies__primary_95b4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_cef1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/597298/b/fortune-cookies__primary_885f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_f8bf.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/516062/b/fortune-cookies__primary_f4d8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_84a9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/485876/b/fortune-cookies__primary_607a.jpg"}],"photoTotalCount":29,"popularCities":["Detroit, MI","Portland, OR","Los Angeles, CA","Montréal, QC","Eugene, OR","Las Vegas, NV","Seattle, WA","Vancouver, BC","Albany, OR","Ann Arbor, MI"],"permalink":"https://mobileapi.leafly.com/hybrid/fortune-cookies","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.62809917355372/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Girl Scout Cookies","subtitle":null,"slug":"girl-scout-cookie","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/girl-scout-cookie","symbol":"Gsc","applink":"leafly://strain/girl-scout-cookie"},{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":136977,"slug":"fortune-cookies","name":"Fortune Cookies","subtitle":null,"symbol":"Ftc","category":"Hybrid","description":"\u003cp\u003eFortune Cookies is a \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e cannabis strain that combines the famed genetics of \u003ca href=\"http://www.leafly.com/hybrid/girl-scout-cookie\"\u003eGirl Scout Cookies\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003eOG Kush\u003c/a\u003e in a potent mix of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eearthy\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-honey\"\u003ehoneyed\u003c/a\u003e flavors. OG Kush genes are already present in Girl Scout Cookies, but Fortune Cookies has pronounced characteristics that OG fans will appreciate. \u003ca href=\"http://leafly.com/sativa\"\u003eSativa\u003c/a\u003e genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-creative\"\u003ecreative\u003c/a\u003e escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty \u0026ldquo;couch-lock\u0026rdquo; effects typically associated with \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e strains.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Fortune Cookies is a hybrid cannabis strain that combines the famed genetics of Girl Scout Cookies and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in Girl Scout Cookies, but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty \u0026ldquo;couch-lock\u0026rdquo; effects typically associated with indica strains.\u0026nbsp;\n","aka":"Fortune Cookie","rating":4.63,"highlightedReviews":[{"id":1413662,"username":"thgdbtmn","text":"I just bought a 1/4 of this stuff just because it looked and smelled so good at the store. Normally I\u0027ll only buy a gram for a new strain just in case I don\u0027t like it. \n\nMan, I am the best kind of high right now, after three good hits of this stuff from my bubbler.\n\nI\u0027ve got Panda Bear - Tomboy turning right now at volume number 47. I don\u0027t even care that it\u0027s Monday. I\u0027m super chill right now. Got my slippers on.\n\nSo what makes this stain worth rambling about is that I am in a tremendously-happy mood, and that\u0027s coming from someone who has been trying to release a bunch of self-hate. And helping others more. I feel like I am going to be the person I\u0027m working toward. Keep on the LEGO. Build dem bricks.\n\nIt was also smooth inhaling, and I love the coated honey stickiness.\n\nDense, and intense.\n\nWould do again.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1554629,"username":"Andrew812","text":"Amazingly dank sativa,  insanely purple inside and out and smells like a strong indica,  but upon hitting it,  it makes itself very clear what it\u0027s here for... To put you right where you need to be.  not overly energetic but energetic for sure.  A very long lasting high very cerebral and long lasting.  Not the best for pain in my opinion but for anxiety headaches and my nausea it\u0027s been doing wonders!!  Also very Euphoric so definitely a great strain for depression!!  stay medicated all!!  ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-62050","title":"5 Fantastic Instrumental Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1522705256000)\/","text":"Instrumental music exists outside the realm of vocalists, with guitar, horns, and keys filling the space with innovative instrumentation (known as instrumental interludes) where lyrics would normally reside. Though commonly associated with jazz, instrumental music is not limited to any single genre, and can even transcend genre altogether.\nThe beauty in instrumental music is its ability to push the boundaries of sound—exploring and weaving in and out of its structure—with an ease not afforded to lyrical constructs.\n\nBelow, discover five fantastic instrumental albums paired with the perfect strain and explore the vast range of sounds and possibilities instrumental music provides.\nFeeling Good by Dorothy Ashby\n\nStrain Pairing Recommendation: Euforia\nReleased posthumously in 2015, Feeling Good is an incredible collection of harpist Dorothy Ashby’s music that can’t be missed. The 30-track album runs for nearly two hours and will leave no question as to why Ashby’s prowess makes her one of the top instrumental artists to know and love. Her light, lovely, and versatile sound relaxes yet enlivens. Feeling Good is a feel-good instrumental jazz album with a fresh twist, as Ashby demonstrates the harp’s use as a bebop instrument that is as engaging as any saxophone.\nFind Euforia Nearby\nJuice by Medeski, Martin, Scofield \u0026 Wood\n\nStrain Pairing Recommendation: Candy Jack\nJuice, released in 2014, is the latest album from the dynamite quartet, Medeski, Martin, Scofield \u0026 Wood. The album contains all the signature versatility that Medeski, Martin \u0026 Wood bring to their albums, with the expert finesse and precision of legendary guitarist John Scofield. The eclectic 10-track album will keep you on your toes as it bends and twists through experimental and improvisational jazz fusion. Medeski’s wizard-like ability to manipulate the keys and organ provokes creativity and a sense of playfulness that will keep you guessing and surprised from “Sham Time” to “The Times They Are A-Changing.”\nFind Candy Jack Nearby\n\nNomad (Remastered) by Lotus\n\nStrain Pairing Recommendation: Fortune Cookies\nNomad was originally released in 2005, but the latest remastered and live version—released in 2014—is here to remind us all over again why we will always love this album. With funky, upbeat stylings and a full, rounded sound, Nomad wastes no time pulling you into its world—and what a joyful world it is. Songs such as “Travel” incorporate light, melodic vocalizations, blended seamlessly so that they become a sort of instrumentation of their own. Nomad traverses landscapes, delivering transcendental bliss and danceable rhythms in a single album.\nFind Fortune Cookies Nearby\nMigration by Bonobo\n\nStrain Pairing Recommendation: 303 OG\nBonobo’s Migration, released in 2017, is an extension of his unique sound and musical stylings. Each song is masterfully manipulated and crafted, flowing from one track to the next with versatility. Though Migration is electronically styled, Bonobo’s use of real instruments creates a depth and soul within the music that is often lacking amongst electronic artists. And while the album incorporates lyrics on a few tracks, it is deftly woven into the soundscape the way any other instrument is intertwined. Migration explores a range of sounds and feelings, from upbeat tribal rhythms to soft, melodic, wordless ballads, making it an album that tells endless stories with every note.\nFind 303 OG Nearby\n\nGentlemen, I Neglected To Inform You You Will Not Be Getting Paid by Charlie Hunter\n\nStrain Pairing Recommendation: Sweet Cheese\nWith a title reflecting the playfulness instilled in this instrumental album, Gentlemen, I Neglected To Inform You You Will Not Be Getting Paid is a modern jazz collection with a funky twist. Released in 2010, the album runs short at only 38 mins, but the pointed, swampy vibe and full sound, makes up for it. Hunter’s guitar sails beside  a medley of drums, horns, and bass, creating a sound that is both precisely orchestrated and experimentally fun. This album will leave your mind stimulated even as you relax into every note.\nFind Sweet Cheese Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/04/02132016/best-instrumental-albums-to-listen-to-while-high-header.jpg","urlslug":"/news/lifestyle/5-instrumental-albums-to-listen-to-while-high"},{"id":"contentitems-8229","title":"Try These Cannabis Strains That Are as Sweet as Honey","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1475440520000)\/","text":"Honey is an amazing substance — it’s a natural sweetener, a super-food with a nearly endless shelf life (if sealed properly), and has outstanding nutritional and medicinal benefits that can even help people adapt to local allergens (not to mention how delicious it is on baklava, peanut butter sandwiches, and in a cup of hot coffee or tea!).\nLeafly is home to over 60 specific strains that exhibit notes of honey. As your strain researcher and a passionate purveyor of fine cannabis, I’ve curated a shortlist of honey-flavored strains that will make your fingers sticky and your taste buds smile. Enjoy!\n   Panama Red\nPanama Red is best described as an old-school cannabis classic. Originating from Panama, this pure sativa rose to stardom in the late 1960’s thanks to its typical sativa effects: speedy and intense, bordering on psychedelic. As cannabis cultivation matured, Panama Red, which has a lengthy flowering time of at least 11 weeks, was left behind for faster growing strains and increased profits. However, those who fondly recall days of its prominence love its smooth medicating experience and loftily contemplate its revival. If you can get your hands on this sentimental throwback, do not hesitate to groove down memory lane and enjoy the ride.\n   Chocolate Thunder\nWhen you combine the sweet cocoa flavor of Chocolope with the strength and potency of Alaskan Thunder Fuck, you get none other than Chocolate Thunder. This clear-headed, active sativa may be all you need to inspire creativity or promote concentration, and patients will appreciate its ability to dull symptoms without fogging mental faculties. True to its name, Chocolate Thunder has a subtle sweet, earthy aroma similar to that of chocolate.\n   Thor’s Hammer\nThor’s Hammer by SnowHigh Seeds is an uplifting sativa strain that combines genetics from Vortex, Cinderella 99, and Acapulco Gold. Like a bolt of lightning commanded by the Norse god himself, Thor’s Hammer delivers an electrifying blast of cerebral energy that awakens creativity and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush fatigue and depression like the giants of Jotunheimr will likely find Thor’s Hammer to be the perfect weapon. You may also find a genetic variant of Thor’s Hammer from Alaska that instead combines God Bud and Sour Diesel in a more balanced indica-sativa hybrid cross.\n   Honey Banana\nHoney Bananas from Elemental Seeds is a heavy-handed hybrid strain bred from Strawberry Banana and Honey Boo Boo. This cannabis strain earns its name with a resinous coat as sticky as honey and an unmistakable banana aroma. She leans heavily toward the indica side of the family, providing weighty full-body effects coupled with an invigorating buzz of cerebral euphoria.\n   Lodi Dodi\nLodi Dodi is a sativa-dominant hybrid popular in Washington State. Exclusively bred by The Clone Zone, the genetic heritage of Lodi Dodi is undefined and closely guarded. Lodi Dodi carries a sweet, unique flavor of tropical fruit and fresh wildflowers. The pungent aroma leads the way towards a cerebral buzz, known to spark creativity and a boost of energy that will turn any task into a more enjoyable adventure.\n   Nebula\nThe Nebula marijuana strain was bred by Paradise Seeds in 1996. Its name means “Starcloud” and it has been known to “twinkle” with THC coating, with a head and body buzz described as intense and almost psychedelic. The buds have been known to smell and taste like honey, and flowering time is a minimum of 9 weeks. Nebula has won many awards, including 3rd place in the sativa category at the High Times Cannabis Cup in 1999 and 2nd place in 2005. It also took 3rd place at the Highlife Cup in 2004 in the Hydro category, and 1st place at the Copa La Bella Flor Spain in 2005.\n   Fortune Cookies\nFortune Cookies is a hybrid cannabis strain that combines the famed genetics of GSC (f.k.a Girl Scout Cookies) and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in GSC (f.k.a Girl Scout Cookies), but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty “couch-lock” effects typically associated with indica strains.\n   BC Sweet Tooth\nDeveloped in British Columbia by BC Bud Depot, BC Sweet tooth is an indica-dominant hybrid known for its quick flowering time and candy taste.  A hardy plant, this strain can be grown outdoors where it can flower in under 7 weeks, but it prefers the indoors where it may flower as soon as 6 weeks. The result of a cross with earlier generations of BC Sweet Tooth and classic Sweet Tooth, these sugary flowers are sure to satisfy your craving. The crystalline buds have a strong, sweet smell with a hint of citrus, and consumers report that this treat satisfies with a long-lasting, potent feeling that hits fast.\n   Danky Doodle\nOriginally named Double D as a reference to the large buds on these plants (we’ll let you make the connection there), breeder KC Brains decided to rename the strain Danky Doodle at the suggestion of some American friends in order to avoid confusion with the similarly named Double Dutch. Danky Doodle certainly isn’t a shy plant; it grows like the weed it is and will make its presence known with its pungent sweet smell. Plants flower at 9 to 11 weeks and should provide a high yield of large buds covered in a rich frost. This plant is a cross between several strains, and it’s no surprise that Big Bud is included in its lineage along with the strains Viking and the breeder’s own KC 636. The result is a strong indica that provides full body relief no matter what you call it.\n   Cream Caramel\nCream Caramel, named after its sweet caramel aroma, is a 90% indica cross between BlueBlack, Maple Leaf Indica, and White Rhino. Covered in a sugary coat of THC-rich resin, Cream Caramel delivers heavy, relaxing indica effects that soothe the mind and body. Though originally bred by Sweet Seeds in Spain, Royal Queen Seeds have also championed their own rendition called Royal Caramel. Early October is the finish line for outdoor Cream Caramel flowers, while indoor gardens should be harvested after a 7 to 8 week flowering period.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/02131126/cannabis-strains-that-taste-like-honey.jpg","urlslug":"/news/strains-products/cannabis-strains-that-taste-like-honey"}],"reviewCount":121,"flavors":[{"name":"Honey","score":16.558441558441558},{"name":"Sweet","score":15.692640692640691},{"name":"Earthy","score":14.637445887445889},{"name":"Vanilla","score":10.091991341991342},{"name":"Pungent","score":7.6028138528138527}],"effects":[{"name":"Relaxed","score":145.7521645021645},{"name":"Happy","score":136.03896103896105},{"name":"Euphoric","score":131.57467532467533},{"name":"Hungry","score":114.74567099567099},{"name":"Creative","score":28.436147186147185}],"symptoms":[{"name":"Pain","score":17.884199134199132},{"name":"Depression","score":16.63961038961039},{"name":"Stress","score":14.637445887445889},{"name":"Muscle Spasms","score":11.417748917748918},{"name":"Headaches","score":9.0367965367965368}],"conditions":[{"name":"Anxiety","score":114.74567099567099},{"name":"Gastrointestinal Disorder","score":102.94913419913419},{"name":"Arthritis","score":7.9004329004329},{"name":"PTSD","score":6.0876623376623371},{"name":"ADD/ADHD","score":5.7088744588744591}],"negatives":[{"name":"Dry Mouth","score":112.55411255411255},{"name":"Dry Eyes","score":8.4686147186147185},{"name":"Dizzy","score":5.51948051948052},{"name":"Headache","score":2.5703463203463204},{"name":"Paranoid","score":1.5151515151515151}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_05b4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001184/b/fortune-cookies__primary_a9c4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_7c1c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607690/b/fortune-cookies__primary_d70d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_f201.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/596982/b/fortune-cookies__primary_95b4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_cef1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/597298/b/fortune-cookies__primary_885f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_f8bf.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/516062/b/fortune-cookies__primary_f4d8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_84a9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/485876/b/fortune-cookies__primary_607a.jpg"}],"photoTotalCount":29,"popularCities":["Detroit, MI","Portland, OR","Los Angeles, CA","Montréal, QC","Eugene, OR","Las Vegas, NV","Seattle, WA","Vancouver, BC","Albany, OR","Ann Arbor, MI"],"permalink":"https://mobileapi.leafly.com/hybrid/fortune-cookies","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.62809917355372/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Girl Scout Cookies","subtitle":null,"slug":"girl-scout-cookie","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/girl-scout-cookie","symbol":"Gsc","applink":"leafly://strain/girl-scout-cookie"},{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":136977,"slug":"fortune-cookies","name":"Fortune Cookies","subtitle":null,"symbol":"Ftc","category":"Hybrid","description":"\u003cp\u003eFortune Cookies is a \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e cannabis strain that combines the famed genetics of \u003ca href=\"http://www.leafly.com/hybrid/girl-scout-cookie\"\u003eGirl Scout Cookies\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003eOG Kush\u003c/a\u003e in a potent mix of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eearthy\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-honey\"\u003ehoneyed\u003c/a\u003e flavors. OG Kush genes are already present in Girl Scout Cookies, but Fortune Cookies has pronounced characteristics that OG fans will appreciate. \u003ca href=\"http://leafly.com/sativa\"\u003eSativa\u003c/a\u003e genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-creative\"\u003ecreative\u003c/a\u003e escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty \u0026ldquo;couch-lock\u0026rdquo; effects typically associated with \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e strains.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Fortune Cookies is a hybrid cannabis strain that combines the famed genetics of Girl Scout Cookies and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in Girl Scout Cookies, but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty \u0026ldquo;couch-lock\u0026rdquo; effects typically associated with indica strains.\u0026nbsp;\n","aka":"Fortune Cookie","rating":4.63,"highlightedReviews":[{"id":1413662,"username":"thgdbtmn","text":"I just bought a 1/4 of this stuff just because it looked and smelled so good at the store. Normally I\u0027ll only buy a gram for a new strain just in case I don\u0027t like it. \n\nMan, I am the best kind of high right now, after three good hits of this stuff from my bubbler.\n\nI\u0027ve got Panda Bear - Tomboy turning right now at volume number 47. I don\u0027t even care that it\u0027s Monday. I\u0027m super chill right now. Got my slippers on.\n\nSo what makes this stain worth rambling about is that I am in a tremendously-happy mood, and that\u0027s coming from someone who has been trying to release a bunch of self-hate. And helping others more. I feel like I am going to be the person I\u0027m working toward. Keep on the LEGO. Build dem bricks.\n\nIt was also smooth inhaling, and I love the coated honey stickiness.\n\nDense, and intense.\n\nWould do again.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1554629,"username":"Andrew812","text":"Amazingly dank sativa,  insanely purple inside and out and smells like a strong indica,  but upon hitting it,  it makes itself very clear what it\u0027s here for... To put you right where you need to be.  not overly energetic but energetic for sure.  A very long lasting high very cerebral and long lasting.  Not the best for pain in my opinion but for anxiety headaches and my nausea it\u0027s been doing wonders!!  Also very Euphoric so definitely a great strain for depression!!  stay medicated all!!  ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-62050","title":"5 Fantastic Instrumental Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1522705256000)\/","text":"Instrumental music exists outside the realm of vocalists, with guitar, horns, and keys filling the space with innovative instrumentation (known as instrumental interludes) where lyrics would normally reside. Though commonly associated with jazz, instrumental music is not limited to any single genre, and can even transcend genre altogether.\nThe beauty in instrumental music is its ability to push the boundaries of sound—exploring and weaving in and out of its structure—with an ease not afforded to lyrical constructs.\n\nBelow, discover five fantastic instrumental albums paired with the perfect strain and explore the vast range of sounds and possibilities instrumental music provides.\nFeeling Good by Dorothy Ashby\n\nStrain Pairing Recommendation: Euforia\nReleased posthumously in 2015, Feeling Good is an incredible collection of harpist Dorothy Ashby’s music that can’t be missed. The 30-track album runs for nearly two hours and will leave no question as to why Ashby’s prowess makes her one of the top instrumental artists to know and love. Her light, lovely, and versatile sound relaxes yet enlivens. Feeling Good is a feel-good instrumental jazz album with a fresh twist, as Ashby demonstrates the harp’s use as a bebop instrument that is as engaging as any saxophone.\nFind Euforia Nearby\nJuice by Medeski, Martin, Scofield \u0026 Wood\n\nStrain Pairing Recommendation: Candy Jack\nJuice, released in 2014, is the latest album from the dynamite quartet, Medeski, Martin, Scofield \u0026 Wood. The album contains all the signature versatility that Medeski, Martin \u0026 Wood bring to their albums, with the expert finesse and precision of legendary guitarist John Scofield. The eclectic 10-track album will keep you on your toes as it bends and twists through experimental and improvisational jazz fusion. Medeski’s wizard-like ability to manipulate the keys and organ provokes creativity and a sense of playfulness that will keep you guessing and surprised from “Sham Time” to “The Times They Are A-Changing.”\nFind Candy Jack Nearby\n\nNomad (Remastered) by Lotus\n\nStrain Pairing Recommendation: Fortune Cookies\nNomad was originally released in 2005, but the latest remastered and live version—released in 2014—is here to remind us all over again why we will always love this album. With funky, upbeat stylings and a full, rounded sound, Nomad wastes no time pulling you into its world—and what a joyful world it is. Songs such as “Travel” incorporate light, melodic vocalizations, blended seamlessly so that they become a sort of instrumentation of their own. Nomad traverses landscapes, delivering transcendental bliss and danceable rhythms in a single album.\nFind Fortune Cookies Nearby\nMigration by Bonobo\n\nStrain Pairing Recommendation: 303 OG\nBonobo’s Migration, released in 2017, is an extension of his unique sound and musical stylings. Each song is masterfully manipulated and crafted, flowing from one track to the next with versatility. Though Migration is electronically styled, Bonobo’s use of real instruments creates a depth and soul within the music that is often lacking amongst electronic artists. And while the album incorporates lyrics on a few tracks, it is deftly woven into the soundscape the way any other instrument is intertwined. Migration explores a range of sounds and feelings, from upbeat tribal rhythms to soft, melodic, wordless ballads, making it an album that tells endless stories with every note.\nFind 303 OG Nearby\n\nGentlemen, I Neglected To Inform You You Will Not Be Getting Paid by Charlie Hunter\n\nStrain Pairing Recommendation: Sweet Cheese\nWith a title reflecting the playfulness instilled in this instrumental album, Gentlemen, I Neglected To Inform You You Will Not Be Getting Paid is a modern jazz collection with a funky twist. Released in 2010, the album runs short at only 38 mins, but the pointed, swampy vibe and full sound, makes up for it. Hunter’s guitar sails beside  a medley of drums, horns, and bass, creating a sound that is both precisely orchestrated and experimentally fun. This album will leave your mind stimulated even as you relax into every note.\nFind Sweet Cheese Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/04/02132016/best-instrumental-albums-to-listen-to-while-high-header.jpg","urlslug":"/news/lifestyle/5-instrumental-albums-to-listen-to-while-high"},{"id":"contentitems-8229","title":"Try These Cannabis Strains That Are as Sweet as Honey","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1475440520000)\/","text":"Honey is an amazing substance — it’s a natural sweetener, a super-food with a nearly endless shelf life (if sealed properly), and has outstanding nutritional and medicinal benefits that can even help people adapt to local allergens (not to mention how delicious it is on baklava, peanut butter sandwiches, and in a cup of hot coffee or tea!).\nLeafly is home to over 60 specific strains that exhibit notes of honey. As your strain researcher and a passionate purveyor of fine cannabis, I’ve curated a shortlist of honey-flavored strains that will make your fingers sticky and your taste buds smile. Enjoy!\n   Panama Red\nPanama Red is best described as an old-school cannabis classic. Originating from Panama, this pure sativa rose to stardom in the late 1960’s thanks to its typical sativa effects: speedy and intense, bordering on psychedelic. As cannabis cultivation matured, Panama Red, which has a lengthy flowering time of at least 11 weeks, was left behind for faster growing strains and increased profits. However, those who fondly recall days of its prominence love its smooth medicating experience and loftily contemplate its revival. If you can get your hands on this sentimental throwback, do not hesitate to groove down memory lane and enjoy the ride.\n   Chocolate Thunder\nWhen you combine the sweet cocoa flavor of Chocolope with the strength and potency of Alaskan Thunder Fuck, you get none other than Chocolate Thunder. This clear-headed, active sativa may be all you need to inspire creativity or promote concentration, and patients will appreciate its ability to dull symptoms without fogging mental faculties. True to its name, Chocolate Thunder has a subtle sweet, earthy aroma similar to that of chocolate.\n   Thor’s Hammer\nThor’s Hammer by SnowHigh Seeds is an uplifting sativa strain that combines genetics from Vortex, Cinderella 99, and Acapulco Gold. Like a bolt of lightning commanded by the Norse god himself, Thor’s Hammer delivers an electrifying blast of cerebral energy that awakens creativity and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush fatigue and depression like the giants of Jotunheimr will likely find Thor’s Hammer to be the perfect weapon. You may also find a genetic variant of Thor’s Hammer from Alaska that instead combines God Bud and Sour Diesel in a more balanced indica-sativa hybrid cross.\n   Honey Banana\nHoney Bananas from Elemental Seeds is a heavy-handed hybrid strain bred from Strawberry Banana and Honey Boo Boo. This cannabis strain earns its name with a resinous coat as sticky as honey and an unmistakable banana aroma. She leans heavily toward the indica side of the family, providing weighty full-body effects coupled with an invigorating buzz of cerebral euphoria.\n   Lodi Dodi\nLodi Dodi is a sativa-dominant hybrid popular in Washington State. Exclusively bred by The Clone Zone, the genetic heritage of Lodi Dodi is undefined and closely guarded. Lodi Dodi carries a sweet, unique flavor of tropical fruit and fresh wildflowers. The pungent aroma leads the way towards a cerebral buzz, known to spark creativity and a boost of energy that will turn any task into a more enjoyable adventure.\n   Nebula\nThe Nebula marijuana strain was bred by Paradise Seeds in 1996. Its name means “Starcloud” and it has been known to “twinkle” with THC coating, with a head and body buzz described as intense and almost psychedelic. The buds have been known to smell and taste like honey, and flowering time is a minimum of 9 weeks. Nebula has won many awards, including 3rd place in the sativa category at the High Times Cannabis Cup in 1999 and 2nd place in 2005. It also took 3rd place at the Highlife Cup in 2004 in the Hydro category, and 1st place at the Copa La Bella Flor Spain in 2005.\n   Fortune Cookies\nFortune Cookies is a hybrid cannabis strain that combines the famed genetics of GSC (f.k.a Girl Scout Cookies) and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in GSC (f.k.a Girl Scout Cookies), but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty “couch-lock” effects typically associated with indica strains.\n   BC Sweet Tooth\nDeveloped in British Columbia by BC Bud Depot, BC Sweet tooth is an indica-dominant hybrid known for its quick flowering time and candy taste.  A hardy plant, this strain can be grown outdoors where it can flower in under 7 weeks, but it prefers the indoors where it may flower as soon as 6 weeks. The result of a cross with earlier generations of BC Sweet Tooth and classic Sweet Tooth, these sugary flowers are sure to satisfy your craving. The crystalline buds have a strong, sweet smell with a hint of citrus, and consumers report that this treat satisfies with a long-lasting, potent feeling that hits fast.\n   Danky Doodle\nOriginally named Double D as a reference to the large buds on these plants (we’ll let you make the connection there), breeder KC Brains decided to rename the strain Danky Doodle at the suggestion of some American friends in order to avoid confusion with the similarly named Double Dutch. Danky Doodle certainly isn’t a shy plant; it grows like the weed it is and will make its presence known with its pungent sweet smell. Plants flower at 9 to 11 weeks and should provide a high yield of large buds covered in a rich frost. This plant is a cross between several strains, and it’s no surprise that Big Bud is included in its lineage along with the strains Viking and the breeder’s own KC 636. The result is a strong indica that provides full body relief no matter what you call it.\n   Cream Caramel\nCream Caramel, named after its sweet caramel aroma, is a 90% indica cross between BlueBlack, Maple Leaf Indica, and White Rhino. Covered in a sugary coat of THC-rich resin, Cream Caramel delivers heavy, relaxing indica effects that soothe the mind and body. Though originally bred by Sweet Seeds in Spain, Royal Queen Seeds have also championed their own rendition called Royal Caramel. Early October is the finish line for outdoor Cream Caramel flowers, while indoor gardens should be harvested after a 7 to 8 week flowering period.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/02131126/cannabis-strains-that-taste-like-honey.jpg","urlslug":"/news/strains-products/cannabis-strains-that-taste-like-honey"}],"reviewCount":121,"flavors":[{"name":"Honey","score":16.558441558441558},{"name":"Sweet","score":15.692640692640691},{"name":"Earthy","score":14.637445887445889},{"name":"Vanilla","score":10.091991341991342},{"name":"Pungent","score":7.6028138528138527}],"effects":[{"name":"Relaxed","score":145.7521645021645},{"name":"Happy","score":136.03896103896105},{"name":"Euphoric","score":131.57467532467533},{"name":"Hungry","score":114.74567099567099},{"name":"Creative","score":28.436147186147185}],"symptoms":[{"name":"Pain","score":17.884199134199132},{"name":"Depression","score":16.63961038961039},{"name":"Stress","score":14.637445887445889},{"name":"Muscle Spasms","score":11.417748917748918},{"name":"Headaches","score":9.0367965367965368}],"conditions":[{"name":"Anxiety","score":114.74567099567099},{"name":"Gastrointestinal Disorder","score":102.94913419913419},{"name":"Arthritis","score":7.9004329004329},{"name":"PTSD","score":6.0876623376623371},{"name":"ADD/ADHD","score":5.7088744588744591}],"negatives":[{"name":"Dry Mouth","score":112.55411255411255},{"name":"Dry Eyes","score":8.4686147186147185},{"name":"Dizzy","score":5.51948051948052},{"name":"Headache","score":2.5703463203463204},{"name":"Paranoid","score":1.5151515151515151}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_05b4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001184/b/fortune-cookies__primary_a9c4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_7c1c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607690/b/fortune-cookies__primary_d70d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_f201.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/596982/b/fortune-cookies__primary_95b4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_cef1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/597298/b/fortune-cookies__primary_885f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_f8bf.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/516062/b/fortune-cookies__primary_f4d8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/fortune-cookies_100x100_84a9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/485876/b/fortune-cookies__primary_607a.jpg"}],"photoTotalCount":29,"popularCities":["Detroit, MI","Portland, OR","Los Angeles, CA","Montréal, QC","Eugene, OR","Las Vegas, NV","Seattle, WA","Vancouver, BC","Albany, OR","Ann Arbor, MI"],"permalink":"https://mobileapi.leafly.com/hybrid/fortune-cookies","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.62809917355372/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Girl Scout Cookies","subtitle":null,"slug":"girl-scout-cookie","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/girl-scout-cookie","symbol":"Gsc","applink":"leafly://strain/girl-scout-cookie"},{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
