{
    "aka": "Blue Lambsbread, Blueberry Lamb's Bread, Blueberry Lambs Bread, Blue Lambsbreath, Blueberry Lamb's Breath, Blue Lamb's Breath",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1426266000000)/",
            "id": "contentitems-3419",
            "text": "Thanks to our app users for all your strain submissions this week! We've highlighted 10 strains we thought you might be into, but there's plenty more exploring to be done in the Leafly Explorer.\nWant to find out where to find these strains near you? Check the \"Availability\" tab on their strain pages to find out if someone's carrying it in your area. Maybe you've tried one of these new strains already; if this is the case, go leave a review!\n \n   1. Swiss Gold\nCharacteristics of Swiss Gold:\n\nSwiss Gold is a high-CBD strain from Northern California that is typically classified as a sativa and was bred by the late Lawrence Ringo. Ringo describes the structure of the strain as “pure indica, short and fat.” Swiss Gold regularly tests with CBD:THC ratios of 2:1, and carries an earthy aroma of fresh citrus. The relaxing effects reduce pain and stress while stimulating the appetite, and eventually cradle you to sleep.\n\n \n   2. Blueberry Skunk\nCharacteristics of Blueberry Skunk:\n\nBlueberry Skunk is an indica-dominant hybrid of Blueberry and Skunk #1 genetics. It has a reputation for being potent, flavorful, and relatively easy to grow. The aroma of Blueberry Skunk is a complex mix of sweet berry flavors that blend with an earthy, skunky musk. The effects are led by a long-lasting euphoric buzz that generates giggles as well as the munchies.\n\n \n   3. Thor's Hammer\nCharacteristics of Thor's Hammer:\n\nThor’s Hammer by SnowHigh Seeds is an uplifting sativa strain that combines genetics from Vortex, Cinderella 99, and Acapulco Gold. Like a bolt of lightning commanded by the Norse god himself, Thor’s Hammer delivers an electrifying blast of cerebral energy that awakens creativity and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush fatigue and depression like the giants of Jotunheimr will likely find Thor’s Hammer to be the perfect weapon. You may also find a genetic variant of Thor's Hammer from Alaska that instead combines God Bud and Sour Diesel in a more balanced indica-sativa hybrid cross.\n\n \n   4. Black '84\nCharacteristics of Black '84:\n\nBlack ’84, also known as UW Black ’84, is one of a few elusive strains that managed to escape from the medical cannabis garden at the University of Washington in the early and mid-1980s. Believed to descend from Afghani genetics, Black ‘84’s unknown indica lineage expresses itself as a stout, dark, and bushy plant. The aroma is a complex mix of sweet tropical flavors that blend with a smooth nutty finish. Its powerful, relaxing effects on the body make Black ’84 a great nighttime strain when combating anxiety, pain, and insomnia.\n\n \n   5. Zeta Sage\nCharacteristics of Zeta Sage:\n\nZeta Sage is a sativa-dominant hybrid that combines SAGE and OG Kush genetics. The flavors of Zeta Sage are a sweet, pungent mix of sharp diesel and blueberry that leave a lingering menthol aftertaste. Its uplifting rush of euphoric effects provides a heady buzz that relaxes the body without overpowering, making Zeta Sage a great choice for daytime activities.\n\n \n    6. White Urkle\nCharacteristics of White Urkle:\n\nWhite Urkle is a hybrid of Purple Urkle and The White bred by OG Raskal Genetics. Most phenotypes will express themselves with deep violet hues that show the influence of its Purple Urkle mother. This strain is known for having a short stature and a fruity bouquet of flavors that mix with an earthy, pine aroma that gives rise to relaxing yet balanced effects.\n\n \n   7. Blueberry Lambsbread\nCharacteristics of Blueberry Lambsbread:\n\nBlueberry Lambsbread is an uplifting hybrid strain that folds together genetics from Jamaican Lamb’s Bread and Blueberry. Invigorating, creative effects are lightly anchored by mellow relaxation, making Blueberry Lambsbread a good choice for day or evening use. Earthy and woody notes mingle with a sweet berry aroma passed down from its Blueberry parent.\n\n \n   8. Mad Scientist\nCharacteristics of Mad Scientist:\n\nMad Scientist, or Mad.S, by Sannie’s Seeds is an indica-dominant concoction that combines Herijuana and White Widow genetics. With a THC profile that often stretches to 24%, Mad Scientist delivers powerfully relaxing effects that ease the mind and body into a peaceful sedation. Hints of sweet lemon and coffee release on the exhale, and its dense buds are powdered with a snow-white blanket of crystal resin.\n\n \n   9. Alien Reunion\nCharacteristics of Alien Reunion:\n\nAlien Reunion is an indica-dominant cross of Alien OG and Alien Dawg bred by Cannobi Genetics. Its dense colas emit a pungent mix of flavors that include sweet fruity tones of cherry and lemon combined with a skunky, diesel note. The relaxing effects of Alien Reunion calm the body while stimulating the mind with an energetic and creative rush that helps you stay productive without feeling sluggish.\n\n \n   10. Hawaiian Cookies\nCharacteristics of Hawaiian Cookies:\n\nHawaiian Cookies is a sativa-dominant hybrid cross between Hawaiian Snow and GSC (f.k.a Girl Scout Cookies) that first entered the scene in 2014. From its Hawaiian Snow parent, Hawaiian Cookies inherits a tropical citrus aroma in a flavorful introduction to its potent euphoric effects. Its rounded bud structure and dark coloration further testify to this strain’s elite parent genetics.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/03/12002431/new-strains-alert-swiss-gold-thors-hammer-hawaiian-cookies-bluebe.png",
            "title": "New Strains Alert: Swiss Gold, Thor's Hammer, Hawaiian Cookies, Blueberry Skunk, and More",
            "urlslug": "/news/strains-products/new-strains-alert-swiss-gold-thors-hammer-hawaiian-cookies-bluebe"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 21.38888888888889
        },
        {
            "name": "PTSD",
            "score": 14.166666666666666
        },
        {
            "name": "Migraines",
            "score": 12.777777777777779
        },
        {
            "name": "Bipolar Disorder",
            "score": 11.38888888888889
        },
        {
            "name": "ADD/ADHD",
            "score": 10
        }
    ],
    "description": "<p>Blueberry Lambsbread is an <a href=\"http://www.leafly.com/explore/tags-uplifted\">uplifting</a> <a href=\"http://www.leafly.com/explore/category-hybrid\">hybrid</a> strain that folds together genetics from Jamaican <a href=\"http://www.leafly.com/sativa/lamb-s-bread\">Lamb&rsquo;s Bread</a> and <a href=\"http://leafly.com/indica/blueberry\">Blueberry</a>. Invigorating, <a href=\"http://www.leafly.com/explore/tags-creative\">creative</a> effects are lightly anchored by mellow <a href=\"http://www.leafly.com/explore/tags-relaxed\">relaxation</a>, making Blueberry Lambsbread a good choice for day or evening use. <a href=\"http://www.leafly.com/explore/flavors-earthy\">Earthy</a> and <a href=\"http://www.leafly.com/explore/flavors-woody\">woody</a> notes mingle with a <a href=\"http://www.leafly.com/explore/flavors-sweet\">sweet</a> <a href=\"http://www.leafly.com/explore/flavors-berry\">berry</a> aroma passed down from its Blueberry parent.&nbsp;</p>\n",
    "descriptionPlain": "Blueberry Lambsbread is an uplifting hybrid strain that folds together genetics from Jamaican Lamb&rsquo;s Bread and Blueberry. Invigorating, creative effects are lightly anchored by mellow relaxation, making Blueberry Lambsbread a good choice for day or evening use. Earthy and woody notes mingle with a sweet berry aroma passed down from its Blueberry parent.&nbsp;\n",
    "effects": [
        {
            "name": "Happy",
            "score": 31.11111111111111
        },
        {
            "name": "Relaxed",
            "score": 23.88888888888889
        },
        {
            "name": "Talkative",
            "score": 14.166666666666666
        },
        {
            "name": "Uplifted",
            "score": 13.88888888888889
        },
        {
            "name": "Focused",
            "score": 12.777777777777779
        }
    ],
    "flavors": [
        {
            "name": "Blueberry",
            "score": 41.111111111111114
        },
        {
            "name": "Earthy",
            "score": 34.166666666666664
        },
        {
            "name": "Sweet",
            "score": 28.333333333333332
        },
        {
            "name": "Berry",
            "score": 16.944444444444443
        },
        {
            "name": "Skunk",
            "score": 10
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1306176,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Just got 2z of this yesterday. The only gripe i have, is that it reminds me alot of blue dream.. but is that a bad thing?. Medium sized cone shaped nugs, beautiful green with red hairs, and covered in dusty white trich hairs.Smell and taste are coassic blueberry with a lemony/catpissy twist,delicious and very strong.The high hits your head, and almost gave me a green crack type boost at first. Only to have the blueberry genetics kick me in the nads about 15mins in. at this point it becomes very balanced, melting your mind and body, but not into full on couchlock. ",
            "username": "flipndip187"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1453528,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Very good in concentrate form",
            "username": "supermario710"
        }
    ],
    "id": 145359,
    "name": "Blueberry Lambsbread",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 12.777777777777779
        },
        {
            "name": "Dizzy",
            "score": 1.3888888888888888
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/blueberry",
            "category": "Indica",
            "name": "Blueberry",
            "permalink": "https://mobileapi.leafly.com/indica/blueberry",
            "slug": "blueberry",
            "subtitle": null,
            "symbol": "Bry"
        },
        {
            "applink": "leafly://strain/lamb-s-bread",
            "category": "Sativa",
            "name": "Lamb's Bread",
            "permalink": "https://mobileapi.leafly.com/sativa/lamb-s-bread",
            "slug": "lamb-s-bread",
            "subtitle": null,
            "symbol": "Lb"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/blueberry-lambsbread",
    "photoTotalCount": 3,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/437619/b/blueberry-lambsbread__primary_c9d6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-lambsbread_100x100_fe09.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/426963/b/blueberry-lambsbread__primary_139b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-lambsbread_100x100_4d78.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/357041/b/blueberry-lambsbread__primary_08fd.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry-lambsbread_100x100_a6a3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Detroit, MI",
        "Medford, OR",
        "New Westminster, BC",
        "Richmond, BC",
        "Shelton, WA",
        "Surrey, BC",
        "West Kelowna, BC"
    ],
    "rating": 4.71,
    "relatedStrains": [],
    "reviewCount": 17,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "blueberry-lambsbread",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.70588235294118/240",
    "subtitle": null,
    "symbol": "Byl",
    "symptoms": [
        {
            "name": "Depression",
            "score": 16.944444444444443
        },
        {
            "name": "Inflammation",
            "score": 10
        },
        {
            "name": "Stress",
            "score": 6.944444444444445
        },
        {
            "name": "Lack of Appetite",
            "score": 5.555555555555555
        },
        {
            "name": "Nausea",
            "score": 4.166666666666666
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
