{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1501426821000)/",
            "id": "contentitems-35532",
            "text": "One of the things that makes every cannabis strain unique is its aroma. From sweet berry and fruit to earthy, herbal, and floral, an attractive fragrance is native to most strains.\nAnd then there are those that, whether by accident or breeder’s intention, inherited flavors that truly challenge the palate. With names like “Cat Piss” and “Dog Shit,” it’s clear that no one is in denial of this odiferous reality.\nOddly enough, either by novelty or quality of effects, many of these remain staples in the cannabis community despite their strange, borderline terrible aromas.\n\n   Sour Cheese\nSour Cheese, UK Cheese, Exodus Cheese…all of these strains refer to a lineage characterized by a sour, savory aroma. Offering mellow euphoria that lifts energy and mood, Sour Cheese is a delightful hybrid strain with a funky flavor that most consumers can look past. But with a fragrance this stinky, we see polarized opinions.\nSome love it so much, it inspires poetry. Just magical:\n\n“When you open the jar and take a whiff you are greeted with a splash of pungent sour that quickly turns into a smooth cheese. The buds release a satisfying snap that throws trichomes into the air when broken from the stems.” – Neemix\n\nBut then:\n\n“[S]mells like puke.” – soop21\n\n\n   Cat Piss\nThis sativa has a pungent aroma that is reminiscent of ammonia–and thus, cat urine. But there’s a reason Cat Piss keeps getting planted, and it has something to do with the buzzy, stimulating effects considered to be worth the funk, according to many Leafly reviewers.\n\n“Besides the [wretched] taste that leaves you wanting water and a mint, soon you will be too uplifted to care! Effects are amazing and are long lasting.” –misterbest\n\nHowever, if you’re susceptible to paranoia and anxiety like this poor reviewer, maybe avoid this novelty strain altogether:\n\n“Yuck. It really does smell like cat piss. Strong, racy sativa. Made me paranoid.” –aarvind\n\n\n   Dog Shit\nSpeaking of animal waste you’d never expect to find yourself smoking, Dog Shit is yet another strain named for its foul-smelling aroma. A hybrid strain most easily acquired in Oregon, its odor doesn’t always come out smelling like sour, funky “doody pies.” But even when it does, Dog Shit retains an unexpected fan base:\n\n“My first impressions of the bud were that they were very stinky and definitely lived up to their name however once I smoked it the smell evolved into something more sweet and pleasant.” – DogeKing\n\nBut, to the shock of absolutely no one, this poopy scented strain ain’t for everyone:\n\n“I got very anxious and paranoid when taking this and it smells kinda bad.” – BONECRUSHER27\n\n\n   M-39\nBased on descriptions from Leafly users, M-39 sounds like Canadian ditchweed grown in a tar pit. And, according to reviews, its aroma is most commonly likened to just that–tar. Some say that its abundance can be attributed to its dull, lackluster aroma that made it easier to smuggle. Across the board, it seems the quality of this strain varies, as well as opinions of it:\n\n“It has a very strong smell almost a combination of paint and smelly body odor.” – StoneySundays\n\nBut I guess it isn’t always bad:\n\n“[H]as a soft smoke with notes of peanut butter and fall aroma.” – ray8753\n\nSo does it taste like tar or warm autumnal cookies? You’ll probably have to wander over to Canada’s black market to find out.\n\n   Grandpa’s Breath\nThere’s a slightly musty hint to this strain, but it’s really not as bad as it sounds. Grandpa’s Breath is more aptly named for the Granddaddy Purple genetics used to breed it, but still, expectations set by the name can shape the experience.\n\n“Real nice body high, heavy relaxed head feeling, taste isn’t amazing but isn’t unpleasant either.” – hazefordayz\n\nBut this reviewer not only loves Grandpa’s Breath – he/she “loooooves” it:\n\n“This is one of the best tasting and medicating, fragrant strains I’ve ever had. I looooove Grandpa’s Breath!” – Strandz\n\nIt’s clear that there’s a layer of subjectivity when it comes to cannabis flavors–even flavors as unusual and questionable as those explored in this roundup. Although you may never want to try any of these, they do demonstrate the vast aromatic spectrum cannabis has to offer. And that, at the very least, is kind of impressive.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/28114836/cannabis-aroma-1.jpg",
            "title": "5 Cannabis Strains With Unusual (and Arguably Terrible) Aromas",
            "urlslug": "/news/strains-products/cannabis-strains-with-unusual-aromas"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1448643600000)/",
            "id": "contentitems-3375",
            "text": "Still digesting all that food from yesterday? We just added some strains to the Leafly Explorer to help you veg out. Others will motivate you to finally get up and out. Read up about each and find out if any of these are offered near you by checking the links below.\n \n   1. Critical Kali Mist\n\nCritical Kali Mist from Delicious Seeds was bred to be brilliant. Its genetics are a pairing of Critical Mass, an indica known for its growth of large sticky buds, and Kali Mist, a multi-award-winning sativa. The result is a powerful and resinous sativa that produces large, dense flowers after about 70 days. With earthy and pine flavors, this bud provides uplifting effects and endless fits of laughter.\n\nClick here for a full list of locations currently carrying Critical Kali Mist\n \n   2. Pink Bubba\n\nPink Bubba is a mostly indica strain that is said to combine genetics from Bubba Kush and Pink Kush. Earthy pine flavors lead the way with slight floral highlights that bring out this strain’s sweet notes. Perhaps best saved for evening use, Pink Bubba delivers a body-melting blast of physical relaxation alongside dreamy euphoria.\n\nClick here for a full list of locations currently carrying Pink Bubba\n \n   3. Purple Dog Shit\n\nWith a name like Purple Dog Shit, this hybrid strain sure knows how to garner attention. Its parent strain Dog Shit was named for its funky smell that some compare to dog turds, but this stain is more often described as earthy with a sweet touch of grape. Though its genetics aren’t certain, popular conjecture names Purple Urkle or another similar Purple strain as the second parent. Some Purple Dog Shit phenotypes exhibit a high level of CBD, a non-psychoactive cannabinoid known for its ability to treat pain, inflammation, and anxiety. Tranquilizing body effects ease you into deep relaxation and a good night's sleep.\n\nClick here for a full list of locations currently carrying Purple Dog Shit\n \n   4. Kali 47\n\nKali 47 is a mostly sativa strain that is characterized by sweet fruity flavors with hints of caramel. For many patients, Kali 47 may relieve an array of symptoms including depression, pain, and stress. A cross between Kali Mist and AK-47, Kali 47 delivers happy euphoric effects that allow the mind to stay agile while relaxing the body. This sativa is easy to grow, making it an ideal choice for novice cultivators.\n\n \n   5. Durga Mata\n\nDurga Mata, bred by Paradise Seeds, is an indica-driven strain. Despite being 90% indica, it acts unlike other predominately indica strains. With flavors best described as reminiscent of Turkish Delight, it offers a long-lasting relaxing body buzz without the couch potato effect. This strain has a natural resistance to pests and survives through rough treatment, which makes it a recommended choice for beginners and outdoor growers.\n\nClick here for a full list of locations currently carrying Durga Mata\n \n   6. Early Miss\n\nAn auto-flowering indica-dominant hybrid, Early Miss is a great strain for those looking for pain relief or an appetite boost. Crop King Seeds took the heavy producer Big Bud and paired it with the hard-hitting White Widow to make a moderate yielding plant with high levels of THC, and then crossed it with an auto-flowering ruderalis variety. Flowering in 50 days, this hybrid is a quick and easy grow that will not leave you disappointed.\n\nClick here for a full list of locations currently carrying Early Miss\n \n   7. Afghan Cow\n\nThis sweet-smelling and resinous sativa breed from Dr. Krippling Seeds is sure to keep you off the couch. Afghan Cow is bred from Ash, Kaya 47 (an AK-47 phenotype), and the beloved Kali Mist. The cerebral effects of this sativa are great for clear-headed daytime use. Having a high yield both indoors and out, this is an impressive plant with even more impressive effects.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12002324/new-strains-alert-purple-dog-shit-critical-kali-mist-pink-bubba-a.png",
            "title": "New Strains Alert: Purple Dog Shit, Critical Kali Mist, Pink Bubba, Afghan Cow, and More",
            "urlslug": "/news/strains-products/new-strains-alert-purple-dog-shit-critical-kali-mist-pink-bubba-a"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 28.26086956521739
        },
        {
            "name": "Glaucoma",
            "score": 26.08695652173913
        },
        {
            "name": "Cancer",
            "score": 25.543478260869566
        },
        {
            "name": "PTSD",
            "score": 25.543478260869566
        },
        {
            "name": "Epilepsy",
            "score": 25
        }
    ],
    "description": "<p>Dog Shit is a sativa-dominant hybrid strain named for its aroma, which bears a striking resemblance to its namesake. For the novelty-seekers not turned off by its name and smell, Dog Shit provides uplifting euphoria that elevates the mood while crushing stress. This strain has an elaborate genetic background that is said to stem&nbsp;from Purple Zacatecas, <a href=\"https://www.leafly.com/sativa/colombian-gold\">Colombian Gold</a>, <a href=\"http://leafly.com/sativa/south-asian-sativa\">Cambodian</a>, and Hippie Trail <a href=\"http://leafly.com/indica/afghani\">Afghani</a>.</p>\n",
    "descriptionPlain": "Dog Shit is a sativa-dominant hybrid strain named for its aroma, which bears a striking resemblance to its namesake. For the novelty-seekers not turned off by its name and smell, Dog Shit provides uplifting euphoria that elevates the mood while crushing stress. This strain has an elaborate genetic background that is said to stem&nbsp;from Purple Zacatecas, Colombian Gold, Cambodian, and Hippie Trail Afghani.\n",
    "effects": [
        {
            "name": "Euphoric",
            "score": 133.15217391304347
        },
        {
            "name": "Energetic",
            "score": 105.97826086956522
        },
        {
            "name": "Focused",
            "score": 78.80434782608695
        },
        {
            "name": "Uplifted",
            "score": 58.15217391304348
        },
        {
            "name": "Happy",
            "score": 57.608695652173914
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 56.52173913043478
        },
        {
            "name": "Woody",
            "score": 52.71739130434783
        },
        {
            "name": "Pine",
            "score": 51.08695652173913
        },
        {
            "name": "Sage",
            "score": 50.54347826086956
        },
        {
            "name": "Pungent",
            "score": 3.260869565217391
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1386859,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I think it's Labrador... lol",
            "username": "Luckey73"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1638935,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I smoke a lot. This is one of those strains that lasts a long time. Freezes time.",
            "username": "Lotoweed"
        }
    ],
    "id": 163536,
    "name": "Dog Shit",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 28.804347826086957
        },
        {
            "name": "Paranoid",
            "score": 2.1739130434782608
        },
        {
            "name": "Headache",
            "score": 1.6304347826086956
        },
        {
            "name": "Anxious",
            "score": 1.6304347826086956
        },
        {
            "name": "Dry Eyes",
            "score": 1.0869565217391304
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/afghani",
            "category": "Indica",
            "name": "Afghani",
            "permalink": "https://mobileapi.leafly.com/indica/afghani",
            "slug": "afghani",
            "subtitle": null,
            "symbol": "Afg"
        },
        {
            "applink": "leafly://strain/colombian-gold",
            "category": "Sativa",
            "name": "Colombian Gold",
            "permalink": "https://mobileapi.leafly.com/sativa/colombian-gold",
            "slug": "colombian-gold",
            "subtitle": null,
            "symbol": "Cg"
        },
        {
            "applink": "leafly://strain/cambodian",
            "category": "Sativa",
            "name": "Cambodian",
            "permalink": "https://mobileapi.leafly.com/sativa/cambodian",
            "slug": "cambodian",
            "subtitle": null,
            "symbol": "Cmb"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/dog-shit",
    "photoTotalCount": 7,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/dog-shit/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/dog-shit/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/629390/b/dog-shit__primary_fda8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dog-shit_100x100_9d2c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/614159/b/dog-shit__primary_98a9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dog-shit_100x100_8e66.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/499789/b/dog-shit__primary_96cb.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dog-shit_100x100_8e86.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/404076/b/dog-shit__primary_379c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dog-shit_100x100_58ce.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/400750/b/dog-shit__primary_0a77.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dog-shit_100x100_145b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/363325/b/dog-shit__primary_2638.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dog-shit_100x100_fb44.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Astoria, OR",
        "Lincoln City, OR",
        "Seaside, OR",
        "Sweet Home, OR"
    ],
    "rating": 4.28,
    "relatedStrains": [],
    "reviewCount": 36,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "dog-shit",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.27777777777778/240",
    "subtitle": null,
    "symbol": "Dsh",
    "symptoms": [
        {
            "name": "Stress",
            "score": 29.347826086956523
        },
        {
            "name": "Pain",
            "score": 28.804347826086957
        },
        {
            "name": "Lack of Appetite",
            "score": 28.26086956521739
        },
        {
            "name": "Depression",
            "score": 27.717391304347828
        },
        {
            "name": "Headaches",
            "score": 27.17391304347826
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
