{"sl_translate":"description,descriptionPlain,category","id":3179,"slug":"jah-kush","name":"Jah Kush","subtitle":null,"symbol":"Jah","category":"Hybrid","description":"\u003cp\u003eJah Kush is a true catch for any cultured cannabis consumer. Its well-rounded excellence is achieved by a distinct, exceptional aroma and long-lasting, mellow effects that are dynamic but not overwhelming. This hybrid is optimal for tension relief and mood lift, offering a rich and slow experience with a citrus aftertaste. With disputed genetics and supposed origins in Northern California, Jah Kush is a self-made success story.\u003c/p\u003e\n","descriptionPlain":"Jah Kush is a true catch for any cultured cannabis consumer. Its well-rounded excellence is achieved by a distinct, exceptional aroma and long-lasting, mellow effects that are dynamic but not overwhelming. This hybrid is optimal for tension relief and mood lift, offering a rich and slow experience with a citrus aftertaste. With disputed genetics and supposed origins in Northern California, Jah Kush is a self-made success story.\n","aka":null,"rating":4.59,"highlightedReviews":[{"id":1378714,"username":"AliDabba","text":"I cannot say enough good things about this strain.  I have some serious anxiety and stress. this is one of the few strains that allows me to not have to take a full heavy dose of prescription medicine with painful side effects.  This strain is so awesome it gives a little bit of everything magical to it.  A hint of energy and a spark of euphoria.  The flavor is INTOXICATING its like a rich cheese and wine, so famously desirable.  when its on the shelf i am undoubtedly buying it all.\r\n\r\nIts a strain where I don\u0027t need to smoke anything extra or in addition to to get to my state of sanity.  Its a great strain one of my favorites. if you enjoy jah kush, you may enjoy blue cheese. ANOTHER favorite.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1639459,"username":"MurplePuffcake","text":"This strain was is amazing, the one I got was named “Jah OG”, assuming this strain is the closest to what I smoked, tho I only smoked a few bowls I gotta say when I was grinding this Bud i underestimated it:)","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-39132","title":"5 Reggae Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1503703122000)\/","text":"Born in 1960s Jamaica, reggae was an evolution of its predecessors: ska and rocksteady. The genre quickly took on a life of its own and eventually made its way to the United States, where it became a staple of 1960s culture. It also carved a special niche in the cannabis world, since reggae’s penchant for political lyrics did not shy away from the topic of legalization.\n\nIt’s a genre that is powerful in both its unique sound and inherently political roots. It is music that uplifts the spirit and rallies the heart. The era of reggae produced a plethora of iconic artists such as Bob Marley, Bunny Wailer, Peter Tosh, The Abyssinians, and Toots \u0026 The Maytals—the latter of whom actually coined the term ‘reggae’ with the 1968 single, “Do The Reggay.”\nTo better understand and appreciate the genre, pack a pipe, grab your friends, and explore the soulful reggae music below—each album we suggest is an ideal match for the right cannabis strain.\nStony Hill by Damian Marley\n\nStrain Pairing Recommendation: King’s Bread\nYoungest son of the legendary Bob Marley, Damian Marley continues his father’s legacy in reggae with his own fresh sound. Stony Hill is Marley’s newest album—released in July of this year, it combines modern electronic elements with classic reggae beats. Stony Hill feels like the next modern step in a continuously growing genre that refuses to lose its heart along the way.\nIn true reggae style, Marley’s lyrics do not shy away from telling honest and human stories. From wondering what the future will bring on one track, while impeccable backup vocals chime “believe in your dreams” on another, the album explores the depth of human character.\nThis 18-track album also features the song “Medication” featuring Marley’s brother and guest artist, Stephen Marley. The song is an ode to Marley’s love of “Mary Jane” and the medicinal power of cannabis. You’ll be singing along to the lyrics, “And I say to myself, what a wonderful herb.”\n\nSevana EP by Sevana\n\nStrain Pairing Recommendation: Purple Bud\nHailing from Kingston, Jamaica, Sevana burst onto the scene last year with her first EP album, where she delivers stunning, expert vocals and impactful reggae beats. The album begins with the softer ballad “Carry You” before launching into the groovy “Bit Too Shy,” which sets the tone for the rest of the collection.\nThe EP’s music will get you moving to the rhythm, while Sevana’s energetic and heartfelt vocals delight across the soundscape with perfect control and beautiful clarity. Sevana captures the heart of reggae in her music, vocals, and lyrics for a complete immersion in classic reggae via a modern recording artist. Sevana’s debut album proves she’s an artist to watch and gives us high hopes of more great albums to come.\nEqual Rights by Peter Tosh\n\nStrain Pairing Recommendation: Jah Kush\nAlong with Bob Marley and Bunny Wailer, Peter Tosh got his start as part of The Wailers. Afterwards, he went on to become his own successful solo artist and produced many iconic albums, including Equal Rights in 1977.\nEqual Rights opens with the familiar song, “Get Up, Stand Up,” performed with Tosh’s unique style and sound. The album contains classics such as “Downpressor Man” and “Stepping Razor,” and features Tosh’s punctuated and mellow vocals accompanied by melodies that are rich, vibrant, and smooth.\nAs a whole, Equal Rights is an iconic reggae album that encapsulates the heart and soul of reggae as it was at the time of its initial emergence onto the popular scene. For this reason, it will always reign as a powerful memento of reggae’s roots.\n\nAfrican Holocaust by Steel Pulse\n\nStrain Pairing Recommendation: Malawi\nReleased in 2004, African Holocaust is the latest in a long line of albums produced by Steel Pulse. Though over a decade old, it remains relevant today both musically as well as lyrically, touching on topics such as global warming, corruption in government and religion, and the ramifications of slavery.\nFormed in 1975 in Birmingham, England, Steel Pulse has had a somewhat rotating cast of players over the years, but always with lead singer David Hinds at the forefront holding down vocals and rhythm guitar.\nAfrican Holocaust is no exception, with Hinds’s fierce voice leading the upbeat reggae melodies that encourage dance and reflection all at once. It is this combination of poignant lyrics and stunningly composed music full of drums and horns that makes African Holocaust such a noteworthy album.\nRebirth by Jimmy Cliff\n\nStrain Pairing Recommendation: Lamb’s Bread\nRebirth was released in 2012 as part of what Jimmy Cliff said was “a rebirth of my career at this time.” It was the first album Cliff had released in eight years, and went on to win a Grammy for Best Reggae Album. Cliff has been producing reggae music since the 1960s and is one of the few original artists who still produces new music today while touring or appearing at festivals (such as Lockn’ in 2015).\nRebirth manages to encapsulate Cliff’s classic reggae feel while shining anew with crisp, fresh, updated sounds. The 13-track album features new, original music as well as some covers—all of it exceedingly lively, joyful, and brimming with energy.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/25110707/best-reggae-albums-header.jpg","urlslug":"/news/lifestyle/reggae-albums-listen-high"}],"reviewCount":80,"flavors":[{"name":"Earthy","score":11.075441412520064},{"name":"Citrus","score":9.3900481540930976},{"name":"Sweet","score":8.26645264847512},{"name":"Tropical","score":7.4237560192616368},{"name":"Woody","score":3.3707865168539324}],"effects":[{"name":"Euphoric","score":115.56982343499197},{"name":"Happy","score":74.678972712680576},{"name":"Uplifted","score":66.974317817014438},{"name":"Relaxed","score":64.727126805778482},{"name":"Energetic","score":61.075441412520057}],"symptoms":[{"name":"Stress","score":63.322632423756012},{"name":"Depression","score":18.780096308186195},{"name":"Pain","score":17.93739967897271},{"name":"Headaches","score":16.53290529695024},{"name":"Fatigue","score":9.3900481540930976}],"conditions":[{"name":"ADD/ADHD","score":8.8282504012841088},{"name":"Anxiety","score":5.0561797752808983},{"name":"Migraines","score":1.4044943820224718},{"name":"Arthritis","score":1.1235955056179776},{"name":"PTSD","score":1.1235955056179776}],"negatives":[{"name":"Dry Mouth","score":55.617977528089888},{"name":"Dry Eyes","score":3.089887640449438},{"name":"Paranoid","score":0.84269662921348309},{"name":"Dizzy","score":0.5617977528089888},{"name":"Headache","score":0.5617977528089888}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jah-kush_100x100_707e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/515667/b/jah-kush__primary_42a9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jah-kush_100x100_8169.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/421942/b/jah-kush__primary_83c8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jah-kush_100x100_3e5b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/402496/b/jah-kush__primary_e6d4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jah-kush_100x100_a3ff.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/347311/b/jah-kush__primary_5618.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jah-kush_100x100_c85d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/344335/b/jah-kush__primary_2adc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jah-kush_100x100_cfcb.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/337811/b/jah-kush__primary_9fd6.jpg"}],"photoTotalCount":22,"popularCities":["San Francisco, CA","Daly City, CA","Glendale, AZ","Phoenix, AZ","South San Francisco, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/jah-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.5875/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
