{
    "aka": "Cindy’s Solution",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1474651043000)/",
            "id": "contentitems-7797",
            "text": "This week’s New Strains Alert is a full house of hybrid buds that reach toward indica or sativa dominance but don’t quite hit the mark. That’s not to say the effects of these strains are weak or without nuance, but rather an illustration of the middle ground they inhabit with their complementary mental and physical attributes. For example, Space Cream’s mental alertness and functional body buzz meld together to offer the best of both worlds, while Mother’s Milk is a situation-specific hybrid that is adaptable to the consumer’s activity by being equal parts heady and sedative. These are just a couple examples, but you too can craft your own hybrid “salad bowl” by mixing strains together.\n   Space Cream\nSpace Cream by Hotsause Genetics is an indica-dominant hybrid with surprisingly uplifting effects. This strain keeps the consumer alert, but hazy mental effects may make it difficult to articulate that alertness. In a way, it gives your mind couchlock while allowing the body to roam unencumbered. It is ideal for social settings and for patients seeking relief from mild pain, depression, and mood swings. Expect an odor of citrus blossom, pine, and hops which blend into a creamy sweetness on the exhale.\n   Mother’s Milk\nMother’s Milk is the sativa-dominant hybrid of Nepali OG and Appalachia. This potent strain smells of powdered milk and delicate earthy terpenes and is layered in a coat of sparkling trichomes. Its effects possess tranquil sedation that is also heady and functional, lending itself to either activity or relaxation. Indulge in Mother’s Milk to help curb minor physical pain, muscle spasms, and depression.\n   Pink Lemonade\nPink Lemonade is a tart sativa-dominant hybrid that adheres to its namesake in flavor and smell. This strain smells of fruity, mentholated tea and screams tart lemons and grapefruit on the exhale. The bud is coated in a generous layer of trichomes atop jade foliage and bronze pistils. Pink Lemonade instantly puts the mind into a haze and settles over the body with calming warmth. This all-day strain is ideal for consumers seeking a functional option to take the edge off repetitive tasks, stress, and depression.\n \n   Blueberry Pie\nBlueberry Pie is the indica-dominant hybrid of two famous strains, GSC (f.k.a Girl Scout Cookies) and Blue Dream. Each strain in this potent cross has its own claim to fame, but when combined their unique attributes coalesce to form a strain greater than the sum of its parts. The blueberry flavor and mental haze of Blue Dream contributes to the stilted cerebral buzz, which is then anchored through the Kush-heavy effects of GSC (f.k.a Girl Scout Cookies), amounting to a strain that shrugs off stress and mutes mild physical discomfort.\n \n   White Sangria\nWhite Sangria is the functional indica-dominant hybrid cross of Tahoe Hydro OG and Gelato 45. This strain’s buds are bright green with facets of purple throughout and emanates an aroma of pine, citrus, and sweetness. The buzz is happy and uplifting while leaving the body cozy and collected. Its effects are perfect for patients seeking relief from depression, anxiety, and minor physical discomfort. However, with continued use, this strain can take on a semi-sedative quality and lead to more pervasive relaxation.\n \n   R-4\nR-4, also known as Cindy’s Solution, is a CBD-dominant strain with exceptional therapeutic benefits. With a THC/CBD ratio of 1:40, R-4 sits firmly in the medical category, catering to consumers seeking relief from muscle spasms, chronic physical pain, nausea, and a shortlist of other ailments dulled by high quantities of CBD. This strain smells of chocolate and earth intermixed with a gentle floral undertone. Enjoy R-4 at any time in the day as the psychoactive ingredients are kept to a minimum.\n \n   Aspen OG\nAspen OG by 303 Seeds is a testament to how rich the Rocky’s cannabis heritage really is. This Sour Cream and SFV OG cross “is sweet like Aspen in the summer and coated white like Aspen in the winter,” topped with glistening trichomes that shimmer like snow. Aspen OG combines physical elements from each parent to easily curb moderate pain and stimulate the appetite. Expect earthy flavors with a sweet berry undertone.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/23101610/new-strains-alert-9-23-2016.jpg",
            "title": "New Strains Alert: Space Cream, Mother's Milk, Pink Lemonade, and More",
            "urlslug": "/news/strains-products/new-strains-alert-space-cream-mothers-milk-pink-lemonade"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [],
    "description": "<p>R-4, also known as Cindy&rsquo;s Solution, is a <a href=\"https://www.leafly.com/news/cannabis-101/whats-the-deal-with-these-high-cbd-strains/\">CBD-dominant strain</a> with exceptional therapeutic benefits. With a potent THC/CBD ratio, R-4 sits firmly in the medical category, catering to consumers seeking relief from muscle spasms, chronic physical pain, nausea, and a shortlist of other ailments dulled by high quantities of CBD. This strain smells of chocolate and earth intermixed with a gentle floral undertone. Enjoy R-4 at any time in the day as the psychoactive ingredients are kept to a minimum.</p>\n",
    "descriptionPlain": "R-4, also known as Cindy&rsquo;s Solution, is a CBD-dominant strain with exceptional therapeutic benefits. With a potent THC/CBD ratio, R-4 sits firmly in the medical category, catering to consumers seeking relief from muscle spasms, chronic physical pain, nausea, and a shortlist of other ailments dulled by high quantities of CBD. This strain smells of chocolate and earth intermixed with a gentle floral undertone. Enjoy R-4 at any time in the day as the psychoactive ingredients are kept to a minimum.\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 66.66666666666666
        },
        {
            "name": "Happy",
            "score": 58.33333333333333
        },
        {
            "name": "Relaxed",
            "score": 58.33333333333333
        },
        {
            "name": "Creative",
            "score": 50
        },
        {
            "name": "Focused",
            "score": 50
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 25
        },
        {
            "name": "Nutty",
            "score": 16.666666666666664
        },
        {
            "name": "Spicy/Herbal",
            "score": 8.333333333333332
        },
        {
            "name": "Butter",
            "score": 8.333333333333332
        },
        {
            "name": "Woody",
            "score": 8.333333333333332
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1376915,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Love R4 can smoke it all day long and feel so wonderful. Perfect if your seeking something to make you feel great without getting to high or high at all. ",
            "username": "lukehall15"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1513190,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I picked it up by mistake, and I'm glad i did! I'e never had any strain which was CDB dominant because I love the effects of THC. However, I found this strain to be heady, dreamy, and fun! I went into this laid back dreamy state, and felt no pain! You won;t get zooted, but it's like drinking a glass of wine that is 12.5% proof. Will buy again. not a 1/2 like I did b4, but an 1/8th. I also mixed it with Blue Dream and that was real fun!",
            "username": "rainman64"
        }
    ],
    "id": 245135,
    "name": "R-4",
    "negatives": [],
    "parents": [
        {
            "applink": "leafly://strain/reclining-buddha",
            "category": "Indica",
            "name": "Reclining Buddha",
            "permalink": "https://mobileapi.leafly.com/indica/reclining-buddha",
            "slug": "reclining-buddha",
            "subtitle": null,
            "symbol": "Rcl"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/r-4",
    "photoTotalCount": 0,
    "photos": [],
    "popularCities": [
        "Colorado Springs, CO"
    ],
    "rating": 5,
    "relatedStrains": [],
    "reviewCount": 4,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "r-4",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
    "subtitle": null,
    "symbol": "R4",
    "symptoms": [
        {
            "name": "Inflammation",
            "score": 16.666666666666664
        },
        {
            "name": "Nausea",
            "score": 16.666666666666664
        },
        {
            "name": "Pain",
            "score": 16.666666666666664
        },
        {
            "name": "Cramps",
            "score": 8.333333333333332
        },
        {
            "name": "Depression",
            "score": 8.333333333333332
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
