{
    "aka": "Triangle, White",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1445554800000)/",
            "id": "contentitems-3605",
            "text": "Updated 02/20/2018\nLooking for a cannabis strain that will challenge your tolerance or stand up to stubborn medical symptoms? Readers ask us all the time which strains are the potent, and while that depends on a variety of factors from growing techniques to phenotypic variation, we’ve put together a list of strains that tend to deliver potent euphoric effects thanks to strong genetics and selective breeding.\nWhile THC is the main driver of potency, it’s important to understand the important role terpenes play in enhancing and shaping the strain’s high. Terpenes like myrcene, linalool, and limonene refer to aromatic compounds that lend cannabis its unique array of smells, and a cannabis strain rich in both terpenes and THC often delivers a more remarkable experience than a product that lacks chemical diversity.\n\nA Selection of the Strongest Cannabis Strains\nBelow are the mean THC levels of a few cannabis strains featured in this list. Note that these represent their average potency across several testing labs; you’ll undoubtedly come across samples with higher or lower THC levels in your own strain exploration, but this gives you a baseline idea of how these strains compare.\nNote: You can filter “potent strains” on dispensary menus to see if any of these recommendations are available near you.\nPotency data derived from six of the largest testing labs in Washington State. Click to enlarge. (Elysse Feigenblatt/Leafly)\nGSC (f.k.a. Girl Scout Cookies)\n\n\nFind GSC Nearby\nGSC (f.k.a Girl Scout Cookies) hauled its way up the ladder of fame in recent years, and it isn’t hard to see why. The genetics in this hybrid are strong, with a THC content that regularly tests above 20%. Expect a crushing wave of blissful euphoria that enshrouds both mind and body with warm relaxation for hours.\nLeafly User Review:\n“Incredible jelly foot. Very nice body pudding. Creativity mixed with amazing peaks of HD colors.” –herbknight\nKosher Kush\n\nFind Kosher Kush Nearby\nKosher Kush first blessed the world with its presence in 2010 and has been nabbing Cannabis Cup awards ever since. Its genetic background may be a mystery, but this indica’s keepers at DNA Genetics have refined a champion strain that consistently breaches 20% THC. Wrapped in a thick blanket of crystalline resin, you’ll hardly need a closer look to see that this tranquilizing indica is not one for the novices.\nLeafly User Review:\n“I can’t feel my face… or my arms, or my feet, or anything for that matter. It’s as though I’m a weightless entity with a somewhat foggy-consciousness, floating on the patio.” –ricegrain\nGhost OG\n\nFind Ghost OG Nearby\nHiding in a white cloak of crystal resin, Ghost OG is a strain that is bred for its high-octane euphoria. Said to be a cut off the original OG Kush, Ghost OG’s potency is toned by a symphony of terpenes that fuel this strain’s powerful THC engine. Find a comfy seat and prepare to be swept into a powerful, euphoric current perfect for relaxing.\nBruce Banner\n\n\nFind Bruce Banner Nearby\nBruce Banner, appropriately named after the Hulk’s alter ego, is a heavy-duty hybrid with a staggering THC content. Rated the strongest strain in 2014 by High Times following its victory in the 2013 Denver Cannabis Cup, Bruce Banner has since carved itself quite the reputation. Powered by OG Kush and Strawberry Diesel genetics, Bruce Banner delivers a dizzying punch of euphoria that anchors your body in deep relaxation.\nGhost Train Haze\n\nFind Ghost Train Haze Nearby\nIn the last few years, the Cannabis Cup leaderboards saw a new rising star: the lively and vigorous sativa known as Ghost Train Haze. Bred by Rare Dankness Seeds, Ghost Train Haze had the highest THC content of any 2011 Cannabis Cup submissions, weighing in at 25.5% THC. Inheriting genetics from Ghost OG and Neville’s Wreck, this sativa’s potency takes form in a jolt of euphoric energy that goes straight to the head, feeding focus and creativity.\nLeafly User Review:\n“My initial response was yelling. It’s almost unreasonably potent. Smooth and citrusy too, but potent. Did I mention it was potent? It was potent. A next-level sativa. Made me feel like a marijuana n00b up until now. CAREFUL, it’s potent.” –thepiginzen\nChemdawg\n\nFind Chemdawg Nearby\nChemdawg is a classic strain whose unforgettable potency keeps a vice grip on its fan base. Ripe with the scent of acrid fuel, Chemdawg delivers an unforgettable flavor profile alongside its invigorating euphoria, inviting creativity alongside firm stress relief.\nLeafly User Review:\n“I feel like I’m in gravy and it’s a real good time.” –powwow31\nGG4 (f.k.a. Gorilla Glue #4)\n\nFind GG4 Nearby\nGG4 (f.k.a. Gorilla Glue #4) is named for the stickiness of its resinous buds, and this hybrid certainly lives up to her name. It isn’t rare for GG4 to hit the mid- to upper-twenties in a potency analysis, and she’s got multiple Cannabis Cup awards to back that claim up. But we doubt you’ll need the proof when this hybrid’s got you gorilla-glued to the couch in stupefied contentment.\nThe White\n\nFind The White Nearby\nNamed for the whiteout of crystal resin cloaking her buds, The White has become a godsend for breeders looking to improve the potency of their genetics. Routinely testing between 20-28% THC, The White delivers a disorienting blizzard of euphoric delirium that commands relaxation.\nDeath Star\n\nFind Death Star Nearby\nWith a THC profile that typically dances between 20-24%, Death Star will surely wreak as much havoc as the Galactic Empire. Using its great psychoactive forces, this Sensi Star and Sour Diesel hybrid commands you to chill out as it imposes powerfully euphoric and sedating effects.\nLeafly User Review:\n“There’s no hiding the high with Death Star. We went Christmas tree shopping in the bitter cold. It took us about 45 minutes to pick out a tree…it ended up being the very first tree we saw. Then went to a bar and I confused a mirror for a window.” –hoobear\nWhite Fire OG\n\nFind White Fire OG Nearby\nBorn from The White and Fire OG, White Fire OG (also known as WiFi OG) is a force not to be trifled with. Testing data shows the impressive THC potential of this hybrid, with average levels falling between 22-29%. Its uplifting effects launch your mood into the clouds, an elevated feeling that will shake creativity and happiness wide awake.\nExplore More Potent Cannabis Strains\nCan’t get enough potent, high-THC strains for your stash jar? Here are a few more heavy-hitters for you to seek out at your next dispensary visit.\n\nKimbo Kush\nHeadband\nCherry Pie\nBubba Kush\nSFV OG\nLA Confidential\nTriangle Kush\n\nWhich other heavy-handed strains belong on this list? Tell us about them in the comments section!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002953/what-are-the-strongest-cannabis-strains.jpg",
            "title": "What Are the Strongest Cannabis Strains?",
            "urlslug": "/news/strains-products/what-are-the-strongest-cannabis-strains"
        },
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1444424400000)/",
            "id": "contentitems-3571",
            "text": "October 1st marked the opening of recreational cannabis sales in Oregon, and what better way to close out the weekend of celebrations than with the first cannabis cup in the state? DOPE Magazine hosted the Oregon DOPE Cup at Refuge PDX in Portland. Happy Oregonians spilled out of the venue and into the city streets, eager to join the festivities and excitedly sampling all the vendors had to offer. The evening’s entertainment was provided by a variety of local musicians and artists who warmed the crowd up for Redman’s headlining performance.\nHappy people, good music, and award-winning cannabis — what more could you ask for? How about the winning strains and products? Here are the award-winners from the 2015 Oregon DOPE Cup:\n \nWinning Cannabis Flowers\n\n \nPeoples’ Choice\n\nMango Kush from Chalice Farms\n \nJudges’ Choice\n\nGSC (f.k.a Girl Scout Cookies) from Herbal Roots\n \nBest Indica Cannabis Strain\n\nWinner: Obama Kush from High Standards\nRunner Up: Anonymous V from Eco Firma Farms\n \nBest Sativa Cannabis Strain\n\nWinner: Strawberry Ice from Chalice Farms\nRunner Up: Chernobyl from Geek Farms\n \nBest Hybrid Cannabis Strain\n\nWinner: Platinum Animal Cookies from Ideal Farms\nRunner Up: Cherry Lopez from Dr. Vert\n \nBest High-THC Cannabis Strain\n\nWinner: The White from Eco Firma Farms\nRunner Up: New York Old School from Five Mules Farms\n \nBest High-CBD Cannabis Strain\n\nWinner: TJ’s CBD from TJ’s Organics\nRunner Up: Charlotte’s Web from Chalice Farms\n \nWinning Cannabis Concentrates\n\n \nBest BHO (THC)\n\nWinner: OG Kush Live Resin from Dirty Arm Farm\nRunner Up: Agent Orange Live Resin from Dirty Arm Farm\n \nBest BHO (CBD)\n\nWinner: Harle Tsu from Proper Oil\nRunner Up: Harle Tsu from Mad Fama\n \nBest PHO (THC)\n\nWinner: Jack Herer Terp Wax from Orgone Extracts\nRunner Up: White Super Skunk from Cultivated Industries\n \nBest Non-Solvent Cannabis Concentrate (THC)\n\nWinner: Pineapple Trainwreck Terp Sauce from Primo Extracts\nRunner Up: Animal Cookies from Reson Ranchers\n \nBest Cannabis Concentrate Cartridge\n\nWinner: OG Kush Wax Truly Pure\nRunner Up: Dutch Treat from Golden XTRX\n \nBest CO2 Cannabis Concentrate (THC)\nWinner: Smarties OM Extracts\nRunner Up: The Clear from Orgone Extracts\n \nBest CO2 Cannabis Concentrate (CBD)\nWinner: Buddha Kong from True North Extracts\nRunner Up: Harle Tsu from OM Extracts\n \nWinning Cannabis Edibles\n\n \nBest Sweet Cannabis Edible\nWinner: Chocolate Kettle Corn from Cannavore\nRunner Up: Blueberries and Hazelnut from Blaze Bars\n \nBest Savory Cannabis Edible\nWinner: Garlic Herb Almonds from Lunchbox Alchemy\nRunner Up: Ginger Hemp Granola from Pannacea Valley Gourmet Edibles\n \nBest CBD Cannabis Edible\nWinner: Honey Bee Honey Stick from Echo Electuary\nRunner Up: CBD Dark Chocolate Truffle from Leif Medicinals\n \nBest Cannabis-Infused Drink\nWinner: Mate Karate from Bent Beverage\nRunner Up: Fruit Punch Level 3 from Vitonic\n \nWinning Cannabis Topical\n\n \nBest Cannabis Topical\nWinner: Peppermint Cayenne Salve from Henrys Herbals\nRunner Up: The Transdermal Patches from Synergy Skin Worx",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002857/the-oregon-dope-cup-winning-cannabis-strains-concentrates-and-edi.jpg",
            "title": "The Oregon DOPE Cup Winning Cannabis Strains, Concentrates, and Edibles",
            "urlslug": "/news/strains-products/the-oregon-dope-cup-winning-cannabis-strains-concentrates-and-edi"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 29.812431544359256
        },
        {
            "name": "PTSD",
            "score": 13.321467688937568
        },
        {
            "name": "Migraines",
            "score": 9.230102227090178
        },
        {
            "name": "ADD/ADHD",
            "score": 6.126779846659365
        },
        {
            "name": "Hypertension",
            "score": 5.6772544724351945
        }
    ],
    "description": "<p>This mysterious strain, supposedly from somewhere in Florida and originally called &ldquo;Triangle,&rdquo; is&nbsp;aptly named; The White&nbsp;is covered with so many white trichomes that the buds look like they were rolled in confectioner&rsquo;s sugar. While it looks much like an OG in structure and certainly has the potency associated with the best <a href=\"http://leafly.com/hybrid/og-kush\">OG Kush</a> cuts, it has little of the smell or flavor found in those West Coast favorites. In fact, The White is actually known for a distinct lack of odor or flavor, leaving some to pass it over in favor of other more pungent varieties. The high is usually described as a true hybrid effect with equal body and head sensation, and definitely very potent.</p>\n",
    "descriptionPlain": "This mysterious strain, supposedly from somewhere in Florida and originally called &ldquo;Triangle,&rdquo; is&nbsp;aptly named; The White&nbsp;is covered with so many white trichomes that the buds look like they were rolled in confectioner&rsquo;s sugar. While it looks much like an OG in structure and certainly has the potency associated with the best OG Kush cuts, it has little of the smell or flavor found in those West Coast favorites. In fact, The White is actually known for a distinct lack of odor or flavor, leaving some to pass it over in favor of other more pungent varieties. The high is usually described as a true hybrid effect with equal body and head sensation, and definitely very potent.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 79.556863818912
        },
        {
            "name": "Happy",
            "score": 60.92780211756116
        },
        {
            "name": "Euphoric",
            "score": 59.86902154070828
        },
        {
            "name": "Sleepy",
            "score": 39.20682730923694
        },
        {
            "name": "Uplifted",
            "score": 37.458926615553125
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 30.12276378240234
        },
        {
            "name": "Pine",
            "score": 27.934465133260318
        },
        {
            "name": "Flowery",
            "score": 19.085432639649504
        },
        {
            "name": "Sweet",
            "score": 17.332968236582694
        },
        {
            "name": "Spicy/Herbal",
            "score": 11.434373859072654
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1415237,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "this shit made me forget my password.  ",
            "username": "jalaloby"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1635964,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I only give it 4 stars because it lacks a good aroma or taste. Its not bad, its just not as pugent as i would expect from a 33.35% strain. But very potent, so it wins me back. Id give it a try like i did at $30 for 1/8oz. Fat bowl of this will put ya back for a little while.",
            "username": "GeorgiaDank"
        }
    ],
    "id": 17395,
    "name": "The White",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 38.533680175246445
        },
        {
            "name": "Anxious",
            "score": 13.93528660094925
        },
        {
            "name": "Dry Eyes",
            "score": 9.074936108068638
        },
        {
            "name": "Dizzy",
            "score": 8.55010952902519
        },
        {
            "name": "Headache",
            "score": 4.84437751004016
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/hybrid/the-white",
    "photoTotalCount": 76,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/the-white/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/the-white/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/640271/b/the-white__primary_2e23.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/the-white_100x100_0b49.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/624402/b/the-white__primary_cb64.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/the-white_100x100_2a18.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/620267/b/the-white__primary_8934.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/the-white_100x100_91af.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/605143/b/the-white__primary_0377.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/the-white_100x100_731b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/590927/b/the-white__primary_5b2f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/the-white_100x100_ce27.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/555153/b/the-white__primary_d312.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/the-white_100x100_2326.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Eugene, OR",
        "Seattle, WA",
        "China",
        "Salem, OR",
        "Bend, OR",
        "Los Angeles, CA",
        "Tacoma, WA",
        "Everett, WA",
        "Colorado Springs, CO"
    ],
    "rating": 4.56,
    "relatedStrains": [],
    "reviewCount": 308,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "the-white",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.55519480519481/240",
    "subtitle": null,
    "symbol": "Twt",
    "symptoms": [
        {
            "name": "Stress",
            "score": 33.66876597298284
        },
        {
            "name": "Pain",
            "score": 29.50666301569916
        },
        {
            "name": "Insomnia",
            "score": 25.49744432274553
        },
        {
            "name": "Depression",
            "score": 24.066721431179264
        },
        {
            "name": "Headaches",
            "score": 17.48357064622125
        }
    ],
    "testGraph": "https://leafly.s3.amazonaws.com/strains/testing/R8VabtoTpukaNCAMedQg_the-white.png",
    "videoUrl": null,
    "weakDescription": false
}
