{
    "aka": "Dance Hall",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1519851079000)/",
            "id": "contentitems-59186",
            "text": "Cannabidiol, or CBD, is becoming a mainstay in consumers’ medicine cabinets as it combats pain, inflammation, anxiety, and much more. However, even as CBD strains and products become more readily available, the price tag can often make one flinch. For this reason, it’s worth knowing which products will bring the best value based on CBD abundance.\n\nLooking at data from cannabis testing labs across Washington State, we compiled a list of strains that tend to produce significant amount of CBD. These numbers are derived from the testing samples of cannabis flowers and do not include CBD concentrates.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nIn the above graph, you’ll find the average cannabinoid contents of ten popular CBD-dominant strains. You’ll notice that many of these strains contain only trace amounts of THC, while others exhibit a more balanced CBD:THC ratio (which means they will be more euphoric in effect). This graph is based on datasets from multiple reliable testing labs across Washington State. However, it’s worth noting that the datasets from each individual lab differ slightly.\nTake a look at the cannabinoid data from one lab, and notice how the numbers shift slightly.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nMost strains maintain a CBD:THC ratio similar to that in the averaged dataset. However, you’ll also see deviations, like ACDC which exhibits a more balanced CBD:THC ratio according to this lab’s individual testing results.\nNow let’s see how the dataset of Lab A compares to a different lab, also represented in the larger, averaged dataset above.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nAs you can see, the CBD levels from Lab B are much higher on average than those from Lab A. There are a number of possible explanations for this. A lab may manufacture bloated cannabinoid profiles, as we’ve seen some labs do in the past. It could also be that Lab B simply tested samples from growers who achieved higher CBD levels in their harvest.\nThe main takeaway here is this: the cannabinoid profile printed on your product depends not only on the strain’s genetics and expertise of the grower, but also on the testing methods (and ethics) of the local lab that performed the chemical analysis. The Dancehall you bought on your last trip to the dispensary is likely to reflect the cannabinoid data illustrated in the above graphs–however, if you see deviation, the reason lies in the many layers of strain and data variability.\n\nCannabis Strains With High Levels of CBD\nWith this caveat in mind, let’s look at the strains that expressed the highest levels of CBD according to the above lab data.\n\nFind Dancehall Nearby\nDancehall is an upbeat and inspiring strain meant to lift your spirits while coercing creativity. With a CBD:THC ratio of nearly 20:1 on average, this strain delivers little to no euphoric effects that might distract focus or dampen cognition in THC-sensitive consumers.\n\nFind ACDC Nearby\nKnown for its keen ability to lift anxiety of all shades, ACDC is a godsend to consumers susceptible to the side effects of THC. This strain allows you to harness many of the desirable traits of cannabis, like light-footed physical relaxation and gentle mood elevation, without the cost of a clear, calm mind.\n\nFind Suzy Q Nearby\nSuzy Q is a CBD-dominant strain with an extremely modest amount of THC, making it another mellow strain with little to no high. The mild effects of this pine-scented strain help you shed anxious or demotivating mental blocks that stood in the way of creativity and productivity.\n\nFind Ringo’s Gift Nearby\nNamed in recognition of the CBD pioneer Lawrence Ringo, Ringo’s Gift imbues the consumer with a sense of wellbeing alongside steady relief in the body. Use this strain to take the edge off pain and stress, while allowing the mind to roam free without the shackles of paranoia or distracting euphoria.\n\nFind Charlotte’s Web Nearby\nCharlotte’s Web was the first CBD strain to receive media attention, and has achieved legendary status among CBD varieties ever since. Although its reputation is built upon its success in treating epilepsy, this strain has aided patients treating many other conditions including pain, anxiety, and inflammation. Charlotte’s Web is grown by CW Pharmaceuticals in Colorado.\n\nFind Remedy Nearby\nRemedy is a high-CBD strain that quietly ushers in easy relaxation without mental fog. For consumers seeking something a little more relaxing than a cup of tea, Remedy offers a solution with effects that rid the mind of anxiety while soothing aches, pains, and inflammation.\n\nFind Sour Tsunami Nearby\nSour Tsunami has become a household name among high-CBD strains. This variety tends to produce less than 1-2% of THC, so you can reap its medicinal benefits without the high. Sour Tsunami is fairly prolific, so keep an eye out for this strain at your next dispensary visit if you’re looking to quell pain or anxiety symptoms without the interference of THC.\n\nFind Hawaiian Dream Nearby\nIf you’re looking to harness the benefits of THC and CBD but wary of getting too high, Hawaiian Dream is the strain for you. With a THC content of around 5% and a CBD profile stretching between 5-10%, Hawaiian Dream can help abate symptoms with only mild, gentle euphoria. As an added bonus, this strain throws in a little tropical flavor to sweeten the experience.\n\nFind Dance World Nearby\nDance World is a CBD-dominant strain that almost achieves a balanced CBD:THC ratio, making it especially appropriate for consumers struggling with pain, depression, and lack of appetite. This synergy of THC and CBD helps to inspire positivity and more vibrant moods by handing you subdued euphoria on a leash.\n\nFind Nordle Nearby\nNordle offers a balanced abundance of both THC and CBD that makes it especially suitable for patients dealing with pain, insomnia, muscle spasms, and anxiety. If your symptoms are keeping you up at night, Nordle is a great nightcap solution for dialing down pain and worries so you can spend less time tossing and turning.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28121936/high-cbd-strains.jpg",
            "title": "Which Cannabis Strains Are Highest in CBD, According to Lab Data?",
            "urlslug": "/news/strains-products/high-cbd-marijuana-strains-according-to-lab-data"
        },
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1514822427000)/",
            "id": "contentitems-40128",
            "text": "For most of us in the Western hemisphere, drinking is usually the first step into the wide and varied world of intoxicants. Drinking, like cannabis, can give a person access to a wide range of sensations–but in all fairness, only one of these significantly increases your chance of barfing. And yes, I mean alcohol. Alcohol can be a lot of fun, but one of the primary deterrents for getting lit on liquor or wrecked on red wine (especially after age 30) is the fierce hangover the next day.\nHangovers can feel like a vampire drained your body of all life-giving fluids just before throwing you in front of a speeding city bus. And somehow you miraculously survived.\nEnter cannabis and its soothing cocktail of cannabinoids. These unique chemical compounds can induce pleasurable euphoria while tempering nausea, reducing inflammation, and stimulating appetite. Cannabis is not a silver bullet for removing a hangover, but it’s often a step toward recovery. Cannabis mixed with a good breakfast and the steady intake of water can revive and rejuvenate even the most wretched party monster.\n\nA cannabis oil cartridge and pen battery is my preferred cannabis consumption method following a long night of drinking. This method is convenient for a few reasons:\n\nYou don’t have to get out of bed\nThe potency and variety of cartridges are at my disposal\nNo need for extra steps like lighting a bowl\nThey are generally less harsh (i.e., you’re less likely to cough and exacerbate your current discomfort)\n\nBrowse Cannabis Vape Pens\nGoing a step further, I would recommend a CBD-dominant cartridge with a 1:1 or 3:1 CBD/THC ratio. This mixture of cannabinoids is utilized by cannabis consumers in and outside the medicinal cannabis community for its anti-inflammatory, anti-anxiety, and analgesic (pain reducing) qualities.\nI encourage you to explore and experiment with strains and products that work best for you. Some folks would rather snap off a zippy sativa to front-load their body and mind with energy. Others seek out strains that help dull the pounding headache of a hangover. My point is, there is no one way. Just be sure to supplement all cannabis consumption with plenty of water and food (and maybe a multivitamin after said food) to assist in the recovery process.\n\nExplore your local dispensary beforehand, and who knows, you might find a deal or two that prepares you for a long Saturday or Sunday of post-party recuperation.\nCannabis Strain Recommendations for Alleviating Hangovers\nHigh-CBD Cannabis Strains\n   Harlequin\nOne of the most popular, and thus, readily available CBD-dominant strains in many cannabis markets, Harlequin offers a solid CBD:THC ratio and a gentle, but noticeable mood boost. This strain’s soothing, happy buzz can work wonders after a solid holiday brunch.\nFind Harlequin Nearby\n   Sour Tsunami\nSour Tusnami is another popular CBD strain that can help tone down nausea and temper inflammation. The bouquet can be a little flat, but the overall effects (especially when mixed with food and water) are stunningly apparent and not mentally or physically cumbersome, which some THC-dominant strain can be.\nFind Sour Tsunami Nearby\n   Dancehall\nHangover or no hangover, Dancehall is curently my favorite CBD dominant flower, period. With usually less than 2% THC and upwards of 20% CBD, Dancehall hits all the right notes at the perfect pitch and volume. The terpene profile is surprisingly dank, reeking of skunk and swamp grass, but the flavor is sweet and herbaceous on the tongue. In a pipe, joint, or vaporizer, Dancehall will be your host at the after-after-after party come New Years Day.\nFind Dancehall Nearby\n   Cannatonic\nCannatonic is known for having a 3:1 CBD/THC ratio, which is perfect for consumers looking for a little headiness with their dose of wellness. This strain is also a popular concentrate, giving vapers, dabber, and other high-potency consumers a good option if smoke inhalation is too harsh. But beware of the dreaded dab cough! Uncontrollable post-hit hacking is the absolute worst with a hangover–trust me!\nFind Cannatonic Nearby\nTHC-Dominant Cannabis Strains\n   Lavender\nLavender is a natural choice for this list: 1) it is indica-dominant in effect, 2) its high concentrations of the terpene linalool should help with the discomfort caused by a hangover, 3) Lavender is sedative at a higher dose, but can be quite functional with only a hit or two. This allows consumer modulate their dosage depending on the severity of their hangover.\nFind Lavender Nearby\n   Hindu Kush\nHindu Kush is one of the more mellow options on this list. The goal is to reduce the overall physical discomfort caused by a hangover, and Hindu Kush dulls just about every sense a person could have. This isn’t a one-and-done painkiller, but consumption should lead to some degree of physical and mental relief from a hangover.\nFind Hindu Kush Nearby\n   Jillybean\nJillybean is a joyous strain with delicious flavors that can add a little pep to your step post-NYE. This strain’s sweet citrus flavor and sativa-dominant bent give the consumer a nudge toward alertness and a slight boost of energy.\nFind Jillybean Nearby\n   Chocolope\nChocolope is a spicy, nutty flower with good energy in store. This strain is pungent and invigorating, leaving the consumer with a happy feeling right between the ears. Mood elevation is a great way to stem the down-and-out feeling of a hangover. Chocolope is a great rallying call on New Years Day to bring your fellow hungover party goers out and back to life.\nFind Chocolope Nearby",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/29164217/hangover.jpg",
            "title": "Hungover? These Cannabis Strains Can Help",
            "urlslug": "/news/strains-products/best-cannabis-strains-for-hangovers"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Arthritis",
            "score": 85.80139372822299
        },
        {
            "name": "Anxiety",
            "score": 55.48780487804878
        },
        {
            "name": "PTSD",
            "score": 30.400696864111495
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 27.4390243902439
        },
        {
            "name": "Spinal Cord Injury",
            "score": 26.829268292682926
        }
    ],
    "description": "<p>Dancehall, a 60/40 <a href=\"http://leafly.com/sativa\">sativa</a>-dominant <a href=\"http://leafly.com/hybrid\">hybrid</a>, was bred by Reggae Seeds by combining Juanita La Lagrimosa (a <a href=\"http://leafly.com/sativa/mexican\">Mexican</a>-<a href=\"http://leafly.com/indica/afghani\">Afghani</a>-Spanish hybrid)&nbsp;with Kalijah (Blue Heaven crossed with a&nbsp;Mexican-Afghani hybrid). Named after a style of Reggae played in times of celebration, Dancehall will lift your spirits to a happier place where <a href=\"http://www.leafly.com/explore#!/explore/tags-creative\">creativity</a> and <a href=\"http://www.leafly.com/explore#!/explore/tags-talkative\">social bonding</a> thrive. As its&nbsp;flowers mature, vibrant shades of green, blue, purple, and red twist underneath its crystal <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\">trichomes</a> while aromas both <a href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\">sweet</a><span style=\"line-height: 20.7999992370605px;\">&nbsp;and <a href=\"http://www.leafly.com/explore#!/explore/flavors-spicyherbal\">spicy</a>&nbsp;dance from cracked buds.&nbsp;</span></p>\n",
    "descriptionPlain": "Dancehall, a 60/40 sativa-dominant hybrid, was bred by Reggae Seeds by combining Juanita La Lagrimosa (a Mexican-Afghani-Spanish hybrid)&nbsp;with Kalijah (Blue Heaven crossed with a&nbsp;Mexican-Afghani hybrid). Named after a style of Reggae played in times of celebration, Dancehall will lift your spirits to a happier place where creativity and social bonding thrive. As its&nbsp;flowers mature, vibrant shades of green, blue, purple, and red twist underneath its crystal trichomes while aromas both sweet&nbsp;and spicy&nbsp;dance from cracked buds.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 121.08013937282229
        },
        {
            "name": "Happy",
            "score": 103.22299651567944
        },
        {
            "name": "Focused",
            "score": 68.03135888501743
        },
        {
            "name": "Uplifted",
            "score": 45.47038327526133
        },
        {
            "name": "Creative",
            "score": 45.383275261324044
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 37.630662020905916
        },
        {
            "name": "Flowery",
            "score": 33.972125435540065
        },
        {
            "name": "Berry",
            "score": 26.21951219512195
        },
        {
            "name": "Spicy/Herbal",
            "score": 9.581881533101045
        },
        {
            "name": "Citrus",
            "score": 8.362369337979093
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 60,
        "growNotes": "\n\tShort veg cycle recommended for height management, especially when using sea of green (SOG) methods\n\tOutdoor yields typically fall between 350-500g/m&sup2;\n\tLow humidity and moist soil are essential for this strain\n\tSuitable for both cool and warm climates\n\n",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": "Soil"
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1378856,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I have chronic pain from degenerative spinal arthritis, which will unfortunately remain with me for my entire life. This strain? Was literally like magic, for me. The relief it gives me is astounding, with only a mild psychoactive effect... The rest is pure relief that casts over my migraines, neck aches, stinging and stabbing back aches and the nausea that comes with chronic 24/7 pain.\n\nDancehall is literally a miracle flower.",
            "username": "PrincessPuff"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Pl-Y2_w7iIfXMq-susdCw64Abdk=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fZFL3vk8uSMmuki8G4w8c_old-school-purple.png",
            "id": 1637471,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Great cerebral elevation that evolves into a calming body relaxation. ",
            "username": "VT_Bob"
        }
    ],
    "id": 101935,
    "name": "Dancehall",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 37.54355400696864
        },
        {
            "name": "Paranoid",
            "score": 8.362369337979093
        },
        {
            "name": "Anxious",
            "score": 7.752613240418118
        },
        {
            "name": "Dry Eyes",
            "score": 4.790940766550523
        },
        {
            "name": "Headache",
            "score": 3.571428571428571
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/hybrid/dancehall",
    "photoTotalCount": 5,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/422484/b/dancehall__primary_6333.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dancehall_100x100_0b3e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/415593/b/dancehall__primary_9d67.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dancehall_100x100_6927.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/373299/b/dancehall__primary_aa11.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dancehall_100x100_1f80.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/367695/b/dancehall__primary_154e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dancehall_100x100_b7db.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/356568/b/dancehall__primary_ea56.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dancehall_100x100_65b3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Bremerton, WA",
        "Chimacum, WA",
        "Everett, WA",
        "Port Townsend, WA",
        "Redmond, WA",
        "Shoreline, WA",
        "Silverdale, WA",
        "Spanaway, WA",
        "Tacoma, WA"
    ],
    "rating": 4.58,
    "relatedStrains": [],
    "reviewCount": 38,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "dancehall",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.57894736842105/240",
    "subtitle": null,
    "symbol": "Dhl",
    "symptoms": [
        {
            "name": "Pain",
            "score": 94.25087108013936
        },
        {
            "name": "Inflammation",
            "score": 84.05923344947735
        },
        {
            "name": "Stress",
            "score": 68.03135888501743
        },
        {
            "name": "Fatigue",
            "score": 58.972125435540065
        },
        {
            "name": "Headaches",
            "score": 34.58188153310104
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
