{"sl_translate":"description,descriptionPlain,category","id":65455,"slug":"acdc","name":"ACDC","subtitle":null,"symbol":"Acd","category":"Hybrid","description":"\u003cp class=\"p1\"\u003eACDC is\u0026nbsp;a sativa-dominant phenotype of the \u003cspan class=\"s1\"\u003e\u003ca href=\"http://www.leafly.com/news/lifestyle/whats-the-deal-with-these-high-cbd-strains\"\u003ehigh-CBD\u003c/a\u003e\u0026nbsp;cannabis\u003c/span\u003e strain, \u003ca href=\"http://www.leafly.com/hybrid/cannatonic\"\u003e\u003cspan class=\"s1\"\u003eCannatonic\u003c/span\u003e\u003c/a\u003e. One remarkable characteristic of ACDC is its THC:CBD ratio of 1:20, meaning this strain induces little to no intoxicating effects. Tests have put ACDC\u0026rsquo;s CBD content as high as 19%, which helps many patients treat pain, anxiety, epilepsy, multiple sclerosis, and the negative effects of chemotherapy, all with a clear head.\u003c/p\u003e\n","descriptionPlain":"ACDC is\u0026nbsp;a sativa-dominant phenotype of the high-CBD\u0026nbsp;cannabis strain, Cannatonic. One remarkable characteristic of ACDC is its THC:CBD ratio of 1:20, meaning this strain induces little to no intoxicating effects. Tests have put ACDC\u0026rsquo;s CBD content as high as 19%, which helps many patients treat pain, anxiety, epilepsy, multiple sclerosis, and the negative effects of chemotherapy, all with a clear head.\n","aka":"AC/DC, C-6, C6","rating":4.5,"highlightedReviews":[{"id":1417899,"username":"PiperDoll","text":"I was a stoner as a teen. Smoking from the time I woke up until the time I went to sleep. When I was 16 my whole family died and I took to weed as my safe haven. Until I developed severe dissociative-anxiety as well as a gnarly case of panic disorder. I stopped smoking because it made it worse- I remember the last time I smoked I took one hit and it triggered a panic attack and I spent the rest of the day thinking my leftover family would find me dead from a heart attack. I didn\u0027t die obviously, however I stopped smoking and years later now five years later at 22 I have used some CBD patches and some CBD oil and they have helped a lot- I decided I wanted to smoke again... I like smoking. I enjoy the puffs and the clouds and the social act considering I live in Denver, and always hate passing up a joint knowing how much I love it but can\u0027t have it. Gosh this is long okay to the review part, I did my research and looked at every strain, read every comment twice and then once more and decided I was going to try ACDC and Charlottes Web. I took one cautious puff at first and I kinda felt it. Throughout the day and now night I\u0027ve been slowly smoking about two bowls and it\u0027s got a tiny kick because I have no tolerance however it\u0027s in my chest and I am calm and friendly and fun and I feel whole again. I didn\u0027t panic even when the mini head high kicked in and faed in less than a minute. My heart isn\u0027t racing and I feel no paranoia. No anxiety and I feel free and me. I would HIGHLY recommend for first timers who are scared or anyone with anxiety. Thanks to all who took the time to read my long story. Anyway- hope you like it!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1641501,"username":"kykle","text":"I got the distillate (super high thc content wax) of this strain and it’s such an odd experience to be smoking such a high thc% on a mostly CBD weed the effects are very odd since they don’t really resemble the effects of the CBD and all I can really say is that I literally can’t care about anything when I smoke this it’s scary, I started smoking when I got up in the morning like every morning on my porch and my sprinklers turned on and I shit you not I just got done staring at one of them for like 20 or 30 minuets straight because I was absolutely mesmerized on the way it moved and after an experience like this I had to review it.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59186","title":"Which Cannabis Strains Are Highest in CBD, According to Lab Data?","author":"Bailey Rahn","category":null,"date":"\/Date(1519851079000)\/","text":"Cannabidiol, or CBD, is becoming a mainstay in consumers’ medicine cabinets as it combats pain, inflammation, anxiety, and much more. However, even as CBD strains and products become more readily available, the price tag can often make one flinch. For this reason, it’s worth knowing which products will bring the best value based on CBD abundance.\n\nLooking at data from cannabis testing labs across Washington State, we compiled a list of strains that tend to produce significant amount of CBD. These numbers are derived from the testing samples of cannabis flowers and do not include CBD concentrates.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nIn the above graph, you’ll find the average cannabinoid contents of ten popular CBD-dominant strains. You’ll notice that many of these strains contain only trace amounts of THC, while others exhibit a more balanced CBD:THC ratio (which means they will be more euphoric in effect). This graph is based on datasets from multiple reliable testing labs across Washington State. However, it’s worth noting that the datasets from each individual lab differ slightly.\nTake a look at the cannabinoid data from one lab, and notice how the numbers shift slightly.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nMost strains maintain a CBD:THC ratio similar to that in the averaged dataset. However, you’ll also see deviations, like ACDC which exhibits a more balanced CBD:THC ratio according to this lab’s individual testing results.\nNow let’s see how the dataset of Lab A compares to a different lab, also represented in the larger, averaged dataset above.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nAs you can see, the CBD levels from Lab B are much higher on average than those from Lab A. There are a number of possible explanations for this. A lab may manufacture bloated cannabinoid profiles, as we’ve seen some labs do in the past. It could also be that Lab B simply tested samples from growers who achieved higher CBD levels in their harvest.\nThe main takeaway here is this: the cannabinoid profile printed on your product depends not only on the strain’s genetics and expertise of the grower, but also on the testing methods (and ethics) of the local lab that performed the chemical analysis. The Dancehall you bought on your last trip to the dispensary is likely to reflect the cannabinoid data illustrated in the above graphs–however, if you see deviation, the reason lies in the many layers of strain and data variability.\n\nCannabis Strains With High Levels of CBD\nWith this caveat in mind, let’s look at the strains that expressed the highest levels of CBD according to the above lab data.\n\nFind Dancehall Nearby\nDancehall is an upbeat and inspiring strain meant to lift your spirits while coercing creativity. With a CBD:THC ratio of nearly 20:1 on average, this strain delivers little to no euphoric effects that might distract focus or dampen cognition in THC-sensitive consumers.\n\nFind ACDC Nearby\nKnown for its keen ability to lift anxiety of all shades, ACDC is a godsend to consumers susceptible to the side effects of THC. This strain allows you to harness many of the desirable traits of cannabis, like light-footed physical relaxation and gentle mood elevation, without the cost of a clear, calm mind.\n\nFind Suzy Q Nearby\nSuzy Q is a CBD-dominant strain with an extremely modest amount of THC, making it another mellow strain with little to no high. The mild effects of this pine-scented strain help you shed anxious or demotivating mental blocks that stood in the way of creativity and productivity.\n\nFind Ringo’s Gift Nearby\nNamed in recognition of the CBD pioneer Lawrence Ringo, Ringo’s Gift imbues the consumer with a sense of wellbeing alongside steady relief in the body. Use this strain to take the edge off pain and stress, while allowing the mind to roam free without the shackles of paranoia or distracting euphoria.\n\nFind Charlotte’s Web Nearby\nCharlotte’s Web was the first CBD strain to receive media attention, and has achieved legendary status among CBD varieties ever since. Although its reputation is built upon its success in treating epilepsy, this strain has aided patients treating many other conditions including pain, anxiety, and inflammation. Charlotte’s Web is grown by CW Pharmaceuticals in Colorado.\n\nFind Remedy Nearby\nRemedy is a high-CBD strain that quietly ushers in easy relaxation without mental fog. For consumers seeking something a little more relaxing than a cup of tea, Remedy offers a solution with effects that rid the mind of anxiety while soothing aches, pains, and inflammation.\n\nFind Sour Tsunami Nearby\nSour Tsunami has become a household name among high-CBD strains. This variety tends to produce less than 1-2% of THC, so you can reap its medicinal benefits without the high. Sour Tsunami is fairly prolific, so keep an eye out for this strain at your next dispensary visit if you’re looking to quell pain or anxiety symptoms without the interference of THC.\n\nFind Hawaiian Dream Nearby\nIf you’re looking to harness the benefits of THC and CBD but wary of getting too high, Hawaiian Dream is the strain for you. With a THC content of around 5% and a CBD profile stretching between 5-10%, Hawaiian Dream can help abate symptoms with only mild, gentle euphoria. As an added bonus, this strain throws in a little tropical flavor to sweeten the experience.\n\nFind Dance World Nearby\nDance World is a CBD-dominant strain that almost achieves a balanced CBD:THC ratio, making it especially appropriate for consumers struggling with pain, depression, and lack of appetite. This synergy of THC and CBD helps to inspire positivity and more vibrant moods by handing you subdued euphoria on a leash.\n\nFind Nordle Nearby\nNordle offers a balanced abundance of both THC and CBD that makes it especially suitable for patients dealing with pain, insomnia, muscle spasms, and anxiety. If your symptoms are keeping you up at night, Nordle is a great nightcap solution for dialing down pain and worries so you can spend less time tossing and turning.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28121936/high-cbd-strains.jpg","urlslug":"/news/strains-products/high-cbd-marijuana-strains-according-to-lab-data"},{"id":"contentitems-38812","title":"Tips for Growing ACDC Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1503531295000)\/","text":"Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Few strains produce as much CBD as ACDC, and as the demand for CBD increases, so does this strain’s popularity. The THC/CBD ratio of this strain can reach as high as 1:20, which means it delivers little to no psychoactive effects. ACDC has been utilized heavily by the medical community to treat conditions such as anxiety, epilepsy, and pain. Consumers sensitive to THC’s side effects have also come to deeply appreciate the mild and relaxing effects ACDC has to offer.\nGrow Techniques: This strain will grow in any medium. The plant structure is naturally bushy and requires little or no training. HST (high stress training) will help level the canopy of the plant, and pruning will keep the energy focused towards the topmost buds.\nFlowering Time: 10 weeks \nYield: Moderate\nGrow Difficulty: Hard\nClimate: ACDC is a picky strain that likes a stable, consistent climate between 68 and 80 degrees Fahrenheit.\nIndoor/Outdoor: ACDC can be grown indoors or outdoors successfully. If growing outdoors, make sure you have enough time for the strain to finish flowering before temperatures drop in the fall.\nFeeding: During the vegetative stage, feed half the recommended amount of nutrients and increase to full feeding during flowering. As a high-CBD strain, ACDC is sensitive to overfeeding.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/23153505/acdc-strain.jpg","urlslug":"/news/growing/how-to-grow-acdc-marijuana"}],"reviewCount":588,"flavors":[{"name":"Earthy","score":26.84660820850079},{"name":"Woody","score":17.839788089148705},{"name":"Pine","score":11.543052003410059},{"name":"Spicy/Herbal","score":11.018450858604313},{"name":"Skunk","score":7.5678967239069541}],"effects":[{"name":"Relaxed","score":73.697783461210562},{"name":"Uplifted","score":62.601083911825604},{"name":"Happy","score":55.931372549019606},{"name":"Focused","score":51.630130312994758},{"name":"Energetic","score":38.301972963098294}],"symptoms":[{"name":"Pain","score":53.006028498355867},{"name":"Stress","score":52.942698818657895},{"name":"Depression","score":36.258068444769215},{"name":"Inflammation","score":31.872488125685059},{"name":"Muscle Spasms","score":22.582815734989648}],"conditions":[{"name":"Anxiety","score":51.740043843624413},{"name":"Arthritis","score":28.207891852393132},{"name":"PTSD","score":26.358543417366946},{"name":"ADD/ADHD","score":17.603824138350994},{"name":"Migraines","score":15.229570088905128}],"negatives":[{"name":"Dry Mouth","score":23.496529046401168},{"name":"Dry Eyes","score":12.199792960662524},{"name":"Anxious","score":4.4954938497137986},{"name":"Paranoid","score":3.8810741687979537},{"name":"Headache","score":2.6781147241505296}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/acdc_100x100_18a6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/544078/b/acdc__primary_8feb.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/acdc_100x100_d693.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/522903/b/acdc__primary_150f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/acdc_100x100_3e5d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/513427/b/acdc__primary_524c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/acdc_100x100_dea5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506615/b/acdc__primary_2209.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/acdc_100x100_1b43.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/497133/b/acdc__primary_d1fa.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/acdc_100x100_cb05.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/494179/b/acdc__primary_a631.jpg"}],"photoTotalCount":20,"popularCities":["Portland, OR","Los Angeles, CA","Eugene, OR","San Diego, CA","Seattle, WA","San Francisco, CA","Bellingham, WA","Everett, WA","Spokane, WA","Chicago, IL"],"permalink":"https://mobileapi.leafly.com/hybrid/acdc","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.49659863945578/240","testGraph":"https://leafly.s3.amazonaws.com/strains/testing/I8baAGQGSpaCeoQGBeTN_acdc.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"Cannatonic","subtitle":null,"slug":"cannatonic","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/cannatonic","symbol":"Ct","applink":"leafly://strain/cannatonic"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":67,"outdoorFinish":null,"height":"Medium","averageYield":"Medium","environment":null,"growNotes":""}}
