{
    "aka": "Alien Ass Hat",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Lisa Rough",
            "category": null,
            "date": "/Date(1445788800000)/",
            "id": "contentitems-3619",
            "text": "Some people take astrology more seriously than others, but regardless of your level of obsession with all things zodiac, you at least know your star sign. That said, have you ever wondered which cannabis strain best reflects your astrological sign? We were curious so we took it upon ourselves to pair up the best strains that complement each personality type based on their horoscope sign.\nWhether you’re as stubborn as a ram, as dramatic as a lion, or as balanced as a scale, we’ve got a strain for you! So sit back, relax, and watch your stars and strains align.\nAries\n\nDates: \nMarch 21 – April 19\nCharacteristics: \nEnthusiastic, Energetic, Independent\nCannabis Strain: \n\nThis sativa-dominant strain will quell any unpleasant feelings with a soothing euphoric boost. Double Dream also offers relaxation with a creative focus and uplifting haziness to let you concentrate on the task at hand, awash in a warm wave of euphoria.\nTaurus\n\nDates: \nApril 20 – May 20\nCharacteristics: \nPractical, Loyal, Dependable\nStrain:\n\nThis sativa-dominant hybrid will uplift your spirit and instill a magical sense of euphoria. Your body will be buzzing and you’ll be tickled Orange Haze with laughter. Resistance is futile, Taurus, so don’t resist the joy and energy of this sweet citrus strain.\nGemini\n\nDates: \nMay 21 – June 20\nCharacteristics: \nEnergetic, Imaginative, Witty\nStrain:\n\nOne of the great and illustrious beginnings for cannabis comes in the form of Haze, a California sativa that will lift you up with focus and creativity, but will also soothe any restlessness with a happy, imaginative buzz that will leave you spinning webs of inspiration.\nCancer\n\nDates: \nJune 21 – July 22\nCharacteristics:\nTenacious, Adaptable, Loyal\nStrain:\n\nThis strain favorite will be your new best friend. A hybrid blend, GSC (f.k.a Girl Scout Cookies) (and its many descendants) are sure to put a smile on your face and bring you peace and relaxation. This is the strain you’ll want for when you’re looking to laugh until you giggle-snort (and then laugh some more).\nLeo\n\nDates: \nJuly 23 – August 22\nCharacteristics: \nConfident, Dramatic, Enthusiastic\nStrain:\n\nAdmittedly, you’re a drama queen, but this strain is guaranteed to lessen the drama and up the ante with joy. Your verbal skills fall dormant and allow someone else to take the spotlight for a change, while you will find yourself quietly in awe at the beauty of the world. Pineapple Express is a freight train that runs on euphoria – all aboard!\nVirgo\n\nDates: \nAugust 23 – September 22\nCharacteristics: \nAnalytical, Observant, Loyal\nStrain:\n\nFor the quietly observant Virgo, Space Queen is a hybrid that will help you out of your shell and make you feel relaxed and comfortable. This is a particularly good choice for those with social anxiety, as it’s a highly fun, sociable strain that elicits easy conversation.\nLibra\n\nDates: \nSeptember 23 – October 22\nCharacteristics: \nPeaceful, Kind, Idealistic\nStrain:\n\nFor the peaceful Libra, nothing suits you better than a high-CBD strain. This sativa-dominant option offers a clear-headed focus that will allow you to get your tasks done with a warm smile on your face. Harlequin is also a wonderful meditation aid, offering relaxation without sedation. Namaste!\nScorpio\n\nDates: \nOctober 23 – November 21\nCharacteristics: \nPassionate, Intense, Observant\nStrain:\n\nThis hybrid is chock full of euphoric happiness. Lemon Skunk also tends to dissipate stress and allow your mind to wander freely through a mellow field of lemony goodness. This strain works whether you’re feeling sociable or flying solo, and you may find yourself feeling some verbose inspiration.\nSagittarius\n\nDates: \nNovember 22 – December 21\nCharacteristics: \nAdventurous, Independent, Conversational\nStrain:\n\nAlien Asshat is as fantastic and ridiculous as it sounds. A perfect match for your adventurous soul, this strain rocks a super high THC content that will blow you out of this world and gear you up for a cosmic journey through space and time (or maybe just an epic hike).\nCapricorn\n\nDates: \nDecember 22 – January 19\nCharacteristics: \nResourceful, Organized, Disciplined\nStrain:\n\nMother’s Helper is perfect for your inner coordinator as it swirls creativity through your mind. Your organizational urges will be appeased with a supremely satisfying sativa burst of energy, followed by a happy mellow cool-down as you survey your accomplishments with pride.\nAquarius\n\nDates:\nJanuary 20 – February 18\nCharacteristics: \nWitty, Clever, Inventive\nStrain: \n\nBlue Diamond will help you exercise your funny bone, with happy giggles and witty repartee galore. You’ll be the life of the party, albeit from the luxurious comfort of a reclined position on a comfy couch. You get the best of both worlds with a soothing dose of pain relief to boot.\nPisces\n\nDates:\nFebruary 9 – March 20\nCharacteristics: \nCompassionate, Imaginative, Escapist\nStrain:\n\nThis strain is one of the best for bonding with friends. Pure Power Plant offers a warm, clear-headed euphoria that’s both uplifting and relaxing. Any leftover stress from your day will dissolve into psychedelic giggles and get you grooving to the music. Keep your eye drops handy, though – red eyes abound!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12003018/which-cannabis-strain-pairs-best-with-your-zodiac-sign.jpg",
            "title": "Which Cannabis Strain Pairs Best With Your Zodiac Sign?",
            "urlslug": "/news/strains-products/which-cannabis-strain-pairs-best-with-your-zodiac-sign"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1441382400000)/",
            "id": "contentitems-3213",
            "text": "New strains have just been added to the Leafly Strain Explorer, and we want your reviews! From the ridiculous Alien Asshat and Honey Boo Boo to the alluring Haze Mist and Tangerine Power, this week's newcomers are sure to raise a few eyebrows. So tell us — have you tried any of these new strains? What did you think?\n \n 1. Alien Asshat\n\nAlien Asshat is a hybrid cannabis strain grown by Sky High Gardens in Washington. With a staggeringly high THC content, Alien Asshat launches you into the cosmos with a powerful euphoric blast. Its buds are a tangle of green calyxes and leaves wrapped in a constellation of shining crystal resin. If you’re new to cannabis, be sure to start small with this heavy-hitter.\n\nAlien Asshat can currently be found at High Society in Anacortes, WA\n \n 2. Honey Boo Boo\n\nAn 80% indica by DNA Genetics, Honey Boo Boo is a limited edition strain that crosses a Bubba Kush mother with a Captain Krypt OG male. With a sweet flavor that in part lends this strain her name, Honey Boo Boo deals a heavy-handed blast of euphoria that melts throughout the body. Her dense buds finish flowering after 8 to 9 weeks, and her maturation is often marked by darkened purple leaf tips.\n\nFind out which locations are currently carrying Honey Boo Boo\n \n 3. Chemmy Jones\n\nChemmy Jones by Connoisseur Genetics is a hybrid strain that unites genetics from Chemdawg D and Casey Jones. Uplifting and revitalizing, Chemmy Jones manages to induce a functional, high-energy buzz that allows you to stay productive. Diesel flavors are counterbalanced by a floral sweetness, inviting the senses before you even indulge in the invigorating effects this sativa-dominant strain has to offer.\n\nFind out which locations are currently carrying Chemmy Jones\n \n 4. Haze Mist\n\nBred by Flying Dutchmen, Haze Mist is a sativa strain that was parented by a South Indian Skunk hybrid and a Haze male. Haze Mist balances sweet, sour, and spicy flavors while its effects lean entirely to the cerebral side of the spectrum with very little full-body sensations. Like a true sativa, Haze Mist stretches tall and requires patience during her 13 to 14 week flowering cycle.\n\n \n 5. Tangerine Power\n\nTangerine Power is a hybrid strain by Sin City Seeds that combines Agent Orange and Blue Power. As one might expect, Tangerine Power carries an unmistakable citrus aroma inherited from the Agent Orange parent. However, this hybrid takes after Blue Power in its paralyzing euphoria and full-body relaxation that trickles over both mind and body.\n\nFind out which locations are currently carrying Tangerine Power\n \n 6. Katsu Kush\n\nKatsu Kush, or just Katsu, is an indica cannabis strain that descends from the hardy Hindu Kush landraces. This indica is named after the original breeder’s alias, and has garnered a reputation for its powerful, full-body effects that leave you blissfully stuck to the couch. Some phenotypes of Katsu Kush exhibit higher levels of CBD, so patients treating pain, inflammation, and anxiety should keep an eye out for this type. With a sweet earthy flavor, Katsu Kush offers a solution for stressful days and sleepless nights.\n\nFind out which locations are currently carrying Katsu Kush\n \n 7. White Skunk\n\nWhite Skunk is an indica-dominant variation of Skunk from Sensi Seeds’ White Label. In a demonstration of its heritage, White Skunk delivers a sour, skunky flavor and a balance of effects that ease both mind and body into a relaxed state. Like many Skunk varieties, this resilient strain is a great choice for beginner growers and offers bountiful yields after a short flowering cycle.\n\nFind out which locations are currently carrying White Skunk\n \nCheck out our other new strains recently added to the Leafly Explorer, or catch up on last week's Michigan Cannabis Cup winners!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/09/12001927/new-strains-alert-alien-asshat-honey-boo-boo-haze-mist-chemmy-jon.png",
            "title": "New Strains Alert: Alien Asshat, Honey Boo Boo, Haze Mist, Chemmy Jones, and More",
            "urlslug": "/news/strains-products/new-strains-alert-alien-asshat-honey-boo-boo-haze-mist-chemmy-jon"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 2.142857142857143
        },
        {
            "name": "PTSD",
            "score": 1.4285714285714286
        },
        {
            "name": "ADD/ADHD",
            "score": 0.7142857142857143
        },
        {
            "name": "Asthma",
            "score": 0.7142857142857143
        },
        {
            "name": "Epilepsy",
            "score": 0.7142857142857143
        }
    ],
    "description": "<p>Alien Asshat is a hybrid cannabis strain grown by Sky High Gardens in Washington. With a staggeringly high THC content, Alien Asshat launches you into the cosmos with a powerful euphoric blast. Its buds are a tangle of green calyxes and leaves wrapped in a constellation of shining crystal <a href=\"https://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\">resin</a>. If you&rsquo;re new to cannabis, be sure to start small with this heavy-hitter.</p>\n",
    "descriptionPlain": "Alien Asshat is a hybrid cannabis strain grown by Sky High Gardens in Washington. With a staggeringly high THC content, Alien Asshat launches you into the cosmos with a powerful euphoric blast. Its buds are a tangle of green calyxes and leaves wrapped in a constellation of shining crystal resin. If you&rsquo;re new to cannabis, be sure to start small with this heavy-hitter.\n",
    "effects": [
        {
            "name": "Euphoric",
            "score": 35
        },
        {
            "name": "Creative",
            "score": 30
        },
        {
            "name": "Giggly",
            "score": 30
        },
        {
            "name": "Happy",
            "score": 25.95238095238095
        },
        {
            "name": "Energetic",
            "score": 22.38095238095238
        }
    ],
    "flavors": [
        {
            "name": "Pungent",
            "score": 18.809523809523807
        },
        {
            "name": "Citrus",
            "score": 14.047619047619047
        },
        {
            "name": "Earthy",
            "score": 10.476190476190474
        },
        {
            "name": "Skunk",
            "score": 9.761904761904761
        },
        {
            "name": "Lemon",
            "score": 9.047619047619046
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png",
            "id": 1369157,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Wow. On the inhale notes of fruit and citrus really come through leaving you smacking your lips to continue tasting the draw. Uplifts and really pierces my frontal lobe. Not racy or overwhelming. Good strain for being around a bunch of people. Can't emphasize enough how fun this one is. Lower doses great for activities where higher doses leave me contemplating staying in my sitting position in a relaxing haze.",
            "username": "Jacob87"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1467313,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "This strain has a hilarious name but I think it goes with the fact that it makes you feel really giggly and relaxed..I dig it!",
            "username": "TreeSap29"
        }
    ],
    "id": 176433,
    "name": "Alien Asshat",
    "negatives": [
        {
            "name": "Dizzy",
            "score": 1.4285714285714286
        },
        {
            "name": "Dry Mouth",
            "score": 1.4285714285714286
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/hybrid/alien-asshat",
    "photoTotalCount": 2,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/394805/b/alien-asshat__primary_822f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/alien-asshat_100x100_d05a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/394557/b/alien-asshat__primary_8916.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/alien-asshat_100x100_c273.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Everett, WA",
        "Auburn, WA",
        "Edmonds, WA",
        "Ocean Shores, WA",
        "Redmond, WA",
        "Renton, WA",
        "Shoreline, WA",
        "Spanaway, WA",
        "Spokane, WA"
    ],
    "rating": 4.82,
    "relatedStrains": [],
    "reviewCount": 33,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "alien-asshat",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.81818181818182/240",
    "subtitle": null,
    "symbol": "Aah",
    "symptoms": [
        {
            "name": "Stress",
            "score": 11.19047619047619
        },
        {
            "name": "Depression",
            "score": 10.476190476190474
        },
        {
            "name": "Fatigue",
            "score": 9.761904761904761
        },
        {
            "name": "Lack of Appetite",
            "score": 8.333333333333332
        },
        {
            "name": "Pain",
            "score": 2.142857142857143
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
