{
    "aka": "MILF Weed",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1429632000000)/",
            "id": "contentitems-3177",
            "text": "The cannabis industry is well on its way to becoming a legitimate and respectable contributor to medicine, the economy, and popular culture in the United States. We’ve come a long way since the dawn of stoner stigmas, and Leafly’s primary goal is to promote worldwide acceptance of marijuana consumption beyond the usual stereotypes. But the market hasn’t always been as polished and PC as it is today, and we still have a lot of work to do.\nBrowse our database of strains and you’ll notice a few that stick out like sore thumbs amidst marketable monikers like Blue Dream, White Lotus, and Strawberry Kush. Some cannabis breeders are much less serious when it comes time to name their new genetic creation, and this list showcases the best of the worst – the dirtiest, the weirdest, the most NSFW strains in the history of cannabis.\n \n1. Wet Dream\n\nThere are a ton of strains out there that induce severe horniness in some individuals (trust us, we read enough detailed and personal strain reviews to know). But, as far as we know, this sativa strain didn’t get its name from a night of magical, sexy, THC-fueled dreams. Wet Dream is just a cleverly named genetic cross between parent strains Blue Dream and Ocean Beach Haze.\n \n2. MILF\n\nThe MILF strain was popularized by the Showtime series “Weeds” as the main character’s signature product, but it’s also a strain that exists in the real world. After hearing the way some growers talk about their “sexy ladies” in the garden, you might suspect that MILF was created by some dendrophiliac who gets off to marijuana plants nearing the end of their maturation cycle. Nope. It’s just a cheeky acronym for “Marijuana I’d Like to Flower.”\n \n3. Purple Monkey Balls\n\nThe history of Purple Monkey Balls is, for the most part, shrouded in mystery. But if we were to guess how its birth story went, it probably went something like:\n\"Once upon a time, there lived a dude that thought poop jokes and penis cartoons were the best thing ever. One day while tending his pot garden, the dude noticed his plants blooming with large, round, purple buds covered in wiry orange pistil hairs. ‘How testicular and primate-like these are,’ he noted with impeccable perception. ‘…Purple Monkey Balls. Yes. Who wouldn't smoke that?' And it was so.\"\n \n4. XXX OG\n\nWARNING: this strain contains somewhat hardcore levels of THC. Consumer discretion is advised. So yeah, this is a super potent indica strain that's said to have aphrodisiac qualities, but take in too much XXX OG and you’re more likely to find yourself uselessly slumped on the couch than in the bedroom making sexy times.\n \n5. Dirty Girl\n\nNot sure if people just expect arousal with a name like Dirty Girl, but there are enough horndog Leafly reviews to question the power of placebo. It’s easy to see Dirty Girl having a positive influence on the libido, though: the effects are energizing, functional, and just euphoric enough to turn a good night into a really, really, really ridiculously good night.\n \n6. Alaskan Thunder Fuck\n\nDespite having a name that would offend all those who keep a swear jar in their home, Alaskan Thunder Fuck remains a timeless classic that won’t be leaving the market any time soon. Some medical marijuana dispensaries abbreviate it to “ATF” on their menus to keep up appearances, but one might argue that this doesn’t provide fair warning of the thundering cerebral mindf*ck to come.\n \n7. Asian Fantasy\n\nYeah, there’s no exciting back story to Asian Fantasy. Her name's the only reason she's on this list.\n \nHave you come across any other cringe-tastic, dirty, or downright NSFW strains? Leave a comment with your favorites!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12001833/leaflys-dirtiest-most-nsfw-cannabis-strains.jpg",
            "title": "Leafly’s Dirtiest, Most NSFW Cannabis Strains",
            "urlslug": "/news/strains-products/leaflys-dirtiest-most-nsfw-cannabis-strains"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1427472000000)/",
            "id": "contentitems-3425",
            "text": "We've uploaded a bunch of new strains to the Leafly Explorer and a few of this week's additions have some pretty unforgettable names, to say the least. If your experiences with any of these strains were as unforgettable as their names, leave some reviews telling us about them!\nThree of these strains come from our friends at Oregrown in Bend, OR, but be sure to check the \"Availability\" tab on the strain pages to find out if any of these are being offered at a location near you.\n \n   1. The Grunk\n\nThe Grunk is a perfect representation of its parent strains Grape Ape and Skunk #1. The aroma is sweet and fruity, mixing with pungent skunky notes to create a flavorful burst of earthy, grape flavors upon exhale. The relaxing indica-dominant effects calm body pains and are balanced by a clear-headed cerebral buzz that lifts away anxieties.\n\n \n   2. MILF\n\nMILF, also known as MILF Weed, from Mother Chucker’s Seeds takes its name from an acronym for Marijuana I’d Like to Flower. This sativa-heavy hybrid crosses White Widow with a select cut of Trainwreck from Arcata, California (e-32). While there is a known indica-dominant phenotype floating around, the MILF strain tends to be led by a strong heady buzz that elevates your mood.\n\n \n   3. Oregon Diesel\n\nOregon Diesel is an indica-dominant hybrid that combines NYC Diesel and Blackberry genetics in a blend bred by Homegrown Natural Wonders specifically for the Pacific Northwest climate. This strain was popularized by Oregrown as they hunted for quality genetics. Oregon Diesel is recommended for nighttime pain relief and its relaxing yet clear-headed effects will calm stress and help you avoid sleepless nights.\n\nAvailable at Oregrown in Bend, OR\n \n   4. The One\n\nThe One, originally bred by Clackamas Coots or CC, is a perfectly balanced hybrid of two landrace strains. It is sometimes referred to by its genetic combination Thai x Pure Afghan, with its sativa heritage stemming from its Thai background and the Afghan influence bringing a thick resinous frosting of trichomes. This specific combination of two cornerstone landrace strains is known to only be available through a select circle of breeders and growers in Oregon.\n\nAvailable at Oregrown in Bend, OR\n \n   5. Sourlope\n\nSourlope is a sativa-dominant cross known for its uplifting and energetic effects. Believed to be a hybrid of NYC Diesel and Cannalope Haze genetics, Sourlope creates a mix of tropical flavors that are sharpened by a strong diesel note. The elevated mood and creative head space attributed to this strain make it a great choice for daytime use and when combating stress and fatigue.\n\n \n   6. Funfetti\n\nFunfetti is a 60/40 indica-dominant hybrid that crosses Cherry Pie with a select phenotype of Animal Cookies, nicknamed Secret Cookies. This strain was originally bred in Northern California by a group of breeders know as Bay Exclusives and was released in limited quantities. Funfetti expresses itself in dark shades of purple and blue that contrast the bright orange pistils and milky trichomes covering all available surface area of the bud. It carries a piney OG undertone to go along with its sweet creamy flavor that is reminiscent of fresh baked birthday cake.\n\nAvailable at Oregrown in Bend, OR\n \n   7. Holy Ghost\n\nHoly Ghost is a harmony of attractive genetics that balance the relaxing nature of indicas with sativas’ cerebral activity. Parent strains Satori, Amnesia Haze, Pitbull, and Durban Poison combine to create a pungent blend of diesel and citrus aromas that are enhanced by an earthy exhale of spiced sandalwood. The interplay of sativa and indica genetics relax the body without putting you to sleep, and energize the mind without overstimulation. Holy Ghost is an enjoyable answer when faced with stress or depression.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/03/12002440/new-strains-alert-the-grunk-milf-holy-ghost-sourlope-and-more.png",
            "title": "New Strains Alert: The Grunk, MILF, Holy Ghost, Sourlope, and More",
            "urlslug": "/news/strains-products/new-strains-alert-the-grunk-milf-holy-ghost-sourlope-and-more"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 2.1739130434782608
        },
        {
            "name": "Epilepsy",
            "score": 1.0869565217391304
        },
        {
            "name": "Migraines",
            "score": 1.0869565217391304
        },
        {
            "name": "PTSD",
            "score": 1.0869565217391304
        }
    ],
    "description": "<p>MILF, also known as MILF Weed, from Mother Chucker&rsquo;s Seeds&nbsp;takes its name from an acronym for Marijuana I&rsquo;d Like to Flower. This <a href=\"http://www.leafly.com/explore/category-sativa\">sativa</a>-heavy <a href=\"http://www.leafly.com/explore/category-hybrid\">hybrid</a> crosses <a href=\"http://www.leafly.com/hybrid/white-widow\">White Widow</a> with a select cut of <a href=\"http://www.leafly.com/hybrid/trainwreck\">Trainwreck</a> from Arcata, California (e-32). While there is a known <a href=\"http://www.leafly.com/explore/category-indica\">indica</a>-dominant <a href=\"http://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\">phenotype</a> floating around, the MILF strain tends to be led by a strong heady buzz that elevates your mood.</p>\n",
    "descriptionPlain": "MILF, also known as MILF Weed, from Mother Chucker&rsquo;s Seeds&nbsp;takes its name from an acronym for Marijuana I&rsquo;d Like to Flower. This sativa-heavy hybrid crosses White Widow with a select cut of Trainwreck from Arcata, California (e-32). While there is a known indica-dominant phenotype floating around, the MILF strain tends to be led by a strong heady buzz that elevates your mood.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 59.78260869565217
        },
        {
            "name": "Euphoric",
            "score": 57.608695652173914
        },
        {
            "name": "Uplifted",
            "score": 56.52173913043478
        },
        {
            "name": "Relaxed",
            "score": 56.52173913043478
        },
        {
            "name": "Giggly",
            "score": 54.34782608695652
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 52.17391304347826
        },
        {
            "name": "Sweet",
            "score": 3.260869565217391
        },
        {
            "name": "Sage",
            "score": 2.1739130434782608
        },
        {
            "name": "Flowery",
            "score": 1.0869565217391304
        },
        {
            "name": "Chestnut",
            "score": 1.0869565217391304
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "\n\tBoth sativa- and indica-dominant phenotypes\n\t10-12 weeks flowering\n\n",
        "height": null,
        "outdoorFinish": "Early October",
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1410411,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I heard it was created by the botwin family \n",
            "username": "thezombie222"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/6MBf4bJ8HotFo9YTLl_yHQoPznw=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fSDQm2BERmuMhwKy3sqqg_2A4DD2F6-3859-42D8-8091-E04F3393F4DB.jpeg.png",
            "id": 1390651,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Super mind awakening and energy! Maybe a little too much (maybe my add get excited with this one). Nice fun happy high. Not much body effects. Love this new strain. Happy to have it in the Burgh. ",
            "username": "MyJokerHandStayLIT"
        }
    ],
    "id": 146902,
    "name": "MILF",
    "negatives": [
        {
            "name": "Dizzy",
            "score": 53.26086956521739
        },
        {
            "name": "Dry Mouth",
            "score": 4.3478260869565215
        },
        {
            "name": "Dry Eyes",
            "score": 3.260869565217391
        },
        {
            "name": "Headache",
            "score": 1.0869565217391304
        },
        {
            "name": "Paranoid",
            "score": 1.0869565217391304
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/white-widow",
            "category": "Hybrid",
            "name": "White Widow",
            "permalink": "https://mobileapi.leafly.com/hybrid/white-widow",
            "slug": "white-widow",
            "subtitle": null,
            "symbol": "Ww"
        },
        {
            "applink": "leafly://strain/trainwreck",
            "category": "Hybrid",
            "name": "Trainwreck",
            "permalink": "https://mobileapi.leafly.com/hybrid/trainwreck",
            "slug": "trainwreck",
            "subtitle": null,
            "symbol": "Tw"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/milf",
    "photoTotalCount": 4,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/633584/b/milf__primary_5c70.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/milf_100x100_ca7e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/371980/b/milf__primary_6ca0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/milf_100x100_73c7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/363307/b/milf__primary_0345.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/milf_100x100_b003.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/354958/b/milf__primary_f4aa.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/milf_100x100_b203.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Spokane, WA",
        "Cheney, WA"
    ],
    "rating": 4.41,
    "relatedStrains": [],
    "reviewCount": 17,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "milf",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.41176470588235/240",
    "subtitle": null,
    "symbol": "Mlf",
    "symptoms": [
        {
            "name": "Stress",
            "score": 2.1739130434782608
        },
        {
            "name": "Cramps",
            "score": 1.0869565217391304
        },
        {
            "name": "Depression",
            "score": 1.0869565217391304
        },
        {
            "name": "Headaches",
            "score": 1.0869565217391304
        },
        {
            "name": "Inflammation",
            "score": 1.0869565217391304
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
