{
    "aka": "Leagle Eagle, L'Eagle, Leagle, Eagle",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1449244800000)/",
            "id": "contentitems-3341",
            "text": "Kick off the weekend right by experimenting with a strain you've never tried before! These indicas, sativas, and hybrids were just added to the Leafly Explorer and are ready for some user reviews. Have you tried any of them?\n \n   1. Master OG\n\nMaster OG is an indica-dominant strain from Cabin Fever Seed Breeders. This offspring of Master Kush and Empress Kush produces large, dense buds that tend to bend branches under the weight. This colorful, pine-scented flower is an ideal match for those suffering pain, nausea, and lack of sleep.\n\nClick here for a full list of locations currently carrying Master OG\n \n   2. Velvet Bud\n\nLike the name suggests, Velvet Bud will produce a smoke that is smooth like velvet. A mostly sativa that crosses Dutch Treat and Blueberry, this fruity strain is a great choice for anyone struggling with depression, anxiety, and stress.\n\n \n   3. L'Eagle Eagle\n\nThe L'Eagle Eagle hybrid is a blend of Candy Haze and Skunk #6 genetics offered at L'Eagle Services in Denver, Colorado. It’s fruity on the inhale, while the exhale brings a sweet and spicy aftertaste alongside an inspirational buzz that encourages activity. Highly potent and energetic, this is a great daytime strain for users with a high THC tolerance.\n\nL'Eagle Eagle is available at L'Eagle in Denver, CO\n \n   4. Crosswalker\n\nCrosswalker is a 70/30 indica-dominant cannabis strain that crosses Skywalker OG and Blueberry. When consumed, you will notice an earthy, sweet, and citrus undertone that lingers in your mouth. You’ll be left with a happy and euphoric feeling, but be careful consuming too much of this strain at once, as you may be on the couch longer than you would have expected.\n\nCrosswalker is currently available at Botanica in Tucson, AZ\n \n   5. Spliff's Strawberry\n\nCreated by Dutch Seedbank, Spliff’s Strawberry is a zealously strong sativa-dominant strain with an in-your-face fresh berry flavor. Made up of Strawberry Cough, Skunk, and Jack Herer, this strain takes on all of its parent strains’ euphoric, giggly traits. Its uplifting effects may alleviate depression and fatigue symptoms while its mild body effects can help dull pain and stress.\n\n \n   6. Blue Treat\n\nJordan of the Islands matched two of the sweetest tasting flowers to make this candy of an strain. Using Blueberry and Dutch Treat genetics, Blue Treat was born. This short plant takes after its strong indica lineage, producing sticky resinous buds that can soothe your pain and relieve your stress. The dark green buds are covered in trichomes and give off a sweet berry aroma.\n\nClick here for a full list of locations currently carrying Blue Treat\n \n   7. Night Train\n\nNight Train is an indica-dominant cross between Jasmine and Trainwreck released by Elemental Seeds in California. DNA Genetics also has a strain with these genetics, but they’ve named their rendition Cole Train. With a pungent and spicy aroma reminiscent of Colombian sativas, Night Train delivers a body-melting blast of relaxing euphoria perfect for unwinding after a long day. Growers will appreciate this resilient and hardy strain as it produces heavy yields following a short flowering cycle.\n\nClick here for a full list of locations currently carrying Night Train\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12002235/new-strains-alert-master-og-velvet-bud-crosswalker-and-night-trai.png",
            "title": "New Strains Alert: Master OG, Velvet Bud, Crosswalker, and Night Train",
            "urlslug": "/news/strains-products/new-strains-alert-master-og-velvet-bud-crosswalker-and-night-trai"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 8.055555555555555
        },
        {
            "name": "Hypertension",
            "score": 2.5
        },
        {
            "name": "Bipolar Disorder",
            "score": 2.5
        },
        {
            "name": "ADD/ADHD",
            "score": 1.25
        },
        {
            "name": "Fibromyalgia",
            "score": 1.25
        }
    ],
    "description": "<p>The L&#39;Eagle Eagle hybrid is a blend of Candy Haze and Skunk #6 genetics offered at <a href=\"https://www.leafly.com/dispensary-info/leagle-services-llc\">L&#39;Eagle Services</a>&nbsp;in Denver, Colorado. It&rsquo;s fruity on the inhale, while the exhale brings a sweet and spicy aftertaste alongside an inspirational buzz that encourages activity. Highly potent and energetic, this is a great daytime strain for users with a high THC tolerance.</p>\n",
    "descriptionPlain": "The L&#39;Eagle Eagle hybrid is a blend of Candy Haze and Skunk #6 genetics offered at L&#39;Eagle Services&nbsp;in Denver, Colorado. It&rsquo;s fruity on the inhale, while the exhale brings a sweet and spicy aftertaste alongside an inspirational buzz that encourages activity. Highly potent and energetic, this is a great daytime strain for users with a high THC tolerance.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 69.86111111111111
        },
        {
            "name": "Uplifted",
            "score": 68.05555555555556
        },
        {
            "name": "Euphoric",
            "score": 56.25
        },
        {
            "name": "Relaxed",
            "score": 51.25
        },
        {
            "name": "Energetic",
            "score": 27.916666666666664
        }
    ],
    "flavors": [
        {
            "name": "Pine",
            "score": 51.25
        },
        {
            "name": "Strawberry",
            "score": 50
        },
        {
            "name": "Sweet",
            "score": 11.805555555555555
        },
        {
            "name": "Spicy/Herbal",
            "score": 6.25
        },
        {
            "name": "Diesel",
            "score": 5.555555555555555
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1390453,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Location: L'Eagle \nTHC: 24.43%\nCBD: Unknown \nTHC-A: Unknown \n\nAdditional Notes: This reminds me a little bit of an upscale golden goat.\n\nAppearance Rating: 5.00\nAppearance Description: These flowers are extremely unique in appearance. The nugget are relatively compact and are covered in Trichromes. They are a very light muted green with almost light pink hairs. The manicure job, as with anything from L'Eagle Services, is very much on point. \n\nTaste Rating: 5.00 \nTaste Description: The flavor on this strain is incredible. You get sweet lemon and citrus along with a hint of pungent pine, spice, and earth in there. Call me crazy, but I swear I got a mild tone of banana on the exhale. It is not only delicious, but definitely unique. \n\nEffects Rating: 5.00 \nEffects Description: This sativa dominant hybrid has amazing effects. It is exceptionally uplifting mentally and physically. There is some mild body relaxation and intense euphoria. I could see a strong sativa like this making some anxious, but I had none of that at all. Nothing but positive, happiness, and smiles. \n\nOverall Rating: 5.00\nOverall Summary: HUGE kudos to L'Eagle services for creating this strain. I am so impressed; it is definitely a new favorite. L'Eagle Eagle is incredible in every way. This is a must try whether you're just visiting or live locally; either way it's worth it! I will definitely be going back for more!! \n\nI'm Keith Von Fraichen ... You Keep On Fraiching",
            "username": "KeithVonFraichen"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1546972,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I’ve been to L’ Eagle a hand full of times now. The produces are always great and affordable. The all organic side of things is really important to me so they will continue to have my business. The last time we went on Black Friday and got an OZ of Strawberry Cough for $99 dollars!! ",
            "username": "eythandavich"
        }
    ],
    "id": 190991,
    "name": "L'Eagle Eagle",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 5
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/hybrid/leagle-eagle",
    "photoTotalCount": 2,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/545550/b/l-eagle-eagle__primary_7c88.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/l-eagle-eagle_100x100_2912.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/414141/b/l-eagle-eagle__primary_3deb.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/l-eagle-eagle_100x100_1991.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Las Vegas, NV"
    ],
    "rating": 4.53,
    "relatedStrains": [],
    "reviewCount": 19,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "leagle-eagle",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.52631578947368/240",
    "subtitle": null,
    "symbol": "Lea",
    "symptoms": [
        {
            "name": "Fatigue",
            "score": 14.86111111111111
        },
        {
            "name": "Depression",
            "score": 10.555555555555555
        },
        {
            "name": "Stress",
            "score": 10.555555555555555
        },
        {
            "name": "Inflammation",
            "score": 2.5
        },
        {
            "name": "Headaches",
            "score": 1.25
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
