{
    "aka": "Birthday Cake, Wedding Cake",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1484957722000)/",
            "id": "contentitems-16353",
            "text": "Every year we like to look back and recognize the rising stars of the cannabis world. Last year, GG4 (f.k.a Gorilla Glue #4), Critical Kush, Candyland, and ACDC were among the fastest trending strains according to Leafly user strain reviews, but which strains stood out from the crowd this year?\nTo eliminate outliers that might skew the results, we restricted our search to the top 200 ranking strains of 2016. These strains tend to be more available nationwide, and we hope you’re able to find them in your area!\nBudtenders and inventory managers – are these trending strains on your menu? If not, consider keeping an eye out for them. Because in 2016, they were flying off the shelves fast.\n\n#10. Blue Cookies\n\nWe all know that customers swarm around anything containing the word “Cookies,” thanks to the Girl Scout Cookie hype. But what makes Blue Cookies stand out from the many, many other Cookie crosses? The addition of Blueberry indica genetics, of course.\n#9. Birthday Cake Kush\n\nAnother decadent GSC (f.k.a Girl Scout Cookies) cross, Birthday Cake Kush also pulls in genetics from Cherry Pie to achieve a dessert-like taste that’s not altogether unlike cake itself. It may not be your birthday, but the luxurious and relaxing qualities of this potent hybrid are certainly something to celebrate.\n#8. Sour Tangie\n\nThe citrus-loaded sativa strain Tangie can’t possibly be improved. Or can it? DNA Genetics has done it again, spinning their Tangie masterpiece with the help of East Coast Sour Diesel genetics. Sour Tangie improves the fuel-like taste of Sour Diesel without compromising Sour D’s high-flying creative effects, making this sativa a must-have for flavor enthusiasts and artists alike.\n#7. Purple Candy\n\nPurple Candy blossomed in British Columbia, Canada. Believed to be a cross between BC Sweet Tooth and Mendocino Purps, it’s as sticky and sweet as grape hard candy. But you won’t feel a sugar rush with this indica; instead, expect the heavy-hitter to prime you for bedtime or a solid nap.\n#6. Quantum Kush\n\nA good sativa can lend a positive spark to an otherwise dreary day of chores, so it’s no wonder that Quantum Kush tipped the charts in 2016 as one of the fastest trending sativa strains. While some sativas bring on the buzz with a bit too much gusto, resulting in anxiety and paranoia, Quantum Kush manages to deliver creative, talkative, giggly qualities without what we like to call “The Fear.”\n#5. God’s Green Crack\n\nWho knew the not-so holy union of God Bud and Green Crack would result in something so heavenly? God Bud is known for producing mammoth yields of gargantuan buds, but the effects are a little heavy-handed for some. That’s why Jordan of the Islands crossbred God Bud with Green Crack, the high-flying sativa strain that focuses all of its effort on elevating the mind to a place where laughing fits are inevitable.\n#4. Gelato\n\nA new generation of GSC (f.k.a Girl Scout Cookies) has arrived, and its name is Gelato. From the same breeders that delivered fan favorites Sunset Sherbet and GSC (f.k.a Girl Scout Cookies), Cookie Fam Genetics from Bay Area, California isn’t finished with their royal line quite yet. Gelato, a descendent of Sunset Sherbet and Thin Mint GSC (f.k.a Girl Scout Cookies), blooms in bright colors that are almost as inviting as its tantalizing dessert-like aroma.\n#3. Grape Stomper\n\nGrape Stomper isn’t a new strain, but a jump in Leafly reviews will show that not all good things are sparkly and new. Strong genetics inherited from Purple Elephant and Chemdawg Sour Diesel equip this strain with the full package: flavor, potency, and consistency. Relaxing without encumbering social skills, the balanced Grape Stomper is an excellent choice for so many different activities. No wonder its popularity isn’t waning.\n#2. Nuken\n\nNuken is also an older strain making a comeback. Originally found in Canada, it’s since proliferated throughout the Pacific Northwest to states like Washington and Oregon. Herbal and sweet in flavor, Nuken cradles you in a blanket of dreamy euphoria where your thoughts can float upward to bliss.\n#1. Superglue\n\nLast year, the top trending strain was GG4 (f.k.a Gorilla Glue #4). This year it’s Superglue, which surprisingly bears no family ties to last year’s champ. A cross between Northern Lights and Afghani, Superglue develops a thick coat of sticky resin that will quite literally glue your fingers together. Though its parentage may lead you to believe Superglue will be a knockout, this strain is bred to deliver more light-footed effects. In fact, Leafly users have described this strain as focusing and creative while simultaneously relaxing the body.\n\nWhat was your favorite strain of 2016? We want to hear from you! Leave your most memorable cannabis varieties in the strain section below.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/20115737/cannabis-flower-up-close.jpg",
            "title": "The Top Trending Cannabis Strains of 2016",
            "urlslug": "/news/strains-products/top-trending-cannabis-strains-2016"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1429920000000)/",
            "id": "contentitems-3315",
            "text": "We've got more strains for you to explore this weekend! Not all of them are \"new\" per se (although they may be to you!) — Lashkar Gah is one of the oldest indicas still kicking today, and Jacky White's been around for a decade now. Young or old, all of these strains are in need of some user reviews, so be sure to get on that if you've tried any of these!\n \n   1. Jacky White\n\nJacky White is a 75% sativa strain bred by Paradise Seeds, who crossed the legendary Jack Herer sativa with a resinous White Widow hybrid. She introduces herself with a sweet grapefruit and citrus aroma, which leads the way into Jacky White’s well-balanced head and body effects. Lofty euphoria lifts the mind into an upbeat cerebral space, while the indica in her softens the racy sativa effects with a deep, physical calm. Since her debut in 2005, growers have cherished Jacky White for her hardiness, stability, fast flowering, and plentiful yields.\n\n \n   2. Blue Dynamite\n\nBlue Dynamite, bred by Next Generation Seeds in Canada, is an indica-dominant strain that provides heavy mind and body relaxation alongside a fruity, hashy flavor. This powerhouse indica was bred from a B.C. Grapefruit clone known as Dynamite and an Afghani–Blueberry hybrid called Avalon. Combining the flavorful qualities of Dynamite with the resinous potential Avalon enables, we are left with a potent strain that can budge even the most stubborn cases of pain, nausea, and sleeplessness. High Times recognized Blue Dynamite among its Top 10 Strains of 2007, solidifying a reputation that keeps this strain firmly set in the cannabis market.\n\n \n   3. Canna-Tsu\n\nCanna-Tsu is a hybrid cannabis strain that combines genetics from two CBD-rich parents, Cannatonic and Sour Tsunami. Sweet earthy flavors activate on the exhale, complementing the subtle citrus aroma that radiates from Canna-Tsu’s buds. Because of its high-CBD, low-THC cannabinoid profile, Canna-Tsu delivers its mellow effects with mental clarity. Strains high in CBD like Canna-Tsu are highly demanded by patients treating pain, inflammation, anxiety, and seizures.\n\n \n   4. Lashkar Gah\n\nLashkar Gah is an indica landrace strain named after its geographic origin in south Afghanistan. Like other Afghani indicas, Lashkar Gah is consistent in its delivery of powerful, sedating effects that promote rest and relaxation. Pain, insomnia, and other severe symptoms collapse under the weight of Lashkar Gah’s heavy effects, and a quick examination of its resin-caked buds explains this indica’s potency. Your body may feel pinned down by Lashkar Gah’s euphoric punch, but your mind will likely float away blissfully as the burdens of stress and anxiety dissolve.\n\nAvailable at BotanaCare Medical & Recreational in Northglenn, CO\n \n   5. Blue Magic\n\nBlue Magic is an upbeat sativa-dominant strain bred from the famous Blue Dream. Its high-energy effects are prefaced by creamy, fruity flavors reminiscent of its Blueberry ancestry. Sativa enthusiasts will appreciate the balance of potency and clarity delivered by Blue Magic, whose euphoria offers functionality and focus despite an impressive THC profile. While its initial punch is quick to hit, Blue Magic’s effects taper down gently and ease you into long-lasting relaxation that extends from the physical exterior to the deep recesses of your mind.\n\n \n   6. Birthday Cake Kush\n\nBirthday Cake Kush, or just Birthday Cake, is an indica-dominant hybrid with strong body effects and sweet cake-like flavor. As decadent as its GSC (f.k.a Girl Scout Cookies) and Cherry Pie parent strains, Birthday Cake Kush buds bloom with a crystalline icing of THC-rich resin. Like any dessert, Birthday Cake Kush is the perfect way to end your day, with deeply relaxing effects that soothe the body without sedating the mind. This indica is preferred by patients treating pain, anxiety, appetite loss, inflammation, and headaches.\n\nAvailable at BotanaCare Medical & Recreational in Northglenn, CO\n \n   7. Truth Serum\n\nTruth Serum is a hybrid strain that was originally bred in the Midwest during the summer of 2006. While exploring how to breed feminized seeds, an underground breeder in Minnesota induced stress on a single branch of G13 to create the pollen that fertilized a variety of strains growing in his garden. After narrowing his breeding projects down into two of the more potent and vigorous phenotypes, we are left with the complex combination of G13, Trinity, and Pineapple. The strain quickly made its way to the Northern California coastline where the dense buds now bloom. Truth Serum carries a sweet tropical aroma and is frosted with a thick coat of trichomes. The exhale provides a mouthful of hash-like flavor that ushers in the relaxing effects led by G13’s indica-dominant influence. It should be noted that another strain by the name Truth Serum is bred by Pisces Genetics. Their Truth Serum is a mostly indica hybrid that combines True OG and Death Star genetics.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12002159/new-strains-alert-jacky-white-blue-dynamite-canna-tsu-lashkar-gah.png",
            "title": "New Strains Alert: Jacky White, Blue Dynamite, Canna-Tsu, Lashkar Gah, and More",
            "urlslug": "/news/strains-products/new-strains-alert-jacky-white-blue-dynamite-canna-tsu-lashkar-gah"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 39.39334819769602
        },
        {
            "name": "ADD/ADHD",
            "score": 13.012356001486435
        },
        {
            "name": "Migraines",
            "score": 12.759197324414716
        },
        {
            "name": "Arthritis",
            "score": 11.563080639167595
        },
        {
            "name": "Anorexia",
            "score": 9.5582497212932
        }
    ],
    "description": "<p>Birthday Cake Kush, also known as Wedding Cake or just Birthday Cake, is an <a href=\"http://www.leafly.com/explore/category-indica\">indica</a>-dominant <a href=\"http://www.leafly.com/explore/category-hybrid\">hybrid</a> with strong body effects and <a href=\"http://www.leafly.com/explore/flavors-sweet\">sweet</a> cake-like flavor. As decadent as its <a href=\"http://leafly.com/hybrid/girl-scout-cookie\">Girl Scout Cookies</a> and <a href=\"http://leafly.com/hybrid/cherry-pie\">Cherry Pie</a> parent strains, Birthday Cake Kush buds bloom with a crystalline&nbsp;icing of THC-rich resin. Like any dessert, Birthday Cake Kush is the perfect way to end your day, with deeply <a href=\"http://www.leafly.com/explore/tags-relaxed\">relaxing</a> effects that soothe the body without sedating the mind. This indica is preferred by patients treating <a href=\"http://www.leafly.com/explore/symptoms-pain\">pain</a>, <a href=\"http://www.leafly.com/explore/conditions-anxiety\">anxiety</a>, <a href=\"http://www.leafly.com/explore/symptoms-lack-of-appetite\">appetite loss</a>, <a href=\"http://www.leafly.com/explore/symptoms-inflammation\">inflammation</a>, and <a href=\"http://www.leafly.com/explore/symptoms-headaches\">headaches</a>.</p>\n",
    "descriptionPlain": "Birthday Cake Kush, also known as Wedding Cake or just Birthday Cake, is an indica-dominant hybrid with strong body effects and sweet cake-like flavor. As decadent as its Girl Scout Cookies and Cherry Pie parent strains, Birthday Cake Kush buds bloom with a crystalline&nbsp;icing of THC-rich resin. Like any dessert, Birthday Cake Kush is the perfect way to end your day, with deeply relaxing effects that soothe the body without sedating the mind. This indica is preferred by patients treating pain, anxiety, appetite loss, inflammation, and headaches.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 83.8828502415459
        },
        {
            "name": "Happy",
            "score": 61.97649572649572
        },
        {
            "name": "Sleepy",
            "score": 46.7530657748049
        },
        {
            "name": "Euphoric",
            "score": 39.29719435154218
        },
        {
            "name": "Hungry",
            "score": 37.91945373467112
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 52.4842066146414
        },
        {
            "name": "Vanilla",
            "score": 40.038554440728355
        },
        {
            "name": "Honey",
            "score": 17.975195094760313
        },
        {
            "name": "Earthy",
            "score": 13.70680044593088
        },
        {
            "name": "Lemon",
            "score": 11.062337421033073
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1392868,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Smells like lemon cake with vanilla icing <3. Very relaxing, totally killed the pain I was having from stomach cramps. Great for winding down at the end of the day. ",
            "username": "RLO"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1628287,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Nice strain here. Taste just like cake and has that sweet flavor to it.  Very dense and sticky. Made me tired in the middle of the day so I guarantee it’ll put me to sleep. It’s just simply a good strain for relaxing after hard day. ",
            "username": "supremeeasy"
        }
    ],
    "id": 154607,
    "name": "Birthday Cake Kush",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 32.431252322556674
        },
        {
            "name": "Dry Eyes",
            "score": 21.260219249349685
        },
        {
            "name": "Dizzy",
            "score": 7.300260126347083
        },
        {
            "name": "Paranoid",
            "score": 1.8659420289855073
        },
        {
            "name": "Anxious",
            "score": 0.6944444444444444
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/girl-scout-cookie",
            "category": "Hybrid",
            "name": "Girl Scout Cookies",
            "permalink": "https://mobileapi.leafly.com/hybrid/girl-scout-cookie",
            "slug": "girl-scout-cookie",
            "subtitle": null,
            "symbol": "Gsc"
        },
        {
            "applink": "leafly://strain/cherry-pie",
            "category": "Hybrid",
            "name": "Cherry Pie",
            "permalink": "https://mobileapi.leafly.com/hybrid/cherry-pie",
            "slug": "cherry-pie",
            "subtitle": null,
            "symbol": "Cp"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/birthday-cake-kush",
    "photoTotalCount": 31,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005372/b/birthday-cake-kush__primary_3414.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/birthday-cake-kush_100x100_2fa5.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002035/b/birthday-cake-kush__primary_72ca.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/birthday-cake-kush_100x100_f239.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646161/b/birthday-cake-kush__primary_7870.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/birthday-cake-kush_100x100_d9e6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/633424/b/birthday-cake-kush__primary_e05d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/birthday-cake-kush_100x100_ea8d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/632816/b/birthday-cake-kush__primary_5cf5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/birthday-cake-kush_100x100_880c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/585364/b/birthday-cake-kush__primary_6c8e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/birthday-cake-kush_100x100_766c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Chicago, IL",
        "Los Angeles, CA",
        "Spokane, WA",
        "Ann Arbor, MI",
        "Caguas, Caguas, Puerto Rico",
        "Eugene, OR",
        "San Diego, CA",
        "Aptos, CA",
        "Arcata, CA"
    ],
    "rating": 4.55,
    "relatedStrains": [],
    "reviewCount": 197,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "birthday-cake-kush",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.55329949238579/240",
    "subtitle": null,
    "symbol": "Bir",
    "symptoms": [
        {
            "name": "Insomnia",
            "score": 45.28010033444816
        },
        {
            "name": "Stress",
            "score": 42.092623560014864
        },
        {
            "name": "Pain",
            "score": 33.125696767001116
        },
        {
            "name": "Depression",
            "score": 28.832683017465627
        },
        {
            "name": "Lack of Appetite",
            "score": 25.746934225195094
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
