{
    "aka": "818 Headband, Headband 818, Sour OG Kush",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1458932400000)/",
            "id": "contentitems-3257",
            "text": "Celebrate the weekend with some strains you've never tried before! These seven were just added to the Leafly strain database, and they're waiting to be reviewed. Submit a review for the ones you've tried, or check the links below to see where they're currently offered in stores!\n \n  1. Clockwork Orange\n\nOriginally a clone-only hybrid and later released in seed form by breeders Riot Seeds, Clockwork Orange is thought to be some sort of G13/Black Widow cross. Because of its compact bushy stature and incredible potency, it has long been sought after by growers and breeders alike. Combining a heavy indica stone with an intense Haze-like head high, Clockwork Orange is not for the novice smoker.\n\nClick here for a full list of locations currently carrying Clockwork Orange\n \n  2. Trix\n\nRiot Seeds claims to have created the most potent and reliable Colombian Gold hybrid in the world by crossing a New World landrace with Loompa’s Chemdawg D cut. Combining the sweet fruity smell of Colombian Gold with the fuel scents of Chemdawg makes Trix a delicious smoke. Finishing in 10 weeks and producing massive yields, Trix is sure to be a sativa grower’s dream. Users can expect an electric, motivating high from this strain.\n\nClick here for a full list of locations currently carrying Trix\n \n  3. Super Sour OG\n\nSuper Sour OG is a 50/50 hybrid from Emerald Triangle that combines well-known strains Blueberry, Sour Diesel, and OG Kush with Lost Coast OG to excellent effect. With tight internodal spacing and few fan leaves, Super Sour OG offers fantastic yields of frosty, uniform colas. The smell and flavor are very sour with a hint of berry, and Super Sour OG offers a euphoric, uplifting buzz that settles into a relaxed sense of well-being.\n\nClick here for a full list of locations currently carrying Super Sour OG\n \n  4. Ether\n\nGenerally referred to as Alien Dawg (“Ether” cut), this is one of the more sought after phenotypes of the indica-dominant hybrid Alien Dawg and has been used to create other hybrids such as Alien Abduction and Lemon Alien Dawg. Leaning more towards the Chemdawg 91 side of its heritage, Ether is known for its intense sour smell and amazing trichome production.\n\n \n  5. Raw Diesel\n\nG-13 Labs created Raw Diesel by crossing NYC Diesel with G13 Haze. Huge flowers coated in resin and that unmistakable sour, lemon-diesel aroma make this a popular strain with connoisseurs and cash-croppers alike. Some phenotypes will have more of a spicy Haze flavor and taller stature, while the best ones are shorter with fatter buds and a lip-smacking sour-fuel flavor. Raw Diesel can be counted on to produce copious amounts of THC.\n\nClick here for a full list of locations currently carrying Raw Diesel\n \n  6. Hemlock\n\nA cross of Durban Poison and LA Confidential, Hemlock is a hybrid strain that smells of sweet grapefruit with a hint of ammonia. Found mostly in Colorado, Hemlock averages about 21% THC and features a short, stocky, easy-to-grow structure with good yields and high resin production. This hybrid gives users a relaxed feeling of well-being, and is potentially good for treating migraines, anxiety, and PTSD.\n\nClick here for a full list of locations currently carrying Hemlock\n \n  7. Pineapple OG\n\nThis 70% sativa hybrid is thought to be a cross between Pineapple Express and an unknown OG Kush hybrid, and is probably only available on the West Coast. As a relatively rare find, the cannabinoid content of Pineapple OG is unclear, but both parent strains are known for their potency, so expect this one to be pretty strong. Smoke reports mention a sweet-spicy pineapple flavor and odors of lemon, pine and fuel, and Pineapple OG is said to provide an upbeat, cerebral high with a decent body buzz.\n\nClick here for a full list of locations currently carrying Pineapple OG\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/03/12002034/new-strains-alert-clockwork-orange-super-sour-og-hemlock-pineappl.jpg",
            "title": "New Strains Alert: Clockwork Orange, Super Sour OG, Hemlock, Pineapple OG, and More",
            "urlslug": "/news/strains-products/new-strains-alert-clockwork-orange-super-sour-og-hemlock-pineappl"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1416865260000)/",
            "id": "contentitems-3561",
            "text": "Winter is coming, and we don’t need every department store nationwide whipping out their Christmas supplies in October to feel it. Whether you love them or despise them with a flaming Grinch-like passion, the holidays are upon us and getting through the madness may require some help from our little green friend. Each chapter of the holidays poses a different challenge, and for this reason, we’ve compiled a handy list of strains to pair with each festivity (and struggle). \nThanksgiving: The Pre-Feast\nIt’s you versus a table full of food. What appetite-stimulating weapon will you choose?\n   Sour OG\nThis Sour Diesel and SFV OG Kush cross dishes out a good balance of uplifting euphoria alongside the hunger rampage, making this hybrid the perfect contender for both appetite loss and the seasonal blues.\n   Afghan Kush\nThis heavy-duty indica is the rocket-launcher equivalent when it comes to fighting appetite loss with cannabis. A little bit of this earthy, relaxing strain and you’ll be inhaling more food than you thought was humanly possible.\nThanksgiving: The Recovery\nYou have just defeated your enemy with the power of sheer gluttony, and now it’s time to deflate. Choose one of these tummy-calming strains to help you harness your full digestive potential:\n   Casey Jones\nJust like the hockey-masked vigilante of the Ninja Turtle world, this Casey Jones will beat any gastointestinal discomfort to a pulp without inducing an early night’s sleep.\n   Headband\nGood for both relaxation and relieving stomach pain, Headband offers long-lasting, carefree effects that will help you accept the feast’s passing as opposed to mourning it. (But seriously, R.I.P., you delicious bowl of stuffing.)\n   Death Star\nThis crushing indica strain will destroy any stomach aches with the choke-hold force of Darth Vader himself. Prepare to die, bloated gut.\nBlack Friday\nBlack Friday could be considered the second major boss fight of the holiday season. Rather than battling the mother ship that is Thanksgiving dinner, Black Friday poses a horde of frenzied consumers looking to get those deals before you do. Luckily, you’ve got quite the psychoactive arsenal to help you get there first:\n   Green Crack\nFew strains can truly be described as energizing, but this sativa is the exception. Green Crack’s active, buzzing effects will have you darting from shelf to shelf like a mad(wo)man for as long as you can remember what you were doing.\n   Lavender\nFor some of us, nothing induces more anxiety than crowds of people flocking around the disarray under those irritating fluorescent lights. You can choose to stay home, or utlize the calming, anti-paranoia properties of Lavender to help you brave the mobs.\nChristmas\nOh, Christmas. This is a day full of different festivities, but whether you’re preparing yourself for Feast Madness: Part II or simply wanting to kick it with that video game you gifted yourself, we’ve got some recommendations for you:\n   Power Plant\n‘Tis the season for obligatory conversation with relatives you see once a year. Power Plant is here to help bring out your more talkative half for those awkward, unnatural exchanges.\n   Chemdawg\nA good, well-rounded hybrid, Chemdawg brings joy, creativity, and sensory elevation to whatever it is you find yourself doing on Christmas Day. Loafing around with your cats? Crafting a masterpiece from snow? Scarfing down an entire tube of raw cinnamon rolls? Chemdawg will make it even better.\nNew Year’s Eve/Day\nNew Year’s Eve and New Year’s Day are literally as different as night and day, so you may want to pick up the entire trifecta here to ensure proper preparation…and recovery:\n   Harlequin\nYou may be the type of person who believes that midnight is an ungodly hour, and for you we suggest Harlequin. This high-CBD sativa provides all the clear-headed energy you’ll need to keep up with those night owl youngsters.\n   Grape Ape\nStaving off a hangover? We recommend ending your holiday season with this indica whose nausea-relieving, restful qualities are sure to bring you back to your baseline.\nImage credit: Martin Cathrae via Photopin cc",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/11/12002842/the-leafly-holiday-survival-guide-15-strains-to-help-you-make-it.jpg",
            "title": "The Leafly Holiday Survival Guide: 12 Strains to Help You Make It to the New Year",
            "urlslug": "/news/strains-products/the-leafly-holiday-survival-guide-15-strains-to-help-you-make-it"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 38.578438733741855
        },
        {
            "name": "PTSD",
            "score": 16.145978152929494
        },
        {
            "name": "Bipolar Disorder",
            "score": 9.272240656865357
        },
        {
            "name": "Asthma",
            "score": 9.200135635914453
        },
        {
            "name": "Migraines",
            "score": 8.155666432533243
        }
    ],
    "description": "<p>Sour OG is a 50/50 hybrid strain that is a real favorite among those who love a balanced sativa/indica buzz. As a cross of two of the most popular and widely available strains in the world (<a href=\"http://leafly.com/sativa/sour-diesel\">Sour Diesel</a> and <a href=\"https://www.leafly.com/hybrid/og-kush\">OG Kush</a>), Sour OG has been available in clone and seed form for quite some time. Most samples express dense, round, OG Kush-type buds laden with large, sticky <a href=\"https://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\">trichomes</a>. The odor and taste are usually an equal mix of both parents, with sour lemon, pine, fuel, and a distinct &ldquo;kushy&rdquo; undertone, although some versions have a more fruity profile. Often described as a &ldquo;one-hit-quit&rdquo; strain, Sour OG starts with an energetic head high that gradually gives way to a relaxing body stone.</p>\n",
    "descriptionPlain": "Sour OG is a 50/50 hybrid strain that is a real favorite among those who love a balanced sativa/indica buzz. As a cross of two of the most popular and widely available strains in the world (Sour Diesel and OG Kush), Sour OG has been available in clone and seed form for quite some time. Most samples express dense, round, OG Kush-type buds laden with large, sticky trichomes. The odor and taste are usually an equal mix of both parents, with sour lemon, pine, fuel, and a distinct &ldquo;kushy&rdquo; undertone, although some versions have a more fruity profile. Often described as a &ldquo;one-hit-quit&rdquo; strain, Sour OG starts with an energetic head high that gradually gives way to a relaxing body stone.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 68.58400949451402
        },
        {
            "name": "Uplifted",
            "score": 60.09470293312665
        },
        {
            "name": "Happy",
            "score": 54.769322062634735
        },
        {
            "name": "Euphoric",
            "score": 45.92699881318575
        },
        {
            "name": "Hungry",
            "score": 34.121224598541914
        }
    ],
    "flavors": [
        {
            "name": "Diesel",
            "score": 21.780923777460217
        },
        {
            "name": "Earthy",
            "score": 19.35824835904764
        },
        {
            "name": "Citrus",
            "score": 15.427228909826338
        },
        {
            "name": "Pine",
            "score": 14.16114031050936
        },
        {
            "name": "Sweet",
            "score": 6.644294814348342
        }
    ],
    "growInfo": {
        "averageYield": "Medium",
        "difficulty": "Moderate",
        "environment": null,
        "floweringDays": 60,
        "growNotes": "",
        "height": "Medium",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1416081,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This is a wonderful medicine for anxiety. Sour OG hits instantly and provides an extremely social, positive uplifting high. It's one of my favorite medicines for anxiety relief, stress relief and is great for social gatherings. The best thing I can say about Sour Og is that it gives me hope. Suffering debilitating panic attacks for years I know what a living hell anxiety can be. I don't like the doctor prescribed medications for anxiety like Xanax, Klonopin etc. as they can cause liver damage. Medicinal marijuana is a holistic all natural remedy. I use it responsibly meaning that I never smoke before work, never smoke before or during driving and only smoke at home. I find it to be rather sad that medical Marijuana still carries a negative stigma from so many people whether it's politicians, uninformed citizens or close minded religious zealots. I can't tell you how many people I've know that criticize marijuana, yet got to the bar every weekend or week day and make a complete ass out of themselves. Alcohol leads to many health problems, can often make the drinker violent or just plain stupid in regard as to how they act. Medical marijuana is an all natural holistic approach to medicine. It's safe, encourages recovery, peace and happiness with no hangover or lowered social inhibitions (ie: sleeping around with promiscuous women, fighting etc.). It's just as easy for someone to grab a few drinks before work or during their lunch break or after work for that matter leaving the drinker a dangerous mess on the highways. It's time people understood that the majority of medicinal marijuana users use this medication for relief and are responsible. I do not smoke until I have completed all errands, work etc. Medicinal marijuana is to be used as a positive remedy to alleviate a variety of diseases from pain related injuries to social phobias, anxiety to depression, stress relief to insomnia along with a myriad of other medical problems. It's time to come together as a responsible, educated collective group and let it be known that there is nothing bad or criminal against smoking an herb that is 100 percent natural and grows from mother earth. Medical marijuana is truly a gift if used in a responsible manner and is not a gateway drug. If you're looking for a gateway drug then lets point the finger at alcohol which has been responsible for many divorces, violent acts, and in some tragic cases even death. We must remain on the educated/ enlightened path and use this medicine for what nature intended, hope and a general sense of well being and a shared concern for the well being of our brothers and sisters on planet earth.",
            "username": "TheWord"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1633051,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "a perfect blend of energy and chill.",
            "username": "LedgeTheOrc"
        }
    ],
    "id": 160,
    "name": "Sour OG",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 17.049458667377138
        },
        {
            "name": "Dry Eyes",
            "score": 16.15263884515707
        },
        {
            "name": "Anxious",
            "score": 10.121127715745876
        },
        {
            "name": "Paranoid",
            "score": 5.274008767893042
        },
        {
            "name": "Dizzy",
            "score": 3.2570784992854893
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/sour-diesel",
            "category": "Sativa",
            "name": "Sour Diesel",
            "permalink": "https://mobileapi.leafly.com/sativa/sour-diesel",
            "slug": "sour-diesel",
            "subtitle": null,
            "symbol": "Sd"
        },
        {
            "applink": "leafly://strain/og-kush",
            "category": "Hybrid",
            "name": "OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/og-kush",
            "slug": "og-kush",
            "subtitle": null,
            "symbol": "Ogk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/sour-og",
    "photoTotalCount": 186,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005515/b/sour-og__primary_583c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-og_100x100_465c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000431/b/sour-og__primary_db23.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-og_100x100_f153.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/663949/b/sour-og__primary_8425.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-og_100x100_e2e6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/655050/b/sour-og__primary_0fd7.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-og_100x100_36b5.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/647729/b/sour-og__primary_a4b7.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-og_100x100_0e34.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636046/b/sour-og__primary_5aa5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-og_100x100_dee0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Los Angeles, CA",
        "Denver, CO",
        "Portland, OR",
        "Detroit, MI",
        "Ann Arbor, MI",
        "Montréal, QC",
        "Phoenix, AZ",
        "Toronto, ON",
        "Vancouver, BC",
        "Calgary, AB"
    ],
    "rating": 4.38,
    "relatedStrains": [],
    "reviewCount": 607,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "sour-og",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.37561779242175/240",
    "subtitle": null,
    "symbol": "Sog",
    "symptoms": [
        {
            "name": "Depression",
            "score": 31.632596216726817
        },
        {
            "name": "Stress",
            "score": 27.99227359701601
        },
        {
            "name": "Pain",
            "score": 27.298956087872696
        },
        {
            "name": "Lack of Appetite",
            "score": 21.140843364739506
        },
        {
            "name": "Headaches",
            "score": 14.20292101630053
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
