{"sl_translate":"description,descriptionPlain,category","id":232977,"slug":"cello-sweet-og","name":"Cello Sweet OG","subtitle":null,"symbol":"Csw","category":"Hybrid","description":"\u003cp\u003e\u003ca href=\"https://coloradoseedinc.com/\"\u003eColorado Seed Inc.\u003c/a\u003e pays homage to new school and old school genetics in Cello Sweet OG. This cross combines DJ Short\u0026rsquo;s \u003ca href=\"https://www.leafly.com/hybrid/flo\"\u003eFlo\u003c/a\u003e, a living cannabis virtuoso, and Secret Garden OG, CO Seed\u0026rsquo;s Kush\u0026nbsp;bomb, to create a connoisseur-quality strain with potency and dimension. With effects that range from cerebral to sedative, this strain contains movements like a symphony, rising into a meditative mind with a decrescendo into full-body relaxation.\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Colorado Seed Inc. pays homage to new school and old school genetics in Cello Sweet OG. This cross combines DJ Short\u0026rsquo;s Flo, a living cannabis virtuoso, and Secret Garden OG, CO Seed\u0026rsquo;s Kush\u0026nbsp;bomb, to create a connoisseur-quality strain with potency and dimension. With effects that range from cerebral to sedative, this strain contains movements like a symphony, rising into a meditative mind with a decrescendo into full-body relaxation.\n\n\u0026nbsp;\n","aka":null,"rating":4,"highlightedReviews":[{"id":1306436,"username":"GLaD0S","text":"A little bit skunky, very sweet, somewhat piney, has a good mix between euphoric and relaxing.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1359611,"username":"Glowteck","text":"Pretty good shit. Not my favorite, but can be used to get through the day. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3379","title":"New Strains Alert: Purple People Eater, Diamond Socks, Bloo\u0027s Kloos, and More","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1468021500000)\/","text":"This week’s New Strains Alert is part old school and part new school genetics, many of which were submitted by Leafly users. These cannabis strains illustrate how we, the cannabis community, appropriate parts of our history—whether from television or music, art or science, we pay homage to the green giants whose shoulders we stand upon. Leafly is growing thanks to you: the farmer, the scientist, the lawyer, the activist, the outspoken, the patient, the connoisseur. With the 4th of July behind us and 710 in front of us, the cannabis community has plenty of reasons to keep celebrating. Cheers!\n  Cello Sweet OG\n\nColorado Seed Inc. pays homage to new school and old school genetics in Cello Sweet OG. This cross combines DJ Short’s Flo, a living cannabis virtuoso, and Secret Garden OG, CO Seed’s Kush bomb, to create a connoisseur-quality strain with potency and dimension. With effects that range from cerebral to sedative, this strain contains movements like a symphony, rising into a meditative mind with a decrescendo into full-body relaxation.\n\n \n  Bloo\u0027s Kloos\n\nBloo’s Kloos is a playful indica with a carefree buzz that encourages laughter. This three-way cross of Larry OG, Blueberry, and Northern Lights imbues Bloo\u0027s with earthy and fruity terpenes that turn sweet when consumed. Created by Mr. Mack out of Las Vegas, this strain leaves the mind clear and the body free of aches and pains.\n\n \n  Diamond Socks\n\nDiamond Socks, named for the dense layer of trichomes coating the plant (and a juicy reggae track), is an invigorating hybrid with roots in a rare strain of Hawaiian Silverback. The structure and growth pattern is indicative of its Kush genetics, leading to a handsome yield and aromatic floral overtones. Hit this mid-range flower for a buzz that is active in the mind and relaxed in the body. This strain is another Hawaiian rarity stabilized and transplanted by Colorado Seed Inc.\n\n \n  Purple People Eater\n\nPurple People Eater is the lanky indica-dominant cross of (Lapis Mnt. Indica x GDP) x (Afghan x Purple Urkle) that has been known to produce green and purple buds that smell pungent and earthy. These multifaceted buds are herbaceous with a flavor of sweet grape. Enjoy this strong sedative at the end of the day to soothe physical discomfort and restlessness.\n\n \n  Mekamika Haze\n\nMekamika Haze won Best Sativa at the 2015 Amsterdam Unity Cup. This pure landrace sativa supposedly hails from the Amazon and shares genetics with another mysterious strain, Mango Rossa (Manga Rosa from Brazil). The bright, lanky sativa is a challenge to grow, but attentive farmers are rewarded with beautiful buds that smell of tropical citrus and mango with pungent, earthy undertones.\n\n \n  Frisian Duck\n\nFrisian Duck is a structurally unique strain developed by Dutch Passion. Its genetics were bred over several generations of Frisian Dew x Duckfoot. The genetics from Duckfoot (named for its oddly shaped leaves that resemble duck feet) allows this plant to hide in plain sight, making it ideal for outdoor grows. Frisian Duck is also rather hardy and able to thrive in harsh growing conditions. Expect pepper and pine on the nose with buds that vary in appearance from light blue to purple.\n\n \n  Secret Garden OG\n\nSecret Garden OG is a Colorado Seed Inc. masterpiece. This OG strain is incredibly relaxing and dedicated to Kush fans everywhere. The blend of Lavender parentage against a Ghost OG Moonshine x Rug Burn OG foretells the weight this strain applies to muscles throughout the body. With a unique aroma that leans toward the therapeutic, Secret Garden OG offers a cozy sense of well-being that extends to mood elevation and pain relief.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12002330/new-strains-alert-purple-people-eater-diamond-socks-bloos-kloos-a.png","urlslug":"/news/strains-products/new-strains-alert-purple-people-eater-diamond-socks-bloos-kloos-a"}],"reviewCount":4,"flavors":[{"name":"Sweet","score":12.5},{"name":"Spicy/Herbal","score":6.25},{"name":"Pineapple","score":6.25},{"name":"Tree Fruit","score":6.25},{"name":"Honey","score":6.25}],"effects":[{"name":"Sleepy","score":12.5},{"name":"Relaxed","score":12.5},{"name":"Uplifted","score":6.25},{"name":"Creative","score":6.25},{"name":"Euphoric","score":6.25}],"symptoms":[{"name":"Fatigue","score":12.5}],"conditions":[{"name":"Anxiety","score":6.25}],"negatives":[{"name":"Dizzy","score":6.25}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cello-sweet-og_100x100_9a17.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/638162/b/cello-sweet-og__primary_1012.jpg"}],"photoTotalCount":1,"popularCities":["Detroit, MI"],"permalink":"https://mobileapi.leafly.com/hybrid/cello-sweet-og","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Flo","subtitle":null,"slug":"flo","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/flo","symbol":"Flo","applink":"leafly://strain/flo"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
