{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1513710785000)/",
            "id": "contentitems-52310",
            "text": "Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis flower products of 2017. How many have you tried? What was your favorite flower of 2017? Share with us in the comments below!\n\nChocolope by Gabriel\nAvailable in: Washington\nChocolope’s bright and dreamy sativa effects are magnified by the exceptional grow practices laid out in Gabriel’s airtight facilities. Their cultivation rooms are sealed from the outside, offering perfect environmental control that is carefully manipulated to stimulate the growth of the best quality flower.\nAlso featured in:\n\nWhat Are You Smoking? Episode 15\nWashington’s Best Tasting Strains From Fall 2017\n\nKosher Kush by Santa Cruz Veteran’s Alliance\nAvailable in: California\nThe high-THC indica Kosher Kush is the perfect strain to crush symptoms of PTSD, and the Santa Cruz Veteran’s Alliance—owned and operated by military veterans—produces this pain-relieving strain for those suffering. We love that members are offered free cannabis grown by fellow veterans in rooms meant to exude peace as the cannabis flower blooms.\nAlso featured in: The VA Can’t Provide Cannabis to Veterans With PTSD, so This Group Gives It Out for Free\nDutchberry by Artizen\nAvailable in: Washington\nWith around 27% THC to 8% CBD, the cheerful hybrid Dutchberry boasts one of the highest cannabinoid contents of all time. To house such a powerhouse strain, Artizen moves in tandem with their flower from growth to packaging—and delivers some excellent buds. We love that they slow down and take a little time with their cannabis crops from start to finish.\n\nPineapple by Fire Bros.\nAvailable in: Washington\nA Seattle favorite, Fire Bros. works with their own phenotypes to produce the most effective cannabis flower for consumers. For an uplifting hybrid strain such as Pineapple, stress-relieving characteristics are an important facet enhanced by Fire Bros.’ hand-selection process.\nHybrid Blend by Lowell Farms\nAvailable in: California\nLowell Farms, which works exclusively with flower, offers seasonal blends of their best strains, and we can’t get enough of their hybrid pre-rolls. We appreciate that they’re thinking outside the box in focusing on balanced flower mixes rather than strain-specific products. Grown in organic fertilizer free of pesticides, Lowell takes pride in their dedication to all-natural cannabis as well as in providing good wages for their workers.\nAlso featured in: What Are You Smoking? Episode 3\nZkittlez by Royal Choice Farms\nAvailable in: Arizona\nArizona does not require pesticide testing for cannabis, so it’s all the more important to find a grower you can trust. Royal Choice Farms chose to be an all-organic operation built on a whole lot of love and no pesticides. By instating natural grow methods, Royal Choice keeps our minds at ease when we’re lighting up their sweet indica Zkittles.\n\nCBD Blue Shark by Marley Natural Red\nAvailable in: California, Oregon, Washington*\nWith a full cannabis operation dedicated to Jamaica’s rich culture, Marley Natural hits it out of the park with their hand-selected flower line—notably, the anti-inflammatory and CBD-rich hybrid CBD Blue Shark. Cultivated by independent growers, we love Marley Natural’s dedication to craft cannabis, their commitment to sustainable growing practices, and their RISE UP social justice program.\nBlack Cherry Soda by Royal Tree Gardens\nAvailable in: Washington\nHaving built a facility from the ground up, Washington’s Royal Tree Gardens is a company steeped in perseverance. Licensed since 2014, Royal Tree Farms has been producing fantastic cannabis ever since, and their sativa-dominant Black Cherry Soda is no exception. We’ve been packing our bowls with this strain for its potent relief, particularly for the medical patients among us.\nDo-Si-Dos by Matrix NV\nAvailable in: Nevada\nOne of the best in medical-grade cannabis production, Nevada’s Matrix NV keeps their focus on the people who will consume their products, and that’s why we love them. Their flower, including the deliciously heavy indica Do-Si-Dos, is cared for by a team of passionate people who use purified and organic products to cultivate their hand-trimmed flower collection.\nAlso featured in: Leafly TV’s Growers: Episode 101\n\nOrange Blossom by Falcanna\nAvailable in: Washington\nA small medical operation turned Tier III licensed producer, Falcanna has seen it all when comes to cannabis—from the garden to the shop. Their dedication to the herb started as a dream between founders Bethany and Justin Rondeau and turned into a full grow facility delivering exceptional cannabis across Washington State. Their bright, floral hybrid Orange Blossom is as tasty as it is elevating and provides a perfect example of their dedication to quality flower.\nWhite Tahoe Cookies by Archive Portland\nAvailable in: Oregon\nWith multiple awards under their belt, Archive Portland boasts a team of growers with over 35 years of collective cannabis growing experience. That dedication to quality trickles down to the buds, where the exceptional indica White Tahoe Cookies takes on a smooth sedative high that keeps us coming back for more.\nLemonder by Seattle’s Private Reserve\nAvailable in: Washington\nWe save Seattle’s Private Reserve flower for special occasions; grown in a facility that is tightly sealed and meticulously controlled, the euphoric hybrid Lemonder has found its way into our stash boxes and smoke circles throughout 2017. SPR’s rigorous testing of all their cannabis products lets us consume with full peace of mind.\nLead image by Nastasic/iStock\n*Editor’s note: Leafly and Marley Natural are owned by the same parent company. Also, Marley Natural Red is available in California, Oregon, and Washington but may be a different high-CBD strain in each market.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/19103646/leafly-faves-flower.jpg",
            "title": "Leafly’s Faves 2017: Flower",
            "urlslug": "/news/strains-products/leaflys-faves-2017-flower"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1504038854000)/",
            "id": "contentitems-39649",
            "text": "Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Pineapple Kush was first produced by crossing Pineapple with Master Kush. Kush strains are generally known for their pungent, piney aroma, and this cross sweetens the flavor with tropical notes. This popular Kush variety offers a quality cerebral high with uplifting effects that allow the consumer to stay active and engaged.\nGrow Techniques: Overall, Pineapple Kush is an easy strain for novice growers. Keep it indoors to provide an ideal climate, and try growing in soil or hydroponically. Consider using the SOG (sea of green) method while keeping the plants tightly pruned to direct growth to the top colas. To keep plants from falling over, trellis for support as the buds put on density.\nFlowering Time: 8 weeks\nYield: Moderate to high\nGrow Difficulty: Easy to moderate\nClimate: Unlike some Kush strains, Pineapple Kush can handle higher humidity levels without having issues with mold. It prefers a temperature between 68 and 80 degrees Fahrenheit.\nIndoor/Outdoor: Pineapple Kush does best indoors in a controlled climate.\nFeeding: Like all OG varieties, feed on the heavier side. Go heavy on the CalMag and top dress the soils with phosphorus-rich nutrients when going into flowering.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/30105221/pineapple-kush-strain.jpg",
            "title": "Tips for Growing Pineapple Kush Cannabis",
            "urlslug": "/news/growing/how-to-grow-pinapple-kush-marijuana"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 33.85887270268609
        },
        {
            "name": "PTSD",
            "score": 23.071485647550556
        },
        {
            "name": "ADD/ADHD",
            "score": 16.772696539430818
        },
        {
            "name": "Bipolar Disorder",
            "score": 14.558362529964963
        },
        {
            "name": "Migraines",
            "score": 14.27561620259389
        }
    ],
    "description": "<p>Pineapple was developed by selecting a phenotype of <a href=\"http://www.leafly.com/hybrid/ed-rosenthal-super-bud\">Ed Rosenthal&rsquo;s Super Bud (ERSB)</a> that expressed predominantly <a href=\"http://www.leafly.com/indica\">indica</a> traits and had intense <a href=\"http://www.leafly.com/explore#!/explore/flavors-tropical\">tropical</a> flavors. After generations of inbreeding, the strain developed a sturdy structure and more pronounced flavors of <a href=\"http://www.leafly.com/explore#!/explore/flavors-pineapple\">pineapple</a> and <a href=\"http://www.leafly.com/explore#!/explore/flavors-diesel\">diesel</a>. The buds take on a bulbous shape that, in a way, resemble the fruit. A perfect strain for <a href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\">stress relief</a>, Pineapple will transport you to your <a href=\"http://www.leafly.com/explore#!/explore/tags-happy\">happy</a> place, leaving you <a href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\">uplifted</a> and <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\">relaxed</a>.</p>\n",
    "descriptionPlain": "Pineapple was developed by selecting a phenotype of Ed Rosenthal&rsquo;s Super Bud (ERSB) that expressed predominantly indica traits and had intense tropical flavors. After generations of inbreeding, the strain developed a sturdy structure and more pronounced flavors of pineapple and diesel. The buds take on a bulbous shape that, in a way, resemble the fruit. A perfect strain for stress relief, Pineapple will transport you to your happy place, leaving you uplifted and relaxed.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 62.96637777368001
        },
        {
            "name": "Euphoric",
            "score": 58.49007314524556
        },
        {
            "name": "Relaxed",
            "score": 50.052246603970744
        },
        {
            "name": "Uplifted",
            "score": 35.793533714426204
        },
        {
            "name": "Focused",
            "score": 35.343290921384224
        }
    ],
    "flavors": [
        {
            "name": "Pineapple",
            "score": 47.98696908230377
        },
        {
            "name": "Tropical",
            "score": 23.86133136640236
        },
        {
            "name": "Sweet",
            "score": 23.162148872088018
        },
        {
            "name": "Citrus",
            "score": 18.719650869752286
        },
        {
            "name": "Earthy",
            "score": 13.91910996373471
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1416929,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Finding a strain that treats lethargic depression and boosts energy without triggering anxiety or paranoia is a challenge, especially when you're prone to cannabis-induced anxiety.  Enter Pineapple: my current superhero strain. \n\nPineapple provides a cheerful, energetic high without the racing thoughts or paranoia of some sativa-dominant strains.   (I get full-blown panic attacks from many strains but this one does not cause them in any setting).  It's ideal for afternoon use when you need a little pick-me-up.  Best of all, it doesn't cause drowsiness or have a sedating comedown.  Score!\n\nThe smell and smoke thickness are not the greatest, but maybe my batch was just dried/cured improperly.  That's why I gave it 4 stars instead of 5.\n\nIf I had to sum up this strain in 5 words, they would be:  \n\n- Happy\n- Mellow\n- Invigorating\n- Sunny \n- Cerebral\n\nI look forward to trying the other Pineapple strains (Pineapple Express & Golden Pineapple are high on the list).  If they're anything like this gem, they'll be worth every penny.",
            "username": "SeasideSuicide"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1642294,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Great strain to grow. Super easy. 44g dry yield in 2gal soil under shared 600w MH/HPS. Great tasting smoke and amazing \"peaches and creme\" bag appeal. Tight nuggs",
            "username": "MitchSpeedman"
        }
    ],
    "id": 239,
    "name": "Pineapple",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 24.58817382752474
        },
        {
            "name": "Dry Eyes",
            "score": 15.392771528674166
        },
        {
            "name": "Anxious",
            "score": 8.914192636302168
        },
        {
            "name": "Paranoid",
            "score": 7.947630462843444
        },
        {
            "name": "Dizzy",
            "score": 4.918864097363083
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/ed-rosenthal-super-bud",
            "category": "Hybrid",
            "name": "Ed Rosenthal Super Bud",
            "permalink": "https://mobileapi.leafly.com/hybrid/ed-rosenthal-super-bud",
            "slug": "ed-rosenthal-super-bud",
            "subtitle": null,
            "symbol": "Ed"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/pineapple",
    "photoTotalCount": 122,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/652970/b/pineapple__primary_4929.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple_100x100_4f36.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/637674/b/pineapple__primary_91ab.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple_100x100_f0d3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/634192/b/pineapple__primary_4eb7.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple_100x100_748a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/619125/b/pineapple__primary_ccf3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple_100x100_03ea.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/611765/b/pineapple__primary_8d24.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple_100x100_6fe8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/610445/b/pineapple__primary_607b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple_100x100_2ad8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Los Angeles, CA",
        "Denver, CO",
        "Vancouver, BC",
        "Seattle, WA",
        "Calgary, AB",
        "Montréal, QC",
        "Detroit, MI",
        "Las Vegas, NV",
        "Spokane, WA"
    ],
    "rating": 4.22,
    "relatedStrains": [],
    "reviewCount": 463,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "pineapple",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.21814254859611/240",
    "subtitle": null,
    "symbol": "Pin",
    "symptoms": [
        {
            "name": "Stress",
            "score": 40.98899747986969
        },
        {
            "name": "Depression",
            "score": 38.99901653451349
        },
        {
            "name": "Pain",
            "score": 22.46296637777368
        },
        {
            "name": "Fatigue",
            "score": 18.764214149609685
        },
        {
            "name": "Headaches",
            "score": 10.712090478824758
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
