{
    "aka": "Sour Purple Urkle, Sour Urkel, Sour Erkle, Sour Erkel",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1511894705000)/",
            "id": "contentitems-49877",
            "text": "As we explored recently with our list of 9 Most Overhyped Cannabis Strains, a few of the best-known cannabis varieties on the market are a little overrated. Correspondingly, it’s no surprise that there are some underrated cannabis strains out there, too.\n\nThe following represent 11 varieties of cannabis that we think get less love than they deserve, based on Leafly review data, regional availability, and the personal experiences of our cannabis expert team. This is far from an exhaustive list—with thousands of strains available in the world, it’s virtually impossible to give all of them the attention we wish we could. Nevertheless, take the following as just a few recommendations of lesser-known types you should keep an eye out for—who knows? You just might find your new favorite strain among them.\nTahoe OG Kush\nStrain type: Hybrid\nParent strains: OG Kush, SFV OG Kush\nWhy it’s underrated: “Tahoe OG isn’t underrated in the traditional sense of the word. In fact, most people I know who’ve come across this select OG Kush phenotype will share their excitement for the pungent, piney sweetness and the strain’s dynamic mix of deep relaxation and profound euphoria. However, when I think of the OG family tree, the Tahoe cut doesn’t seem to get quite the same notoriety that some of its relatives. The SFV, Larry, and Fire OGs manage to capture a lot of the buzz, while other cuts, like the Ghost and WiFi OGs, have somewhat cult followings. This leaves room for Tahoe OG to stand on its own, which is OK by me. I love its dank, complex aroma and the sedating effects, so the less hype there is for Tahoe OG, the more of this delicious strain is available for me!” —Will Hyde\n\nLodi Dodi\nStrain type: Hybrid\nParent strains: Undisclosed\nWhy it’s underrated: “This strain is a mainstay in the Pacific Northwest, but still flies beneath the radar outside the region. Sativa-dominant in effect, this unknown cultivar has been propagated throughout the Evergreen State for decades. Lodi Dodi’s airy physical lightness and uplifting mental buzz allow the consumer to metaphorically levitate two inches above their problems and their pain. I personally enjoy working out after consuming this strain for its stimulating aura and a mental haze that allows me to fade into my headphones and run forever. It’s equally satisfying on the dancefloor or in the bedroom, as long as you mind your dosage. Lodi Dodi came to party—it don’t cause trouble or bother nobody.” —Jeremiah Wilhelm\nChocolope Kush\nStrain type: Hybrid\nParent strains:  Chocolope, Kosher Kush\nWhy it’s underrated: “This is, weirdly, one of the lowest-rated strains on Leafly (yep, a four-star rating is on the low end—Leafly reviewers give most cannabis pretty high marks), but riddle me this: How can a marriage of superstars like Chocolope and Kosher Kush possibly be bad? Those parent strains are two of our all-time faves (in fact, both landed on our Top 100 Strains list) and given that the apple rarely falls far from the tree, this super-low rating for Chocolate Kush is undeserved.” —Brett Konen\n\nDancehall\nStrain type: Hybrid\nParent strains: Juanita La Lagrimosa, Kalijah\nWhy it’s underrated: “Dancehall is an exceptional CBD-dominant strain that doesn’t get much recognition by comparison to CBD hallmarks like Harlequin, ACDC, Charlotte’s Web, and Cannatonic. With a near 21:1 CBD:THC ratio, Dancehall delivers soothing, easygoing effects with just enough sativa-dominant influence to elevate mood, which makes it a constant companion for consumers who like to stay level and clearheaded while enjoying cannabis. The terpene profile also offers deeper, skunkier notes than the usual grassy, hay-like aroma CBD strains are known for. Whether you’re enjoying it for what it is, or blending with your THC-dominant strains, Dancehall adds something special and drastically underappreciate to any joint or bowl.” —Jeremiah Wilhelm\nBay Dream\nStrain type: Sativa\nParent strains: Blue Dream, Bay 11\nWhy it’s underrated: “Bay Dream is an uplifting strain with sharp citrus notes and subtle earthiness. It seems to be overlooked because of its polarizing parent strain, Blue Dream, but in combination with the sweet, skunky flavors and focused headspace of Bay 11 the mix is a pleasant surprise. I appreciate that Bay Dream trades some of Blue Dream’s fruit notes for a deeper, more poignant Kush-like palate of flavors. So, if you’re in the ‘Blue Dream is overrated’ crowd, don’t shy away from Bay Dream—you might be amazed by how much this strain expresses its individuality.” —Will Hyde\n\nSour Urkle\nStrain type: Hybrid\nParent strains: Sour Diesel, Purple Urkle\nWhy it’s underrated: “Sour Urkle is the potent union of pungent, polar opposites. Created from Sour Diesel and Purple Urkle, this funky and surprisingly affordable bud packs the best of both strains into one frosty package. This strain emits an odd floral and chemical aroma that is contrasted against a latent but tangible sweetness brought forth by the fruitiness of Purple Urkle. This flavor profile can be challenging for some, but the effects are undeniably heady while draping the body in a soothing, mellow aura.” —Jeremiah Wilhelm\nPresidential Kush\nStrain type: Indica\nParent strains: Bubble Gum, OG Kush\nWhy it’s underrated: “Easily one of the more picturesque strains I’ve come across, Presidential Kush (also known as Presidential OG) expresses itself with deep green and purple hues. A thick blanket of trichomes adds another dimension to the strain’s aesthetic, but PK is so much more than just a pretty flower. It’s a potent, complex, and flavorful experience that only takes a puff or two before you feel the comforting weight of deep relaxation wash over you. The piney, diesel flavors make it hard to put down, and I still find myself embarking on epic journeys just to track down this beautiful bud. In my opinion, genetics this compelling should be easier to find and should be garnering more attention in the cannabis community, so for that reason, I’d like to encourage more growers to add this strain to their stable, and if you find it at your local dispensary as a consumer, definitely do not overlook it!” —Will Hyde\n\nDurban Poison\nStrain type: Sativa\nParent strains: African\nWhy it’s underrated: “Landrace strains, including Durban Poison, are hard to find and often faked. As such, many people have had a less-enjoyable-than-average experience with a strain they believed, mistakenly, to be the landrace advertised on the packaging. Durban Poison is a fantastic pure sativa that many people, including myself, loved at first smoke, so if Durban Poison didn’t wow you the first time around, give it another chance—that first batch might have been something else that was merely masquerading as this iconic strain.” —Brett Konen\nApple Jack\nStrain type: Hybrid\nParent strains: Jack Herer, White Widow\nWhy it’s underrated: “Apple Jack hasn’t gained much in the way of ratings on Leafly, but that doesn’t mean it’s a dud. It blends two well-known cuts together (Jack Herer x White Widow) to create something greater than the sum of its parts. Apple Jack’s initially clear-headed high relieves stress while elevating the mind and encouraging creativity. The happy effects and accessible THC concentration make it a friendly flower for consumers of all potency levels. And even though its flavor doesn’t always live up the name, Apple Jack’s sweet, earthy terpene profile still offers satisfying flavors alongside a productive buzz.” —Jeremiah Wilhelm\n\nPlushberry\nStrain type: Indica\nParent strains: Black Cherry Soda, Space Queen\nWhy it’s underrated: “Plushberry is an incredible strain that’s underrated simply because it hasn’t appeared to travel beyond the Pacific Northwest. Wrapped in beautiful lavender foliage, it smells like sweet wildflowers and mixed berries, and if you have the chance to try it while you’re in the area, Plushberry is a strain you won’t soon forget.” —Bailey Rahn\nSkunk No. 1\nStrain type: Hybrid\nParent strains: Afghani, Acapulco Gold, Colombian Gold\nWhy it’s underrated: “Even if you don’t love the flavor of the flower itself, you’ve got to respect a strain that’s given us so many of our favorites on the market—I’m talking Green Crack, Island Sweet Skunk, Amnesia, Pineapple Chunk, UK Cheese, and so many more. Skunk No. 1 is a true original among cannabis strains, and while its skunky flavor is an acquired taste, you’re smoking a piece of history with Skunk No. 1—so respect your elders.” —Brett Konen",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/28103218/most-underrated-cannabis-strains.jpg",
            "title": "11 Unsung Cannabis Strains Worth Discovering",
            "urlslug": "/news/strains-products/11-underrated-marijuana-strains"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1425661200000)/",
            "id": "contentitems-3373",
            "text": "This week's new strains are in, Professor Chaos is here to bring destruction to your pain, and those needing a lesson in relaxation may consult Dr. Funk. You novelty-seekers are probably wondering what Pineapple Dog Shit is all about — it's likely the only strain on this list with a more unusual flavor combination than Cheese Candy.\nWe're pleased to inform our friends in Oregon that many of these strains are available right out your back door in Portland (be sure to say hello to the good folks of Oregon House of Herbs for us!). As for the rest of you non-Oregon folks, check the \"Availability\" tab on their strain pages to see if any of these varieties are offered in your area.\n \n   1. Professor Chaos\nCharacteristics of Professor Chaos:\n\nProfessor Chaos is what you get when you combine the malevolent forces of Mad Scientist and Jack the Ripper, two strains that balance energy with merciless painkilling properties. This 65/35 sativa-dominant hybrid from TGA Genetics has a sour, spicy aroma that introduces its clear-headed effects perfect for patients needing a potent medicine without sacrificing productivity. Its buds form knobby, finger-like calyxes covered in a snow-like layer of crystal trichomes in a show of Professor Chaos’ supervillain strength.\n\n \n   2. Dr. Funk\nCharacteristics of Dr. Funk:\n\nDr. Funk is a mostly indica strain that balances genetics from Blueberry and Bubba Kush. You can taste this strain’s lineage as flavors of sweet berry and earthy sharpness activate on the exhale. Its tight, compact buds and orange hair-like pistils are obscured under a thick dusting of crystal trichomes, which hint at Dr. Funk’s potency.\n\nAvailable at Oregon House of Herbs\n \n   3. Ice Queen\nCharacteristics of Ice Queen:\n\nIce Queen is a hybrid strain that crosses White Widow and Cinderella 99 in a sativa-heavy blend fit for royalty. Its light, loose buds are powdered with frost-like resin that blankets the buds like fresh snowfall. One whiff of Ice Queen fills your nose with a sweet bouquet of lavenderrose aromas accented by subtle pepper notes. Another variety of Ice Queen was once bred by No Mercy Seeds, who combined Master Ice and Valley Queen; however, you may find this rendition harder to come by in today’s market.\n\nAvailable at Oregon House of Herbs\n \n   4. Paris XXX\nCharacteristics of Paris XXX:\n\nParis XXX is an extension of the Paris OG family that has placed in multiple Cannabis Cup competitions. This indica variety combines Headband OG, Chemdawg, and OG Kush genetics, creating a crisp, piney, and woody flavor on inhale. The fast-acting effects provide a balance of cerebral stimulation and full-body relaxation. Paris XXX is known to increase your appetite while also sparking creativity.\n\n \n   5. Pineapple Dog Shit\nCharacteristics of Pineapple Dog Shit:\n\nPineapple Dog Shit is a hybrid strain that may not sound appetizing, but its elite parentage of Pineapple Punch and Chemdawg 4 is enough to draw connoisseurs of old school genetics. Its name is derived from its sour, tar-like aroma that could arguably be compared to canine byproduct, but one look at this hybrid’s knobby, dense, crystal-covered buds may convince you to push past its unconventional aroma. For those of you less interested in the novelty of Pineapple Dog Shit, we reassure you that the taste is a more pleasant blend of sweet tropical and citrus flavors.\n\nAvailable at Oregon House of Herbs\n \n   6. Sour Urkle\nCharacteristics of Sour Urkle:\n\nSour Urkle is a hybrid cannabis strain that unites Sour Diesel and Purple Urkle, whose opposing sativa and indica genetics meet in a balanced and flavorful fusion. Hints of berry fight through the dominant skunky diesel smell of Sour Urkle, creating a complex aroma that will have you fighting your friends for the first taste. Its dense, rounded buds are caked in crystal-tipped trichomes that try their best to hide Sour Urkle’s deep purple coloration to no avail.\n\nAvailable at Oregon House of Herbs\n \n   7. Cheese Candy\nCharacteristics of Cheese Candy:\n\nCheese Candy by Delicious Seeds is the hybrid lovechild of Cheese and Caramelo, a combination of parent strains that results in an unusual fusion of sweet candy and sharp cheese flavors. The sweet and sour aroma is accented by flowery, fruity flavors which usher in Cheese Candy’s deeply relaxing characteristics. Its long, slender buds are wrapped in fiery orange hairs that stand in vibrant contrast to this hybrid’s sage green hues.\n\nAvailable at Oregon House of Herbs",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/03/12002322/new-strains-alert-professor-chaos-ice-queen-sour-urkle-cheese-can.png",
            "title": "New Strains Alert: Professor Chaos, Ice Queen, Sour Urkle, Cheese Candy, and More",
            "urlslug": "/news/strains-products/new-strains-alert-professor-chaos-ice-queen-sour-urkle-cheese-can"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 8.423913043478262
        },
        {
            "name": "PTSD",
            "score": 7.336956521739131
        },
        {
            "name": "Fibromyalgia",
            "score": 6.25
        },
        {
            "name": "Bipolar Disorder",
            "score": 3.260869565217391
        },
        {
            "name": "Arthritis",
            "score": 2.1739130434782608
        }
    ],
    "description": "<p>Sour Urkle is a <a href=\"http://www.leafly.com/explore/category-hybrid\">hybrid</a> cannabis strain that unites <a href=\"http://leafly.com/sativa/sour-diesel\">Sour Diesel</a> and <a href=\"http://www.leafly.com/indica/purple-urkle\">Purple Urkle</a>, whose opposing <a href=\"http://www.leafly.com/explore/category-sativa\">sativa</a> and <a href=\"http://www.leafly.com/explore/category-indica\">indica</a> genetics meet in a balanced and flavorful fusion. Hints of <a href=\"http://www.leafly.com/explore/flavors-berry\">berry</a> fight through the dominant <a href=\"http://www.leafly.com/explore/flavors-skunk\">skunky</a> <a href=\"http://www.leafly.com/explore/flavors-diesel\">diesel</a> smell of Sour Urkle, creating a complex aroma that will have you fighting your friends for the first taste. Its dense, rounded buds are caked in crystal-tipped <a href=\"http://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\">trichomes</a> that try their best to hide Sour Urkle&rsquo;s deep purple coloration to no avail.</p>\n",
    "descriptionPlain": "Sour Urkle is a hybrid cannabis strain that unites Sour Diesel and Purple Urkle, whose opposing sativa and indica genetics meet in a balanced and flavorful fusion. Hints of berry fight through the dominant skunky diesel smell of Sour Urkle, creating a complex aroma that will have you fighting your friends for the first taste. Its dense, rounded buds are caked in crystal-tipped trichomes that try their best to hide Sour Urkle&rsquo;s deep purple coloration to no avail.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 30.163043478260867
        },
        {
            "name": "Uplifted",
            "score": 17.391304347826086
        },
        {
            "name": "Happy",
            "score": 15.489130434782608
        },
        {
            "name": "Focused",
            "score": 14.673913043478262
        },
        {
            "name": "Hungry",
            "score": 13.858695652173914
        }
    ],
    "flavors": [
        {
            "name": "Flowery",
            "score": 13.043478260869565
        },
        {
            "name": "Diesel",
            "score": 11.141304347826086
        },
        {
            "name": "Earthy",
            "score": 8.967391304347826
        },
        {
            "name": "Citrus",
            "score": 7.880434782608695
        },
        {
            "name": "Grape",
            "score": 7.336956521739131
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png",
            "id": 1409862,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/3/240",
            "text": "One of the most flavorful hybrids i have tried so far and i have had my fair share of hybrids. Nice relaxing body high,  easy head high,  but effects last only about 30 minutes or so for the veteran user. I would recommend for beginners.",
            "username": "BunnyBear420"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1606382,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Pretty good high had me uplifted n vibin with music good for stress or lack of appetite ",
            "username": "asapmarky14"
        }
    ],
    "id": 144047,
    "name": "Sour Urkle",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 11.141304347826086
        },
        {
            "name": "Anxious",
            "score": 6.25
        },
        {
            "name": "Dry Eyes",
            "score": 2.717391304347826
        },
        {
            "name": "Dizzy",
            "score": 0.5434782608695652
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/sour-diesel",
            "category": "Sativa",
            "name": "Sour Diesel",
            "permalink": "https://mobileapi.leafly.com/sativa/sour-diesel",
            "slug": "sour-diesel",
            "subtitle": null,
            "symbol": "Sd"
        },
        {
            "applink": "leafly://strain/purple-urkle",
            "category": "Indica",
            "name": "Purple Urkle",
            "permalink": "https://mobileapi.leafly.com/indica/purple-urkle",
            "slug": "purple-urkle",
            "subtitle": null,
            "symbol": "Pu"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/sour-urkle",
    "photoTotalCount": 22,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/675153/b/sour-urkle__primary_0172.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-urkle_100x100_b673.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/631828/b/sour-urkle__primary_9b55.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-urkle_100x100_593a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/566651/b/sour-urkle__primary_5da9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-urkle_100x100_a2d0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/489363/b/sour-urkle__primary_ed80.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-urkle_100x100_5bb2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/472525/b/sour-urkle__primary_77a9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-urkle_100x100_3135.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/471058/b/sour-urkle__primary_8923.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-urkle_100x100_8136.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Seattle, WA",
        "Spokane Valley, WA",
        "Spokane, WA",
        "Beaverton, OR",
        "Bothell, WA",
        "Detroit, MI",
        "Eugene, OR",
        "Friday Harbor, WA",
        "Gresham, OR"
    ],
    "rating": 4.57,
    "relatedStrains": [],
    "reviewCount": 51,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "sour-urkle",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.56862745098039/240",
    "subtitle": null,
    "symbol": "Sur",
    "symptoms": [
        {
            "name": "Depression",
            "score": 17.934782608695652
        },
        {
            "name": "Stress",
            "score": 12.228260869565219
        },
        {
            "name": "Fatigue",
            "score": 9.51086956521739
        },
        {
            "name": "Pain",
            "score": 6.521739130434782
        },
        {
            "name": "Inflammation",
            "score": 3.260869565217391
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
