{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1469051100000)/",
            "id": "contentitems-3061",
            "text": "Space: the final frontier. The massively empty wonder which has tantalized the imagination of mankind since first gazing upwards to witness the brilliance of the celestial. Whether for discovery, in reaction to climate change, or because you’re an overly excited core that wants to go to space, exploration is more relevant and possible than ever. With private space companies reigniting the torch of space travel and helmed by incredibly smart and innovative individuals (like Elon Musk, founder of SpaceX, or Sir Richard Branson of Virgin Galactic), it’s not hard to believe we are entering a golden age of cosmological discovery.\nOn the shoulders of giants we stride forward into a future not grounded on Earth. Here at Leafly, we’d like to reengage the booster switch and combust a little propellant in honor of the men and women around the world making the dream of space exploration a reality. We’ve compiled a list of outer space-themed cannabis strains to help you celebrate the scientists, star formations, conspiratorial UFO hunters, Apollo missions, and others on this Space Exploration Day.\n  Project Blue Book\nOriginating in 1952, Project Blue Book kicked off a series of studies conducted by the U.S. Air Force to determine if UFOs were a threat to national security. Its strain counterpart is a sativa-leaning hybrid offering a serene body high and calm, focused effects that are perfect for star-gazing.\n  Sputnik\nThis rocket was used by the Soviet Union to perform the world’s first satellite launch in 1957. Strain-wise, the spunky Sputnik sativa (say that three times fast!) has hints of sour and diesel, perhaps from that rocket boost of uplifting effects you may experience.\n“2 hits to liftoff. Decent buzz out of the launchpad. mid buzz nice and headize, no burn out at the end. good strain to kick back, and rate strains.” – sonofabrokenman\n  Apollo 11\nThe first space flight that brought humans on the Moon, Apollo 11 is the reason we’re celebrating this date today since it occurred on July 20th, 1969. Neil Armstrong and Buzz Aldrin took one small step for man and one giant leap for mankind. The strain, meanwhile, offers strong cerebral effects that are good for treating stress and moderate pain.\n“I love this strain. It takes you on a cosmic journey while leaving you grounded on planet earth. –symbol9991\n  Stephen Hawking Kush\nThe iconic theoretical physicist brought us predictions on black holes, gravitational singularity theorems, and cosmology. His strainsake, Stephen Hawking Kush, is an indica-dominant offering that helps with pain, nausea, and relaxation.\n“Healing codes from the universe immediately came to me when I smoked a hit of this high 11.4 CBD strain. Absolutely Smiles and TOTAL RELEIF are endrenching me in this dream. My love of indica just got greater because I have had a crush on Stephen Hawking and now I can smoke bud named after his fine ass and mind. WOW I think this strain will make me more intelligent. It is so much stonier and higher than I thought it …” – StellarStoner\n  Apollo 13\nThe seventh manned mission in the Apollo space program, Apollo 13 was the United States’ third intended Moon landing. Unfortunately, an oxygen tank exploded and crippled the Service Module. The crew managed to cobble together some makeshift repairs and return safely to Earth on April 17th. Not only did this historical event result in a blockbuster film of the same name, it also inspired the popular Apollo 13 hybrid strain featuring cerebral, energizing effects and an appropriately earthy scent.\n“WOW! Such an appropriate name, because I’m blasted light years past the moon. Light speed ahead, on a rocket ship I said, catch me if you can, I’m your spaceman…” –NunoFreak\n  Cosmic Collision\nThis sativa collided Cosmic Charlie with Piña Collision to create a fusion that’s out of this world. Enjoy the pineapple-kiwi flavors of Cosmic Collision and its uplifting, euphoric effects while you ponder exactly how far the universe extends.\n  Carl Sagan\nThe American astronomer, cosmologist, astrophysicist, and astrobiologist dedicated his efforts to researching extraterrestrial life and sent the first physical messages into space. His Carl Sagan strain counterpart offers balanced effects and relaxation.\n  Outer Space\nDefined as the void that exists between celestial bodies, the mystery of outer space will keep scientists hunting for answers well into the next millennium. The sativa Outer Space is widely touted for its creative, uplifting, and energetic effects.\n“Really makes you feel like taking off into space. More of a head uplifting feeling and focus.” – robmorales\n  Nebula\nA nebula is an interstellar cloud comprised of dust, helium, hydrogen, and other ionized gases. Its hybrid Nebula strain version twinkles with THC coating and offers intense, almost psychedelic effects.\n“Out of this world!” – hermantheworm420",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001512/cannabis-strains-for-space-exploration-day.jpg",
            "title": "Celebrate Space Exploration Day With These Cannabis Strains",
            "urlslug": "/news/strains-products/cannabis-strains-for-space-exploration-day"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 5.163043478260869
        },
        {
            "name": "ADD/ADHD",
            "score": 1.0869565217391304
        },
        {
            "name": "Migraines",
            "score": 1.0869565217391304
        },
        {
            "name": "Arthritis",
            "score": 0.8152173913043478
        },
        {
            "name": "Fibromyalgia",
            "score": 0.8152173913043478
        }
    ],
    "description": "<p>Apollo 11 is a potent hybrid cannabis strain with strong cerebral effects that might just have your head feeling like it&rsquo;s making a moon landing. It&rsquo;s another strain created by breeders&nbsp;Brothers Grimm and is the half-sister to another heady sativa, <a href=\"http://www.leafly.com/hybrid/apollo-13\" style=\"text-decoration:none;\">Apollo 13</a>. Apollo 11 also has Genius (a <a href=\"https://www.leafly.com/sativa/jack-herer\">Jack Herer</a> <a href=\"https://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\">phenotype</a>) as a mother, but was crossed with <a href=\"http://www.leafly.com/hybrid/cinderella-99\" style=\"text-decoration:none;\">Cinderella 99</a> to create this uplifting strain. This Apollo shares the family trait of an extremely fast flowering time, usually before 8 weeks. There is some variety among plants, but in general they will stay shorter and develop lots of branches and bud sites. The resinous flowers will have a strong, sharp citrus aroma and a slightly subtler lemon flavor. Effective for treating stress and moderate pain, for a few hours this strain will give you a first-class trip out of this world.</p>\n",
    "descriptionPlain": "Apollo 11 is a potent hybrid cannabis strain with strong cerebral effects that might just have your head feeling like it&rsquo;s making a moon landing. It&rsquo;s another strain created by breeders&nbsp;Brothers Grimm and is the half-sister to another heady sativa, Apollo 13. Apollo 11 also has Genius (a Jack Herer phenotype) as a mother, but was crossed with Cinderella 99 to create this uplifting strain. This Apollo shares the family trait of an extremely fast flowering time, usually before 8 weeks. There is some variety among plants, but in general they will stay shorter and develop lots of branches and bud sites. The resinous flowers will have a strong, sharp citrus aroma and a slightly subtler lemon flavor. Effective for treating stress and moderate pain, for a few hours this strain will give you a first-class trip out of this world.\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 59.51086956521739
        },
        {
            "name": "Happy",
            "score": 55.70652173913044
        },
        {
            "name": "Euphoric",
            "score": 34.51086956521739
        },
        {
            "name": "Creative",
            "score": 29.619565217391305
        },
        {
            "name": "Energetic",
            "score": 29.619565217391305
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 27.445652173913043
        },
        {
            "name": "Pungent",
            "score": 26.902173913043477
        },
        {
            "name": "Lemon",
            "score": 25.815217391304348
        },
        {
            "name": "Flowery",
            "score": 25.543478260869566
        },
        {
            "name": "Grapefruit",
            "score": 25.27173913043478
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 48,
        "growNotes": "\n\tSuitable for SCROG (screen of green)\\\n\tHigh calyx/leaf ratio\n\n",
        "height": "Short",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1137290,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I recently bought this bud and I could smell it before I entered the building in which I purchased it. It's an extremely potent strain, maybe one of the best.",
            "username": "blakebeitzel"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Fw0JEfqG0tfLyB-h0kujFvz9k-0=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fYVopYOS5SXadF7Hukmhn_aj133670_LemonOGKush2.jpg",
            "id": 1422710,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Now this IS a Rocket Science Strain Review of Apollo 11 received from a wonderful old-time friend of 35 years when I got home from my al most daily hospital jaunts for diagnostics and now the series of injections for the extreme anemia due to the two remaining cancers I fought off, with only kidney cancer to go.!\n\nThis strain is from the renowned Brothers Grim who crossed Cinderella 99 x Genius genetics to arrive at the creation of a new favoured strain of mine for morning exclusive uses !  This is a highly functional, creative, high \nthat not only does it generate appetite but it gave me the energy to make breakfast in bed for my new girlfriend and I.   I am a 17 year wheelchaired guy that needs more than a thousand volt zap to have this much energy, a rare enough occasion for me to have this plussed sativa dominant strain.  It is known as a very spacey, creative strain that is great at relieving stress, cramps, and tension to create an ideal head put to other tasks than those one might be doing.\n\n\n I will be very good interested in taking two ounce to our setup to produce Cannabis Rosin in a 25K pound press with 600 watt plates above and below.  I am right proud to be one of the three that designed this product, of which we are already producing for sales of this machine.",
            "username": "LEQCANNASOINS"
        }
    ],
    "id": 315,
    "name": "Apollo 11",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 30.706521739130434
        },
        {
            "name": "Dry Eyes",
            "score": 3.532608695652174
        },
        {
            "name": "Dizzy",
            "score": 1.358695652173913
        },
        {
            "name": "Headache",
            "score": 1.358695652173913
        },
        {
            "name": "Paranoid",
            "score": 1.0869565217391304
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/cinderella-99",
            "category": "Hybrid",
            "name": "Cinderella 99",
            "permalink": "https://mobileapi.leafly.com/hybrid/cinderella-99",
            "slug": "cinderella-99",
            "subtitle": null,
            "symbol": "C99"
        },
        {
            "applink": "leafly://strain/jack-herer",
            "category": "Sativa",
            "name": "Jack Herer",
            "permalink": "https://mobileapi.leafly.com/sativa/jack-herer",
            "slug": "jack-herer",
            "subtitle": null,
            "symbol": "Jh"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/apollo-11",
    "photoTotalCount": 25,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/507415/b/apollo-11__primary_f729.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/apollo-11_100x100_7182.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/507034/b/apollo-11__primary_3396.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/apollo-11_100x100_d8b3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/464846/b/apollo-11__primary_6900.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/apollo-11_100x100_2126.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/464785/b/apollo-11__primary_fe90.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/apollo-11_100x100_3e5b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/465034/b/apollo-11__primary_909f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/apollo-11_100x100_9ece.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/394830/b/apollo-11__primary_daee.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/apollo-11_100x100_57c5.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Bay City, MI",
        "Cortez, CO",
        "Detroit, MI",
        "Dinosaur, CO",
        "Las Vegas, NV",
        "Los Angeles, CA",
        "Sparks, NV"
    ],
    "rating": 4.36,
    "relatedStrains": [],
    "reviewCount": 59,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "apollo-11",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.35593220338983/240",
    "subtitle": null,
    "symbol": "A11",
    "symptoms": [
        {
            "name": "Stress",
            "score": 33.96739130434783
        },
        {
            "name": "Pain",
            "score": 30.163043478260867
        },
        {
            "name": "Depression",
            "score": 28.26086956521739
        },
        {
            "name": "Nausea",
            "score": 27.445652173913043
        },
        {
            "name": "Headaches",
            "score": 26.630434782608695
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
