{"sl_translate":"description,descriptionPlain,category","id":2268,"slug":"lemon-og","name":"Lemon OG Kush","subtitle":null,"symbol":"Leg","category":"Hybrid","description":"\u003cp\u003eWhat this skunky indica lacks in longevity it makes up for in speed. A cross between the mythical Las Vegas Lemon Skunk and The OG #18, Lemon OG provides users with a quick-acting sleepy head sensation. While Lemon OG has inherited a skunky aroma from its kush relatives, this particular strain is mild tasting and pleasant smelling with fruity undertones. Lemon OG tends to feel more psychoactive than other members of the kush family, but still offers a heavy, medicated feel. The strain is great for stress relief and increasing appetite. These plants usually flower in 8-10 weeks.\u003c/p\u003e\n","descriptionPlain":"What this skunky indica lacks in longevity it makes up for in speed. A cross between the mythical Las Vegas Lemon Skunk and The OG #18, Lemon OG provides users with a quick-acting sleepy head sensation. While Lemon OG has inherited a skunky aroma from its kush relatives, this particular strain is mild tasting and pleasant smelling with fruity undertones. Lemon OG tends to feel more psychoactive than other members of the kush family, but still offers a heavy, medicated feel. The strain is great for stress relief and increasing appetite. These plants usually flower in 8-10 weeks.\n","aka":"Lemon OG","rating":4.32,"highlightedReviews":[{"id":1397508,"username":"Anonymous","text":"Fast onset, start feeling it as soon as you exhale with full effects after less than 10 minutes. Happy, euphoric, nostalgic. Play your old favorite video game on this or watch your old favorite move; you\u0027ll be all smiles. Comedown is sleepy but not groggy. A personal favorite.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"},{"id":1634342,"username":"LEQCANNASOINS","text":"OH My CannaGods this is a strain I have wanted so much to try for at least two years. From those guys at DNA Genetics. And a Skunk based genetic at that and NO wonders why I love it so.  She is a 50/50 perfect blend of Las Vegas Lemon Skunk x OG#18.  She has a bag nose of the richest Meyer Lemon Zest Limonene terpenes that I have ever had my nose in.  And that after my 48th year of Cannabis use.  She has some intriguing Berry overtones as well.  This is one strain that I will request beans of and it will remain one of my go to morning strains !!!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Fw0JEfqG0tfLyB-h0kujFvz9k-0=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fYVopYOS5SXadF7Hukmhn_aj133670_LemonOGKush2.jpg"}],"relatedStrains":[],"articles":[{"id":"contentitems-49637","title":"The 13 Best Cannabis Strains for Parties","author":"Brett Konen","category":null,"date":"\/Date(1511383998000)\/","text":"A lot of people think of alcohol as the classic social lubricant. For some of us, it is. Alcohol can loosen us up, make us chatty and animated, and wash away social anxiety. It’s also often readily available at social occasions. Meanwhile, many people avoid cannabis use during social events—for one thing, it’s generally not served, and for another, many can recall a time cannabis made them paranoid or sleepy at a party, and don’t want to have that happen again.\n\nLuckily, with the right strains you can avoid the unwanted effects mentioned above. We used the advanced filters in Leafly’s strain explorer to get started, sorting to include strains with the happiest, most talkative highs, and to exclude any strains that make users anxious, paranoid, or sleepy. (If only alcohol’s drawbacks were so easy to filter out, am I right?)\nWe’ve curated the resultant list with our in-house expertise, vetting all suggestions against our own experiences and ensuring there’s a pick for every type of party. Attendees heading to any social occasion will find something below.\nAnd the awards for the best party cannabis strains go to…\nChocolope\nStrain type: Sativa\nBest for: All occasions.\nDNA Genetics developed Chocolope by crossing Chocolate Thai with Cannalope Haze to create their homage to the super-popular Chocolate strains of the 1980s. The hefty sativa buds give earthy, sweet coffee flavors that provide a dreamy, cerebral effect. It’s known around the Leafly office as “the party strain,” and for good reason—it’s basically impossible to be unhappy or introverted with such a feel-good high.\n\nWhite Russian\nStrain type: Hybrid\nBest for: Dinner parties.\nOriginally created by Dutch breeders Serious Seeds, White Russian is a cross of two legendary strains, White Widow and AK-47. An indica-dominant hybrid, it won the High Times Cannabis Cup “Best Overall” in 1996. White Russian is an extremely fragrant plant, and with a flavor that is smooth and spicy with undertones of skunk and earth, and its high is quite cerebral (especially for an indica-dominant strain), making it great for conversation with those around you.\nTangie\nStrain type: Sativa\nBest for: Cocktail parties.\nAnother fave among the Leafly crew, particularly for group gatherings after work, Tangie is a fantastic offering from DNA Genetics in Amsterdam. This strain is a remake of sorts of the popular version of Tangerine Dream that was sought-after in the 1990s, with genetics derived from a cross of California Orange and a Skunk hybrid. Its citrus heritage is the most evident in its refreshing tangerine aroma.\nBlue Goo\nStrain type: Hybrid\nBest for: Friends and family gatherings.\nBlue Goo is a sativa-dominant hybrid that’s a cross between the famous hybrid Blue Dream and indica Afgoo. A moderate to high potency yields uplifting effects that are standard for sativas, but not excessively energetic thanks to Afgoo’s contribution as well as the mellow nature of Blue Dream. This strain is appropriate for day or nighttime consumption and provides smooth smoke and berry flavor.\n\nSour Lemon OG\nStrain type: Hybrid\nBest for: Birthday parties.\nBred by Emerald Triangle Seeds, Sour Lemon OG is a sativa-dominant hybrid cross between California Sour and Lemon OG. This 65% sativa strain is named after its aromatic sour smell with recognizable notes of lemon, lime, and apple. Sour Lemon OG elevates the mind and body simultaneously, making this a natural go-to strain for celebrations, social engagements, or even just a busy day.\nBlue Diesel\nStrain type: Hybrid\nBest for: Happy hour.\nDaughter of indica-dominant Blueberry and sativa-dominant NYC Diesel, Blue Diesel (also known as Blue City Diesel) falls slightly on the indica side of things with a pleasant, moderate- to long-lasting body buzz (perfect if you want to extend the happy for more than an hour). Thanks to its Blueberry genetics, this flower emanates a light berry aroma that is smooth, expansive, and fast-acting. This strain is optimal for daytime use, and relaxes the consumer in social settings without putting you to sleep.\nPez\nStrain type: Indica\nBest for: Cannabis-focused parties.\nPez is an indica daughter of Afghani and Pakistani strains. These sweet, frosty buds offer the relaxation typical of indicas without the drowsiness, making the strain great for daytime use. We recommend this one as a shareable contribution to any 420-friendly gathering—it’s also on our list of the Top 100 Must-Try Strains, meaning it will be a particularly popular addition to any event with open cannabis consumption.\n\nOrange Bud\nStrain type: Hybrid\nBest for: Hosting.\nMatching plenty of social energy with a dose of subtle relaxation, this strain is perfect for gatherings where you’re in charge and want to stay upbeat and level-headed. First bred in 1980s by Dutch Passion, Orange Bud is a combination of two members of the 100% Skunk family. With bright orange hairs coating the surface, it showcases scents of orange and nectarine.\nBlueberry Headband\nStrain type: Hybrid\nBest for: Parties you don’t want to attend.\nSeveral renditions of the Blueberry Headband hybrid are known to exist, but the original Blueberry Headband from NorCal’s Emerald Triangle Seeds is the most well-known. It’s a 50/50 indica-sativa hybrid that smells of diesel, berries and pepper, and it produces a perfectly balanced high with a nice cerebral rush and relaxing body effects. This is great for staying sufficiently present while mentally floating high above any social event you wish you didn’t have to attend (think work parties, baby showers, and so on).\nBanana Kush\nStrain type: Hybrid\nBest for: Potlucks.\nThis legendary West Coast strain crosses Ghost OG and Skunk Haze to create an indica-dominant hybrid that tastes and smells like a bushel of fresh bananas (and will whet your appetite if there’s food around). Although it leans towards an indica genetically, the effects are balanced by the Haze’s mellow sativa buzz that provides a relaxed sense of euphoria. Banana Kush also help its consumers remain talkative in social settings.\n\nDurban Cookies\nStrain type: Sativa\nBest for: Loud parties.\nDurban Cookies is the Durban Poison-dominant phenotype of GSC. Known for its invigorating mental energy and body buzz, Durban Cookies offers a more energizing experience, making this sativa-dominant strain a top choice throughout the day and into the evening, particularly if you’re headed to a high-energy event where you’ll be surrounded by music, people, and movement.\nBubblegum Kush\nStrain type: Indica\nBest for: Low-key get-togethers.\nThis strain is for laid-back social situations; it’ll leave you relaxed and comfy on any given couch, but also chatty and ready to hang with whoever sits down next to you. An 80% indica strain from Bulldog Seeds in the Netherlands, Bubblegum Kush is a cross between Bubble Gum and an undisclosed Kush, and has a satisfyingly sour smell and flavor.\nStrawberry\nStrain type: Sativa\nBest for: Being a plus-one.\nOriginally bred in the Netherlands, Strawberry is a mostly sativa cannabis strain with a pungent fruity scent and uplifting effects. Consumers prone to anxiety choose Strawberry for its stress-relieving qualities without the jarring paranoia common among high-THC strains (which makes it great for small talk with people you don’t know). Comfortable and relaxing, Strawberry brings with it a hearty dose of physical and mental ease.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/22124021/best-cannabis-strains-for-parties.jpg","urlslug":"/news/strains-products/the-13-best-cannabis-strains-for-parties"},{"id":"contentitems-3537","title":"The Best Cannabis Strains for the Holidays (According to Leafly Reviewers)","author":"Brett Konen","category":null,"date":"\/Date(1450897200000)\/","text":"The holidays are fast approaching, so naturally you’re thinking about the perfect cannabis strains to enjoy over the upcoming weeks. Have innumerable aunts, uncles, in-laws, and second cousins coming into town for the long weekend? You’ll probably need something to chill you out after all that family time. Wanting to keep moving in spite of the weather? You’re after something active. Have about a thousand errands left to run? Something to spice up the process would be nice.\nLuckily, Leafly user reviews are a gold mine of suggestions for cannabis strains that fit any scenario, so we’ve compiled a few great user-sourced recommendations for a range of seasonal activities listed below. Whether you’re grocery shopping, cocoa-sipping, or baking some cannabis-infused holiday cookies, try out one of the ideas below and enjoy your holiday celebrations!\n\nFor Coping with Winter\n  “This is the perfect strain to make Seattle winter days productive! A couple hits gives my ambition, creativity and libido a jump-start.” –munin.raven\n \n “My go to for getting my figure back after holiday indulgence!” –grngrazer\n \n “Smooth pull, great taste – exactly what I hoped for…real killer high to cure the inevitable holiday blues.” –hazedandconfused\nFor Spending Time with Family \u0026 Friends\n “Smells like Christmas trees, tastes like pine and lightens the heart and mind…I found it made the whole holiday with ALL the family, very enjoyable. Oh and added benefits of not breaking ornaments or dropping the turkey.” –Free_Byrd\n \n “Smoked this with my Nana and great Uncle Pete while on winter vacation…Made me forget how much my back hurt from sleeping on an air mattress.” –somniumtextrix\n \n “A swift cerebral head high, accompanied by a punch of energy. Best used at a party with friends as is very good for getting you in the mood, to talk, dance, whatever!” –JustAnotherStoner\nFor Curling Up by the Fire\n “I could feel every atom in my body float away in rhythm with the space heater I was sitting next to. Perfect for sitting home on a cold winter evening and then getting a good night sleep.” –Anonymous\n \n “I enjoyed a blunt and hits from my vaporizer along side with a cup of hot chocolate, it was a great combo…pick it up for a stay-at-home type of day.” –kushconnoisseur420\n \n “I’m washing it down with some seasonal ale and it’s the perfect end to a perfect night.” –BudseyXO\nLooks, Smells, and Tastes Like Christmas\n “When I opened the bag I thought I was suddenly on a camping trip. It smelled like a Christmas tree…The taste of pine, clove and earth danced across across my palate.” –robmacpheejr\n \n “Nom nom nom like a Christmas tree with a lifesaver candy cane in your mouth.” –greedyguy\n \n “Feels like I threw a Christmas tree in a wood chipper… lights, ornaments, candy canes – everything – and put it in my Pax to vape it.’” –Midnyte003\nFor Making Spirits Bright\n “This is like that one ‘big’ present hidden behind the tree just when you think you didn’t get what you ‘really’ wanted that year. It’s that good.” –Anonymous\n \n “My brain lit up like Times Square on New Years Eve.” –Grumple\n \n “This strain had me smiling like the Grinch that stole Christmas.” –Skyclub\n \n “Like skating across a frozen lake surrounded by snowflakes in the night.” – bugpowderdustmugwumpjism\n \n “BEST. STRAIN. EVER. Four for you, Sour D, you go Sour D.” –Anonymous\nWhat are some of your favorite strains to enjoy over the holidays? Share in the comments!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12002805/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re.jpg","urlslug":"/news/strains-products/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re"}],"reviewCount":351,"flavors":[{"name":"Lemon","score":48.9791088379425},{"name":"Citrus","score":33.349718138514788},{"name":"Earthy","score":17.259411089407489},{"name":"Sweet","score":13.642331482814161},{"name":"Skunk","score":13.586965833933037}],"effects":[{"name":"Happy","score":64.572945581028748},{"name":"Relaxed","score":59.996444604365855},{"name":"Creative","score":47.695846612521848},{"name":"Uplifted","score":46.326912203145881},{"name":"Euphoric","score":43.806222370720675}],"symptoms":[{"name":"Stress","score":29.393376683458413},{"name":"Pain","score":24.1042973167472},{"name":"Insomnia","score":23.439159898564135},{"name":"Lack of Appetite","score":19.984321990336177},{"name":"Depression","score":19.0881909461636}],"conditions":[{"name":"Anxiety","score":21.89566841437922},{"name":"Migraines","score":12.547440971865255},{"name":"ADD/ADHD","score":12.364959220040436},{"name":"PMS","score":10.687497858195401},{"name":"Anorexia","score":10.505016106370583}],"negatives":[{"name":"Dry Mouth","score":23.8219003803845},{"name":"Dry Eyes","score":12.69083478976046},{"name":"Anxious","score":10.687497858195401},{"name":"Dizzy","score":8.4452426236249618},{"name":"Paranoid","score":8.1450687090915324}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/lemon-og/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/lemon-og/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_1f3b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648234/b/lemon-og-kush__primary_37e7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_4d0e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/641326/b/lemon-og-kush__primary_b910.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_79b9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/641007/b/lemon-og-kush__primary_b564.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_964e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/638666/b/lemon-og-kush__primary_b4eb.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_b6e8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/629811/b/lemon-og-kush__primary_0716.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_e41c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/613164/b/lemon-og-kush__primary_0ec1.jpg"}],"photoTotalCount":100,"popularCities":["Seattle, WA","Portland, OR","Spokane, WA","Everett, WA","Bellingham, WA","Denver, CO","Mount Vernon, WA","Phoenix, AZ","Shoreline, WA","Tacoma, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/lemon-og","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.32478632478632/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Lemon Skunk","subtitle":null,"slug":"lemon-skunk","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/lemon-skunk","symbol":"Ls","applink":"leafly://strain/lemon-skunk"},{"name":"OG #18","subtitle":null,"slug":"og-18","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-18","symbol":"O18","applink":"leafly://strain/og-18"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":2268,"slug":"lemon-og","name":"Lemon OG Kush","subtitle":null,"symbol":"Leg","category":"Hybrid","description":"\u003cp\u003eWhat this skunky indica lacks in longevity it makes up for in speed. A cross between the mythical Las Vegas Lemon Skunk and The OG #18, Lemon OG provides users with a quick-acting sleepy head sensation. While Lemon OG has inherited a skunky aroma from its kush relatives, this particular strain is mild tasting and pleasant smelling with fruity undertones. Lemon OG tends to feel more psychoactive than other members of the kush family, but still offers a heavy, medicated feel. The strain is great for stress relief and increasing appetite. These plants usually flower in 8-10 weeks.\u003c/p\u003e\n","descriptionPlain":"What this skunky indica lacks in longevity it makes up for in speed. A cross between the mythical Las Vegas Lemon Skunk and The OG #18, Lemon OG provides users with a quick-acting sleepy head sensation. While Lemon OG has inherited a skunky aroma from its kush relatives, this particular strain is mild tasting and pleasant smelling with fruity undertones. Lemon OG tends to feel more psychoactive than other members of the kush family, but still offers a heavy, medicated feel. The strain is great for stress relief and increasing appetite. These plants usually flower in 8-10 weeks.\n","aka":"Lemon OG","rating":4.32,"highlightedReviews":[{"id":1397508,"username":"Anonymous","text":"Fast onset, start feeling it as soon as you exhale with full effects after less than 10 minutes. Happy, euphoric, nostalgic. Play your old favorite video game on this or watch your old favorite move; you\u0027ll be all smiles. Comedown is sleepy but not groggy. A personal favorite.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"},{"id":1634342,"username":"LEQCANNASOINS","text":"OH My CannaGods this is a strain I have wanted so much to try for at least two years. From those guys at DNA Genetics. And a Skunk based genetic at that and NO wonders why I love it so.  She is a 50/50 perfect blend of Las Vegas Lemon Skunk x OG#18.  She has a bag nose of the richest Meyer Lemon Zest Limonene terpenes that I have ever had my nose in.  And that after my 48th year of Cannabis use.  She has some intriguing Berry overtones as well.  This is one strain that I will request beans of and it will remain one of my go to morning strains !!!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Fw0JEfqG0tfLyB-h0kujFvz9k-0=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fYVopYOS5SXadF7Hukmhn_aj133670_LemonOGKush2.jpg"}],"relatedStrains":[],"articles":[{"id":"contentitems-49637","title":"The 13 Best Cannabis Strains for Parties","author":"Brett Konen","category":null,"date":"\/Date(1511383998000)\/","text":"A lot of people think of alcohol as the classic social lubricant. For some of us, it is. Alcohol can loosen us up, make us chatty and animated, and wash away social anxiety. It’s also often readily available at social occasions. Meanwhile, many people avoid cannabis use during social events—for one thing, it’s generally not served, and for another, many can recall a time cannabis made them paranoid or sleepy at a party, and don’t want to have that happen again.\n\nLuckily, with the right strains you can avoid the unwanted effects mentioned above. We used the advanced filters in Leafly’s strain explorer to get started, sorting to include strains with the happiest, most talkative highs, and to exclude any strains that make users anxious, paranoid, or sleepy. (If only alcohol’s drawbacks were so easy to filter out, am I right?)\nWe’ve curated the resultant list with our in-house expertise, vetting all suggestions against our own experiences and ensuring there’s a pick for every type of party. Attendees heading to any social occasion will find something below.\nAnd the awards for the best party cannabis strains go to…\nChocolope\nStrain type: Sativa\nBest for: All occasions.\nDNA Genetics developed Chocolope by crossing Chocolate Thai with Cannalope Haze to create their homage to the super-popular Chocolate strains of the 1980s. The hefty sativa buds give earthy, sweet coffee flavors that provide a dreamy, cerebral effect. It’s known around the Leafly office as “the party strain,” and for good reason—it’s basically impossible to be unhappy or introverted with such a feel-good high.\n\nWhite Russian\nStrain type: Hybrid\nBest for: Dinner parties.\nOriginally created by Dutch breeders Serious Seeds, White Russian is a cross of two legendary strains, White Widow and AK-47. An indica-dominant hybrid, it won the High Times Cannabis Cup “Best Overall” in 1996. White Russian is an extremely fragrant plant, and with a flavor that is smooth and spicy with undertones of skunk and earth, and its high is quite cerebral (especially for an indica-dominant strain), making it great for conversation with those around you.\nTangie\nStrain type: Sativa\nBest for: Cocktail parties.\nAnother fave among the Leafly crew, particularly for group gatherings after work, Tangie is a fantastic offering from DNA Genetics in Amsterdam. This strain is a remake of sorts of the popular version of Tangerine Dream that was sought-after in the 1990s, with genetics derived from a cross of California Orange and a Skunk hybrid. Its citrus heritage is the most evident in its refreshing tangerine aroma.\nBlue Goo\nStrain type: Hybrid\nBest for: Friends and family gatherings.\nBlue Goo is a sativa-dominant hybrid that’s a cross between the famous hybrid Blue Dream and indica Afgoo. A moderate to high potency yields uplifting effects that are standard for sativas, but not excessively energetic thanks to Afgoo’s contribution as well as the mellow nature of Blue Dream. This strain is appropriate for day or nighttime consumption and provides smooth smoke and berry flavor.\n\nSour Lemon OG\nStrain type: Hybrid\nBest for: Birthday parties.\nBred by Emerald Triangle Seeds, Sour Lemon OG is a sativa-dominant hybrid cross between California Sour and Lemon OG. This 65% sativa strain is named after its aromatic sour smell with recognizable notes of lemon, lime, and apple. Sour Lemon OG elevates the mind and body simultaneously, making this a natural go-to strain for celebrations, social engagements, or even just a busy day.\nBlue Diesel\nStrain type: Hybrid\nBest for: Happy hour.\nDaughter of indica-dominant Blueberry and sativa-dominant NYC Diesel, Blue Diesel (also known as Blue City Diesel) falls slightly on the indica side of things with a pleasant, moderate- to long-lasting body buzz (perfect if you want to extend the happy for more than an hour). Thanks to its Blueberry genetics, this flower emanates a light berry aroma that is smooth, expansive, and fast-acting. This strain is optimal for daytime use, and relaxes the consumer in social settings without putting you to sleep.\nPez\nStrain type: Indica\nBest for: Cannabis-focused parties.\nPez is an indica daughter of Afghani and Pakistani strains. These sweet, frosty buds offer the relaxation typical of indicas without the drowsiness, making the strain great for daytime use. We recommend this one as a shareable contribution to any 420-friendly gathering—it’s also on our list of the Top 100 Must-Try Strains, meaning it will be a particularly popular addition to any event with open cannabis consumption.\n\nOrange Bud\nStrain type: Hybrid\nBest for: Hosting.\nMatching plenty of social energy with a dose of subtle relaxation, this strain is perfect for gatherings where you’re in charge and want to stay upbeat and level-headed. First bred in 1980s by Dutch Passion, Orange Bud is a combination of two members of the 100% Skunk family. With bright orange hairs coating the surface, it showcases scents of orange and nectarine.\nBlueberry Headband\nStrain type: Hybrid\nBest for: Parties you don’t want to attend.\nSeveral renditions of the Blueberry Headband hybrid are known to exist, but the original Blueberry Headband from NorCal’s Emerald Triangle Seeds is the most well-known. It’s a 50/50 indica-sativa hybrid that smells of diesel, berries and pepper, and it produces a perfectly balanced high with a nice cerebral rush and relaxing body effects. This is great for staying sufficiently present while mentally floating high above any social event you wish you didn’t have to attend (think work parties, baby showers, and so on).\nBanana Kush\nStrain type: Hybrid\nBest for: Potlucks.\nThis legendary West Coast strain crosses Ghost OG and Skunk Haze to create an indica-dominant hybrid that tastes and smells like a bushel of fresh bananas (and will whet your appetite if there’s food around). Although it leans towards an indica genetically, the effects are balanced by the Haze’s mellow sativa buzz that provides a relaxed sense of euphoria. Banana Kush also help its consumers remain talkative in social settings.\n\nDurban Cookies\nStrain type: Sativa\nBest for: Loud parties.\nDurban Cookies is the Durban Poison-dominant phenotype of GSC. Known for its invigorating mental energy and body buzz, Durban Cookies offers a more energizing experience, making this sativa-dominant strain a top choice throughout the day and into the evening, particularly if you’re headed to a high-energy event where you’ll be surrounded by music, people, and movement.\nBubblegum Kush\nStrain type: Indica\nBest for: Low-key get-togethers.\nThis strain is for laid-back social situations; it’ll leave you relaxed and comfy on any given couch, but also chatty and ready to hang with whoever sits down next to you. An 80% indica strain from Bulldog Seeds in the Netherlands, Bubblegum Kush is a cross between Bubble Gum and an undisclosed Kush, and has a satisfyingly sour smell and flavor.\nStrawberry\nStrain type: Sativa\nBest for: Being a plus-one.\nOriginally bred in the Netherlands, Strawberry is a mostly sativa cannabis strain with a pungent fruity scent and uplifting effects. Consumers prone to anxiety choose Strawberry for its stress-relieving qualities without the jarring paranoia common among high-THC strains (which makes it great for small talk with people you don’t know). Comfortable and relaxing, Strawberry brings with it a hearty dose of physical and mental ease.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/22124021/best-cannabis-strains-for-parties.jpg","urlslug":"/news/strains-products/the-13-best-cannabis-strains-for-parties"},{"id":"contentitems-3537","title":"The Best Cannabis Strains for the Holidays (According to Leafly Reviewers)","author":"Brett Konen","category":null,"date":"\/Date(1450897200000)\/","text":"The holidays are fast approaching, so naturally you’re thinking about the perfect cannabis strains to enjoy over the upcoming weeks. Have innumerable aunts, uncles, in-laws, and second cousins coming into town for the long weekend? You’ll probably need something to chill you out after all that family time. Wanting to keep moving in spite of the weather? You’re after something active. Have about a thousand errands left to run? Something to spice up the process would be nice.\nLuckily, Leafly user reviews are a gold mine of suggestions for cannabis strains that fit any scenario, so we’ve compiled a few great user-sourced recommendations for a range of seasonal activities listed below. Whether you’re grocery shopping, cocoa-sipping, or baking some cannabis-infused holiday cookies, try out one of the ideas below and enjoy your holiday celebrations!\n\nFor Coping with Winter\n  “This is the perfect strain to make Seattle winter days productive! A couple hits gives my ambition, creativity and libido a jump-start.” –munin.raven\n \n “My go to for getting my figure back after holiday indulgence!” –grngrazer\n \n “Smooth pull, great taste – exactly what I hoped for…real killer high to cure the inevitable holiday blues.” –hazedandconfused\nFor Spending Time with Family \u0026 Friends\n “Smells like Christmas trees, tastes like pine and lightens the heart and mind…I found it made the whole holiday with ALL the family, very enjoyable. Oh and added benefits of not breaking ornaments or dropping the turkey.” –Free_Byrd\n \n “Smoked this with my Nana and great Uncle Pete while on winter vacation…Made me forget how much my back hurt from sleeping on an air mattress.” –somniumtextrix\n \n “A swift cerebral head high, accompanied by a punch of energy. Best used at a party with friends as is very good for getting you in the mood, to talk, dance, whatever!” –JustAnotherStoner\nFor Curling Up by the Fire\n “I could feel every atom in my body float away in rhythm with the space heater I was sitting next to. Perfect for sitting home on a cold winter evening and then getting a good night sleep.” –Anonymous\n \n “I enjoyed a blunt and hits from my vaporizer along side with a cup of hot chocolate, it was a great combo…pick it up for a stay-at-home type of day.” –kushconnoisseur420\n \n “I’m washing it down with some seasonal ale and it’s the perfect end to a perfect night.” –BudseyXO\nLooks, Smells, and Tastes Like Christmas\n “When I opened the bag I thought I was suddenly on a camping trip. It smelled like a Christmas tree…The taste of pine, clove and earth danced across across my palate.” –robmacpheejr\n \n “Nom nom nom like a Christmas tree with a lifesaver candy cane in your mouth.” –greedyguy\n \n “Feels like I threw a Christmas tree in a wood chipper… lights, ornaments, candy canes – everything – and put it in my Pax to vape it.’” –Midnyte003\nFor Making Spirits Bright\n “This is like that one ‘big’ present hidden behind the tree just when you think you didn’t get what you ‘really’ wanted that year. It’s that good.” –Anonymous\n \n “My brain lit up like Times Square on New Years Eve.” –Grumple\n \n “This strain had me smiling like the Grinch that stole Christmas.” –Skyclub\n \n “Like skating across a frozen lake surrounded by snowflakes in the night.” – bugpowderdustmugwumpjism\n \n “BEST. STRAIN. EVER. Four for you, Sour D, you go Sour D.” –Anonymous\nWhat are some of your favorite strains to enjoy over the holidays? Share in the comments!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12002805/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re.jpg","urlslug":"/news/strains-products/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re"}],"reviewCount":351,"flavors":[{"name":"Lemon","score":48.9791088379425},{"name":"Citrus","score":33.349718138514788},{"name":"Earthy","score":17.259411089407489},{"name":"Sweet","score":13.642331482814161},{"name":"Skunk","score":13.586965833933037}],"effects":[{"name":"Happy","score":64.572945581028748},{"name":"Relaxed","score":59.996444604365855},{"name":"Creative","score":47.695846612521848},{"name":"Uplifted","score":46.326912203145881},{"name":"Euphoric","score":43.806222370720675}],"symptoms":[{"name":"Stress","score":29.393376683458413},{"name":"Pain","score":24.1042973167472},{"name":"Insomnia","score":23.439159898564135},{"name":"Lack of Appetite","score":19.984321990336177},{"name":"Depression","score":19.0881909461636}],"conditions":[{"name":"Anxiety","score":21.89566841437922},{"name":"Migraines","score":12.547440971865255},{"name":"ADD/ADHD","score":12.364959220040436},{"name":"PMS","score":10.687497858195401},{"name":"Anorexia","score":10.505016106370583}],"negatives":[{"name":"Dry Mouth","score":23.8219003803845},{"name":"Dry Eyes","score":12.69083478976046},{"name":"Anxious","score":10.687497858195401},{"name":"Dizzy","score":8.4452426236249618},{"name":"Paranoid","score":8.1450687090915324}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/lemon-og/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/lemon-og/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_1f3b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648234/b/lemon-og-kush__primary_37e7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_4d0e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/641326/b/lemon-og-kush__primary_b910.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_79b9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/641007/b/lemon-og-kush__primary_b564.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_964e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/638666/b/lemon-og-kush__primary_b4eb.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_b6e8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/629811/b/lemon-og-kush__primary_0716.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_e41c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/613164/b/lemon-og-kush__primary_0ec1.jpg"}],"photoTotalCount":100,"popularCities":["Seattle, WA","Portland, OR","Spokane, WA","Everett, WA","Bellingham, WA","Denver, CO","Mount Vernon, WA","Phoenix, AZ","Shoreline, WA","Tacoma, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/lemon-og","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.32478632478632/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Lemon Skunk","subtitle":null,"slug":"lemon-skunk","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/lemon-skunk","symbol":"Ls","applink":"leafly://strain/lemon-skunk"},{"name":"OG #18","subtitle":null,"slug":"og-18","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-18","symbol":"O18","applink":"leafly://strain/og-18"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":2268,"slug":"lemon-og","name":"Lemon OG Kush","subtitle":null,"symbol":"Leg","category":"Hybrid","description":"\u003cp\u003eWhat this skunky indica lacks in longevity it makes up for in speed. A cross between the mythical Las Vegas Lemon Skunk and The OG #18, Lemon OG provides users with a quick-acting sleepy head sensation. While Lemon OG has inherited a skunky aroma from its kush relatives, this particular strain is mild tasting and pleasant smelling with fruity undertones. Lemon OG tends to feel more psychoactive than other members of the kush family, but still offers a heavy, medicated feel. The strain is great for stress relief and increasing appetite. These plants usually flower in 8-10 weeks.\u003c/p\u003e\n","descriptionPlain":"What this skunky indica lacks in longevity it makes up for in speed. A cross between the mythical Las Vegas Lemon Skunk and The OG #18, Lemon OG provides users with a quick-acting sleepy head sensation. While Lemon OG has inherited a skunky aroma from its kush relatives, this particular strain is mild tasting and pleasant smelling with fruity undertones. Lemon OG tends to feel more psychoactive than other members of the kush family, but still offers a heavy, medicated feel. The strain is great for stress relief and increasing appetite. These plants usually flower in 8-10 weeks.\n","aka":"Lemon OG","rating":4.32,"highlightedReviews":[{"id":1397508,"username":"Anonymous","text":"Fast onset, start feeling it as soon as you exhale with full effects after less than 10 minutes. Happy, euphoric, nostalgic. Play your old favorite video game on this or watch your old favorite move; you\u0027ll be all smiles. Comedown is sleepy but not groggy. A personal favorite.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"},{"id":1634342,"username":"LEQCANNASOINS","text":"OH My CannaGods this is a strain I have wanted so much to try for at least two years. From those guys at DNA Genetics. And a Skunk based genetic at that and NO wonders why I love it so.  She is a 50/50 perfect blend of Las Vegas Lemon Skunk x OG#18.  She has a bag nose of the richest Meyer Lemon Zest Limonene terpenes that I have ever had my nose in.  And that after my 48th year of Cannabis use.  She has some intriguing Berry overtones as well.  This is one strain that I will request beans of and it will remain one of my go to morning strains !!!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Fw0JEfqG0tfLyB-h0kujFvz9k-0=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fYVopYOS5SXadF7Hukmhn_aj133670_LemonOGKush2.jpg"}],"relatedStrains":[],"articles":[{"id":"contentitems-49637","title":"The 13 Best Cannabis Strains for Parties","author":"Brett Konen","category":null,"date":"\/Date(1511383998000)\/","text":"A lot of people think of alcohol as the classic social lubricant. For some of us, it is. Alcohol can loosen us up, make us chatty and animated, and wash away social anxiety. It’s also often readily available at social occasions. Meanwhile, many people avoid cannabis use during social events—for one thing, it’s generally not served, and for another, many can recall a time cannabis made them paranoid or sleepy at a party, and don’t want to have that happen again.\n\nLuckily, with the right strains you can avoid the unwanted effects mentioned above. We used the advanced filters in Leafly’s strain explorer to get started, sorting to include strains with the happiest, most talkative highs, and to exclude any strains that make users anxious, paranoid, or sleepy. (If only alcohol’s drawbacks were so easy to filter out, am I right?)\nWe’ve curated the resultant list with our in-house expertise, vetting all suggestions against our own experiences and ensuring there’s a pick for every type of party. Attendees heading to any social occasion will find something below.\nAnd the awards for the best party cannabis strains go to…\nChocolope\nStrain type: Sativa\nBest for: All occasions.\nDNA Genetics developed Chocolope by crossing Chocolate Thai with Cannalope Haze to create their homage to the super-popular Chocolate strains of the 1980s. The hefty sativa buds give earthy, sweet coffee flavors that provide a dreamy, cerebral effect. It’s known around the Leafly office as “the party strain,” and for good reason—it’s basically impossible to be unhappy or introverted with such a feel-good high.\n\nWhite Russian\nStrain type: Hybrid\nBest for: Dinner parties.\nOriginally created by Dutch breeders Serious Seeds, White Russian is a cross of two legendary strains, White Widow and AK-47. An indica-dominant hybrid, it won the High Times Cannabis Cup “Best Overall” in 1996. White Russian is an extremely fragrant plant, and with a flavor that is smooth and spicy with undertones of skunk and earth, and its high is quite cerebral (especially for an indica-dominant strain), making it great for conversation with those around you.\nTangie\nStrain type: Sativa\nBest for: Cocktail parties.\nAnother fave among the Leafly crew, particularly for group gatherings after work, Tangie is a fantastic offering from DNA Genetics in Amsterdam. This strain is a remake of sorts of the popular version of Tangerine Dream that was sought-after in the 1990s, with genetics derived from a cross of California Orange and a Skunk hybrid. Its citrus heritage is the most evident in its refreshing tangerine aroma.\nBlue Goo\nStrain type: Hybrid\nBest for: Friends and family gatherings.\nBlue Goo is a sativa-dominant hybrid that’s a cross between the famous hybrid Blue Dream and indica Afgoo. A moderate to high potency yields uplifting effects that are standard for sativas, but not excessively energetic thanks to Afgoo’s contribution as well as the mellow nature of Blue Dream. This strain is appropriate for day or nighttime consumption and provides smooth smoke and berry flavor.\n\nSour Lemon OG\nStrain type: Hybrid\nBest for: Birthday parties.\nBred by Emerald Triangle Seeds, Sour Lemon OG is a sativa-dominant hybrid cross between California Sour and Lemon OG. This 65% sativa strain is named after its aromatic sour smell with recognizable notes of lemon, lime, and apple. Sour Lemon OG elevates the mind and body simultaneously, making this a natural go-to strain for celebrations, social engagements, or even just a busy day.\nBlue Diesel\nStrain type: Hybrid\nBest for: Happy hour.\nDaughter of indica-dominant Blueberry and sativa-dominant NYC Diesel, Blue Diesel (also known as Blue City Diesel) falls slightly on the indica side of things with a pleasant, moderate- to long-lasting body buzz (perfect if you want to extend the happy for more than an hour). Thanks to its Blueberry genetics, this flower emanates a light berry aroma that is smooth, expansive, and fast-acting. This strain is optimal for daytime use, and relaxes the consumer in social settings without putting you to sleep.\nPez\nStrain type: Indica\nBest for: Cannabis-focused parties.\nPez is an indica daughter of Afghani and Pakistani strains. These sweet, frosty buds offer the relaxation typical of indicas without the drowsiness, making the strain great for daytime use. We recommend this one as a shareable contribution to any 420-friendly gathering—it’s also on our list of the Top 100 Must-Try Strains, meaning it will be a particularly popular addition to any event with open cannabis consumption.\n\nOrange Bud\nStrain type: Hybrid\nBest for: Hosting.\nMatching plenty of social energy with a dose of subtle relaxation, this strain is perfect for gatherings where you’re in charge and want to stay upbeat and level-headed. First bred in 1980s by Dutch Passion, Orange Bud is a combination of two members of the 100% Skunk family. With bright orange hairs coating the surface, it showcases scents of orange and nectarine.\nBlueberry Headband\nStrain type: Hybrid\nBest for: Parties you don’t want to attend.\nSeveral renditions of the Blueberry Headband hybrid are known to exist, but the original Blueberry Headband from NorCal’s Emerald Triangle Seeds is the most well-known. It’s a 50/50 indica-sativa hybrid that smells of diesel, berries and pepper, and it produces a perfectly balanced high with a nice cerebral rush and relaxing body effects. This is great for staying sufficiently present while mentally floating high above any social event you wish you didn’t have to attend (think work parties, baby showers, and so on).\nBanana Kush\nStrain type: Hybrid\nBest for: Potlucks.\nThis legendary West Coast strain crosses Ghost OG and Skunk Haze to create an indica-dominant hybrid that tastes and smells like a bushel of fresh bananas (and will whet your appetite if there’s food around). Although it leans towards an indica genetically, the effects are balanced by the Haze’s mellow sativa buzz that provides a relaxed sense of euphoria. Banana Kush also help its consumers remain talkative in social settings.\n\nDurban Cookies\nStrain type: Sativa\nBest for: Loud parties.\nDurban Cookies is the Durban Poison-dominant phenotype of GSC. Known for its invigorating mental energy and body buzz, Durban Cookies offers a more energizing experience, making this sativa-dominant strain a top choice throughout the day and into the evening, particularly if you’re headed to a high-energy event where you’ll be surrounded by music, people, and movement.\nBubblegum Kush\nStrain type: Indica\nBest for: Low-key get-togethers.\nThis strain is for laid-back social situations; it’ll leave you relaxed and comfy on any given couch, but also chatty and ready to hang with whoever sits down next to you. An 80% indica strain from Bulldog Seeds in the Netherlands, Bubblegum Kush is a cross between Bubble Gum and an undisclosed Kush, and has a satisfyingly sour smell and flavor.\nStrawberry\nStrain type: Sativa\nBest for: Being a plus-one.\nOriginally bred in the Netherlands, Strawberry is a mostly sativa cannabis strain with a pungent fruity scent and uplifting effects. Consumers prone to anxiety choose Strawberry for its stress-relieving qualities without the jarring paranoia common among high-THC strains (which makes it great for small talk with people you don’t know). Comfortable and relaxing, Strawberry brings with it a hearty dose of physical and mental ease.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/22124021/best-cannabis-strains-for-parties.jpg","urlslug":"/news/strains-products/the-13-best-cannabis-strains-for-parties"},{"id":"contentitems-3537","title":"The Best Cannabis Strains for the Holidays (According to Leafly Reviewers)","author":"Brett Konen","category":null,"date":"\/Date(1450897200000)\/","text":"The holidays are fast approaching, so naturally you’re thinking about the perfect cannabis strains to enjoy over the upcoming weeks. Have innumerable aunts, uncles, in-laws, and second cousins coming into town for the long weekend? You’ll probably need something to chill you out after all that family time. Wanting to keep moving in spite of the weather? You’re after something active. Have about a thousand errands left to run? Something to spice up the process would be nice.\nLuckily, Leafly user reviews are a gold mine of suggestions for cannabis strains that fit any scenario, so we’ve compiled a few great user-sourced recommendations for a range of seasonal activities listed below. Whether you’re grocery shopping, cocoa-sipping, or baking some cannabis-infused holiday cookies, try out one of the ideas below and enjoy your holiday celebrations!\n\nFor Coping with Winter\n  “This is the perfect strain to make Seattle winter days productive! A couple hits gives my ambition, creativity and libido a jump-start.” –munin.raven\n \n “My go to for getting my figure back after holiday indulgence!” –grngrazer\n \n “Smooth pull, great taste – exactly what I hoped for…real killer high to cure the inevitable holiday blues.” –hazedandconfused\nFor Spending Time with Family \u0026 Friends\n “Smells like Christmas trees, tastes like pine and lightens the heart and mind…I found it made the whole holiday with ALL the family, very enjoyable. Oh and added benefits of not breaking ornaments or dropping the turkey.” –Free_Byrd\n \n “Smoked this with my Nana and great Uncle Pete while on winter vacation…Made me forget how much my back hurt from sleeping on an air mattress.” –somniumtextrix\n \n “A swift cerebral head high, accompanied by a punch of energy. Best used at a party with friends as is very good for getting you in the mood, to talk, dance, whatever!” –JustAnotherStoner\nFor Curling Up by the Fire\n “I could feel every atom in my body float away in rhythm with the space heater I was sitting next to. Perfect for sitting home on a cold winter evening and then getting a good night sleep.” –Anonymous\n \n “I enjoyed a blunt and hits from my vaporizer along side with a cup of hot chocolate, it was a great combo…pick it up for a stay-at-home type of day.” –kushconnoisseur420\n \n “I’m washing it down with some seasonal ale and it’s the perfect end to a perfect night.” –BudseyXO\nLooks, Smells, and Tastes Like Christmas\n “When I opened the bag I thought I was suddenly on a camping trip. It smelled like a Christmas tree…The taste of pine, clove and earth danced across across my palate.” –robmacpheejr\n \n “Nom nom nom like a Christmas tree with a lifesaver candy cane in your mouth.” –greedyguy\n \n “Feels like I threw a Christmas tree in a wood chipper… lights, ornaments, candy canes – everything – and put it in my Pax to vape it.’” –Midnyte003\nFor Making Spirits Bright\n “This is like that one ‘big’ present hidden behind the tree just when you think you didn’t get what you ‘really’ wanted that year. It’s that good.” –Anonymous\n \n “My brain lit up like Times Square on New Years Eve.” –Grumple\n \n “This strain had me smiling like the Grinch that stole Christmas.” –Skyclub\n \n “Like skating across a frozen lake surrounded by snowflakes in the night.” – bugpowderdustmugwumpjism\n \n “BEST. STRAIN. EVER. Four for you, Sour D, you go Sour D.” –Anonymous\nWhat are some of your favorite strains to enjoy over the holidays? Share in the comments!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12002805/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re.jpg","urlslug":"/news/strains-products/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re"}],"reviewCount":351,"flavors":[{"name":"Lemon","score":48.9791088379425},{"name":"Citrus","score":33.349718138514788},{"name":"Earthy","score":17.259411089407489},{"name":"Sweet","score":13.642331482814161},{"name":"Skunk","score":13.586965833933037}],"effects":[{"name":"Happy","score":64.572945581028748},{"name":"Relaxed","score":59.996444604365855},{"name":"Creative","score":47.695846612521848},{"name":"Uplifted","score":46.326912203145881},{"name":"Euphoric","score":43.806222370720675}],"symptoms":[{"name":"Stress","score":29.393376683458413},{"name":"Pain","score":24.1042973167472},{"name":"Insomnia","score":23.439159898564135},{"name":"Lack of Appetite","score":19.984321990336177},{"name":"Depression","score":19.0881909461636}],"conditions":[{"name":"Anxiety","score":21.89566841437922},{"name":"Migraines","score":12.547440971865255},{"name":"ADD/ADHD","score":12.364959220040436},{"name":"PMS","score":10.687497858195401},{"name":"Anorexia","score":10.505016106370583}],"negatives":[{"name":"Dry Mouth","score":23.8219003803845},{"name":"Dry Eyes","score":12.69083478976046},{"name":"Anxious","score":10.687497858195401},{"name":"Dizzy","score":8.4452426236249618},{"name":"Paranoid","score":8.1450687090915324}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/lemon-og/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/lemon-og/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_1f3b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648234/b/lemon-og-kush__primary_37e7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_4d0e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/641326/b/lemon-og-kush__primary_b910.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_79b9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/641007/b/lemon-og-kush__primary_b564.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_964e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/638666/b/lemon-og-kush__primary_b4eb.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_b6e8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/629811/b/lemon-og-kush__primary_0716.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemon-og-kush_100x100_e41c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/613164/b/lemon-og-kush__primary_0ec1.jpg"}],"photoTotalCount":100,"popularCities":["Seattle, WA","Portland, OR","Spokane, WA","Everett, WA","Bellingham, WA","Denver, CO","Mount Vernon, WA","Phoenix, AZ","Shoreline, WA","Tacoma, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/lemon-og","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.32478632478632/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Lemon Skunk","subtitle":null,"slug":"lemon-skunk","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/lemon-skunk","symbol":"Ls","applink":"leafly://strain/lemon-skunk"},{"name":"OG #18","subtitle":null,"slug":"og-18","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-18","symbol":"O18","applink":"leafly://strain/og-18"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
