{
    "aka": null,
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Lisa Rough",
            "category": null,
            "date": "/Date(1491865568000)/",
            "id": "contentitems-24013",
            "text": "In honor of National Siblings Day, we decided to take a look at some of the most popular strains in cannabis and their offspring. There are quite a few strains that share genetics, but it just might surprise you to find out which strains are siblings.\n  Granddaddy Purple\nGDP is one of the oldest and most well-known strains. Let’s check out the kiddos!\nCandyland\nThis sativa-dominant hybrid is an award-winning strain from GDP and Bay Platinum Cookies. Its sativa side stems from the Platinum Cookies parent, which was created from OG Kush, Durban Poison, and a third unknown strain. Candyland is a rare sativa known for its relaxing relief from muscle aches with the added benefit of uplifting and stimulating effects.\nCherry Pie\nCherry Pie is renowned for its strong effects and high potency. The offspring of two cannabis heavyweights–GDP and Durban Poison–Cherry Pie has a fruity flavor and a high that can last several hours. Although there are claims that this strain tastes like real cherry pie, others compare the flavor to berries, much like the flavor of GDP. This sweet strain will melt away your stress and bring on a strong craving for your favorite munchies!\n\n  Blueberry\nBlueberry’s fruity genetics provide the backdrop for some of the most common and delicious strains available.\nBlue Dream\nThe “Blue” in this sativa-dominant celebrity strain comes from the Blue in Blueberry, while the “Dream” comes from another champion strain, Haze, a dreamy and euphoric sativa. Blue Dream is easily the most popular strain on Leafly, and its mild, uplifting effects make it the perfect strain for novice smokers.\nBerry White\nBerry White may be the offspring of two legendary strains, but this relaxing indica is famous in its own right for its balanced effects and a euphoric escape from stress and anxiety. With parentage from Blueberry and the epic hybrid White Widow, Berry White tends to taste like overripe sour blueberries and offers such mind-bending effects that you may forget you have arms.\n\n  Trainwreck\nA freight train of a hybrid strain, Trainwreck is sure to knock your socks off. What about its offspring?\nCasey Jones\nA little history lesson for you: Casey Jones is the name of a famous train engineer who was killed in a train wreck in 1900. However, for those of you who were raised on Saturday morning 90s cartoons, the name may sound more familiar as the hockey-masked vigilante from Teenage Mutant Ninja Turtles. Either way, this earthy sativa combines Oriental Express (an offshoot of Trainwreck and Thai) with East Coast Sour Diesel to create a power-packed punch that’s great for inspiring creativity.\nPineapple Express\nAh yes, everyone’s favorite movie-turned-famous-strain is known for its fruity sweet undertones. But did you know that it has roots in the speedy hybrid, Trainwreck? Pineapple Express is more than just a famous name, it combines Trainwreck and Hawaiian for a long-lasting energetic buzz and a sweet mango and pineapple citrus flavor that makes for one golden afternoon.\n\n  GSC (f.k.a Girl Scout Cookies)\nGSC (f.k.a Girl Scout Cookies) is the Genghis Khan of genetic stomp-arounds–these days, it seems like there are Cookies genetics in every new strain.\nSunset Sherbet\nSunset Sherbet is the heir apparent to the GSC throne. It’s known to have the heady, cerebral effects of GSC with an intoxicating boost from a heavy indica known as Pink Panties. Sunset Sherbet is so nicknamed due to its sweet, sherbet-like flavor, and tends to lean more heavily towards its indica roots than the standard GSC, so be prepared for a calm, relaxing high.\nMoon Cookies\nThis intergalactic herb crosses GSC (f.k.a Girl Scout Cookies) with another phenotype of itself to create a complex woody, earthy scent with some strong, heavy indica-leaning relaxation. These buds are hard, dense, resinous rocks that taste like cookie dough and will send you soaring up to the stars. But don’t consume too much Moon Cookies or you just might get lost in space.\n\n  Jack Herer\nOne of the most notorious cannabis activists spawned this world-renowned sativa, and Jack Herer‘s litany of offspring continues to expand with no end in sight.\nXJ-13\nWhat sounds like a top-secret government experiment is actually one of the most delightfully uplifting hybrids you can find. XJ-13 combines Jack Herer’s warm, fuzzy sativa genetics with the dreamy high of G13 Haze to create a stimulating and euphoric experience. It’s not heavy enough to make you feel asleep, but not stimulating enough to cause paranoia, giving consumers a perfectly balanced buzz that is high, happy, and carefree.\nDragon’s Breath\nThis sativa-dominant hybrid was born of two heavyweight strains, Jack Herer and Northern Lights. The name Dragon’s Breath is a reference to the spicy flavor and aroma accompanied by this hazy strain, but it won’t burn you out. Instead, you can expect a clear-headed, energetic, productive high. But be forewarned–too much of the Dragon may leave you feeling a bit paranoid.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/04/10154425/national-sibling-day.jpg",
            "title": "10 Strains You Might Not Know Are Siblings",
            "urlslug": "/news/strains-products/10-strains-might-not-know-siblings"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1494538454000)/",
            "id": "contentitems-26321",
            "text": "Five contestants lean back into the couch, disappearing inch by inch into the cushions with every puff off the vaporizer or joint. A golden trophy, filled to the brim with a mixed ounce of Rainbow Jones, Moon Cookies, and Thin Mint GSC, sits nobly among a table full of snacks. The winner of Leafly’s High Five Virtual Reality Challenge would be the proud owner of the stash, but six episodes would stand between them and their prize.\nVR Challenge Episode 6: The Final VR Showdown\nWatch as our two finalists go head to head playing two familiar titles: Space Pirate Trainer and Fruit Ninja. Does our leader to-date maintain their winning streak or will the underdog blast their way to the top to take home the championship trophy? Tune in to find out!\n\nVR Challenge Episode 5: QuiVr\nIn our fifth episode of Leafly’s High Five VR Challenge, the final three contestants, armed with only an imaginary bow and a few arrows, take down as many advancing enemies as they can in the fast-paced virtual world of QuiVr. After a nail-biting sudden death round, only two contestants remain. Who will advance to the final VR showdown?\n\nVR Challenge Episode 4: Audioshield\nThe stakes get higher (and so do the contestants) in our fourth episode of Leafly’s High Five VR Challenge. The remaining four participants go up against some pretty intimidating sound orbs in Audioshield as they continue to vie for first place while avoiding the dreaded consolation doughnut.\n\nVR Challenge Episode 3: Space Pirate Trainer\nIn Episode 3 of Leafly’s High Five VR Challenge, the stoned contestants get one step closer to the green grand prize in an attempt to master Space Pirate Trainer.\n\nVR Challenge Episode 2: Racket: Nx\nFor Round 2 of Leafly’s High Five VR Challenge, our contestants enter the psychedelic space world of Racket: Nx.\n\nVR Challenge Episode 1: Fruit Ninja\nIn this inaugural episode, watch the five fearless contestants pass around the DaVinci IQ vaporizer before they slice and dice their way through a rousing game of Fruit Ninja.\n\nMeet the Contestants: \n\nJosh, the familiar bearded face found on the popular YouTube channel Strain Central\nSasha, AKA SilencedHippie, another social media cannabis maven\nYouTuber and strain reviewer Ashley, better known as Positive Smash 420\nJamila, a cannabis enthusiast who came dressed ready to play “Space Pirate Trainer”\nWill, a budtender by day and EDM bandmate/harp player by night\n\nThank you to our five participants and DaVinci for making the first ever Leafly High Five VR Challenge so much fun!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/05/12152240/vr-episode-6.jpg",
            "title": "Who Won Leafly's High Five VR Challenge? Watch the Exciting Conclusion",
            "urlslug": "/news/lifestyle/competing-in-virtual-reality-while-high"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 7.5
        },
        {
            "name": "ADD/ADHD",
            "score": 1.6666666666666667
        },
        {
            "name": "Arthritis",
            "score": 1.6666666666666667
        },
        {
            "name": "Hypertension",
            "score": 1.6666666666666667
        },
        {
            "name": "Migraines",
            "score": 1.6666666666666667
        }
    ],
    "description": "<p>Moon Cookies is a twice deep GSC x GSC cross that is certain to moon rock you! This intergalactic herb&rsquo;s stinky-sweet <a href=\"https://www.leafly.com/news/cannabis-101/terpenes-the-flavors-of-cannabis-aromatherapy\">terpene profile</a> is a complex melange of dough, earth, and green forest. The effects are those of classic <a href=\"https://www.leafly.com/hybrid/girl-scout-cookie\">Girl Scout Cookies</a>, and the buds are resinous rocks that are hard and dense. Enjoy Moon Cookies into the afternoon as the physical effects of this strain can get heavier and more sedative with continued consumption. But in good measure, Moon Cookies offers a bright cerebral buzz that can improve mood while its physical effects mute minor physical discomfort, nausea, and stress. &nbsp; &nbsp;&nbsp;</p>\n",
    "descriptionPlain": "Moon Cookies is a twice deep GSC x GSC cross that is certain to moon rock you! This intergalactic herb&rsquo;s stinky-sweet terpene profile is a complex melange of dough, earth, and green forest. The effects are those of classic Girl Scout Cookies, and the buds are resinous rocks that are hard and dense. Enjoy Moon Cookies into the afternoon as the physical effects of this strain can get heavier and more sedative with continued consumption. But in good measure, Moon Cookies offers a bright cerebral buzz that can improve mood while its physical effects mute minor physical discomfort, nausea, and stress. &nbsp; &nbsp;&nbsp;\n",
    "effects": [
        {
            "name": "Euphoric",
            "score": 23.333333333333332
        },
        {
            "name": "Creative",
            "score": 21.666666666666664
        },
        {
            "name": "Happy",
            "score": 17.5
        },
        {
            "name": "Relaxed",
            "score": 17.5
        },
        {
            "name": "Focused",
            "score": 16.666666666666664
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 13.333333333333332
        },
        {
            "name": "Citrus",
            "score": 9.999999999999998
        },
        {
            "name": "Blueberry",
            "score": 5.833333333333333
        },
        {
            "name": "Spicy/Herbal",
            "score": 4.166666666666666
        },
        {
            "name": "Mint",
            "score": 4.166666666666666
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png",
            "id": 1382662,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "WHOOA!! If this strain doesn't relax you and chill you down for a bit, nothing will!! Taste is amazing, smell of the bud is intoxicating, nice chunky buds! Deep, dark purple flecks, with bright green and a touch of blue!!\nAll around, great for medicinal purposes.",
            "username": "gva1018"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1610903,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Me being a huge fan of GSC made picking up this strain very simple and easy. You can expect all of the GSC effects but literally x2",
            "username": "MitchellandFinese"
        }
    ],
    "id": 273199,
    "name": "Moon Cookies",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 11.666666666666666
        },
        {
            "name": "Dry Eyes",
            "score": 9.999999999999998
        },
        {
            "name": "Dizzy",
            "score": 5.833333333333333
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/girl-scout-cookie",
            "category": "Hybrid",
            "name": "Girl Scout Cookies",
            "permalink": "https://mobileapi.leafly.com/hybrid/girl-scout-cookie",
            "slug": "girl-scout-cookie",
            "subtitle": null,
            "symbol": "Gsc"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/moon-cookies",
    "photoTotalCount": 4,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/643789/b/moon-cookies__primary_85ff.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/moon-cookies_100x100_11be.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/642797/b/moon-cookies__primary_3d61.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/moon-cookies_100x100_2b09.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/641770/b/moon-cookies__primary_2ad3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/moon-cookies_100x100_28f0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639793/b/moon-cookies__primary_c770.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/moon-cookies_100x100_dca1.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Bothell, WA",
        "Bremerton, WA",
        "Everett, WA",
        "Granite Falls, WA",
        "Mount Vernon, WA",
        "Redmond, WA",
        "Spanaway, WA"
    ],
    "rating": 4.75,
    "relatedStrains": [],
    "reviewCount": 16,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "moon-cookies",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.75/240",
    "subtitle": null,
    "symbol": "Mck",
    "symptoms": [
        {
            "name": "Pain",
            "score": 114.16666666666667
        },
        {
            "name": "Lack of Appetite",
            "score": 12.5
        },
        {
            "name": "Stress",
            "score": 9.999999999999998
        },
        {
            "name": "Headaches",
            "score": 8.333333333333332
        },
        {
            "name": "Depression",
            "score": 7.5
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
