{"sl_translate":"description,descriptionPlain,category","id":97680,"slug":"superglue","name":"Superglue","subtitle":null,"symbol":"Spg","category":"Hybrid","description":"\u003cp\u003eSuperglue is a \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e strain bred by Seedism Seeds. A cross between \u003ca href=\"http://leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e\u0026nbsp;and \u003ca href=\"http://leafly.com/indica/northern-lights\"\u003eNorthern Lights\u003c/a\u003e, Superglue inherits \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e growth patterns along with a sweet caramel and pine aroma. Superglue brings calming relaxation to\u0026nbsp;the mind and body, but leaves you functional and energetic enough for social activities or a productive afternoon.\u003c/p\u003e\n","descriptionPlain":"Superglue is a hybrid strain bred by Seedism Seeds. A cross between Afghani\u0026nbsp;and Northern Lights, Superglue inherits indica growth patterns along with a sweet caramel and pine aroma. Superglue brings calming relaxation to\u0026nbsp;the mind and body, but leaves you functional and energetic enough for social activities or a productive afternoon.\n","aka":"Super Glue","rating":4.66,"highlightedReviews":[{"id":1410673,"username":"OccamsPhazer","text":"Method: Wolf-LX Vap\nGrind: Medium\nPulls: 4-7\nRating: 4.5/5.0\n\nWell, this was an impulse purchase. And i\u0027m glad for it. Usually, my delivery service has a rounded selection of good kind. Its pretty consistent. And every so often, they carry some new stuff that I haven\u0027t come across to sample. Today was one of those days. And Super Glue was the mismatched sock that stood out. I mean the name sounds powerful. But I\u0027ve been fooled by the name before. Pineapple Express comes to mind. And what a let down that high was... So, I conclude that knowledge is power. My next move is to look up thc%, to glance over previous reviews, and finally, I pull out my 8x photo loop and a nice l.e.d white light so I may observe the trichome characteristics. In general, I do notice a favoring trend between thc%, (subjective high), and \"degrees of frostiness\". Good bud has layered, highly visible, thick fields(large or small droplets, either) of crystals. \nI digress... Super Glue is a vibrant green to see. Really fresh and plump. It caught my eye immediately. Proud looking. I could feel myself looking forward to popping open the box lid, and sticking my nose in for a deep pull. Pungent, yes. A sharp sweet dirty earthiness to SG. Bright. Crisp. \nIn my vap it smoked a little better around 420 than it did at 390 or 400 respectively. I bet this would be tasty in a joint or a bong. Alas, no combust for me... anyways, why lament? Let\u0027s vap some Super Glue!!! I expected more resistance from the bud while being packed down the vap chamber opening. Typically, really sticky strains get hung up. Super Glue is not crazy sticky, but it does have weight to it. Resin weight too... as well as pull weight. Off a nicely packed chamber, I got some really plummy vapor rolls. And the taste... yummy sweet waxy petrol and pine and earth, as it rolls off the lips and just hangs on a bit, before leaping over into an ever-thinning-slice of Rocky Mountain atmosphere. I always get em\u0027 confused. Which one\u0027s body and which one is heady? Super Glue is a body heavy high for sure. Its fast acting. Warm and tingly straight away. Face is a flush with the nano scale hum of a trillion little points of electric fire... kinda thing. It feels like a heavy high to me. It could be just me, everything is heavy of late. But still... the high feels deep. Perhaps not a wake me up. It\u0027s the evening, and the day is behind me... perhaps that influences? A morning wake and bake ought be in order. Examine after a fresh sleep. I know, it sounds like I\u0027m disapointed. Maybe... but maybe not the weeds fault. I\u0027ve been consuming copious amounts of pot butter lately. If i were a cloud, I would be saturated in full, and raining... as it were, thc. And no! Not disapointed at all. I\u0027m very aware of the high. Nothing subtle about it. I\u0027ve been vaping White Widow all day or so... and that strain wasn\u0027t picking up at all. No matter how much I vaped. And O\u0027l Super Glue here, sure right as rain, did change up the game a bit. Feels like it leaves the mind pretty much alone. My focus is still good. It\u0027s not an euphoric high, I\u0027ll say that. It is a mellowish high... but I don\u0027t mean weak!! Hard to explain kind of.. I guess I\u0027m a little out of touch with what it is to be relaxed. Maybe that\u0027s it...?\nI think that this is one of the least helpful reviews I\u0027ve written so far... lol.\nThe Super Glue... I love it!\n\nCheers,\nOccamsPhazer","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1641742,"username":"Zinzah","text":"Another great strain! Mild glue taste and feel in my mouth, but awesome pain relief. Did not have to smoke a lot of this strain for results. ❤️ Thanks Crystal","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-16353","title":"The Top Trending Cannabis Strains of 2016","author":"Bailey Rahn","category":null,"date":"\/Date(1484957722000)\/","text":"Every year we like to look back and recognize the rising stars of the cannabis world. Last year, GG4 (f.k.a Gorilla Glue #4), Critical Kush, Candyland, and ACDC were among the fastest trending strains according to Leafly user strain reviews, but which strains stood out from the crowd this year?\nTo eliminate outliers that might skew the results, we restricted our search to the top 200 ranking strains of 2016. These strains tend to be more available nationwide, and we hope you’re able to find them in your area!\nBudtenders and inventory managers – are these trending strains on your menu? If not, consider keeping an eye out for them. Because in 2016, they were flying off the shelves fast.\n\n#10. Blue Cookies\n\nWe all know that customers swarm around anything containing the word “Cookies,” thanks to the Girl Scout Cookie hype. But what makes Blue Cookies stand out from the many, many other Cookie crosses? The addition of Blueberry indica genetics, of course.\n#9. Birthday Cake Kush\n\nAnother decadent GSC (f.k.a Girl Scout Cookies) cross, Birthday Cake Kush also pulls in genetics from Cherry Pie to achieve a dessert-like taste that’s not altogether unlike cake itself. It may not be your birthday, but the luxurious and relaxing qualities of this potent hybrid are certainly something to celebrate.\n#8. Sour Tangie\n\nThe citrus-loaded sativa strain Tangie can’t possibly be improved. Or can it? DNA Genetics has done it again, spinning their Tangie masterpiece with the help of East Coast Sour Diesel genetics. Sour Tangie improves the fuel-like taste of Sour Diesel without compromising Sour D’s high-flying creative effects, making this sativa a must-have for flavor enthusiasts and artists alike.\n#7. Purple Candy\n\nPurple Candy blossomed in British Columbia, Canada. Believed to be a cross between BC Sweet Tooth and Mendocino Purps, it’s as sticky and sweet as grape hard candy. But you won’t feel a sugar rush with this indica; instead, expect the heavy-hitter to prime you for bedtime or a solid nap.\n#6. Quantum Kush\n\nA good sativa can lend a positive spark to an otherwise dreary day of chores, so it’s no wonder that Quantum Kush tipped the charts in 2016 as one of the fastest trending sativa strains. While some sativas bring on the buzz with a bit too much gusto, resulting in anxiety and paranoia, Quantum Kush manages to deliver creative, talkative, giggly qualities without what we like to call “The Fear.”\n#5. God’s Green Crack\n\nWho knew the not-so holy union of God Bud and Green Crack would result in something so heavenly? God Bud is known for producing mammoth yields of gargantuan buds, but the effects are a little heavy-handed for some. That’s why Jordan of the Islands crossbred God Bud with Green Crack, the high-flying sativa strain that focuses all of its effort on elevating the mind to a place where laughing fits are inevitable.\n#4. Gelato\n\nA new generation of GSC (f.k.a Girl Scout Cookies) has arrived, and its name is Gelato. From the same breeders that delivered fan favorites Sunset Sherbet and GSC (f.k.a Girl Scout Cookies), Cookie Fam Genetics from Bay Area, California isn’t finished with their royal line quite yet. Gelato, a descendent of Sunset Sherbet and Thin Mint GSC (f.k.a Girl Scout Cookies), blooms in bright colors that are almost as inviting as its tantalizing dessert-like aroma.\n#3. Grape Stomper\n\nGrape Stomper isn’t a new strain, but a jump in Leafly reviews will show that not all good things are sparkly and new. Strong genetics inherited from Purple Elephant and Chemdawg Sour Diesel equip this strain with the full package: flavor, potency, and consistency. Relaxing without encumbering social skills, the balanced Grape Stomper is an excellent choice for so many different activities. No wonder its popularity isn’t waning.\n#2. Nuken\n\nNuken is also an older strain making a comeback. Originally found in Canada, it’s since proliferated throughout the Pacific Northwest to states like Washington and Oregon. Herbal and sweet in flavor, Nuken cradles you in a blanket of dreamy euphoria where your thoughts can float upward to bliss.\n#1. Superglue\n\nLast year, the top trending strain was GG4 (f.k.a Gorilla Glue #4). This year it’s Superglue, which surprisingly bears no family ties to last year’s champ. A cross between Northern Lights and Afghani, Superglue develops a thick coat of sticky resin that will quite literally glue your fingers together. Though its parentage may lead you to believe Superglue will be a knockout, this strain is bred to deliver more light-footed effects. In fact, Leafly users have described this strain as focusing and creative while simultaneously relaxing the body.\n\nWhat was your favorite strain of 2016? We want to hear from you! Leave your most memorable cannabis varieties in the strain section below.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/20115737/cannabis-flower-up-close.jpg","urlslug":"/news/strains-products/top-trending-cannabis-strains-2016"},{"id":"contentitems-3527","title":"The 2015 NorCal Cannabis Cup Winners","author":"Lisa Rough","category":null,"date":"\/Date(1435011180000)\/","text":"There was some beautiful competition at the NorCal High Times Cannabis Cup this past weekend and we were there to cover all of the action. Among all of the hubbub and hoopla, here are the winners of this year’s 2015 NorCal Cannabis Cup:\n \nCANNABIS FLOWER WINNERS\n\nBest Sativa Cannabis Strains\n1st Place: Schlemons by The Source Genetics\n2nd Place: Super Silver Haze by Life is Good\n3rd Place: Super Glue by Vallejo Patients Care\n \nBest Indica Cannabis Strains\n1st Place: Zkittles by 3rd Gen Family\n2nd Place: Kosher Kush from DNA by Greenwolf Los Angeles and Cali Kush Farms\n3rd Place: 24K OG Kush by Strain Collective with Pearl Pharma\n \nBest Hybrid Cannabis Strains\n1st Place: Orange Crush by Cannabiotix\n2nd Place: Tahoe Chem by C.R.A.F.T.\n3rd Place: Chiquita Banana by Utopia Meds – Santa Cruz\n \nBest CBD Cannabis Flower\n1st Place: CBD OG by C.R.A.F.T.\n2nd Place: Doctor Cookies by Northstar Holistic Collective\n3rd Place: Sunkiss CBD by California Growers Guild\n \nCANNABIS CONCENTRATE WINNERS\n\nBest Sativa Cannabis Concentrates\n1st Place: Citrix #4 by Gold Coast Collection with Apothecary 420\n2nd Place: Purple Tangie by Zeinstein Gardens \u0026 Loudpack Extracts\n3rd Place: Double Tangie Banana by Crockett Family Farms\n \nBest Indica Cannabis Concentrates\n1st Place: AHHS Brand OG by Alternative Herbal Health Services\n2nd Place: Banana OG by Crockett Family Farms\n3rd Place: Crown OG Live Resin by Prime Extractions\n \nBest Hybrid Cannabis Concentrates\n1st Place: Emperors Mandarins “Shatter” by the Kind Center with Unregistered Extracts\n2nd Place: Emperors Mandarins by Greenwolf Collective X Cali Kush Farms\n3rd Place: Crown OG x Dab Vader OG Zombie Resin by Crown Genetics\n \nBest Non-Solvent Hash Products\n1st Place: Kimbo Kush Cubantech Drysift by Cubanhashqueen with Exotic Genetix\n2nd Place: Cookies \u0026 Cream Cubantech Drysift by Exotic Genetix\n3rd Place: Peaches ‘N Cream by Full Flava Extracts with E.T. Extracts\n \nCANNABIS-INFUSED EDIBLE WINNERS\n\n1st Place: Dark Chocolate Macaroons by Utopia Meds\n2nd Place: Pineapple Delight Bites by Lifted Edibles\n3rd Place: Cinnamon Maple Tree Hugger – Om Edibles \u0026 Gold Drop Collaboration\n \nCANNABIS TOPICAL WINNERS\n\n1st Place: Crown OG “It’s the Balm Haling Salve” by Crown Genetics\n2nd Place: Honey Pot Bear Butter by Honey Pot with Pure Joy Collective\n3rd Place: Absorb CBD Topical Relief by Absorb with Seasonal Apothecary\n \nHIGH CBD PRODUCT WINNERS\n\nBest High CBD Cannabis Concentrates\n1st Place: Goji D.C. Live Resin by Moxie Genetics\n2nd Place: ACDC by Scapegoat Genetics\n3rd Place: ACDC by Dankman Extrax\n \nBest High CBD Cannabis Edibles\n1st Place: Raw CBD Sipping Cacao by Om Edibles All Female Collective\n2nd Place: Beezle’s CBD Brulee – Chocolate Orange by Beezle Extracts\n3rd Place: CBD/THC Honey by Baked Beez with the W.E.E.D. Studio City","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/06/12002748/the-2015-norcal-cannabis-cup-winners.jpg","urlslug":"/news/strains-products/the-2015-norcal-cannabis-cup-winners"}],"reviewCount":207,"flavors":[{"name":"Pine","score":29.727466947178321},{"name":"Earthy","score":27.33219918499573},{"name":"Pungent","score":22.751872857471998},{"name":"Woody","score":20.199748191142007},{"name":"Sweet","score":9.8414907456753813}],"effects":[{"name":"Relaxed","score":99.996974570098047},{"name":"Happy","score":65.460994063175633},{"name":"Euphoric","score":64.933463814694747},{"name":"Uplifted","score":45.731932947164353},{"name":"Focused","score":36.253901059133185}],"symptoms":[{"name":"Stress","score":52.614669611418435},{"name":"Pain","score":32.88200125206253},{"name":"Insomnia","score":29.488516166268315},{"name":"Depression","score":28.148367082391765},{"name":"Lack of Appetite","score":25.8992508570112}],"conditions":[{"name":"Anxiety","score":55.462646413352857},{"name":"Migraines","score":24.320209173568912},{"name":"PTSD","score":17.711681184851439},{"name":"ADD/ADHD","score":16.293103648901187},{"name":"Gastrointestinal Disorder","score":15.758358913731028}],"negatives":[{"name":"Dry Mouth","score":44.430707182603314},{"name":"Dry Eyes","score":23.646527388286},{"name":"Dizzy","score":10.664873129760689},{"name":"Anxious","score":6.6869564407911728},{"name":"Paranoid","score":4.7300269263261274}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_9d73.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002875/b/superglue__primary_44b2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_d524.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002874/b/superglue__primary_4237.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_562a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/675283/b/superglue__primary_9102.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_9dc0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/652042/b/superglue__primary_ddab.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_fb40.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/637776/b/superglue__primary_e236.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_9593.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636362/b/superglue__primary_7fa2.jpg"}],"photoTotalCount":49,"popularCities":["Detroit, MI","Phoenix, AZ","Los Angeles, CA","Tucson, AZ","Bozeman, MT","West Hollywood, CA","Addison, IL","Ann Arbor, MI","Bethesda, MD","Bothell, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/superglue","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.65700483091787/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Northern Lights","subtitle":null,"slug":"northern-lights","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/northern-lights","symbol":"Nl","applink":"leafly://strain/northern-lights"},{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":54,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":97680,"slug":"superglue","name":"Superglue","subtitle":null,"symbol":"Spg","category":"Hybrid","description":"\u003cp\u003eSuperglue is a \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e strain bred by Seedism Seeds. A cross between \u003ca href=\"http://leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e\u0026nbsp;and \u003ca href=\"http://leafly.com/indica/northern-lights\"\u003eNorthern Lights\u003c/a\u003e, Superglue inherits \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e growth patterns along with a sweet caramel and pine aroma. Superglue brings calming relaxation to\u0026nbsp;the mind and body, but leaves you functional and energetic enough for social activities or a productive afternoon.\u003c/p\u003e\n","descriptionPlain":"Superglue is a hybrid strain bred by Seedism Seeds. A cross between Afghani\u0026nbsp;and Northern Lights, Superglue inherits indica growth patterns along with a sweet caramel and pine aroma. Superglue brings calming relaxation to\u0026nbsp;the mind and body, but leaves you functional and energetic enough for social activities or a productive afternoon.\n","aka":"Super Glue","rating":4.66,"highlightedReviews":[{"id":1410673,"username":"OccamsPhazer","text":"Method: Wolf-LX Vap\nGrind: Medium\nPulls: 4-7\nRating: 4.5/5.0\n\nWell, this was an impulse purchase. And i\u0027m glad for it. Usually, my delivery service has a rounded selection of good kind. Its pretty consistent. And every so often, they carry some new stuff that I haven\u0027t come across to sample. Today was one of those days. And Super Glue was the mismatched sock that stood out. I mean the name sounds powerful. But I\u0027ve been fooled by the name before. Pineapple Express comes to mind. And what a let down that high was... So, I conclude that knowledge is power. My next move is to look up thc%, to glance over previous reviews, and finally, I pull out my 8x photo loop and a nice l.e.d white light so I may observe the trichome characteristics. In general, I do notice a favoring trend between thc%, (subjective high), and \"degrees of frostiness\". Good bud has layered, highly visible, thick fields(large or small droplets, either) of crystals. \nI digress... Super Glue is a vibrant green to see. Really fresh and plump. It caught my eye immediately. Proud looking. I could feel myself looking forward to popping open the box lid, and sticking my nose in for a deep pull. Pungent, yes. A sharp sweet dirty earthiness to SG. Bright. Crisp. \nIn my vap it smoked a little better around 420 than it did at 390 or 400 respectively. I bet this would be tasty in a joint or a bong. Alas, no combust for me... anyways, why lament? Let\u0027s vap some Super Glue!!! I expected more resistance from the bud while being packed down the vap chamber opening. Typically, really sticky strains get hung up. Super Glue is not crazy sticky, but it does have weight to it. Resin weight too... as well as pull weight. Off a nicely packed chamber, I got some really plummy vapor rolls. And the taste... yummy sweet waxy petrol and pine and earth, as it rolls off the lips and just hangs on a bit, before leaping over into an ever-thinning-slice of Rocky Mountain atmosphere. I always get em\u0027 confused. Which one\u0027s body and which one is heady? Super Glue is a body heavy high for sure. Its fast acting. Warm and tingly straight away. Face is a flush with the nano scale hum of a trillion little points of electric fire... kinda thing. It feels like a heavy high to me. It could be just me, everything is heavy of late. But still... the high feels deep. Perhaps not a wake me up. It\u0027s the evening, and the day is behind me... perhaps that influences? A morning wake and bake ought be in order. Examine after a fresh sleep. I know, it sounds like I\u0027m disapointed. Maybe... but maybe not the weeds fault. I\u0027ve been consuming copious amounts of pot butter lately. If i were a cloud, I would be saturated in full, and raining... as it were, thc. And no! Not disapointed at all. I\u0027m very aware of the high. Nothing subtle about it. I\u0027ve been vaping White Widow all day or so... and that strain wasn\u0027t picking up at all. No matter how much I vaped. And O\u0027l Super Glue here, sure right as rain, did change up the game a bit. Feels like it leaves the mind pretty much alone. My focus is still good. It\u0027s not an euphoric high, I\u0027ll say that. It is a mellowish high... but I don\u0027t mean weak!! Hard to explain kind of.. I guess I\u0027m a little out of touch with what it is to be relaxed. Maybe that\u0027s it...?\nI think that this is one of the least helpful reviews I\u0027ve written so far... lol.\nThe Super Glue... I love it!\n\nCheers,\nOccamsPhazer","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1641742,"username":"Zinzah","text":"Another great strain! Mild glue taste and feel in my mouth, but awesome pain relief. Did not have to smoke a lot of this strain for results. ❤️ Thanks Crystal","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-16353","title":"The Top Trending Cannabis Strains of 2016","author":"Bailey Rahn","category":null,"date":"\/Date(1484957722000)\/","text":"Every year we like to look back and recognize the rising stars of the cannabis world. Last year, GG4 (f.k.a Gorilla Glue #4), Critical Kush, Candyland, and ACDC were among the fastest trending strains according to Leafly user strain reviews, but which strains stood out from the crowd this year?\nTo eliminate outliers that might skew the results, we restricted our search to the top 200 ranking strains of 2016. These strains tend to be more available nationwide, and we hope you’re able to find them in your area!\nBudtenders and inventory managers – are these trending strains on your menu? If not, consider keeping an eye out for them. Because in 2016, they were flying off the shelves fast.\n\n#10. Blue Cookies\n\nWe all know that customers swarm around anything containing the word “Cookies,” thanks to the Girl Scout Cookie hype. But what makes Blue Cookies stand out from the many, many other Cookie crosses? The addition of Blueberry indica genetics, of course.\n#9. Birthday Cake Kush\n\nAnother decadent GSC (f.k.a Girl Scout Cookies) cross, Birthday Cake Kush also pulls in genetics from Cherry Pie to achieve a dessert-like taste that’s not altogether unlike cake itself. It may not be your birthday, but the luxurious and relaxing qualities of this potent hybrid are certainly something to celebrate.\n#8. Sour Tangie\n\nThe citrus-loaded sativa strain Tangie can’t possibly be improved. Or can it? DNA Genetics has done it again, spinning their Tangie masterpiece with the help of East Coast Sour Diesel genetics. Sour Tangie improves the fuel-like taste of Sour Diesel without compromising Sour D’s high-flying creative effects, making this sativa a must-have for flavor enthusiasts and artists alike.\n#7. Purple Candy\n\nPurple Candy blossomed in British Columbia, Canada. Believed to be a cross between BC Sweet Tooth and Mendocino Purps, it’s as sticky and sweet as grape hard candy. But you won’t feel a sugar rush with this indica; instead, expect the heavy-hitter to prime you for bedtime or a solid nap.\n#6. Quantum Kush\n\nA good sativa can lend a positive spark to an otherwise dreary day of chores, so it’s no wonder that Quantum Kush tipped the charts in 2016 as one of the fastest trending sativa strains. While some sativas bring on the buzz with a bit too much gusto, resulting in anxiety and paranoia, Quantum Kush manages to deliver creative, talkative, giggly qualities without what we like to call “The Fear.”\n#5. God’s Green Crack\n\nWho knew the not-so holy union of God Bud and Green Crack would result in something so heavenly? God Bud is known for producing mammoth yields of gargantuan buds, but the effects are a little heavy-handed for some. That’s why Jordan of the Islands crossbred God Bud with Green Crack, the high-flying sativa strain that focuses all of its effort on elevating the mind to a place where laughing fits are inevitable.\n#4. Gelato\n\nA new generation of GSC (f.k.a Girl Scout Cookies) has arrived, and its name is Gelato. From the same breeders that delivered fan favorites Sunset Sherbet and GSC (f.k.a Girl Scout Cookies), Cookie Fam Genetics from Bay Area, California isn’t finished with their royal line quite yet. Gelato, a descendent of Sunset Sherbet and Thin Mint GSC (f.k.a Girl Scout Cookies), blooms in bright colors that are almost as inviting as its tantalizing dessert-like aroma.\n#3. Grape Stomper\n\nGrape Stomper isn’t a new strain, but a jump in Leafly reviews will show that not all good things are sparkly and new. Strong genetics inherited from Purple Elephant and Chemdawg Sour Diesel equip this strain with the full package: flavor, potency, and consistency. Relaxing without encumbering social skills, the balanced Grape Stomper is an excellent choice for so many different activities. No wonder its popularity isn’t waning.\n#2. Nuken\n\nNuken is also an older strain making a comeback. Originally found in Canada, it’s since proliferated throughout the Pacific Northwest to states like Washington and Oregon. Herbal and sweet in flavor, Nuken cradles you in a blanket of dreamy euphoria where your thoughts can float upward to bliss.\n#1. Superglue\n\nLast year, the top trending strain was GG4 (f.k.a Gorilla Glue #4). This year it’s Superglue, which surprisingly bears no family ties to last year’s champ. A cross between Northern Lights and Afghani, Superglue develops a thick coat of sticky resin that will quite literally glue your fingers together. Though its parentage may lead you to believe Superglue will be a knockout, this strain is bred to deliver more light-footed effects. In fact, Leafly users have described this strain as focusing and creative while simultaneously relaxing the body.\n\nWhat was your favorite strain of 2016? We want to hear from you! Leave your most memorable cannabis varieties in the strain section below.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/20115737/cannabis-flower-up-close.jpg","urlslug":"/news/strains-products/top-trending-cannabis-strains-2016"},{"id":"contentitems-3527","title":"The 2015 NorCal Cannabis Cup Winners","author":"Lisa Rough","category":null,"date":"\/Date(1435011180000)\/","text":"There was some beautiful competition at the NorCal High Times Cannabis Cup this past weekend and we were there to cover all of the action. Among all of the hubbub and hoopla, here are the winners of this year’s 2015 NorCal Cannabis Cup:\n \nCANNABIS FLOWER WINNERS\n\nBest Sativa Cannabis Strains\n1st Place: Schlemons by The Source Genetics\n2nd Place: Super Silver Haze by Life is Good\n3rd Place: Super Glue by Vallejo Patients Care\n \nBest Indica Cannabis Strains\n1st Place: Zkittles by 3rd Gen Family\n2nd Place: Kosher Kush from DNA by Greenwolf Los Angeles and Cali Kush Farms\n3rd Place: 24K OG Kush by Strain Collective with Pearl Pharma\n \nBest Hybrid Cannabis Strains\n1st Place: Orange Crush by Cannabiotix\n2nd Place: Tahoe Chem by C.R.A.F.T.\n3rd Place: Chiquita Banana by Utopia Meds – Santa Cruz\n \nBest CBD Cannabis Flower\n1st Place: CBD OG by C.R.A.F.T.\n2nd Place: Doctor Cookies by Northstar Holistic Collective\n3rd Place: Sunkiss CBD by California Growers Guild\n \nCANNABIS CONCENTRATE WINNERS\n\nBest Sativa Cannabis Concentrates\n1st Place: Citrix #4 by Gold Coast Collection with Apothecary 420\n2nd Place: Purple Tangie by Zeinstein Gardens \u0026 Loudpack Extracts\n3rd Place: Double Tangie Banana by Crockett Family Farms\n \nBest Indica Cannabis Concentrates\n1st Place: AHHS Brand OG by Alternative Herbal Health Services\n2nd Place: Banana OG by Crockett Family Farms\n3rd Place: Crown OG Live Resin by Prime Extractions\n \nBest Hybrid Cannabis Concentrates\n1st Place: Emperors Mandarins “Shatter” by the Kind Center with Unregistered Extracts\n2nd Place: Emperors Mandarins by Greenwolf Collective X Cali Kush Farms\n3rd Place: Crown OG x Dab Vader OG Zombie Resin by Crown Genetics\n \nBest Non-Solvent Hash Products\n1st Place: Kimbo Kush Cubantech Drysift by Cubanhashqueen with Exotic Genetix\n2nd Place: Cookies \u0026 Cream Cubantech Drysift by Exotic Genetix\n3rd Place: Peaches ‘N Cream by Full Flava Extracts with E.T. Extracts\n \nCANNABIS-INFUSED EDIBLE WINNERS\n\n1st Place: Dark Chocolate Macaroons by Utopia Meds\n2nd Place: Pineapple Delight Bites by Lifted Edibles\n3rd Place: Cinnamon Maple Tree Hugger – Om Edibles \u0026 Gold Drop Collaboration\n \nCANNABIS TOPICAL WINNERS\n\n1st Place: Crown OG “It’s the Balm Haling Salve” by Crown Genetics\n2nd Place: Honey Pot Bear Butter by Honey Pot with Pure Joy Collective\n3rd Place: Absorb CBD Topical Relief by Absorb with Seasonal Apothecary\n \nHIGH CBD PRODUCT WINNERS\n\nBest High CBD Cannabis Concentrates\n1st Place: Goji D.C. Live Resin by Moxie Genetics\n2nd Place: ACDC by Scapegoat Genetics\n3rd Place: ACDC by Dankman Extrax\n \nBest High CBD Cannabis Edibles\n1st Place: Raw CBD Sipping Cacao by Om Edibles All Female Collective\n2nd Place: Beezle’s CBD Brulee – Chocolate Orange by Beezle Extracts\n3rd Place: CBD/THC Honey by Baked Beez with the W.E.E.D. Studio City","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/06/12002748/the-2015-norcal-cannabis-cup-winners.jpg","urlslug":"/news/strains-products/the-2015-norcal-cannabis-cup-winners"}],"reviewCount":207,"flavors":[{"name":"Pine","score":29.727466947178321},{"name":"Earthy","score":27.33219918499573},{"name":"Pungent","score":22.751872857471998},{"name":"Woody","score":20.199748191142007},{"name":"Sweet","score":9.8414907456753813}],"effects":[{"name":"Relaxed","score":99.996974570098047},{"name":"Happy","score":65.460994063175633},{"name":"Euphoric","score":64.933463814694747},{"name":"Uplifted","score":45.731932947164353},{"name":"Focused","score":36.253901059133185}],"symptoms":[{"name":"Stress","score":52.614669611418435},{"name":"Pain","score":32.88200125206253},{"name":"Insomnia","score":29.488516166268315},{"name":"Depression","score":28.148367082391765},{"name":"Lack of Appetite","score":25.8992508570112}],"conditions":[{"name":"Anxiety","score":55.462646413352857},{"name":"Migraines","score":24.320209173568912},{"name":"PTSD","score":17.711681184851439},{"name":"ADD/ADHD","score":16.293103648901187},{"name":"Gastrointestinal Disorder","score":15.758358913731028}],"negatives":[{"name":"Dry Mouth","score":44.430707182603314},{"name":"Dry Eyes","score":23.646527388286},{"name":"Dizzy","score":10.664873129760689},{"name":"Anxious","score":6.6869564407911728},{"name":"Paranoid","score":4.7300269263261274}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_9d73.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002875/b/superglue__primary_44b2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_d524.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002874/b/superglue__primary_4237.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_562a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/675283/b/superglue__primary_9102.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_9dc0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/652042/b/superglue__primary_ddab.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_fb40.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/637776/b/superglue__primary_e236.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_9593.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636362/b/superglue__primary_7fa2.jpg"}],"photoTotalCount":49,"popularCities":["Detroit, MI","Phoenix, AZ","Los Angeles, CA","Tucson, AZ","Bozeman, MT","West Hollywood, CA","Addison, IL","Ann Arbor, MI","Bethesda, MD","Bothell, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/superglue","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.65700483091787/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Northern Lights","subtitle":null,"slug":"northern-lights","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/northern-lights","symbol":"Nl","applink":"leafly://strain/northern-lights"},{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":54,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":97680,"slug":"superglue","name":"Superglue","subtitle":null,"symbol":"Spg","category":"Hybrid","description":"\u003cp\u003eSuperglue is a \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e strain bred by Seedism Seeds. A cross between \u003ca href=\"http://leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e\u0026nbsp;and \u003ca href=\"http://leafly.com/indica/northern-lights\"\u003eNorthern Lights\u003c/a\u003e, Superglue inherits \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e growth patterns along with a sweet caramel and pine aroma. Superglue brings calming relaxation to\u0026nbsp;the mind and body, but leaves you functional and energetic enough for social activities or a productive afternoon.\u003c/p\u003e\n","descriptionPlain":"Superglue is a hybrid strain bred by Seedism Seeds. A cross between Afghani\u0026nbsp;and Northern Lights, Superglue inherits indica growth patterns along with a sweet caramel and pine aroma. Superglue brings calming relaxation to\u0026nbsp;the mind and body, but leaves you functional and energetic enough for social activities or a productive afternoon.\n","aka":"Super Glue","rating":4.66,"highlightedReviews":[{"id":1410673,"username":"OccamsPhazer","text":"Method: Wolf-LX Vap\nGrind: Medium\nPulls: 4-7\nRating: 4.5/5.0\n\nWell, this was an impulse purchase. And i\u0027m glad for it. Usually, my delivery service has a rounded selection of good kind. Its pretty consistent. And every so often, they carry some new stuff that I haven\u0027t come across to sample. Today was one of those days. And Super Glue was the mismatched sock that stood out. I mean the name sounds powerful. But I\u0027ve been fooled by the name before. Pineapple Express comes to mind. And what a let down that high was... So, I conclude that knowledge is power. My next move is to look up thc%, to glance over previous reviews, and finally, I pull out my 8x photo loop and a nice l.e.d white light so I may observe the trichome characteristics. In general, I do notice a favoring trend between thc%, (subjective high), and \"degrees of frostiness\". Good bud has layered, highly visible, thick fields(large or small droplets, either) of crystals. \nI digress... Super Glue is a vibrant green to see. Really fresh and plump. It caught my eye immediately. Proud looking. I could feel myself looking forward to popping open the box lid, and sticking my nose in for a deep pull. Pungent, yes. A sharp sweet dirty earthiness to SG. Bright. Crisp. \nIn my vap it smoked a little better around 420 than it did at 390 or 400 respectively. I bet this would be tasty in a joint or a bong. Alas, no combust for me... anyways, why lament? Let\u0027s vap some Super Glue!!! I expected more resistance from the bud while being packed down the vap chamber opening. Typically, really sticky strains get hung up. Super Glue is not crazy sticky, but it does have weight to it. Resin weight too... as well as pull weight. Off a nicely packed chamber, I got some really plummy vapor rolls. And the taste... yummy sweet waxy petrol and pine and earth, as it rolls off the lips and just hangs on a bit, before leaping over into an ever-thinning-slice of Rocky Mountain atmosphere. I always get em\u0027 confused. Which one\u0027s body and which one is heady? Super Glue is a body heavy high for sure. Its fast acting. Warm and tingly straight away. Face is a flush with the nano scale hum of a trillion little points of electric fire... kinda thing. It feels like a heavy high to me. It could be just me, everything is heavy of late. But still... the high feels deep. Perhaps not a wake me up. It\u0027s the evening, and the day is behind me... perhaps that influences? A morning wake and bake ought be in order. Examine after a fresh sleep. I know, it sounds like I\u0027m disapointed. Maybe... but maybe not the weeds fault. I\u0027ve been consuming copious amounts of pot butter lately. If i were a cloud, I would be saturated in full, and raining... as it were, thc. And no! Not disapointed at all. I\u0027m very aware of the high. Nothing subtle about it. I\u0027ve been vaping White Widow all day or so... and that strain wasn\u0027t picking up at all. No matter how much I vaped. And O\u0027l Super Glue here, sure right as rain, did change up the game a bit. Feels like it leaves the mind pretty much alone. My focus is still good. It\u0027s not an euphoric high, I\u0027ll say that. It is a mellowish high... but I don\u0027t mean weak!! Hard to explain kind of.. I guess I\u0027m a little out of touch with what it is to be relaxed. Maybe that\u0027s it...?\nI think that this is one of the least helpful reviews I\u0027ve written so far... lol.\nThe Super Glue... I love it!\n\nCheers,\nOccamsPhazer","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1641742,"username":"Zinzah","text":"Another great strain! Mild glue taste and feel in my mouth, but awesome pain relief. Did not have to smoke a lot of this strain for results. ❤️ Thanks Crystal","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-16353","title":"The Top Trending Cannabis Strains of 2016","author":"Bailey Rahn","category":null,"date":"\/Date(1484957722000)\/","text":"Every year we like to look back and recognize the rising stars of the cannabis world. Last year, GG4 (f.k.a Gorilla Glue #4), Critical Kush, Candyland, and ACDC were among the fastest trending strains according to Leafly user strain reviews, but which strains stood out from the crowd this year?\nTo eliminate outliers that might skew the results, we restricted our search to the top 200 ranking strains of 2016. These strains tend to be more available nationwide, and we hope you’re able to find them in your area!\nBudtenders and inventory managers – are these trending strains on your menu? If not, consider keeping an eye out for them. Because in 2016, they were flying off the shelves fast.\n\n#10. Blue Cookies\n\nWe all know that customers swarm around anything containing the word “Cookies,” thanks to the Girl Scout Cookie hype. But what makes Blue Cookies stand out from the many, many other Cookie crosses? The addition of Blueberry indica genetics, of course.\n#9. Birthday Cake Kush\n\nAnother decadent GSC (f.k.a Girl Scout Cookies) cross, Birthday Cake Kush also pulls in genetics from Cherry Pie to achieve a dessert-like taste that’s not altogether unlike cake itself. It may not be your birthday, but the luxurious and relaxing qualities of this potent hybrid are certainly something to celebrate.\n#8. Sour Tangie\n\nThe citrus-loaded sativa strain Tangie can’t possibly be improved. Or can it? DNA Genetics has done it again, spinning their Tangie masterpiece with the help of East Coast Sour Diesel genetics. Sour Tangie improves the fuel-like taste of Sour Diesel without compromising Sour D’s high-flying creative effects, making this sativa a must-have for flavor enthusiasts and artists alike.\n#7. Purple Candy\n\nPurple Candy blossomed in British Columbia, Canada. Believed to be a cross between BC Sweet Tooth and Mendocino Purps, it’s as sticky and sweet as grape hard candy. But you won’t feel a sugar rush with this indica; instead, expect the heavy-hitter to prime you for bedtime or a solid nap.\n#6. Quantum Kush\n\nA good sativa can lend a positive spark to an otherwise dreary day of chores, so it’s no wonder that Quantum Kush tipped the charts in 2016 as one of the fastest trending sativa strains. While some sativas bring on the buzz with a bit too much gusto, resulting in anxiety and paranoia, Quantum Kush manages to deliver creative, talkative, giggly qualities without what we like to call “The Fear.”\n#5. God’s Green Crack\n\nWho knew the not-so holy union of God Bud and Green Crack would result in something so heavenly? God Bud is known for producing mammoth yields of gargantuan buds, but the effects are a little heavy-handed for some. That’s why Jordan of the Islands crossbred God Bud with Green Crack, the high-flying sativa strain that focuses all of its effort on elevating the mind to a place where laughing fits are inevitable.\n#4. Gelato\n\nA new generation of GSC (f.k.a Girl Scout Cookies) has arrived, and its name is Gelato. From the same breeders that delivered fan favorites Sunset Sherbet and GSC (f.k.a Girl Scout Cookies), Cookie Fam Genetics from Bay Area, California isn’t finished with their royal line quite yet. Gelato, a descendent of Sunset Sherbet and Thin Mint GSC (f.k.a Girl Scout Cookies), blooms in bright colors that are almost as inviting as its tantalizing dessert-like aroma.\n#3. Grape Stomper\n\nGrape Stomper isn’t a new strain, but a jump in Leafly reviews will show that not all good things are sparkly and new. Strong genetics inherited from Purple Elephant and Chemdawg Sour Diesel equip this strain with the full package: flavor, potency, and consistency. Relaxing without encumbering social skills, the balanced Grape Stomper is an excellent choice for so many different activities. No wonder its popularity isn’t waning.\n#2. Nuken\n\nNuken is also an older strain making a comeback. Originally found in Canada, it’s since proliferated throughout the Pacific Northwest to states like Washington and Oregon. Herbal and sweet in flavor, Nuken cradles you in a blanket of dreamy euphoria where your thoughts can float upward to bliss.\n#1. Superglue\n\nLast year, the top trending strain was GG4 (f.k.a Gorilla Glue #4). This year it’s Superglue, which surprisingly bears no family ties to last year’s champ. A cross between Northern Lights and Afghani, Superglue develops a thick coat of sticky resin that will quite literally glue your fingers together. Though its parentage may lead you to believe Superglue will be a knockout, this strain is bred to deliver more light-footed effects. In fact, Leafly users have described this strain as focusing and creative while simultaneously relaxing the body.\n\nWhat was your favorite strain of 2016? We want to hear from you! Leave your most memorable cannabis varieties in the strain section below.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/20115737/cannabis-flower-up-close.jpg","urlslug":"/news/strains-products/top-trending-cannabis-strains-2016"},{"id":"contentitems-3527","title":"The 2015 NorCal Cannabis Cup Winners","author":"Lisa Rough","category":null,"date":"\/Date(1435011180000)\/","text":"There was some beautiful competition at the NorCal High Times Cannabis Cup this past weekend and we were there to cover all of the action. Among all of the hubbub and hoopla, here are the winners of this year’s 2015 NorCal Cannabis Cup:\n \nCANNABIS FLOWER WINNERS\n\nBest Sativa Cannabis Strains\n1st Place: Schlemons by The Source Genetics\n2nd Place: Super Silver Haze by Life is Good\n3rd Place: Super Glue by Vallejo Patients Care\n \nBest Indica Cannabis Strains\n1st Place: Zkittles by 3rd Gen Family\n2nd Place: Kosher Kush from DNA by Greenwolf Los Angeles and Cali Kush Farms\n3rd Place: 24K OG Kush by Strain Collective with Pearl Pharma\n \nBest Hybrid Cannabis Strains\n1st Place: Orange Crush by Cannabiotix\n2nd Place: Tahoe Chem by C.R.A.F.T.\n3rd Place: Chiquita Banana by Utopia Meds – Santa Cruz\n \nBest CBD Cannabis Flower\n1st Place: CBD OG by C.R.A.F.T.\n2nd Place: Doctor Cookies by Northstar Holistic Collective\n3rd Place: Sunkiss CBD by California Growers Guild\n \nCANNABIS CONCENTRATE WINNERS\n\nBest Sativa Cannabis Concentrates\n1st Place: Citrix #4 by Gold Coast Collection with Apothecary 420\n2nd Place: Purple Tangie by Zeinstein Gardens \u0026 Loudpack Extracts\n3rd Place: Double Tangie Banana by Crockett Family Farms\n \nBest Indica Cannabis Concentrates\n1st Place: AHHS Brand OG by Alternative Herbal Health Services\n2nd Place: Banana OG by Crockett Family Farms\n3rd Place: Crown OG Live Resin by Prime Extractions\n \nBest Hybrid Cannabis Concentrates\n1st Place: Emperors Mandarins “Shatter” by the Kind Center with Unregistered Extracts\n2nd Place: Emperors Mandarins by Greenwolf Collective X Cali Kush Farms\n3rd Place: Crown OG x Dab Vader OG Zombie Resin by Crown Genetics\n \nBest Non-Solvent Hash Products\n1st Place: Kimbo Kush Cubantech Drysift by Cubanhashqueen with Exotic Genetix\n2nd Place: Cookies \u0026 Cream Cubantech Drysift by Exotic Genetix\n3rd Place: Peaches ‘N Cream by Full Flava Extracts with E.T. Extracts\n \nCANNABIS-INFUSED EDIBLE WINNERS\n\n1st Place: Dark Chocolate Macaroons by Utopia Meds\n2nd Place: Pineapple Delight Bites by Lifted Edibles\n3rd Place: Cinnamon Maple Tree Hugger – Om Edibles \u0026 Gold Drop Collaboration\n \nCANNABIS TOPICAL WINNERS\n\n1st Place: Crown OG “It’s the Balm Haling Salve” by Crown Genetics\n2nd Place: Honey Pot Bear Butter by Honey Pot with Pure Joy Collective\n3rd Place: Absorb CBD Topical Relief by Absorb with Seasonal Apothecary\n \nHIGH CBD PRODUCT WINNERS\n\nBest High CBD Cannabis Concentrates\n1st Place: Goji D.C. Live Resin by Moxie Genetics\n2nd Place: ACDC by Scapegoat Genetics\n3rd Place: ACDC by Dankman Extrax\n \nBest High CBD Cannabis Edibles\n1st Place: Raw CBD Sipping Cacao by Om Edibles All Female Collective\n2nd Place: Beezle’s CBD Brulee – Chocolate Orange by Beezle Extracts\n3rd Place: CBD/THC Honey by Baked Beez with the W.E.E.D. Studio City","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/06/12002748/the-2015-norcal-cannabis-cup-winners.jpg","urlslug":"/news/strains-products/the-2015-norcal-cannabis-cup-winners"}],"reviewCount":207,"flavors":[{"name":"Pine","score":29.727466947178321},{"name":"Earthy","score":27.33219918499573},{"name":"Pungent","score":22.751872857471998},{"name":"Woody","score":20.199748191142007},{"name":"Sweet","score":9.8414907456753813}],"effects":[{"name":"Relaxed","score":99.996974570098047},{"name":"Happy","score":65.460994063175633},{"name":"Euphoric","score":64.933463814694747},{"name":"Uplifted","score":45.731932947164353},{"name":"Focused","score":36.253901059133185}],"symptoms":[{"name":"Stress","score":52.614669611418435},{"name":"Pain","score":32.88200125206253},{"name":"Insomnia","score":29.488516166268315},{"name":"Depression","score":28.148367082391765},{"name":"Lack of Appetite","score":25.8992508570112}],"conditions":[{"name":"Anxiety","score":55.462646413352857},{"name":"Migraines","score":24.320209173568912},{"name":"PTSD","score":17.711681184851439},{"name":"ADD/ADHD","score":16.293103648901187},{"name":"Gastrointestinal Disorder","score":15.758358913731028}],"negatives":[{"name":"Dry Mouth","score":44.430707182603314},{"name":"Dry Eyes","score":23.646527388286},{"name":"Dizzy","score":10.664873129760689},{"name":"Anxious","score":6.6869564407911728},{"name":"Paranoid","score":4.7300269263261274}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_9d73.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002875/b/superglue__primary_44b2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_d524.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002874/b/superglue__primary_4237.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_562a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/675283/b/superglue__primary_9102.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_9dc0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/652042/b/superglue__primary_ddab.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_fb40.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/637776/b/superglue__primary_e236.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/superglue_100x100_9593.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636362/b/superglue__primary_7fa2.jpg"}],"photoTotalCount":49,"popularCities":["Detroit, MI","Phoenix, AZ","Los Angeles, CA","Tucson, AZ","Bozeman, MT","West Hollywood, CA","Addison, IL","Ann Arbor, MI","Bethesda, MD","Bothell, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/superglue","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.65700483091787/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Northern Lights","subtitle":null,"slug":"northern-lights","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/northern-lights","symbol":"Nl","applink":"leafly://strain/northern-lights"},{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":54,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":null,"growNotes":""}}
