{
    "aka": "Alaskan Thunder Grape",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1454691900000)/",
            "id": "contentitems-3435",
            "text": "Check out the cannabis strains recently added to the Leafly database! While they might be new to our strain Explorer, some of these have been making it around the market for a while now. If you've come across any of them before, write a strain review! Otherwise check the links below to see if they're offered at a shop near you.\n \n   1. White Smurf\n\nThe Cannabis Cup People’s Choice winner in 2000, White Smurf is a hybrid strain bred from a Northern Lights x Skunk #1 female and a pure Dutch sativa male. Wonderful smells of fresh citrus fruit will entice you as accents of orange pistils and dusty white resin stand out in a sea of green. This strain is a great choice for social butterflies to lounge out to after a nice dinner.\n\nClick here for a full list of locations carrying White Smurf\n \n   2. Titan's Haze\n\nBred by Flying Dutchmen, Titan’s Haze is sativa cross of Haze and Skunk #1. This strain brings a powerful cerebral rush that sativa connoisseurs crave with the smell and flavor of herbal spice. It’s a go-to hybrid for creative minds looking for that stimulating and energizing buzz during daytime hours. These plants fare well in high humidity or dry climates and have proven resistant to pests and molds.\n\n \n   3. God's Bubba\n\nBred by Jordan of the Islands, God’s Bubba is an indica cross between two hefty parent strains, God Bud and Pre-98 Bubba Kush. Potency, a compact stature, and heavy harvests are what these breeders aimed for, to the delight of commercial growers and consumers with stubbornly high tolerances. Indica lovers will appreciate the tranquilizing qualities God’s Bubba has to offer, especially those treating pain and insomnia. \n\nClick here for a full list of locations carrying God's Bubba\n \n   4. Arctic Sun\n\nCultivated by Flying Dutchman, Arctic Sun is a 60/40 sativa-dominant hybrid of Skunk #1 and White Widow. These two crosses create a pungent fuel-like tang with floral undertones. When consumed, a robust burst of euphoria and energy comes through, stimulating both social interaction and creativity. Patients often look to this strain for relief of chronic pain, sleeplessness, and muscle spasms.\n\nClick here for a full list of locations carrying Arctic Sun\n \n   5. In The Pines\n\nFrom Aficionado Seeds comes In The Pines, a sativa-dominant strain bred by crossing Pineapple Thai, Master Kush, and Pineapple. Tropical fruity flavors activate on the inhale and usher in this sativa’s invigorating, active effects. Clear creativity comes alive as the senses sharpen, making In The Pines the perfect companion strain for hobbies and productive afternoons.\n\nClick here for a full list of locations carrying In The Pines\n \n   6. Bronze Whaler\n\nAn 80/20 indica-dominant strain bred in Australia, Bronze Whaler gives off the sweet smell of fruit with distinct tropical overtones. Awarded 2nd place at the Sydney Cannabis Cup in 2002, this dense, compact bud produces an abundance of fine white pistils that turn to a bronze hue on upon maturing. For patients seeking long-lasting relief from pain and stress, this nighttime strain is ideal.\n\n \n   7. Alaska Thunder Grape\n\nFrom Sonoma County comes Alaska Thunder Grape, a hybrid strain that balances genetics from Matanuska Thunder Fuck and Grape Ape. With floral flavors of lavender and hibiscus, Alaska Thunder Grape delivers heavy euphoric effects that promote rest and relaxation.\n\nClick here for a full list of locations carrying Alaska Thunder Grape\n \nBrowse through other new strains that were added recently to the Leafly Explorer or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/12002452/new-strains-alert-white-smurf-arctic-sun-titans-haze-gods-bubba-a.png",
            "title": "New Strains Alert: White Smurf, Arctic Sun, Titan's Haze, God's Bubba, and More",
            "urlslug": "/news/strains-products/new-strains-alert-white-smurf-arctic-sun-titans-haze-gods-bubba-a"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "ADD/ADHD",
            "score": 4.166666666666666
        },
        {
            "name": "Anxiety",
            "score": 4.166666666666666
        }
    ],
    "description": "<p>From Sonoma County comes Alaska Thunder Grape, a hybrid strain that balances genetics from <a href=\"https://www.leafly.com/sativa/matanuska-thunder-fuck\">Matanuska Thunder Fuck</a> and <a href=\"https://www.leafly.com/indica/grape-ape\">Grape Ape</a>. With floral flavors of lavender and hibiscus, Alaska Thunder Grape delivers heavy euphoric effects that promote rest and relaxation.</p>\n",
    "descriptionPlain": "From Sonoma County comes Alaska Thunder Grape, a hybrid strain that balances genetics from Matanuska Thunder Fuck and Grape Ape. With floral flavors of lavender and hibiscus, Alaska Thunder Grape delivers heavy euphoric effects that promote rest and relaxation.\n",
    "effects": [
        {
            "name": "Tingly",
            "score": 4.166666666666666
        },
        {
            "name": "Uplifted",
            "score": 4.166666666666666
        },
        {
            "name": "Creative",
            "score": 4.166666666666666
        },
        {
            "name": "Euphoric",
            "score": 4.166666666666666
        },
        {
            "name": "Focused",
            "score": 4.166666666666666
        }
    ],
    "flavors": [
        {
            "name": "Pepper",
            "score": 4.166666666666666
        },
        {
            "name": "Strawberry",
            "score": 4.166666666666666
        },
        {
            "name": "Grape",
            "score": 4.166666666666666
        },
        {
            "name": "Skunk",
            "score": 4.166666666666666
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1387713,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Alaskan Thunder Grape (also know as Grape Thunder)\nLooks: White and purple buds with a fair amount of red hairs and bright green leaves here and there. Some of the most beautiful bud ive ever seen. My man said he could only spare a q but it came as 2 thick crown nugs. For some reason he doesnt like the crowns. The trich coverage is top 3 ive seen, the bud is actually green but so covered it looks white.\nSmell/Taste: The combo of ATFs sweet peppery flavor with grape apes sweet n sour grape fuses into a delicious warm grapey/strawberry flavor with hints of pepper that almost seem to pop in your sinus cavity. I cant explain the feeling, its like a car exhaust is backfireing delicious peppery terpenes while the grapeyness is steady. Really F'n amazing.\nEffects: This stuff really creeps, your high from the 1st hit, but it keeps coming in waves and takes about 15mins to fully kick in. It starts with a headband feeling, then your eyes widen as it sinks down your back. Everything seems brighter, by the time it kicks in you have a very balanced high that kills pain, uplifts and helps focus and creativity all with a great euphporic buzz. If you over do it, it quickly turns into couchlock and a dazed feeling that lasts for up to 6hrs. Best to take a few hits, wait a little and do again, i made the mistake of smoking a bubbler then a 1g blunt and i was tapped out for about 8hrs.\nDefinetly a great strain. I hope NJ gets to savor more of this.",
            "username": "flipndip187"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1477861,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/0/240",
            "text": "I am going through the rigorous process of acquiring a Medical Marijuana Card and just wanted to do some research on the variety of strains. And this one in particular happened to catch my eye as it suggests in helping with eye pressure and has nearly no negative response. But with time and trial and error along with keeping record of use time and dates as well as method and type of strain most people can formulate a medicinal regimen that works with their diagnoses.",
            "username": "Guamanian78"
        }
    ],
    "id": 206447,
    "name": "Alaska Thunder Grape",
    "negatives": [],
    "parents": [
        {
            "applink": "leafly://strain/matanuska-thunder-fuck",
            "category": "Sativa",
            "name": "Matanuska Thunder Fuck",
            "permalink": "https://mobileapi.leafly.com/sativa/matanuska-thunder-fuck",
            "slug": "matanuska-thunder-fuck",
            "subtitle": null,
            "symbol": "Mtf"
        },
        {
            "applink": "leafly://strain/grape-ape",
            "category": "Indica",
            "name": "Grape Ape",
            "permalink": "https://mobileapi.leafly.com/indica/grape-ape",
            "slug": "grape-ape",
            "subtitle": null,
            "symbol": "Ga"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/alaska-thunder-grape",
    "photoTotalCount": 3,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000692/b/alaska-thunder-grape__primary_5e53.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/alaska-thunder-grape_100x100_b41a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/473930/b/alaska-thunder-grape__primary_3ca9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/alaska-thunder-grape_100x100_0f81.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/473898/b/alaska-thunder-grape__primary_47a8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/alaska-thunder-grape_100x100_66f4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Vancouver, BC"
    ],
    "rating": 5,
    "relatedStrains": [],
    "reviewCount": 3,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "alaska-thunder-grape",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
    "subtitle": null,
    "symbol": "Atg",
    "symptoms": [
        {
            "name": "Eye Pressure",
            "score": 4.166666666666666
        },
        {
            "name": "Pain",
            "score": 4.166666666666666
        },
        {
            "name": "Stress",
            "score": 4.166666666666666
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
