{
    "aka": "GSC, Girl Scout Cookie, Girl Scout Cookies",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1516919218000)/",
            "id": "contentitems-55795",
            "text": "One question I get asked all the time is, “What temperature should I be dabbing at?” The simple answer is that it’s up to you. Some dabbers prefer hotter dabs that give them big clouds of vapor while others live by the low-temp dabber’s credo: “You got to waste it to taste it.”\nHot dabs always give me very immediate and pronounced effects that take a few minutes to settle into. Low temp dabs, on the other hand, tend to deliver a much lighter and tapered rise into cannabis’ euphoric effects. If you’re not sure which you prefer, I encourage you to use some of the techniques I shared last week to help you dab at the right temperature. Once you’ve experimented a bit, you’ll discover the range of temperature you prefer. To give you a good starting point, I’ll share a few temperatures that I like to dab at.\nhttps://www.instagram.com/p/BeYy9YVhWVv/?taken-by=the.avid.dabber\nBut before I dive in, I want to share a quick reminder of the vaporization points for the essential cannabinoids and terpenes. Keeping these temperatures (see above infographic) in mind when you dab will help you fine-tune the effectiveness of each dab you take. A little personal tip: I always like to aim my temperatures a little higher than the boiling point for these compounds. That way I make sure they are completely vaporized once my dab gets capped.\n\n545-570°F\nhttps://www.instagram.com/p/BeHDoFohPlF/?taken-by=the.avid.dabber\nMy sweet spot, or the temperature range I most commonly dab at, is nestled somewhere between 545° and 570° Fahrenheit. Or at least that’s what I set my e-nail to on my daily driver. Many e-nails give you a temperature reading for the heater coil, so you must account for some slight variation with the heat transferring from that coil to the dabbing surface. This is one of the main reasons why I specifically recommend The MiniNail. Their controllers are factory calibrated to account for this loss of heat and their temperature readout gives you more precise control over your dabbing experience.\nI will use these temperatures for most of my dabs, but specifically prefer this range for hydrocarbon extracts like live resin, sugar resin, honey crystal, shatter, and crumble. I also use this range when dabbing my home-pressed rosin. I’ve found that dabbing these consistencies and forms between 545-570°F allows my dab to almost completely vaporize, capturing nearly all of its essence and potency without scorching or combusting any of the more heat-sensitive terpenes.\n\n500-540°F\nhttps://www.instagram.com/p/BdBybiRAw-N/\nWhen I’m terp hunting, or really trying to savor the terpene profile of the hash I’m dabbing, I’ll drop my temperatures a little lower. The 500-540°F range is where I like to dab all the solventless hash I come across. In my experience, forms like ice wax, hash rosin, and other high-melt hashes are a little more delicate and don’t take as much heat. Often these natural separation methods don’t undergo a dewaxing process the same way that hydrocarbon extracts do. Dewaxing helps remove the fats and lipids from cannabis and is a way to further purify concentrates. So, when dabbing these less-processed forms of hash, it’s not uncommon to leave residue after each dab. A simple wipe with a Q-Tip and a couple drops of isopropyl alcohol will take care of that.\nSome people prefer even lower temp dabs than this, so don’t feel like you can’t dip below 500°F. Just know that puddling is more likely to occur and will leave behind a small pool of hash oil that was not able to completely vaporize (this is where the phrase “you got to waste it to taste” comes from). Many flavor hounds view puddling as a badge of honor and a sign that they haven’t combusted any non-essential compounds. Others will tell you it’s a waste of good hash. I personally sit somewhere in the middle. I don’t mind a little puddle, but prefer my dabs to be flavorful, effective, and efficient.\n\nOver 600° F\nhttps://www.instagram.com/p/BeO9FiDFnY3/?tagged=meltshot\nNot often, but sometimes a hotter dab is needed. I reserve the hotter temperatures for isolates, like crystalline THCA and CBD. This really just comes down to my own preferences as I’m sure many will tell you that they actually like lower temperatures for isolated compounds. This makes since, because the single compound will have a more specific vaporization point than a full-spectrum hash that has many cannabinoid and terpene compounds in its profile.\nThe reason I prefer a higher temperature for isolates, specifically THCA, is because it is the chemical precursor to the psychoactive compound THC. THCA in its isolated form is not considered intoxicating; it must convert to THC to gain its euphoric properties. This process, known as decarboxylation, happens naturally over time as cannabis flowers dry, but it can also be accomplished in a shorter amount of time with heat.\nWhen dabbing an isolate like crystalline THCA, that conversion process is taking place in real-time on the hot surface of your nail. So, while a low temp dab can still manage this chemical conversion, a higher temp will expedite that conversion so that it is more instantaneous. My thought process there is that the efficacy and efficiency of that conversion can take place in a shorter timespan under my carb cap.\n\nAvid Dab of the Week\nhttps://www.instagram.com/p/Bd_V83CBxXy/?taken-by=the.avid.dabber\nI’m back into my solventless head stash for this week’s Avid Dab. I was over at my good friend’s (@voodoomelts) place to catch up on life and business over a steady stream of delicious solventless dabs. He had two flavors he recently washed and it was hard to choose which to dab first. At his recommendation, I chose the GSC six-star hash rosin and was not disappointed. It has an unforgettable flavor profile that mixes sweet candied notes with pungent earthy undertones. It’s a complex terpene profile that creates a deeply relaxing and euphoric mix of effects. It finishes with a subtle doughiness that is present in a lot of GSC genetics.\nWhat’s your preferred temperature to dab at? And what are you dabbing this week? Share your temperature tips on Instagram and tag me (@the.avid.dabber) and use #aviddabber. Or tell me what’s up in the comments section below. Stay tuned to The Avid Dabber column where next week I’ll break out my Nectar Collector and show you what makes this unique dabbing piece so great. Until then, remember to ONLY DAB THE BEST!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/25131509/why-low-temperatures-are-so-important-for-dabbing1.jpg",
            "title": "The Avid Dabber: My Favorite Temperatures for Dabbing Cannabis Concentrates",
            "urlslug": "/news/strains-products/the-avid-dabber-best-dabbing-temperatures"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1498399222000)/",
            "id": "contentitems-32157",
            "text": "Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Platinum GSC (f.k.a Girl Scout Cookies) is a sweet and spicy hybrid strain with THC levels that will make even experienced consumers feel they are trying cannabis for their first time. Created by the Cookie Fam in the Bay Area, Platinum GSC is the follow-up to the well-known GSC (f.k.a Girl Scout Cookies). It was bred by crossing OG Kush, Durban Poison, and an unknown strain.\nGrow Techniques: Finding a cutting of Platinum GSC (f.k.a Girl Scout Cookies) will probably be the most difficult part about cultivating this strain. Grow outdoors in a warm, summery climate, and top the plant continually to develop a nice large bush with lots of bud sites. When grown indoors, Platinum GSC produces dense, small, trichome-soaked popcorn buds.\nFlowering Time: 8-9 weeks\nYield: Moderate\nGrow Difficulty: Moderate to high when trying for a high yield\nClimate: Platinum GSC (f.k.a Girl Scout Cookies) grows best between 68-80 degrees Fahrenheit, and is recommended for greenhouse gardens.\nIndoor/Outdoor: This strain cultivates well both indoors and out.\nFeeding: The heavier the feeding schedule, the better. Platinum GSC (f.k.a Girl Scout Cookies) needs a lot of nutrients to stay happy and healthy.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/24125107/platinum-girl-scout-cookies-cannabis.jpg",
            "title": "Tips for Growing Platinum GSC (f.k.a Platinum Girl Scout Cookies) Cannabis",
            "urlslug": "/news/growing/how-to-grow-platinum-gsc-marijuana"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 26.004702862552033
        },
        {
            "name": "PTSD",
            "score": 10.104239706696733
        },
        {
            "name": "ADD/ADHD",
            "score": 10.079677082183567
        },
        {
            "name": "Migraines",
            "score": 7.934242836670873
        },
        {
            "name": "Arthritis",
            "score": 7.806372585568392
        }
    ],
    "description": "<p>GSC, formerly&nbsp;known as Girl Scout Cookies,&nbsp;is an <a href=\"http://www.leafly.com/hybrid/og-kush\">OG Kush</a>&nbsp;and <a href=\"http://www.leafly.com/sativa/durban-poison\">Durban Poison</a> <a href=\"http://leafly.com/hybrid\">hybrid</a> cross whose reputation grew too large to stay within the borders of its California homeland. With a <a href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\">sweet</a> and <a href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\">earthy</a> aroma, GSC launches you to <a href=\"http://www.leafly.com/explore/tags-euphoric\">euphoria</a>&rsquo;s top floor where full-body <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\">relaxation</a> meets a time-bending cerebral space. A little goes a long way with this hybrid, whose THC heights have won GSC numerous Cannabis Cup awards. Patients needing a strong dose of relief, however, may look to GSC for severe <a href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\">pain</a>, <a href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\">nausea</a>, and <a href=\"http://www.leafly.com/explore#!/explore/symptoms-lack-of-appetite\">appetite loss</a>.</p>\n\n<p>There are several different <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\">phenotypes</a> of the GSC strain including <a href=\"http://www.leafly.com/hybrid/thin-mint\">Thin Mint</a> and <a href=\"http://www.leafly.com/hybrid/platinum-girl-scout-cookies\">Platinum Cookies</a>, which exhibit some variation in appearance and effect. Typically, however, GSC expresses its beauty in twisting green <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\">calyxes</a> wrapped in purple leaves and fiery orange hairs. Patients and consumers looking to cultivate this cannabis staple themselves should wait 9 to 10 weeks for their indoor plants to finish flowering.</p>\n",
    "descriptionPlain": "GSC, formerly&nbsp;known as Girl Scout Cookies,&nbsp;is an OG Kush&nbsp;and Durban Poison hybrid cross whose reputation grew too large to stay within the borders of its California homeland. With a sweet and earthy aroma, GSC launches you to euphoria&rsquo;s top floor where full-body relaxation meets a time-bending cerebral space. A little goes a long way with this hybrid, whose THC heights have won GSC numerous Cannabis Cup awards. Patients needing a strong dose of relief, however, may look to GSC for severe pain, nausea, and appetite loss.\n\nThere are several different phenotypes of the GSC strain including Thin Mint and Platinum Cookies, which exhibit some variation in appearance and effect. Typically, however, GSC expresses its beauty in twisting green calyxes wrapped in purple leaves and fiery orange hairs. Patients and consumers looking to cultivate this cannabis staple themselves should wait 9 to 10 weeks for their indoor plants to finish flowering.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 71.80083594828082
        },
        {
            "name": "Relaxed",
            "score": 69.32622619575406
        },
        {
            "name": "Euphoric",
            "score": 52.94736732972767
        },
        {
            "name": "Uplifted",
            "score": 47.15889096520333
        },
        {
            "name": "Creative",
            "score": 32.8700635779104
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 24.329613098797335
        },
        {
            "name": "Sweet",
            "score": 20.418087689887837
        },
        {
            "name": "Pungent",
            "score": 10.13183801708847
        },
        {
            "name": "Flowery",
            "score": 6.285717300611557
        },
        {
            "name": "Citrus",
            "score": 4.821713623611699
        }
    ],
    "growInfo": {
        "averageYield": "Low",
        "difficulty": "Moderate",
        "environment": null,
        "floweringDays": 60,
        "growNotes": "\n\tPrefers moderate amounts of fertilizer\n\tMay express fruity or diesel-smelling phenotypes\n\tTrains well as a multi-branched plant or with sea of green (SOG) operations\n\tAverage yield falls between 25-30 grams per plant\n\n",
        "height": "Short",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1418797,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This is one of my favorite strains!!!  I am a daily user and the effects for me are very strong and intense and, very enjoyable.  For me, mostly a head high.  It makes me talkative, happy, goofy and generally in good spirits.  I could still focus on tasks, as long as they weren't too complicated.  For me this is definitely a strain where you want to be in an unstructured or party environment.\r\nI would suggest using this strain for pain relief as I think it is distracting and could take your mind off your pain.  I strongly encourage those who can handle the effects to use it for lack of appetite!!  I gain weight when using this strain for any period of a week or more, because I always get the munchies after using it.  Usually it takes two or three sessions, but after the effects are waning I become ravenous - especially for sugar and salt.\r\nDefinitely one of the better strains around in my opinion.",
            "username": "kimdavis3"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1642686,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This is so good tasting, nice and herbish, not too sweet. After a couple puffs you're worried will melt away! Definitely is good for stress.",
            "username": "Dosha82"
        }
    ],
    "id": 10771,
    "name": "GSC",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 33.062361681019794
        },
        {
            "name": "Dry Eyes",
            "score": 15.646607496134273
        },
        {
            "name": "Anxious",
            "score": 8.05403079289417
        },
        {
            "name": "Dizzy",
            "score": 7.991206831785832
        },
        {
            "name": "Paranoid",
            "score": 6.476041883393717
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/durban-poison",
            "category": "Sativa",
            "name": "Durban Poison",
            "permalink": "https://mobileapi.leafly.com/sativa/durban-poison",
            "slug": "durban-poison",
            "subtitle": null,
            "symbol": "Dp"
        },
        {
            "applink": "leafly://strain/og-kush",
            "category": "Hybrid",
            "name": "OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/og-kush",
            "slug": "og-kush",
            "subtitle": null,
            "symbol": "Ogk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/gsc",
    "photoTotalCount": 1746,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/gsc/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/gsc/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1006202/b/girl-scout-cookies__primary_c980.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/girl-scout-cookies_100x100_9d27.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003386/b/girl-scout-cookies__primary_dfc4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/girl-scout-cookies_100x100_d122.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002913/b/girl-scout-cookies__primary_c0c6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/girl-scout-cookies_100x100_43d9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002672/b/girl-scout-cookies__primary_80db.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/girl-scout-cookies_100x100_4ddd.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002657/b/girl-scout-cookies__primary_e704.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/girl-scout-cookies_100x100_e0a3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002540/b/girl-scout-cookies__primary_ebe0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/girl-scout-cookies_100x100_93b1.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Los Angeles, CA",
        "Vancouver, BC",
        "Toronto, ON",
        "Eugene, OR",
        "Seattle, WA",
        "Montréal, QC",
        "San Francisco, CA",
        "Calgary, AB",
        "Phoenix, AZ"
    ],
    "rating": 4.5,
    "relatedStrains": [],
    "reviewCount": 5994,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "gsc",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.49933266599933/240",
    "subtitle": "(f.k.a. Girl Scout Cookies)",
    "symbol": "Gsc",
    "symptoms": [
        {
            "name": "Stress",
            "score": 33.29575662782938
        },
        {
            "name": "Depression",
            "score": 27.98424608554653
        },
        {
            "name": "Pain",
            "score": 27.707623258498806
        },
        {
            "name": "Lack of Appetite",
            "score": 14.01643781225305
        },
        {
            "name": "Insomnia",
            "score": 12.991585332074708
        }
    ],
    "testGraph": "https://leafly-s3.s3.amazonaws.com/strains/testing/vFE0gBYDTFSHIx4CBjYZ_GSC.png",
    "videoUrl": null,
    "weakDescription": false
}
