{
    "aka": "uk exodus cheese, uk original cheese",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Rebecca Kelley",
            "category": null,
            "date": "/Date(1405011600000)/",
            "id": "contentitems-3009",
            "text": "Ever since Pope Francis (née Jorge Mario Bergoglio) was elected to succeed Pope Benedict XVI on March 13, 2013, the world has for the most part responded positively to His Holiness' behavior at the top of the religious food chain. As of December 2013, 88% of American Catholics approve of how he's handling his role as head of the Catholic church, and even non-religious people admire Pope Francis' humility, his vow to live simply, his acts of compassion, and his love for and acceptance of folks from all walks of life. Dude was even a bar bouncer and a janitor before becoming a priest. What's not to like about him? \nWell, it turns out pope-in' ain't easy, and as much as I admire Pope Francis for being the pope-iest Pope to come along in decades, he holds one opinion that broke my little heathen heart. Last week, he condemned efforts to legalize cannabis, saying that limited attempts to legalize recreational drugs \"are not only highly questionable from a legislative standpoint, but they fail to produce the desired effects.\" He also added, \"the problem of drug use is not solved with drugs!\"\nPope Francis, I get where you're coming from. You've previously spoken out against the evils of drug addiction, so I can see how you'd be wary about cannabis legalization. However, cannabis is far less addictive (9-10%) than tobacco smokers (20%-30%), heroin users (23-25%), alcohol users (15%), and cocaine users (15%-20%), plus it has therapeutic and medical benefits.\nMaybe you need a little bit of cannabis education, Mr. Pope. For instance, did you know that cannabis and religion often go hand-in-hand? It's true! As a matter of fact, I've got a list of nine strains that I think are right up your pious alley. Check out a few of these holy wonders and you'll see that cannabis isn't so bad, after all. \n1. 3 Kings\nIn the biblical sense, the Three Kings, also known as the biblical Magi or the three Wise Men (not to be confused with the \"Ooohhhhh a wise guy, eh?\" schtick of the Three Stooges) were a trio of foreigners who visited Jesus after his birth. They brought gifts of gold, frankincense, and myrrh because they had no idea what sort of thing newborn babies are into (in hindsight, burping cloths and a Baby Bjorn would have probably been more ideal than pungent tree resin, though the gold was a classy touch).\nWhat better way to commemorate the birth of baby Jesus than with the hybrid 3 Kings strain, known for its appropriately piney, pungent smell and its euphoric, happy effects. Pair it with Dream Star to simulate the Star of Bethlehem and you've got yourself a pretty uplifting birthday celebration.\n2. Endless Sky\nIsn't heaven supposed to be some sort of Endless Sky where everyone lives on a fluffy cloud and gets free access to Backstreet Boys concerts? If so, let its indica counterpart bring you relaxation so you can dream about the day you get to meet your maker and high-five Him for inviting you through the pearly gates.\n3. Holy Grail Kush\nThe Holy Grail has had quite the heyday in pop culture, from Monty Python to Indiana Jones. There's no way you're not an Indiana Jones fan, Mr. Pope, so I strongly recommend you partake in this woody hybrid while commemorating the supposed vessel of the Last Supper with a viewing of the 1989 classic. Just know with Holy Grail Kush, you have chosen wisely.\n4. Jesus OG\nTry the indica named after Mr. JC himself, Jesus OG. Its citrus, earthy flavors and focused effects may channel the power of Christ to compel you to pair it with the hybrid Bio-Jesus, a euphoric hybrid that provides exceptional pain relief. That's double the Jesus in one session — think of it as hitting up church twice on the same Sunday.\n5. Soul Shine\nNot to be confused with Soul Glo (just let your soooooooooullllll glowwwwwwww!), Soul Shine is an arousing hybrid that will amplify your love for the man upstairs. (Not the dude who lives in the apartment above yours, I mean the actual Man Upstairs.) As Pope, I imagine you've got one of the shiniest souls around, so this is a great option for someone with your sparkly innards.\n6. Lamb's Bread\nIn religious terms, lamb's bread is also known as sacramental bread, the body of Christ, altar bread, or Communion bread. It's used in the Christian ritual of the Eucharist/Holy Communion, where Christians accept a sacrament in the form of a piece of bread or cracker and a sip of wine or grape juice. In cannabis terms, Lamb's Bread is an earthy sativa that brings euphoric, uplifting, and creative effects. That sounds like a better Communion offering to me, don't you agree, Pope? Think of how much more amazing the church songs would be once the congregation gets their creative juices flowing (and we all know Christian hymns could use some oomph).    \n7. Trinity\nThe Trinity in Christian terms describes God as three expressions: the Father, the Son (aka Jesus), and the Holy Spirit. If God is a hybrid of these three, it's only fitting that the Trinity cannabis strain is also a hybrid (though I would hope God isn't as skunky-smelling). Try this one out for its trio of happy, uplifting, and energetic qualities and you'll think three is a magic number, indeed.\n8. Exodus Cheese\nThe Book of Exodus tells the story of Moses leading the Israelites out of slavery in Egypt, where they wandered the desert for a ridiculous amount of time, subsisting on manna and miraculous water. They didn't even have any cheese, which to me is easily the biggest sacrifice (well, that and the whole \"wandering aimlessly through the dessert in search of a safe haven\" part). So pick up some of the hybrid Exodus Cheese, enjoy its sweet, cheesy flavors, and reflect on how thankful you are to eat cheese whenever you want instead of manna for the 40th day in a row (hopefully you're not lactose intolerant, Mr. Pope).\n9. God's Treat\n…or God's Gift, or God Bud. Whatever your preference, know that a number of strains are named after The Big Guy because a lot of growers are thankful that one of His creations was this incredible plant with therapeutic purposes. So whaddya say, Pope Francis, why don't you pick up some hybrid God's Treat and acknowledge that there are many positive aspects of cannabis that benefit millions of people around the world? After all, it must be stressful to be Pope, and this Treat can deliver relaxing and sleepy effects to help you rest up so you can continue to spread your goodwill to those in need…much how cannabis does.    ",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/07/12001344/9-holy-strains-that-can-change-the-popes-opinion-of-cannabis.jpg",
            "title": "9 Holy Strains That Can Change Pope Francis' Opinion of Cannabis",
            "urlslug": "/news/strains-products/9-holy-strains-that-can-change-the-popes-opinion-of-cannabis"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 29.47530864197531
        },
        {
            "name": "ADD/ADHD",
            "score": 6.7059483726150395
        },
        {
            "name": "Migraines",
            "score": 6.242985409652077
        },
        {
            "name": "PTSD",
            "score": 5.780022446689114
        },
        {
            "name": "Bipolar Disorder",
            "score": 5.4713804713804715
        }
    ],
    "description": "<p>Generally known as simply <a href=\"http://www.leafly.com/hybrid/cheese\">&ldquo;Cheese&rdquo;</a> or <a href=\"https://www.leafly.com/hybrid/uk-cheese\">&ldquo;UK Cheese,&rdquo;</a> Exodus Cheese is the original clone-only strain that originated in Southern England sometime during the late 1980s or early 90s. Said to be grown from a packet of Sensi Seeds <a href=\"http://www.leafly.com/sativa/skunk-1\">Skunk #1</a>, it is known for its high yields, potency and distinct, overwhelmingly strong cheese-like odor. Though the identity of the original grower is still debated, at some point in the early 90s the cannabis lifestyle activists based in Luton calling themselves Exodus acquired some clones of Cheese and from there it rapidly became one of the most popular and sought after varieties in the UK. Since then many breeders have created seed lines using Cheese, while the original clone is still found in grow rooms around the globe.</p>\n",
    "descriptionPlain": "Generally known as simply &ldquo;Cheese&rdquo; or &ldquo;UK Cheese,&rdquo; Exodus Cheese is the original clone-only strain that originated in Southern England sometime during the late 1980s or early 90s. Said to be grown from a packet of Sensi Seeds Skunk #1, it is known for its high yields, potency and distinct, overwhelmingly strong cheese-like odor. Though the identity of the original grower is still debated, at some point in the early 90s the cannabis lifestyle activists based in Luton calling themselves Exodus acquired some clones of Cheese and from there it rapidly became one of the most popular and sought after varieties in the UK. Since then many breeders have created seed lines using Cheese, while the original clone is still found in grow rooms around the globe.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 78.5213243546577
        },
        {
            "name": "Happy",
            "score": 73.6672278338945
        },
        {
            "name": "Uplifted",
            "score": 56.06060606060606
        },
        {
            "name": "Hungry",
            "score": 34.79236812570146
        },
        {
            "name": "Talkative",
            "score": 33.866442199775534
        }
    ],
    "flavors": [
        {
            "name": "Cheese",
            "score": 66.03535353535354
        },
        {
            "name": "Pungent",
            "score": 14.029180695847362
        },
        {
            "name": "Blueberry",
            "score": 13.945005611672277
        },
        {
            "name": "Earthy",
            "score": 12.331649831649832
        },
        {
            "name": "Skunk",
            "score": 10.479797979797981
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 56,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1378665,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/0/240",
            "text": "this isn't the original cheese, or even the one favoured by the exodus collective, which remains 'clone only' to this day. \r\n\r\n the real deal has a taste as strong as the smell, and it's the fruitiest thing this side of blueberry, but considerably more potent and so deserves respect; it's caused more 'whiteys' than any other strain in the uk, and takes a while to get used to.\r\n\r\n the biggest problem is that funky smell. it's just in a different league to anything else....if you pass someone in the street with some in their pocket, you'll know it. if a friend comes to your house with some, the first thing you say won't be your usual greeting, it'll be more like 'you smell nice'.\r\n all well and good, but attracts attention like no other. the good and the bad varieties...you have been warned! \r\nother than the smell, it's a dream to grow. strong, vigorous, mould resistant, loves sog, scrog, yield wise similar to northern lights, not as good as say, jack herer in that regard. it doesn't actually hum that bad on the grow, but just wait 'til harvest time and you will be able to follow your nose back from the shops. not one to grow in an urban environment, especially for beginners; carbon filters won't help you here as the smell amps up once it's cropped, and never leaves!\r\n\r\nand ps\r\nkeep looking for a better hybrid than this one. they are out there....nepalcheese being my absolute favourite smoke of all time. good things come to those who search, and some people have managed to crack some seriously impressive likenesses, good enough to fool even this member of the exodus collective. but this ain't it, so don't be fooled by the 'exodus' bit",
            "username": "sirgavofgreensmoke"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1594653,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Bedore I start It's important to remember that all strains effect everyone differently. This review is based on my experiences and my opinions, I can't gaurantee you will get the same effects, if you didnt already know this you have a lot to learn 😂 \n\nI've used this strain for recreational and medical purposes, I'm also writing this whilst smoking a joint of exodus cheese and to me its just an average cheese, the high isnt that strong, maybe its the grow but im not getting much from it in regards to taste and recreationap effects. \n\nOn the other hand this strain is amazing for nausea and lack of appetite! I ate some bad food last night and was sick 7 times today. I couldnt eat, sit down for too long, stand up for too long, basically I wouldnt wish how i felt on anyone. After 1 joint (less than a gram and mixed with tobacco because im from the UK and we cant compete with the USA, Canada, ect. 😂 some of us can smoke blunts but nowhere near the amount compared to the US) anyway after 1 joint i felt fine. i went from feeling like i had food poisening to feeling like nothing even happened. ",
            "username": "smokeykid"
        }
    ],
    "id": 699,
    "name": "Exodus Cheese",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 38.566217732884404
        },
        {
            "name": "Dry Eyes",
            "score": 12.794612794612796
        },
        {
            "name": "Dizzy",
            "score": 1.8518518518518516
        },
        {
            "name": "Paranoid",
            "score": 0.7716049382716049
        },
        {
            "name": "Headache",
            "score": 0.30864197530864196
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/skunk-1",
            "category": "Hybrid",
            "name": "Skunk No. 1",
            "permalink": "https://mobileapi.leafly.com/hybrid/skunk-1",
            "slug": "skunk-1",
            "subtitle": null,
            "symbol": "Sk1"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/exodus-cheese",
    "photoTotalCount": 47,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002353/b/exodus-cheese__primary_f0f1.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/exodus-cheese_100x100_7445.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000923/b/exodus-cheese__primary_9dde.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/exodus-cheese_100x100_a736.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/601518/b/exodus-cheese__primary_dc55.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/exodus-cheese_100x100_8aab.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/601546/b/exodus-cheese__primary_1497.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/exodus-cheese_100x100_ec80.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/597802/b/exodus-cheese__primary_db67.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/exodus-cheese_100x100_4844.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/519827/b/exodus-cheese__primary_4b58.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/exodus-cheese_100x100_b72b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Spokane, WA",
        "Vancouver, BC",
        "Bremerton, WA",
        "Bothell, WA",
        "Calgary, AB",
        "Everett, WA",
        "Friday Harbor, WA",
        "Goldendale, WA",
        "Halifax, NS",
        "Keizer, OR"
    ],
    "rating": 4.26,
    "relatedStrains": [],
    "reviewCount": 127,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "exodus-cheese",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.25984251968504/240",
    "subtitle": null,
    "symbol": "Exo",
    "symptoms": [
        {
            "name": "Lack of Appetite",
            "score": 36.097081930415264
        },
        {
            "name": "Fatigue",
            "score": 31.397306397306398
        },
        {
            "name": "Nausea",
            "score": 31.397306397306398
        },
        {
            "name": "Pain",
            "score": 22.50280583613917
        },
        {
            "name": "Stress",
            "score": 14.95510662177329
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
