{"sl_translate":"description,descriptionPlain,category","id":185295,"slug":"golden-ticket","name":"Golden Ticket","subtitle":null,"symbol":"Gtk","category":"Hybrid","description":"\u003cp\u003eGolden Ticket from Archive Seeds Bank is a 50/50 hybrid strain that gives you special access to euphoria\u0026rsquo;s top floor. Combining genetics from \u003ca href=\"https://www.leafly.com/hybrid/golden-goat\"\u003eGolden Goat\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/indica/face-off-og\"\u003eFace Off OG\u003c/a\u003e, Golden Ticket balances full-body relaxation with invigorating cerebral qualities. Its aroma is an enticing mix of tangy lemon, sweet lime, and sour skunk. Keep in mind, Golden Ticket may also refer to a \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\"\u003ephenotypic variation\u003c/a\u003e of \u003ca href=\"https://www.leafly.com/hybrid/chernobyl\"\u003eChernobyl\u003c/a\u003e, a hybrid from TGA Seeds.\u003c/p\u003e\n","descriptionPlain":"Golden Ticket from Archive Seeds Bank is a 50/50 hybrid strain that gives you special access to euphoria\u0026rsquo;s top floor. Combining genetics from Golden Goat and Face Off OG, Golden Ticket balances full-body relaxation with invigorating cerebral qualities. Its aroma is an enticing mix of tangy lemon, sweet lime, and sour skunk. Keep in mind, Golden Ticket may also refer to a phenotypic variation of Chernobyl, a hybrid from TGA Seeds.\n","aka":"Mr. Dank’s Golden Ticket","rating":4.49,"highlightedReviews":[{"id":1412749,"username":"CannaWhoop","text":"I would call this hybrid sativa leaning.  I smoke it at night, but was not looking for a sleep-aid, just something to put me out there.  Golden Ticket did not disappoint!  The body high was fast and strong putting flat out on my back in bed.  But the head high - oh my!  The high was cerebral and stoney at the same time.  My thoughts were positive, reminiscing about old friends and good times past.My eyes were closed and I felt my happy grin go ear to ear.  If the Golden Ticket made me feel this good alone,  I can\u0027t wait to smoke it with friends.  I\u0027m sure it\u0027s the Golden Ticket to great conversations, lots of laughing, philosophical debates, and of course grinning ear to ear!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png"},{"id":1634956,"username":"GreatScott2115","text":"Golden ticket has mellow yet extremely satisfying effects.  I\u0027m currently relaxing on the sofa, listening to music and typing this review with no couch lock whatsoever.  I plan on saving the remainder for Memorial Day and if I run out I\u0027ll be sure to buy it again for July 4th because I\u0027m imagining that it\u0027d be the perfect strain for a BBQ, hanging out with family and friends and of course eating plenty of good food!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-53439","title":"5 Best-Smelling Cannabis Strains in Washington","author":"Will Hyde","category":null,"date":"\/Date(1514934606000)\/","text":"I’m a firm believer that quality cannabis should captivate all of the senses, starting with the nose. Aroma has always been an important characteristic when choosing a cannabis strain, and it’s generally the first thing that will attract you to a specific variety. A strain’s smell is a major indicator the flower’s flavor profile and gives you some semblance of what tastes can be expected when you inhale.\nMost connoisseurs will tell you that cannabis should be purchased with your nose, letting the natural harmony of terpenes guide your decision. One of the flaws with state regulations requiring pre-packaged cannabis is that it removes the nose from the equation and forces you to wait until you get home to find out how pungent the purchased flower may be. To help overcome this roadblock the legal cannabis market presents, I’ll share some of my favorite strains available in Washington that carry truly exceptional and complex aromas.\n\n#1 | Lemonder by Seattle’s Private Reserve\n\nLemonder from Seattle’s Private Reserve is a 91-point strain that was awarded the Best Aroma in Washington State using Leafly’s Cannabis Rating System. While somewhat wispy in appearance, it was the only qualifying strain that scored perfectly for its aroma. The strain is a hybrid of Super Lemon Haze, OG Kush, and Lavender, and it produces a sweet citrus aroma with the added pungent zest of fruit when ground up. Its flavor is a fruity, floral experience that reminds me of candied orange.\nFind Lemonder Nearby\nFrom the Tasting Notebook:\n “Lemon, cream, spice, and some middle savory note that is mellowing the lemon in an unexpected way.” –Jeremiah Wilhelm, Strain Researcher\n\n#2 | White Tahoe Cookies by Royal Tree Gardens\n\nRoyal Tree Gardens has a diverse mix of aromas and flavors coming from their flowering rooms. Their White Tahoe Cookies is a prime example of the quality and consistency their garden produces. A 94-point strain overall, White Tahoe Cookies’ aroma is a compelling mix of its parent genetics, The White, Tahoe OG, and an unspecified GSC cut. This flower has a grape and berry sweetness that blends with notes of musky mint, pine, and skunky earth to complete its enchanting bouquet.\nFind White Tahoe Cookies Nearby\nFrom the Tasting Notebook:\n“Robust grape and berry notes charged with a hint of dank, musky Kush and a sweet finish. Aromas of mint, eucalyptus, and pine forest erupt when this bud is broken down into shake.” –Will Hyde, Cannabis Expert\n\n#3 | Gummo by Gabriel Cannabis\n\nGummo from Gabriel Cannabis is an irresistible 92-point strain that crosses the sweetness of Bubble Gum with the intricate citrus aroma of Orange Bud. The tight buds covered in fiery orange hairs emit an intense citrus sour with soft floral sweetness. The flavor follows suit with a sharper, spiced finish reminiscent of cinnamon and sandalwood. The resulting effects are immediate, heady, and introspective.\nFind Gummo Nearby\nFrom the Tasting Notebook:\n“Loud, ripe berry aroma that expands into a sweet citrus medley of mandarin and tangerine.” –Bailey Rahn, Strains \u0026 Products Editor\n\nGummo grown by Gabriel Cannabis.\n#4 | Blueberry Pancakes by Nebula Gardens\n\nA truly amazing flower with a captivating, nuanced, and unique terpene profile, Blueberry Pancakes from Nebula Gardens really does emulate its namesake: a mix of berry notes that finish with a creamy touch of citrus, evoking memories of fresh baked muffins. Scoring 89 points overall and near perfect for its aroma, Blueberry Pancakes provides soothing effects that pair nicely with its pungent essence.\nFind Blueberry Pancakes Nearby\nFrom the Tasting Notebook:\n“Bright strawberry, wildflower, and sweet pine with doughy vanilla. Its aroma feels clarifying with diverse nuance.”–Bailey Rahn, Strains \u0026 Products Editor\n\n#5 | Golden Ticket by Khush Kush\n\nAn 87-point strain overall, Golden Ticket from Khush Kush is a flower with fragrant fruity notes of citrus and subtle undertones of tropical flowers. The nuanced smells of Golden Ticket were just a couple points shy of a perfect aroma score. Its complex smell gives way to fresh pine and spearmint flavors with just a touch of sharp lime upon exhale.\nFind Golden Ticket Nearby\nFrom the Tasting Notebook:\n“Sweet, floral, and sort of tropical like a papaya\u2028. Reminds me of a Trainwreck\u2028 cross. When I grind it up, the aroma is even sweeter like a sour green apple or an overripe pineapple\u2028.” –Will Hyde, Cannabis Expert","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/02145135/lemonader-macro.jpg","urlslug":"/news/strains-products/best-smelling-strains-in-washington-fall-2017"},{"id":"contentitems-50073","title":"The Top THC-Dominant Strains of Washington State in Fall 2017","author":"Leafly Staff","category":null,"date":"\/Date(1512081671000)\/","text":"This fall, Leafly set out on a quest to find the very best cannabis in Washington state, and we came back with ten standout strains from talented growers on both sides of the Cascade Mountains.\nUsing a point-based method that rates cannabis by its aroma, flavor, appearance, cure, and overall experience, each of these strains received a 1-to-100 score (which you can read more about here). In this feature, we take a look at some of the best THC-dominant strains in Washington, but stay tuned for more product ratings in Washington and beyond.\nThese 10 strains—and their growers—each offered something unique among the sea of cannabis available throughout the state of Washington.\n(Click to enlarge)\nAll strains evaluated in this round have a THC-dominant cannabinoid profile, meaning its THC-to-CBD ratio is at least 5:1. Presidential Kush, which weighed in at just over 17% THC, demonstrates that quality is not measured by this one chemical alone. A diverse and compelling terpene profile—which the curing process can make or break—is often the key to a consumer’s heart, as terpenes augment the overall experience.\n(Click to enlarge)\nOur tasting panel draws experience from all corners of the industry, from budtending to cultivation. Avid curiosity and deep appreciation of cannabis products forms our common foundation, from which extends our individual preferences and experiences.\n#1 | Middlefork by Royal Tree Gardens\n\nPrice: $15-17.00/gram\nThe unanimous favorite among our three tasters was Royal Tree’s Middlefork, a true Washington native born just outside the city of Bellingham. Perfected over years from Dutch Treat parent genetics, it’s no surprise that its aroma and flavor stole our hearts: Effervescent citrus and fresh-cut pine linger on the exhale in an impressive translation of aroma to flavor. Middlefork is ruggedly attractive, growing fuzzy buds that are absolutely packed with sticky, enticing trichomes. Meanwhile, its effects are commanding in strength, bolting all three of us to our seats in stunned satisfaction.\nFind Middlefork Nearby\nFrom the Tasting Notebook:\n“Very attractive scent of sweet candied citrus fizz…I am definitely stoned.” –Will\n“Kind of tastes like vanilla chai mixed with orange spice creamsicle. After a few hits from the vaporizer, my eyes fell into crescents, and I was hopelessly glued to the couch in a state of bliss.” –Bailey\n#2 | Sherbet by Gabriel\n\nPrice: $45/eighth\nGabriel’s Sherbet weighed in as our panel’s second place flower, tying with Middlefork in its overall score but falling just inches short after calculating each panelist’s individual scoring. With Sherbet, we couldn’t help but obsess over the knotting of purple, blue, and green hues underneath the thick coat of trichomes and fiery orange hairs. Its aroma mimics that of a berry pie, from buttery crust to its fruity center, creating a unique bouquet that isn’t often captured by a single cannabis bud. Considering its price-to-quality ratio, Sherbet by Gabriel is among the best value on this list (plus, it’s pesticide-free).\nFind Gabriel Sherbet Nearby\nFrom the Tasting Notebook:\n“Beautiful bud with highly expressive features. Provides a heady, happy buzz with relaxing physical effects.” –Jeremiah\n“Its color is variated and intricate with a dessert-like aroma of sugary dough, sweet berry, and deep grape.” –Bailey \n#3 | Presidential Kush by Fifty Fold\n\nPrice: $50/eighth\nPresidential Kush by Fifty Fold is beauty in a bag, showing off a thick layer of frosty trichomes against its dark, cosmic purple coloration. The buds bloom with perfect conic uniformity, like a Christmas tree covered in luminescent white bulbs. Its aroma is full and nuanced, expressing sweet and sour notes of fruit and berry, but these delicate fragrances are lost with heat. Though its exceptional aroma and appearance tied its overall score up with our two frontrunners, Presidential Kush’s muted earthy flavor left some room for improvement.\nFind Presidential Kush Nearby\nFrom the Tasting Notebook:\n“Very complex and enticing smell of funky dankness and sweet sugary notes that keep me coming back to this bud. This was easily one of my favorite flowers in the whole lot.” –Will\n“Beautiful frosted buds with uniform shape, but the flavor left much to be desired after its wonderful aroma.” –Jeremiah\n#4 | Alien Dawg by NEBULA\n\nPrice: $48/eighth\nNebula Gardens is known for its bulky, resinous buds—and Alien Dawg is no exception thanks to its enormous, bulbous buds that build up off of each other to create an otherworldly mass of trichome-covered foliage. Gassy diesel aromas evaporate off the monolithic buds, intermixing with notes of pine and tangy fruit. This aroma translates well to flavor that carries hints of sweet earth, sandalwood, and herbs. The diversity of flavors and aromas combined with its commanding cerebral high made Alien Dawg a standout strain, especially among our tasters with a penchant for funky, gassy strains. It’s also pesticide-free.\nFind Alien Dawg Nearby\nFrom the Tasting Notebook:\n“Sweet and sour aroma with overripe tree fruit and fresh soil. Its effects are cerebrally stimulating without feeling too top-heavy.” –Bailey\n“It has the pungent funkiness of many other strains, but with a bright and peppery sweetness at the center.” –Jeremiah\n#5 | Lemonder by Seattle’s Private Reserve\n\nPrice: $45/eighth\nLemonder by Seattle’s Private Reserve leaves an immediate impression with an aroma that smells like fresh-squeezed lemons and flowering herbs. The soft lime-green buds crack open easily, filling the nose with a diversity of funky, floral, and citrus aromas inherited from its parent genetics: Lavender, OG Kush, and Super Lemon Haze. Its intricate but fragile flavor profile collapses with heat, delivering fleeting hints of candied lemon. This flavor is refreshing but subdued compared to its impeccable lemon astringent aroma. Anyone with a sweet tooth for lemon-loaded strains should not walk, but run to the nearest dispensary stocking Lemonder.\nFind Lemonder Nearby\nFrom the Tasting Notebook:\n“This is the best aroma I have smelled so far. Lemon, cream, spice, and a middle savory note that mellows the lemon in a weird way.” –Jeremiah\n“Very healthy-looking lime green coloration and incredible lemon astringent aroma. It’s easy to focus in the stillness of its pleasant effects.” –Bailey\n#6 | GG4 by North Coast Growers\n\nPrice: $50-63.00/eighth\nSticky, euphoric, and reeking of sour fuel, GG4 (formerly known as GG4 (f.k.a Gorilla Glue #4)) is easy to pick out of a crowd. This particular rendition from North Coast Growers was a polarizing force among our tasters, but the consensus brought this strain to #6 on our list. The close shave of the trim and subtlety of aroma and flavor were, for some, a miss. But others favored the trim and aroma, admiring its poignant odor of gas and pine. Hints of sweet white tea and aged sour cheese hit the palate on the exhale, a divisive but unique flavor that lacked somewhat in strength.\nFind GG4 Nearby\nFrom the Tasting Notebook:\n“Its flavor is sharp pine with a hint of parmesan funk. Really deep and complex earthy notes that finish sweet with a tingle of citrus.” –Will\n“This one has a deep herbal and pine aroma with a light skunky gas note. The onset of effects is jarring and intense—deeply euphoric and trippy.” –Bailey\n#7 | Jet Fuel by Sweet As!\n\nPrice: $36/eighth\nThis take on Jet Fuel by Sweet As! is decidedly one of the best values when its quality-to-price ratio is considered. The strain has immediate bag appeal, showing off fuzzy, healthy green buds under a coat of gluey resin. Sweet and earthy aromas fill the nose, hinting at a spice rack of different terpenes. Jet Fuel scored well across the board, proving to be an all-around solid choice for those seeking a potent strain with a moderate offering of fragrances and flavors.\nFind Jet Fuel Nearby\nFrom the Tasting Notebook:\n“It has a sweet, skunky zest with a funky sour aroma that opens up with bright intensity. When smoked, it tastes like turpentine.” –Bailey\n“Sweet, fresh, earthy aroma with subtle hints of spice and licorice when ground up. Effects are thought-provoking with cerebral energy out the gate.” –Will\n#8 | GG4 by From the Soil\n\nPrice: $50/eighth\nFrom the Soil’s GG4 (formerly known as GG4 (f.k.a Gorilla Glue #4)) is yet another solid take on the sticky, stinky favorite. The aroma of this strain was somewhat muted in the jar, but when ground up, the strain shares its fragrant secret in full: stinging fuel, sharp pine, and a whisper of sweet lemon. Its exhaled flavor is dampened by heat, giving rise to vague earthy flavors with a slight tinge of mint best preserved by a vaporizer. The effects rest neatly in the head, singing away stress and tension with warm euphoria.\nFrom the Tasting Notebook:\n“Buds offer little on the nose until broken up, but once cracked open, there’s a pleasant, funky aroma. Its swampy, earthy flavor sticks to the tongue but fades away pretty quickly.” –Jeremiah\n“Smells earthy, woody, and muted as a nug. When cracked open, it exposes a loud fuel/gas scent reminiscent of Kush. Smells fantastic when ground up!” –Will \nFind GG4 Nearby\n\n#9 | Golden Ticket by Khush Kush\n\nPrice: $50-65/eighth\nGolden Ticket from Khush Kush offers an alluring but subtle harmony of sweet flavors that dance lightly across the palate, charming you with notes of tropical fruit, lemon spearmint, and fresh pine. Its aroma carries similar traits, but with dialed-up citrus and orange blossom notes. The flower itself is a beautiful twisting of green, purple, and fire-orange hairs hiding under a brilliant coat of trichomes. A few minor flaws in the buds and a somewhat faint flavor profile knocked a few points off this strain’s score, but it’s definitely a catch for low-temp vaping.\nFind Golden Ticket Nearby\nFrom the Tasting Notebook:\n“Aroma is sweet, floral and sort of tropical. Ground up, it gets even sweeter, like a sour green apple or overripe pineapple. Flavor falls off a little compared to the smell, but is still sweet and tropical.” –Will\n“It has a sharp lemon-lime aroma with sweet pine and herbs, and a light, summery lime flavor.” –Bailey \n#10 | MK Ultra by Virginia Co.\n\nPrice: $50-65/eighth\nMK Ultra from Virginia Co. is a gorgeous flower that expresses itself with weaving hues of dark and light green under glittering trichomes. The aroma is complex but not super pungent. Where it catches your attention is in its unusual scent that can only be described as a compost bin full of overripe fruit and cheese rind. Its flavor releases a spicy, peppery essence with a touch of sweet flower. As for effects, the onset is immediate and intoxicating, favoring those with a stubborn tolerance to THC.\nFind MK Ultra Nearby\nFrom the Tasting Notebook:\n“Great bud structure with resinous knots that show off the flower’s unique shape. Peppery hashy taste that’s smooth on the inhale; some slight harshness on the exhale.” –Bailey\n“Aroma is pungent and smells a bit like rotten earth, skunk, and some lemon. The flavor is much more mellow than the smell: earthy, floral, and a touch of funk.” –Jeremiah","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/29155113/gabriel-sherbet-macro.jpg","urlslug":"/news/strains-products/best-thc-strains-washington-state-fall-2017"}],"reviewCount":116,"flavors":[{"name":"Sweet","score":38.430735930735928},{"name":"Earthy","score":33.376623376623371},{"name":"Citrus","score":28.98268398268398},{"name":"Woody","score":17.748917748917748},{"name":"Lemon","score":15.205627705627705}],"effects":[{"name":"Uplifted","score":90.61688311688313},{"name":"Happy","score":72.359307359307365},{"name":"Relaxed","score":68.8961038961039},{"name":"Focused","score":67.445887445887436},{"name":"Euphoric","score":63.419913419913421}],"symptoms":[{"name":"Stress","score":59.134199134199136},{"name":"Depression","score":41.2012987012987},{"name":"Lack of Appetite","score":29.913419913419911},{"name":"Nausea","score":25.7034632034632},{"name":"Fatigue","score":22.348484848484844}],"conditions":[{"name":"Anxiety","score":31.30952380952381},{"name":"PTSD","score":22.586580086580085},{"name":"ADD/ADHD","score":19.03679653679654},{"name":"Arthritis","score":10.043290043290044},{"name":"Migraines","score":8.2467532467532454}],"negatives":[{"name":"Dry Mouth","score":51.547619047619051},{"name":"Dry Eyes","score":42.586580086580085},{"name":"Dizzy","score":3.4090909090909087},{"name":"Headache","score":2.5108225108225111},{"name":"Anxious","score":2.5108225108225111}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-ticket_100x100_ee4e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/640522/b/golden-ticket__primary_0ed6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-ticket_100x100_5bfe.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/584621/b/golden-ticket__primary_4e13.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-ticket_100x100_629c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/565689/b/golden-ticket__primary_6b1d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-ticket_100x100_54bf.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/556502/b/golden-ticket__primary_5bd4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-ticket_100x100_f1a8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/556020/b/golden-ticket__primary_dbdf.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-ticket_100x100_efda.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/515852/b/golden-ticket__primary_8299.jpg"}],"photoTotalCount":12,"popularCities":["Seattle, WA","Portland, OR","Bellingham, WA","Eugene, OR","Shoreline, WA","Lynnwood, WA","Salem, OR","Spokane, WA","Bend, OR","Bremerton, WA"],"permalink":"https://mobileapi.leafly.com/hybrid/golden-ticket","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.49137931034483/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Golden Goat","subtitle":null,"slug":"golden-goat","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/golden-goat","symbol":"Gdg","applink":"leafly://strain/golden-goat"},{"name":"Face Off OG","subtitle":null,"slug":"face-off-og","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/face-off-og","symbol":"Fac","applink":"leafly://strain/face-off-og"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
