{"sl_translate":"description,descriptionPlain,category","id":179602,"slug":"cactus-cooler","name":"Cactus Cooler","subtitle":null,"symbol":"Cco","category":"Hybrid","description":"\u003cp\u003eCactus Cooler is a sativa-dominant strain that\u0026rsquo;s said to be a cross between \u003ca href=\"http://leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e and \u003ca href=\"http://leafly.com/hybrid/og-kush\"\u003eOG Kush\u003c/a\u003e. The sativa in Cactus Cooler lends an upbeat cerebral kick to help you stay focused and productive throughout the day, while the OG boosts the senses with buzzing euphoria. With notes of sharp lemon and sweet wildflowers, Cactus Cooler takes after both parents in its fragrance.\u003c/p\u003e\n","descriptionPlain":"Cactus Cooler is a sativa-dominant strain that\u0026rsquo;s said to be a cross between Blue Dream and OG Kush. The sativa in Cactus Cooler lends an upbeat cerebral kick to help you stay focused and productive throughout the day, while the OG boosts the senses with buzzing euphoria. With notes of sharp lemon and sweet wildflowers, Cactus Cooler takes after both parents in its fragrance.\n","aka":null,"rating":4.33,"highlightedReviews":[{"id":1317922,"username":"Chunglee","text":"I enjoy spending my Sunday nights dabbing that good ole Cactus Cooler. It makes me feel like a milli bucks and gives me the motivation to rock some socks in the octagon. The flavor reminds me of eating a raw cactus mixed with buttered popcorn.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"},{"id":1627404,"username":"KidGalaxy","text":"I got a sativa Cactus Cooler, and it did not do very much, sadly.  I thought it would taste like Cactus Cooler, the soft drink, pinapple and orange flavor, but it tasted more like an actual cactus.  \nSo, unfortunately, I have a 4.5 grams of this stuff, and I wish there were trade-ins at ye olde weed store. Maybe the hybrid version is the one to get....","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3235","title":"New Strains Alert: Blueberry Jack, Hellfire OG, Double Tangie Banana, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1442592000000)\/","text":"The weekend is drawing near, which means it\u0027s just about time to kick back and relax with a bowl of your favorite strain. We\u0027d like to introduce you to a few varieties recently added to the Leafly Explorer, and if you like the sound of any of these, check the links to see if any are available near you.\nRemember, if you do have a chance to try one of these newly added strains, give \u0027em a review. Happy strain hunting!\n \n 1. Blueberry Jack\n\nA cross between the legendary Jack Herer and DJ Short Blueberry, Blueberry Jack has something special to offer in both flavor and effect. Sweet, candied blueberry flavors invade on the inhale while the earthy, piney exhale reminds you of this strain’s Jack heritage. A lively sativa buzz typically dominates Blueberry Jack’s effect profile, with just enough physical relaxation to keep you grounded. Blueberry Jack offers an easy escape from stress and bad moods, keeping you positive and motivated through the day.\n\nFind out which locations are currently carrying Blueberry Jack\n \n 2. Crouching Tiger Hidden Alien\n\nCrouching Tiger Hidden Alien is another indica staple from Exotic Genetix, who combined Tiger’s Milk with Starfighter to create this powerhouse strain. Flavors of pine and spice come through on the inhale while ushering in full-body tranquility. Its heavy-handed sedation makes Crouching Tiger Hidden Alien a perfect choice for sleepless nights or for getting rest and relaxation.\n\nFind out which locations are currently carrying Crouching Tiger Hidden Alien\n \n 3. Double Tangie Banana\n\nDouble Tangie Banana is a sativa-dominant hybrid strain developed by Crockett Family Farms. Supposedly a cross between Banana Sherbert and DNA Genetics’ orange-flavored Tangie, Double Tangie Banana oozes with crystal resin and citrus aromas. Anyone who has tried Tangie knows that this strain was primarily bred for the flavor enthusiasts, so if you’re searching for a strain with an impressive terpene profile, look no further.\n\n \n \n 4. Chocolate Diesel\n\nChocolate Diesel is a sativa cannabis strain that brings together genetics from the original Sour Diesel and Chocolate Thai. With soaring euphoria that shoots straight to the head, Chocolate Diesel could easily be compared to a cup of coffee. Its flavors offer a little part of both parents, with notes of both earthy chocolate and skunky diesel.\n\nFind out which locations are currently carrying Chocolate Diesel\n \n 5. Hellfire OG\n\nHellfire OG is a California hybrid strain that crosses Rascal’s OG Kush with SFV OG Kush. Another robust and powerfully euphoric addition to the OG family tree, Hellfire OG is the perfect THC powerhouse for the cannabis veteran or the patient needing potent relief. In a show of its genetic line, Hellfire OG carries that signature OG smell of lemon diesel and earthy spice.\n\nHellfire OG is currently available at Green Door (medical) in San Francisco, CA\n \n 6. Blue Power\n\nThe indica-dominant Blue Power is one of Sin City Seeds’ signature strains, bred from Sour Double, Master Kush, The White, and Blue Moonshine genetics. Cherished for its fragrant buds, Blue Power offers a sweet fusion of lemon and berry flavors with an earthy finish. It should be noted that another genetic variation released by Vision Seeds crosses Blueberry, White Widow, and Skunk #1. This rendition is described as a happy and uplifting indica that helps focus the mind while fighting stress.\n\nBlue Power is currently available at Jackson County Compassion Club (medical) in Jackson, MI\n \n 7. Cactus Cooler\n\nCactus Cooler is a sativa-dominant strain that’s said to be a cross between Blue Dream and OG Kush. The sativa in Cactus Cooler lends an upbeat cerebral kick to help you stay focused and productive throughout the day, while the OG boosts the senses with buzzing euphoria. With notes of sharp lemon and sweet wildflowers, Cactus Cooler takes after both parents in its fragrance.\n\nCactus Cooler is currently available through Grandma\u0027s Goodies Delivery (medical) in San Francisco, CA and Los Angeles, CA\n \nCheck out our other new strains recently added to the Leafly Explorer, or catch up on last week\u0027s New Strains Alert!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/09/12001958/new-strains-alert-blueberry-jack-hellfire-og-double-tangie-banana.png","urlslug":"/news/strains-products/new-strains-alert-blueberry-jack-hellfire-og-double-tangie-banana"}],"reviewCount":15,"flavors":[{"name":"Earthy","score":55.357142857142854},{"name":"Pine","score":51.785714285714285},{"name":"Tobacco","score":51.785714285714285},{"name":"Woody","score":50},{"name":"Citrus","score":33.928571428571431}],"effects":[{"name":"Euphoric","score":110.71428571428571},{"name":"Talkative","score":103.57142857142857},{"name":"Happy","score":85.714285714285708},{"name":"Focused","score":58.928571428571431},{"name":"Relaxed","score":57.142857142857139}],"symptoms":[{"name":"Depression","score":28.571428571428569},{"name":"Nausea","score":28.571428571428569},{"name":"Headaches","score":7.1428571428571423},{"name":"Pain","score":7.1428571428571423},{"name":"Stress","score":7.1428571428571423}],"conditions":[{"name":"Arthritis","score":51.785714285714285},{"name":"Anxiety","score":5.3571428571428568},{"name":"Migraines","score":5.3571428571428568},{"name":"Anorexia","score":3.5714285714285712},{"name":"Asthma","score":3.5714285714285712}],"negatives":[{"name":"Anxious","score":50},{"name":"Dry Eyes","score":5.3571428571428568},{"name":"Dry Mouth","score":5.3571428571428568},{"name":"Headache","score":1.7857142857142856}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cactus-cooler_100x100_6270.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509166/b/cactus-cooler__primary_797d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cactus-cooler_100x100_310b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/471031/b/cactus-cooler__primary_7234.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cactus-cooler_100x100_35a8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/398677/b/cactus-cooler__primary_9b1e.jpg"}],"photoTotalCount":3,"popularCities":["Los Angeles, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/cactus-cooler","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.33333333333333/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"},{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
