{
    "aka": "new york city diesel",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Catherine LeClair",
            "category": null,
            "date": "/Date(1459692000000)/",
            "id": "contentitems-2689",
            "text": "April is a great month. The hours of light are stretching longer into the evening, the trees start to bud, and that sweet, sweet tax return arrives in the mail, which basically feels like free money even though it’s definitely not. Maybe you’ll prematurely stuff your peacoat far into the depths of your closet and find yourself going for walks, taking deep inhalations of that springy, earthy smell, and turning to your friends and yelling, “This is life! This is living!” Hey, when spring grabs hold, there’s not much you can do to stop it.\n\nThis month’s new-to-Netflix lineup is further proof that April rocks and that T.S. Eliot was very incorrect when he said, “April is the cruelest month.” Poor guy probably always owed to the IRS at the end of the year. Here are some of the best new things for your eyeballs.\n \nFor the Lover of Both Dogs and Mockumentaries\n\nWatch: Best in Show\nWho are the types of people who breed dogs for kennel club shows? This mockumentary by writer and director Christopher Guest shows you the seedy and hilarious underbelly of the high-brow world of dog breeding and showing. Guest, who is known for popularizing the “mockumentary” style of shooting, relies largely on improvisation for Best in Show, as well as his other popular mockumentary films, including A Mighty Wind, This Is Spinal Tap and Waiting for Guffman. If you love The Office or Parks and Rec, you will absolutely love this movie, as Guest’s style arguably laid the foundation for the success of the mockumentary sitcom. It’s got a Portlandia-style sense of self-aware humor to it, plus it has people who look like their dogs.\nAvailable: April 1st\nStrain Pairing: Dogwalker OG\nMunchies: In the spirit of canines, why not whip up a batch of Puppy Chow?\n \nFor Fans of Post-Bunker Humor\n\nWatch: Unbreakable Kimmy Schmidt Season 2\nThe brains behind 30 Rock, Tina Fey and Robert Carlock, bring us season two of their wacky Netflix original Unbreakable Kimmy Schmidt on April 15. The jokes are just as fast and funny in this sitcom starring Ellie Kemper as a cult survivor who strikes out on her own to start a life in New York City after spending years underground in a bunker. While in season one we see Kimmy navigate some of the basics of life – getting a job, dating, and finding a roommate – we can expect that no matter what new life troubles are thrown her way in season two, she’ll face them with the same combination of naïveté, grit and determination that makes her such a strange yet lovable character.\nAvailable: April 15th\nStrain Pairing: NYC Diesel\nMunchies: Since Kimmy still has the palate of a child, load up on plenty of chocolate and candy.\n \nFor Those of You Yearning for Zihuatanejo\n\nWatch: The Shawshank Redemption\nThe Shawshank Redemption was selected by the Library of Congress in 2015 to be preserved in the National Film Registry due to its cultural and aesthetic significance. In short: this is a really good movie. Based on a novella by Stephen King, the movie takes place in his home state of Maine and tells the story of Andy Dufresne, who is sentenced to life in prison for murdering his wife and child. The movie takes us inside the walls of Shawshank State Penitentiary to learn about the alliances, betrayal and oppression that inmates face in a high-security facility. If you’re a fan of Orange Is the New Black but have never sat down to watch Shawshank, you’re in for a treat.\nAvailable: April 1st\nStrain Pairing: Star Killer\nMunchies: To celebrate your freedom, why not go for the least prison-type food possible: sushi.\n \nFor Folks Who Want to Learn About Law as Salaciously as Possible\n\nWatch: How to Get Away with Murder Season 2\nThis TV drama series on ABC centers around law school professor Annalise Keating (Viola Davis), who teaches a class on criminal defense that she refers to as “How to Get Away with Murder 101.” The second season of this murder- and betrayal-filled show has earned Viola Davis the Screen Actors Guild Award for Outstanding Performance in a Drama Series and secured executive producer Shonda Rhimes as an unstoppable creator of salacious and ensnaring dramas (she’s also behind Grey’s Anatomy and Scandal). Of course, this is nothing like the boring Torts classes you heard so much about from your friends slogging through law school.\nAvailable: April 16th\nStrain Pairing: Outlaw\nMunchies: Rhimes’ one controversial opinion might be that she hates thin crust pizza. Order in a deep dish in her honor.\n \nFor Those of You Who Have Never Caught a Glimpse of Dirk's \"Diggler\"\n\nWatch: Boogie Nights\nFrom a nightclub dishwasher to a wealthy porn star, Boogie Nights tracks the rise of Eddie Adams (Mark Wahlburg), a baby-faced high school dropout who takes on the porn star persona of Dirk Diggler after a director (Burt Reynolds) takes him under his wing based on his good looks and natural charm. The film, set in southern California’s San Fernando Valley, helped director Paul Thomas Anderson get on the map during his twenties. (He then went on to create well-regarded classics including Magnolia, There Will Be Blood and The Master.) Watching young Eddie succumb to the addiction to money, power and sex feels like witnessing a slow-motion trainwreck in a similar vein as The Wolf of Wall Street. For many reasons, you can’t look away.\nAvailable: April 1st\nStrain Pairing: Money Maker\nMunchies: It’s set in Los Angeles – what better excuse do you need for chips and guac?\n\nImage Sources: IMDb",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/04/11235904/april-netflix-and-chill-tax-returns-for-all-of-us.jpg",
            "title": "April Netflix and Chill: Tax Returns for All of Us!",
            "urlslug": "/news/lifestyle/april-netflix-and-chill-tax-returns-for-all-of-us"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1501623576000)/",
            "id": "contentitems-36180",
            "text": "Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: NYC Diesel by Soma Seeds is a cross between Afghani and Mexican parent strains. A 60% sativa-dominant hybrid, NYC Diesel offers a euphoric high that energizes the mind while reducing stress and anxiety. Its flavor is that of a ruby-red grapefruit with hints of sour lime.\nGrow Techniques: Unless you have a warm fall climate, keep NYC Diesel indoors so this plant can finish on time. Healthy soil will allow this plant’s aroma to fully develop. Top the plants during the veg cycle to promote a full canopy of growth, and keep the lower portions of the plant pruned to direct efforts where they matter most.\nFlowering Time: 9-11 weeks\nYield: High\nGrow Difficulty: Moderate\nClimate: Moisture and cold fall seasons should be avoided with this strain.\nIndoor/Outdoor: NYC Diesel grows best indoors in a stable climate, but fares well outdoors in a dry, warm climate.\nFeeding: Build a healthy soil with lots of micro- and macro-nutrients for NYC Diesel to grow organically and thrive. Promote micro-organism and mycorrhizal diversity through compost tea to allow the plant to take in all the nutrients available in the soil. Top-dress with phosphorus-heavy nutrients when moving to flower.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/01143233/nyc-diesel-strain.jpg",
            "title": "Tips for Growing NYC Diesel Cannabis",
            "urlslug": "/news/growing/how-to-grow-nyc-diesel-marijuana"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 20.10068392072232
        },
        {
            "name": "PTSD",
            "score": 16.759363578180125
        },
        {
            "name": "Migraines",
            "score": 10.916416742040761
        },
        {
            "name": "Fibromyalgia",
            "score": 9.486556964301773
        },
        {
            "name": "ADD/ADHD",
            "score": 5.800896026066213
        }
    ],
    "description": "<p><span style=\"line-height: 20.8px;\">Bred by Soma Sacred Seeds,&nbsp;</span>NYC Diesel (or Soma Sour Diesel)&nbsp;is a 60% sativa-dominant cross between Mexican and Afghani <a href=\"https://www.leafly.com/news/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\">landraces</a>. This&nbsp;strain provides strong cerebral effects that ease into a deep, full-body relaxation over time. A pungent <a href=\"http://www.leafly.com/explore#!/explore/flavors-lime\">lime</a> and <a href=\"http://www.leafly.com/explore#!/explore/flavors-grapefruit\">grapefruit</a> <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/terpenes-the-flavors-of-cannabis-aromatherapy\">aroma</a> is the mark of a high quality batch, like those that won this strain five Cannabis Cup trophies in the early 2000s. NYC Diesel&rsquo;s happy, talkative qualities make this hybrid a good choice for social activities and many <a href=\"http://www.leafly.com/explore#!/explore/tags-anxious\">anxiety-prone</a> consumers praise it for its paranoia-free effects.</p>\n",
    "descriptionPlain": "Bred by Soma Sacred Seeds,&nbsp;NYC Diesel (or Soma Sour Diesel)&nbsp;is a 60% sativa-dominant cross between Mexican and Afghani landraces. This&nbsp;strain provides strong cerebral effects that ease into a deep, full-body relaxation over time. A pungent lime and grapefruit aroma is the mark of a high quality batch, like those that won this strain five Cannabis Cup trophies in the early 2000s. NYC Diesel&rsquo;s happy, talkative qualities make this hybrid a good choice for social activities and many anxiety-prone consumers praise it for its paranoia-free effects.\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 70.44859486821434
        },
        {
            "name": "Happy",
            "score": 58.14754280455101
        },
        {
            "name": "Energetic",
            "score": 54.78453588071323
        },
        {
            "name": "Creative",
            "score": 49.8040273568289
        },
        {
            "name": "Relaxed",
            "score": 45.89145072650047
        }
    ],
    "flavors": [
        {
            "name": "Diesel",
            "score": 23.449144966861848
        },
        {
            "name": "Citrus",
            "score": 14.17905710976055
        },
        {
            "name": "Pungent",
            "score": 12.999518663683439
        },
        {
            "name": "Earthy",
            "score": 7.514400418921277
        },
        {
            "name": "Pine",
            "score": 5.703306410236067
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": "Difficult",
        "environment": null,
        "floweringDays": 78,
        "growNotes": "",
        "height": "Tall",
        "outdoorFinish": "Early November",
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1412510,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "My new favorite from Ravens Grass, New York Diesel. What a Sour D. variant should be like! If you enjoy Cin-x and Jack Herer, check out the New York Diesel now at The Novel Tree. 22.13 THC,",
            "username": "JonosFolly"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1626838,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "The first pull you take of NYC Diesel will instantly have your eyes low. The second pull will give you a nice calm head high, after the third pull you will feel both the effects of the indica and sativa in this potent hybrid strain. NYC Diesel has a very strong diesel scent and smells a lot stronger than your average strain. I’d definitely recommend to anybody who wants to smoke a strong strain during the day but wants to feel more of a sativa than an indica high, very similar to the effects of sour diesel.  NYC Diesel is for people who need a push to their day or people who are stressed or feeling very anxious. I’d give this 9 of 10 stars. ",
            "username": "5mokey5antana"
        }
    ],
    "id": 45,
    "name": "NYC Diesel",
    "negatives": [
        {
            "name": "Dry Eyes",
            "score": 26.158777511544137
        },
        {
            "name": "Dry Mouth",
            "score": 24.26516870573425
        },
        {
            "name": "Dizzy",
            "score": 8.356474502398749
        },
        {
            "name": "Paranoid",
            "score": 8.28229052613762
        },
        {
            "name": "Headache",
            "score": 1.5534997381742015
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/afghani",
            "category": "Indica",
            "name": "Afghani",
            "permalink": "https://mobileapi.leafly.com/indica/afghani",
            "slug": "afghani",
            "subtitle": null,
            "symbol": "Afg"
        },
        {
            "applink": "leafly://strain/mexican",
            "category": "Sativa",
            "name": "Mexican",
            "permalink": "https://mobileapi.leafly.com/sativa/mexican",
            "slug": "mexican",
            "subtitle": null,
            "symbol": "Mex"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/nyc-diesel",
    "photoTotalCount": 241,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/nyc-diesel/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/hybrid/nyc-diesel/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002053/b/nyc-diesel__primary_5c3b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nyc-diesel_100x100_128c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/652684/b/nyc-diesel__primary_20e8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nyc-diesel_100x100_5d6e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646864/b/nyc-diesel__primary_29be.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nyc-diesel_100x100_827f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636780/b/nyc-diesel__primary_501e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nyc-diesel_100x100_3fa9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/632626/b/nyc-diesel__primary_1bf0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nyc-diesel_100x100_55fb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/606827/b/nyc-diesel__primary_6c3d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nyc-diesel_100x100_5f5a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Seattle, WA",
        "Montréal, QC",
        "Toronto, ON",
        "China",
        "Portland, OR",
        "Calgary, AB",
        "Vancouver, BC",
        "Colorado Springs, CO",
        "Hamilton, ON"
    ],
    "rating": 4.25,
    "relatedStrains": [],
    "reviewCount": 798,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "nyc-diesel",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.25438596491228/240",
    "subtitle": null,
    "symbol": "Nyc",
    "symptoms": [
        {
            "name": "Stress",
            "score": 31.937986956314763
        },
        {
            "name": "Depression",
            "score": 26.890567395018433
        },
        {
            "name": "Fatigue",
            "score": 16.782769217749145
        },
        {
            "name": "Pain",
            "score": 12.283861480929032
        },
        {
            "name": "Headaches",
            "score": 11.921536890990549
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
