{
    "aka": "Betty Page",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1440169200000)/",
            "id": "contentitems-3223",
            "text": "Leafly's strain Explorer was just updated with new strains, and they're in sore need of some user reviews. Leave a rating for the ones you've tried, or hunt them down at a nearby shop by following the links below!\n \n 1. Bettie Page\n\nBettie Page, grown by Liberty Reach Farms in Washington, is a perfectly balanced 50/50 hybrid cannabis strain. This high-THC strain provides mellow euphoria that focuses itself in the cerebral space, encouraging energy rather than lethargy.\n\nFind out which stores and dispensaries are currently carrying Bettie Page\n \n 2. Cornbread\n\nCornbread by Rare Dankness is an 80/20 indica-dominant hybrid strain that crosses Katsu Bubba Kush and Rare Dankness #2. Its aroma is a sweet mix of lemons and incense, and like a perfect appetizer, Cornbread is all you’ll need to invite the appetite before dinner. With heavy, tranquilizing effects that relax the body, Cornbread also makes a great nightcap as you transition into sleep.\n\nFind out which stores and dispensaries are currently carrying Cornbread\n \n 3. Space Candy\n\nSpace Candy originally comes from the gardens of TGA Genetics, who bred this hybrid strain by crossing Cherry Space Queen and Cotton Candy. The genetic combination is as decadent as it sounds, as Space Candy inherits a unique flavor profile of candied apples and sweet cherry, counterbalanced by more tame earthy notes. Its effects may take some time to taper in, but once they do, expect to experience the mind-body balance of invigorating euphoria and deep physical relaxation.\n\nFind out which stores and dispensaries are currently carrying Space Candy\n \n 4. Pineapple Punch\n\nPineapple Punch by Flying Dutchmen is a 70/30 sativa-dominant strain that unites Skunk #1 genetics with those of the Hawaiian indica Real McCoy. As suggested by the name, Pineapple Punch delivers a medley of pineapple, tropical citrus, and sweet floral flavors, while the uplifting, lighthearted effects provide a vacation from stress and bad moods. This sativa’s mellow and functional effects make it a great choice for getting out to social gatherings or appreciating nature.\n\nFind out which stores and dispensaries are currently carrying Pineapple Punch\n \n 5. Jolly Rancher\n\nNot much is known about the California-bred hybrid Jolly Rancher, but this hybrid strain has nevertheless carved a name for itself among West Coast genetics. Its name and initial appeal lies primarily in Jolly Rancher’s sour candied aroma, although there’s also something to be said about its high-flying euphoria and colorful buds. Coated with a sticky blanket of sugar-like resin, Jolly Rancher is a treat for all the senses.\n\nFind out which stores and dispensaries are currently carrying Jolly Rancher\n \n 6. Reclining Buddha \n\nReclining Buddha from Soma Seeds is a mostly indica cannabis strain bred from Super Skunk, Big Skunk Korean, and Holland’s Hope. Originally named Soma Skunk V, the more aptly named Reclining Buddha provides a physically relaxing experience that allows enough mental energy for introspective and creative activities. Growers are drawn to this indica’s resistance to mold, vitality outdoors, and large yields of resinous, cherry-scented buds.\n\n \n 7. Peaches and Cream\n\nThe Peaches and Cream hybrid is a Skunk phenotype with a flavor that lives up to its name. Though floral and citrusy in aroma, Peaches and Cream has a sweet fruity taste underscored by a subtle spiciness. Its buds take on a soft pink-orange color during maturation with bright amber hairs bursting from pastel calyxes. Heady euphoria gives way to creativity and good moods, making this strain an excellent choice for focused tasks and unwinding after work.\n\nFind out which stores and dispensaries are currently carrying Peaches and Cream\n \nCheck out our other new strains recently added to the Leafly Explorer, or catch up on last week's recently added strains!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/08/12001941/new-strains-alert-bettie-page-space-candy-jolly-rancher-pineapple.png",
            "title": "New Strains Alert: Bettie Page, Space Candy, Jolly Rancher, Pineapple Punch and More",
            "urlslug": "/news/strains-products/new-strains-alert-bettie-page-space-candy-jolly-rancher-pineapple"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 50.560224089635845
        },
        {
            "name": "ADD/ADHD",
            "score": 42.68207282913164
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 40.47619047619047
        },
        {
            "name": "PTSD",
            "score": 35.5392156862745
        },
        {
            "name": "Fibromyalgia",
            "score": 34.06862745098039
        }
    ],
    "description": "<p>Bettie Page, grown by Liberty Reach Farms in Washington, is a perfectly balanced 50/50 hybrid cannabis strain. This high-THC strain provides mellow euphoria that focuses itself in the cerebral space, encouraging energy rather than lethargy.&nbsp;</p>\n",
    "descriptionPlain": "Bettie Page, grown by Liberty Reach Farms in Washington, is a perfectly balanced 50/50 hybrid cannabis strain. This high-THC strain provides mellow euphoria that focuses itself in the cerebral space, encouraging energy rather than lethargy.&nbsp;\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 135.92436974789914
        },
        {
            "name": "Energetic",
            "score": 102.59103641456582
        },
        {
            "name": "Happy",
            "score": 96.18347338935574
        },
        {
            "name": "Relaxed",
            "score": 92.71708683473388
        },
        {
            "name": "Focused",
            "score": 71.81372549019606
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 15.756302521008402
        },
        {
            "name": "Cheese",
            "score": 10.819327731092436
        },
        {
            "name": "Diesel",
            "score": 9.34873949579832
        },
        {
            "name": "Sweet",
            "score": 8.61344537815126
        },
        {
            "name": "Pungent",
            "score": 8.61344537815126
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1361076,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "O.K. this is a real good strain for doing chores, working in the garden or sitting around a kitchen table with friends and talking till mid-night or beyond.  I like making art while smoking this strain.  It sets my creative juices flowing and gives me energy enough to attack my work with vigor and joy.   I've been smoking for nearly 50 years but until recently had  little experience with this quality of smoke.  So I'm trying as many new strains as possible.  I've been smoking this strain for about two weeks now and it's all that I've said it too be, however if I really want to get blasted for me it's Fruity Pebbles, AK47 or Zombie Stomp.  Truly couch potato time with these.  DO NOT DRIVE!!!",
            "username": "bardahl4"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1619007,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I picked this up in a vape at Local Roots in Everett during their 420 sale. I wasn't familiar with the strain but it was took good of a sale to pass up. After reading the reviews on here I decided it was probably best to save this one for chore day. I spent the last 7 hours puffing this vape and cleaning my house. I struggle with pain and fatigue but sativa dominants tend to make me a bit too anxious, I found this to be well-balanced, gave me lots of energy helped me cope with the pain. I would highly recommend it for getting lost in whatever activity you enjoy or simply just need to get done. ",
            "username": "CarmanSanDiego425"
        }
    ],
    "id": 176272,
    "name": "Bettie Page",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 50.560224089635845
        },
        {
            "name": "Anxious",
            "score": 15.756302521008402
        },
        {
            "name": "Dizzy",
            "score": 14.285714285714285
        },
        {
            "name": "Dry Eyes",
            "score": 1.4705882352941175
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/hybrid/bettie-page",
    "photoTotalCount": 3,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/459280/b/bettie-page__primary_010c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bettie-page_100x100_3c9a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/407274/b/bettie-page__primary_22c9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bettie-page_100x100_9e79.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/375337/b/bettie-page__primary_a12b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bettie-page_100x100_c0a2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Bellingham, WA",
        "Portland, OR",
        "Seattle, WA",
        "Beaverton, OR",
        "Covington, WA",
        "Ephrata, WA",
        "George, WA",
        "Goldendale, WA",
        "Granite Falls, WA",
        "Hillsboro, OR"
    ],
    "rating": 4.24,
    "relatedStrains": [],
    "reviewCount": 33,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "bettie-page",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.24242424242424/240",
    "subtitle": null,
    "symbol": "Bet",
    "symptoms": [
        {
            "name": "Pain",
            "score": 93.2422969187675
        },
        {
            "name": "Stress",
            "score": 92.50700280112044
        },
        {
            "name": "Fatigue",
            "score": 84.62885154061622
        },
        {
            "name": "Depression",
            "score": 58.438375350140056
        },
        {
            "name": "Muscle Spasms",
            "score": 50.560224089635845
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
