{"sl_translate":"description,descriptionPlain,category","id":65591,"slug":"gg-4","name":"GG4","subtitle":"(f.k.a. Gorilla Glue #4)","symbol":"Gg4","category":"Hybrid","description":"\u003cp\u003eGG4, formerly known as Gorilla Glue #4, developed by GG Strains, is a potent hybrid strain that delivers heavy-handed euphoria and relaxation, leaving you feeling \u0026ldquo;glued\u0026rdquo; to the couch. Its chunky,\u0026nbsp;resin-covered buds fill the room with pungent earthy and sour aromas inherited from its parent strains, \u003ca href=\"http://www.leafly.com/sativa/chems-sister\"\u003eChem\u0026rsquo;s Sister\u003c/a\u003e, Sour Dubb, and \u003ca href=\"http://www.leafly.com/sativa/chocolate-diesel\"\u003eChocolate Diesel\u003c/a\u003e. Taking first place in both the\u0026nbsp;Michigan and Los Angeles 2014 Cannabis Cups as well as the \u003cem\u003eHigh Times\u003c/em\u003e Jamaican World Cup, this multiple award-winning\u0026nbsp;hybrid\u0026#39;s supremacy\u0026nbsp;is no longer a secret,\u0026nbsp;and consumers will search far and wide to get their hands sticky with GG4.\u003c/p\u003e\n","descriptionPlain":"GG4, formerly known as Gorilla Glue #4, developed by GG Strains, is a potent hybrid strain that delivers heavy-handed euphoria and relaxation, leaving you feeling \u0026ldquo;glued\u0026rdquo; to the couch. Its chunky,\u0026nbsp;resin-covered buds fill the room with pungent earthy and sour aromas inherited from its parent strains, Chem\u0026rsquo;s Sister, Sour Dubb, and Chocolate Diesel. Taking first place in both the\u0026nbsp;Michigan and Los Angeles 2014 Cannabis Cups as well as the High Times Jamaican World Cup, this multiple award-winning\u0026nbsp;hybrid\u0026#39;s supremacy\u0026nbsp;is no longer a secret,\u0026nbsp;and consumers will search far and wide to get their hands sticky with GG4.\n","aka":"GG, Gorilla Glue, Guerrilla Glue, Gorilla Glue 4, Gorilla Glue #4, Gorilla Glue No. 4, Gorilla Glue No.4, Gorilla Glue No 4, GG#4, GG #4, GG 4","rating":4.68,"highlightedReviews":[{"id":1418982,"username":"chronicallymedicated","text":"Initial impression: My bud-tender said in the usual tone \"what\u0027ll it be?\" I chirped back, \"surprise me, something new from the cannaseur shelf\u0027 please\". So I was handed a newer strain aptly named \"Mother\u0027s Milk. The other one was Gorilla Glue #4 (GG)\" (reviewed in this post). Needless to say, I was pretty excited about both of these. I sampled this one in a pre-rolled cone form, also rolled with \"Raw Cones\" thanks to the talented hands of Jazzy J at Medicine Man\u0027s Medical Market, located in Glendale, CO.\n\nI use a scale of 10 points, 10 being the highest possible score in any category, with 3 total categories, Taste / Aroma / Potency.\n\nAroma: 10.0 (+1.) bonus.\nThis is the highest number of points I have ever awarded any strain for its aroma. The smell from this strain is so unique, I have never smelled anything like it ever. It had an incredibly strong pungent earthy aroma, with overtones of powerful industrial ammonia. Damn, is all I can really say about this strain. Kudos to the growers for this strain, really, it is something special. I would not want to grow a bunch of this indoors, you would need some serious filters, it would smell like a huge uncleaned litter box, in terms of a real strong odor of cat piss.\n\nTaste: 9.5\nThe taste of this bud was something quite different than its scent. Like the aroma, the taste was also heavy. I was glad that the taste of this did not overwhelm me like its aroma. The initial taste of this is more earthy and piney than its smell leads you to believe. Regardless, this is by far the tastiest strain I have had aside from Jenny Kush in quite a while. It was intense, and mellow at the same time. Really a wonderful strain, with lots to offer.\n\nPotency: 9.0\nThe strength of this euphoria was intense. This strain has provided me with one of the more intense body and head highs of any strain that I have reviewed to date. The high came on almost immediately, and was pretty intense in terms of its psychedelic intensity, the body high was great also, I felt lethargically focused, if that makes any sense. I was in full effect of the indica part also, and here is what I mean. I needed a seat belt for reality, but I was intensely focused on the movie I had on, \"The Big Lebowski\".\n\nFinal opinion: I thought this strain was really really great! The potency was strong, the aroma was powerful and the taste was exceptional, this is a textbook example of perfection. Great job to all of those involved in the production and distribution of this awesome strain. This strain when they have more will be in my private stash for the really long snow days we get in Denver. I would implore you (the reader) try this strain if you have the means to, it is absolutely worth it.\n\nTotal points awarded: 29.5 out of 30 (plus 1 bonus point in the aroma category). I would rate this strain 5.0 stars, I feel that this strain deserves every point it earned! This is not a strain for novices.\n\nCM~","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1642114,"username":"Davidpnin","text":"howdy space hoes, this is your king space hoe dr avocado.   I\u0027m here to report to you all that this strain destroys my sister and I love it too.  it makes me feel trippy without the heavy indica effect.  go slow then climb higher it you wish.  over and out.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-50073","title":"The Top THC-Dominant Strains of Washington State in Fall 2017","author":"Leafly Staff","category":null,"date":"\/Date(1512081671000)\/","text":"This fall, Leafly set out on a quest to find the very best cannabis in Washington state, and we came back with ten standout strains from talented growers on both sides of the Cascade Mountains.\nUsing a point-based method that rates cannabis by its aroma, flavor, appearance, cure, and overall experience, each of these strains received a 1-to-100 score (which you can read more about here). In this feature, we take a look at some of the best THC-dominant strains in Washington, but stay tuned for more product ratings in Washington and beyond.\nThese 10 strains—and their growers—each offered something unique among the sea of cannabis available throughout the state of Washington.\n(Click to enlarge)\nAll strains evaluated in this round have a THC-dominant cannabinoid profile, meaning its THC-to-CBD ratio is at least 5:1. Presidential Kush, which weighed in at just over 17% THC, demonstrates that quality is not measured by this one chemical alone. A diverse and compelling terpene profile—which the curing process can make or break—is often the key to a consumer’s heart, as terpenes augment the overall experience.\n(Click to enlarge)\nOur tasting panel draws experience from all corners of the industry, from budtending to cultivation. Avid curiosity and deep appreciation of cannabis products forms our common foundation, from which extends our individual preferences and experiences.\n#1 | Middlefork by Royal Tree Gardens\n\nPrice: $15-17.00/gram\nThe unanimous favorite among our three tasters was Royal Tree’s Middlefork, a true Washington native born just outside the city of Bellingham. Perfected over years from Dutch Treat parent genetics, it’s no surprise that its aroma and flavor stole our hearts: Effervescent citrus and fresh-cut pine linger on the exhale in an impressive translation of aroma to flavor. Middlefork is ruggedly attractive, growing fuzzy buds that are absolutely packed with sticky, enticing trichomes. Meanwhile, its effects are commanding in strength, bolting all three of us to our seats in stunned satisfaction.\nFind Middlefork Nearby\nFrom the Tasting Notebook:\n“Very attractive scent of sweet candied citrus fizz…I am definitely stoned.” –Will\n“Kind of tastes like vanilla chai mixed with orange spice creamsicle. After a few hits from the vaporizer, my eyes fell into crescents, and I was hopelessly glued to the couch in a state of bliss.” –Bailey\n#2 | Sherbet by Gabriel\n\nPrice: $45/eighth\nGabriel’s Sherbet weighed in as our panel’s second place flower, tying with Middlefork in its overall score but falling just inches short after calculating each panelist’s individual scoring. With Sherbet, we couldn’t help but obsess over the knotting of purple, blue, and green hues underneath the thick coat of trichomes and fiery orange hairs. Its aroma mimics that of a berry pie, from buttery crust to its fruity center, creating a unique bouquet that isn’t often captured by a single cannabis bud. Considering its price-to-quality ratio, Sherbet by Gabriel is among the best value on this list (plus, it’s pesticide-free).\nFind Gabriel Sherbet Nearby\nFrom the Tasting Notebook:\n“Beautiful bud with highly expressive features. Provides a heady, happy buzz with relaxing physical effects.” –Jeremiah\n“Its color is variated and intricate with a dessert-like aroma of sugary dough, sweet berry, and deep grape.” –Bailey \n#3 | Presidential Kush by Fifty Fold\n\nPrice: $50/eighth\nPresidential Kush by Fifty Fold is beauty in a bag, showing off a thick layer of frosty trichomes against its dark, cosmic purple coloration. The buds bloom with perfect conic uniformity, like a Christmas tree covered in luminescent white bulbs. Its aroma is full and nuanced, expressing sweet and sour notes of fruit and berry, but these delicate fragrances are lost with heat. Though its exceptional aroma and appearance tied its overall score up with our two frontrunners, Presidential Kush’s muted earthy flavor left some room for improvement.\nFind Presidential Kush Nearby\nFrom the Tasting Notebook:\n“Very complex and enticing smell of funky dankness and sweet sugary notes that keep me coming back to this bud. This was easily one of my favorite flowers in the whole lot.” –Will\n“Beautiful frosted buds with uniform shape, but the flavor left much to be desired after its wonderful aroma.” –Jeremiah\n#4 | Alien Dawg by NEBULA\n\nPrice: $48/eighth\nNebula Gardens is known for its bulky, resinous buds—and Alien Dawg is no exception thanks to its enormous, bulbous buds that build up off of each other to create an otherworldly mass of trichome-covered foliage. Gassy diesel aromas evaporate off the monolithic buds, intermixing with notes of pine and tangy fruit. This aroma translates well to flavor that carries hints of sweet earth, sandalwood, and herbs. The diversity of flavors and aromas combined with its commanding cerebral high made Alien Dawg a standout strain, especially among our tasters with a penchant for funky, gassy strains. It’s also pesticide-free.\nFind Alien Dawg Nearby\nFrom the Tasting Notebook:\n“Sweet and sour aroma with overripe tree fruit and fresh soil. Its effects are cerebrally stimulating without feeling too top-heavy.” –Bailey\n“It has the pungent funkiness of many other strains, but with a bright and peppery sweetness at the center.” –Jeremiah\n#5 | Lemonder by Seattle’s Private Reserve\n\nPrice: $45/eighth\nLemonder by Seattle’s Private Reserve leaves an immediate impression with an aroma that smells like fresh-squeezed lemons and flowering herbs. The soft lime-green buds crack open easily, filling the nose with a diversity of funky, floral, and citrus aromas inherited from its parent genetics: Lavender, OG Kush, and Super Lemon Haze. Its intricate but fragile flavor profile collapses with heat, delivering fleeting hints of candied lemon. This flavor is refreshing but subdued compared to its impeccable lemon astringent aroma. Anyone with a sweet tooth for lemon-loaded strains should not walk, but run to the nearest dispensary stocking Lemonder.\nFind Lemonder Nearby\nFrom the Tasting Notebook:\n“This is the best aroma I have smelled so far. Lemon, cream, spice, and a middle savory note that mellows the lemon in a weird way.” –Jeremiah\n“Very healthy-looking lime green coloration and incredible lemon astringent aroma. It’s easy to focus in the stillness of its pleasant effects.” –Bailey\n#6 | GG4 by North Coast Growers\n\nPrice: $50-63.00/eighth\nSticky, euphoric, and reeking of sour fuel, GG4 (formerly known as GG4 (f.k.a Gorilla Glue #4)) is easy to pick out of a crowd. This particular rendition from North Coast Growers was a polarizing force among our tasters, but the consensus brought this strain to #6 on our list. The close shave of the trim and subtlety of aroma and flavor were, for some, a miss. But others favored the trim and aroma, admiring its poignant odor of gas and pine. Hints of sweet white tea and aged sour cheese hit the palate on the exhale, a divisive but unique flavor that lacked somewhat in strength.\nFind GG4 Nearby\nFrom the Tasting Notebook:\n“Its flavor is sharp pine with a hint of parmesan funk. Really deep and complex earthy notes that finish sweet with a tingle of citrus.” –Will\n“This one has a deep herbal and pine aroma with a light skunky gas note. The onset of effects is jarring and intense—deeply euphoric and trippy.” –Bailey\n#7 | Jet Fuel by Sweet As!\n\nPrice: $36/eighth\nThis take on Jet Fuel by Sweet As! is decidedly one of the best values when its quality-to-price ratio is considered. The strain has immediate bag appeal, showing off fuzzy, healthy green buds under a coat of gluey resin. Sweet and earthy aromas fill the nose, hinting at a spice rack of different terpenes. Jet Fuel scored well across the board, proving to be an all-around solid choice for those seeking a potent strain with a moderate offering of fragrances and flavors.\nFind Jet Fuel Nearby\nFrom the Tasting Notebook:\n“It has a sweet, skunky zest with a funky sour aroma that opens up with bright intensity. When smoked, it tastes like turpentine.” –Bailey\n“Sweet, fresh, earthy aroma with subtle hints of spice and licorice when ground up. Effects are thought-provoking with cerebral energy out the gate.” –Will\n#8 | GG4 by From the Soil\n\nPrice: $50/eighth\nFrom the Soil’s GG4 (formerly known as GG4 (f.k.a Gorilla Glue #4)) is yet another solid take on the sticky, stinky favorite. The aroma of this strain was somewhat muted in the jar, but when ground up, the strain shares its fragrant secret in full: stinging fuel, sharp pine, and a whisper of sweet lemon. Its exhaled flavor is dampened by heat, giving rise to vague earthy flavors with a slight tinge of mint best preserved by a vaporizer. The effects rest neatly in the head, singing away stress and tension with warm euphoria.\nFrom the Tasting Notebook:\n“Buds offer little on the nose until broken up, but once cracked open, there’s a pleasant, funky aroma. Its swampy, earthy flavor sticks to the tongue but fades away pretty quickly.” –Jeremiah\n“Smells earthy, woody, and muted as a nug. When cracked open, it exposes a loud fuel/gas scent reminiscent of Kush. Smells fantastic when ground up!” –Will \nFind GG4 Nearby\n\n#9 | Golden Ticket by Khush Kush\n\nPrice: $50-65/eighth\nGolden Ticket from Khush Kush offers an alluring but subtle harmony of sweet flavors that dance lightly across the palate, charming you with notes of tropical fruit, lemon spearmint, and fresh pine. Its aroma carries similar traits, but with dialed-up citrus and orange blossom notes. The flower itself is a beautiful twisting of green, purple, and fire-orange hairs hiding under a brilliant coat of trichomes. A few minor flaws in the buds and a somewhat faint flavor profile knocked a few points off this strain’s score, but it’s definitely a catch for low-temp vaping.\nFind Golden Ticket Nearby\nFrom the Tasting Notebook:\n“Aroma is sweet, floral and sort of tropical. Ground up, it gets even sweeter, like a sour green apple or overripe pineapple. Flavor falls off a little compared to the smell, but is still sweet and tropical.” –Will\n“It has a sharp lemon-lime aroma with sweet pine and herbs, and a light, summery lime flavor.” –Bailey \n#10 | MK Ultra by Virginia Co.\n\nPrice: $50-65/eighth\nMK Ultra from Virginia Co. is a gorgeous flower that expresses itself with weaving hues of dark and light green under glittering trichomes. The aroma is complex but not super pungent. Where it catches your attention is in its unusual scent that can only be described as a compost bin full of overripe fruit and cheese rind. Its flavor releases a spicy, peppery essence with a touch of sweet flower. As for effects, the onset is immediate and intoxicating, favoring those with a stubborn tolerance to THC.\nFind MK Ultra Nearby\nFrom the Tasting Notebook:\n“Great bud structure with resinous knots that show off the flower’s unique shape. Peppery hashy taste that’s smooth on the inhale; some slight harshness on the exhale.” –Bailey\n“Aroma is pungent and smells a bit like rotten earth, skunk, and some lemon. The flavor is much more mellow than the smell: earthy, floral, and a touch of funk.” –Jeremiah","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/29155113/gabriel-sherbet-macro.jpg","urlslug":"/news/strains-products/best-thc-strains-washington-state-fall-2017"},{"id":"contentitems-31849","title":"Tips for Growing GG4 (f.k.a. Gorilla Glue #4) Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1498086938000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Created by cannabis breeder GG Strains, GG4 (f.k.a Gorilla Glue #4) is one of the most potent strains on the market today. Coming from Chem’s Sister, Sour Dub, and Chocolate Diesel, this hybrid strain has won multiple Cannabis Cups. With a THC content that regularly hits the 25-30% range, GG4 (f.k.a Gorilla Glue #4)’s earthy buds will glow with more trichomes than you’ve likely ever seen. It is a highly coveted strain that has been circulated only as a clone for now, with seeds soon coming from GG Strains directly.\nGrow Techniques: GG4 (f.k.a Gorilla Glue #4) will do wonders with a SCROG (screen of green) style grow as the plants will be fast to fill your garden space, especially if grown hydroponically. Giving all the buds equal chance for full sunlight will guarantee the entire plant reaches its peak potential while supporting its beautiful colas. Because GG4 (f.k.a Gorilla Glue #4) came from a hermaphroditic plant, so be aware that pollen sacs can develop from this strain.\nFlowering Time: 8-9 weeks\nYield: Moderate to high\nGrow Difficulty: Moderate\nClimate: Moderate climates between 68 and 85 degrees Fahrenheit. Keep humidity down while flowering to help against mold. Colder temperatures will also increase trichome production towards the end of flowering.\nIndoor/Outdoor: GG4 (f.k.a Gorilla Glue #4) can be grown both indoors and outdoors successfully. Trichomes are naturally water repellant, so this crystallized strain always has a raincoat on while flowering.\nFeeding: Try using potassium silicate-rich foods that will help strengthen the plant as these buds develop.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/28141521/gorilla-glue-strain-article.jpg","urlslug":"/news/growing/how-to-grow-gg4-marijuana"}],"reviewCount":3364,"flavors":[{"name":"Earthy","score":32.597959736617213},{"name":"Pungent","score":20.846597362641688},{"name":"Pine","score":16.456353423560845},{"name":"Woody","score":15.983464230002557},{"name":"Diesel","score":11.201314303664798}],"effects":[{"name":"Relaxed","score":80.2983198639564},{"name":"Euphoric","score":68.529998705755986},{"name":"Happy","score":58.399382593777666},{"name":"Uplifted","score":39.537943715183388},{"name":"Sleepy","score":31.711180529311996}],"symptoms":[{"name":"Stress","score":38.178283295366093},{"name":"Depression","score":29.682776511702166},{"name":"Pain","score":27.6497035820663},{"name":"Insomnia","score":22.099135710911408},{"name":"Lack of Appetite","score":18.084713603631272}],"conditions":[{"name":"Anxiety","score":25.211562042099207},{"name":"PTSD","score":13.720777070713421},{"name":"ADD/ADHD","score":10.174736274309421},{"name":"Migraines","score":7.8302114673023855},{"name":"Arthritis","score":7.2424332358256054}],"negatives":[{"name":"Dry Mouth","score":27.251905704821773},{"name":"Dry Eyes","score":15.238917124891392},{"name":"Paranoid","score":6.0779544649953561},{"name":"Dizzy","score":5.4133525607064659},{"name":"Anxious","score":4.7970261269781815}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/gg-4/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/gg-4/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_23a9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005508/b/gorilla-glue--4__primary_086c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_85d1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1004769/b/gorilla-glue--4__primary_429f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_00ae.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003601/b/gorilla-glue--4__primary_a05e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_6424.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003584/b/gorilla-glue--4__primary_9e5d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_8723.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003066/b/gorilla-glue--4__primary_2488.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_ded9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002966/b/gorilla-glue--4__primary_b9cc.jpg"}],"photoTotalCount":761,"popularCities":["Portland, OR","Los Angeles, CA","Denver, CO","Seattle, WA","Eugene, OR","Detroit, MI","Toronto, ON","Las Vegas, NV","Phoenix, AZ","San Francisco, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/gg-4","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.67627824019025/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Chem\u0027s Sister","subtitle":null,"slug":"chems-sister","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/chems-sister","symbol":"Csi","applink":"leafly://strain/chems-sister"},{"name":"Chocolate Diesel","subtitle":null,"slug":"chocolate-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/chocolate-diesel","symbol":"Cdl","applink":"leafly://strain/chocolate-diesel"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":"Tall","averageYield":"Medium","environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":65591,"slug":"gg-4","name":"GG4","subtitle":"(f.k.a. Gorilla Glue #4)","symbol":"Gg4","category":"Hybrid","description":"\u003cp\u003eGG4, formerly known as Gorilla Glue #4, developed by GG Strains, is a potent hybrid strain that delivers heavy-handed euphoria and relaxation, leaving you feeling \u0026ldquo;glued\u0026rdquo; to the couch. Its chunky,\u0026nbsp;resin-covered buds fill the room with pungent earthy and sour aromas inherited from its parent strains, \u003ca href=\"http://www.leafly.com/sativa/chems-sister\"\u003eChem\u0026rsquo;s Sister\u003c/a\u003e, Sour Dubb, and \u003ca href=\"http://www.leafly.com/sativa/chocolate-diesel\"\u003eChocolate Diesel\u003c/a\u003e. Taking first place in both the\u0026nbsp;Michigan and Los Angeles 2014 Cannabis Cups as well as the \u003cem\u003eHigh Times\u003c/em\u003e Jamaican World Cup, this multiple award-winning\u0026nbsp;hybrid\u0026#39;s supremacy\u0026nbsp;is no longer a secret,\u0026nbsp;and consumers will search far and wide to get their hands sticky with GG4.\u003c/p\u003e\n","descriptionPlain":"GG4, formerly known as Gorilla Glue #4, developed by GG Strains, is a potent hybrid strain that delivers heavy-handed euphoria and relaxation, leaving you feeling \u0026ldquo;glued\u0026rdquo; to the couch. Its chunky,\u0026nbsp;resin-covered buds fill the room with pungent earthy and sour aromas inherited from its parent strains, Chem\u0026rsquo;s Sister, Sour Dubb, and Chocolate Diesel. Taking first place in both the\u0026nbsp;Michigan and Los Angeles 2014 Cannabis Cups as well as the High Times Jamaican World Cup, this multiple award-winning\u0026nbsp;hybrid\u0026#39;s supremacy\u0026nbsp;is no longer a secret,\u0026nbsp;and consumers will search far and wide to get their hands sticky with GG4.\n","aka":"GG, Gorilla Glue, Guerrilla Glue, Gorilla Glue 4, Gorilla Glue #4, Gorilla Glue No. 4, Gorilla Glue No.4, Gorilla Glue No 4, GG#4, GG #4, GG 4","rating":4.68,"highlightedReviews":[{"id":1418982,"username":"chronicallymedicated","text":"Initial impression: My bud-tender said in the usual tone \"what\u0027ll it be?\" I chirped back, \"surprise me, something new from the cannaseur shelf\u0027 please\". So I was handed a newer strain aptly named \"Mother\u0027s Milk. The other one was Gorilla Glue #4 (GG)\" (reviewed in this post). Needless to say, I was pretty excited about both of these. I sampled this one in a pre-rolled cone form, also rolled with \"Raw Cones\" thanks to the talented hands of Jazzy J at Medicine Man\u0027s Medical Market, located in Glendale, CO.\n\nI use a scale of 10 points, 10 being the highest possible score in any category, with 3 total categories, Taste / Aroma / Potency.\n\nAroma: 10.0 (+1.) bonus.\nThis is the highest number of points I have ever awarded any strain for its aroma. The smell from this strain is so unique, I have never smelled anything like it ever. It had an incredibly strong pungent earthy aroma, with overtones of powerful industrial ammonia. Damn, is all I can really say about this strain. Kudos to the growers for this strain, really, it is something special. I would not want to grow a bunch of this indoors, you would need some serious filters, it would smell like a huge uncleaned litter box, in terms of a real strong odor of cat piss.\n\nTaste: 9.5\nThe taste of this bud was something quite different than its scent. Like the aroma, the taste was also heavy. I was glad that the taste of this did not overwhelm me like its aroma. The initial taste of this is more earthy and piney than its smell leads you to believe. Regardless, this is by far the tastiest strain I have had aside from Jenny Kush in quite a while. It was intense, and mellow at the same time. Really a wonderful strain, with lots to offer.\n\nPotency: 9.0\nThe strength of this euphoria was intense. This strain has provided me with one of the more intense body and head highs of any strain that I have reviewed to date. The high came on almost immediately, and was pretty intense in terms of its psychedelic intensity, the body high was great also, I felt lethargically focused, if that makes any sense. I was in full effect of the indica part also, and here is what I mean. I needed a seat belt for reality, but I was intensely focused on the movie I had on, \"The Big Lebowski\".\n\nFinal opinion: I thought this strain was really really great! The potency was strong, the aroma was powerful and the taste was exceptional, this is a textbook example of perfection. Great job to all of those involved in the production and distribution of this awesome strain. This strain when they have more will be in my private stash for the really long snow days we get in Denver. I would implore you (the reader) try this strain if you have the means to, it is absolutely worth it.\n\nTotal points awarded: 29.5 out of 30 (plus 1 bonus point in the aroma category). I would rate this strain 5.0 stars, I feel that this strain deserves every point it earned! This is not a strain for novices.\n\nCM~","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1642114,"username":"Davidpnin","text":"howdy space hoes, this is your king space hoe dr avocado.   I\u0027m here to report to you all that this strain destroys my sister and I love it too.  it makes me feel trippy without the heavy indica effect.  go slow then climb higher it you wish.  over and out.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-50073","title":"The Top THC-Dominant Strains of Washington State in Fall 2017","author":"Leafly Staff","category":null,"date":"\/Date(1512081671000)\/","text":"This fall, Leafly set out on a quest to find the very best cannabis in Washington state, and we came back with ten standout strains from talented growers on both sides of the Cascade Mountains.\nUsing a point-based method that rates cannabis by its aroma, flavor, appearance, cure, and overall experience, each of these strains received a 1-to-100 score (which you can read more about here). In this feature, we take a look at some of the best THC-dominant strains in Washington, but stay tuned for more product ratings in Washington and beyond.\nThese 10 strains—and their growers—each offered something unique among the sea of cannabis available throughout the state of Washington.\n(Click to enlarge)\nAll strains evaluated in this round have a THC-dominant cannabinoid profile, meaning its THC-to-CBD ratio is at least 5:1. Presidential Kush, which weighed in at just over 17% THC, demonstrates that quality is not measured by this one chemical alone. A diverse and compelling terpene profile—which the curing process can make or break—is often the key to a consumer’s heart, as terpenes augment the overall experience.\n(Click to enlarge)\nOur tasting panel draws experience from all corners of the industry, from budtending to cultivation. Avid curiosity and deep appreciation of cannabis products forms our common foundation, from which extends our individual preferences and experiences.\n#1 | Middlefork by Royal Tree Gardens\n\nPrice: $15-17.00/gram\nThe unanimous favorite among our three tasters was Royal Tree’s Middlefork, a true Washington native born just outside the city of Bellingham. Perfected over years from Dutch Treat parent genetics, it’s no surprise that its aroma and flavor stole our hearts: Effervescent citrus and fresh-cut pine linger on the exhale in an impressive translation of aroma to flavor. Middlefork is ruggedly attractive, growing fuzzy buds that are absolutely packed with sticky, enticing trichomes. Meanwhile, its effects are commanding in strength, bolting all three of us to our seats in stunned satisfaction.\nFind Middlefork Nearby\nFrom the Tasting Notebook:\n“Very attractive scent of sweet candied citrus fizz…I am definitely stoned.” –Will\n“Kind of tastes like vanilla chai mixed with orange spice creamsicle. After a few hits from the vaporizer, my eyes fell into crescents, and I was hopelessly glued to the couch in a state of bliss.” –Bailey\n#2 | Sherbet by Gabriel\n\nPrice: $45/eighth\nGabriel’s Sherbet weighed in as our panel’s second place flower, tying with Middlefork in its overall score but falling just inches short after calculating each panelist’s individual scoring. With Sherbet, we couldn’t help but obsess over the knotting of purple, blue, and green hues underneath the thick coat of trichomes and fiery orange hairs. Its aroma mimics that of a berry pie, from buttery crust to its fruity center, creating a unique bouquet that isn’t often captured by a single cannabis bud. Considering its price-to-quality ratio, Sherbet by Gabriel is among the best value on this list (plus, it’s pesticide-free).\nFind Gabriel Sherbet Nearby\nFrom the Tasting Notebook:\n“Beautiful bud with highly expressive features. Provides a heady, happy buzz with relaxing physical effects.” –Jeremiah\n“Its color is variated and intricate with a dessert-like aroma of sugary dough, sweet berry, and deep grape.” –Bailey \n#3 | Presidential Kush by Fifty Fold\n\nPrice: $50/eighth\nPresidential Kush by Fifty Fold is beauty in a bag, showing off a thick layer of frosty trichomes against its dark, cosmic purple coloration. The buds bloom with perfect conic uniformity, like a Christmas tree covered in luminescent white bulbs. Its aroma is full and nuanced, expressing sweet and sour notes of fruit and berry, but these delicate fragrances are lost with heat. Though its exceptional aroma and appearance tied its overall score up with our two frontrunners, Presidential Kush’s muted earthy flavor left some room for improvement.\nFind Presidential Kush Nearby\nFrom the Tasting Notebook:\n“Very complex and enticing smell of funky dankness and sweet sugary notes that keep me coming back to this bud. This was easily one of my favorite flowers in the whole lot.” –Will\n“Beautiful frosted buds with uniform shape, but the flavor left much to be desired after its wonderful aroma.” –Jeremiah\n#4 | Alien Dawg by NEBULA\n\nPrice: $48/eighth\nNebula Gardens is known for its bulky, resinous buds—and Alien Dawg is no exception thanks to its enormous, bulbous buds that build up off of each other to create an otherworldly mass of trichome-covered foliage. Gassy diesel aromas evaporate off the monolithic buds, intermixing with notes of pine and tangy fruit. This aroma translates well to flavor that carries hints of sweet earth, sandalwood, and herbs. The diversity of flavors and aromas combined with its commanding cerebral high made Alien Dawg a standout strain, especially among our tasters with a penchant for funky, gassy strains. It’s also pesticide-free.\nFind Alien Dawg Nearby\nFrom the Tasting Notebook:\n“Sweet and sour aroma with overripe tree fruit and fresh soil. Its effects are cerebrally stimulating without feeling too top-heavy.” –Bailey\n“It has the pungent funkiness of many other strains, but with a bright and peppery sweetness at the center.” –Jeremiah\n#5 | Lemonder by Seattle’s Private Reserve\n\nPrice: $45/eighth\nLemonder by Seattle’s Private Reserve leaves an immediate impression with an aroma that smells like fresh-squeezed lemons and flowering herbs. The soft lime-green buds crack open easily, filling the nose with a diversity of funky, floral, and citrus aromas inherited from its parent genetics: Lavender, OG Kush, and Super Lemon Haze. Its intricate but fragile flavor profile collapses with heat, delivering fleeting hints of candied lemon. This flavor is refreshing but subdued compared to its impeccable lemon astringent aroma. Anyone with a sweet tooth for lemon-loaded strains should not walk, but run to the nearest dispensary stocking Lemonder.\nFind Lemonder Nearby\nFrom the Tasting Notebook:\n“This is the best aroma I have smelled so far. Lemon, cream, spice, and a middle savory note that mellows the lemon in a weird way.” –Jeremiah\n“Very healthy-looking lime green coloration and incredible lemon astringent aroma. It’s easy to focus in the stillness of its pleasant effects.” –Bailey\n#6 | GG4 by North Coast Growers\n\nPrice: $50-63.00/eighth\nSticky, euphoric, and reeking of sour fuel, GG4 (formerly known as GG4 (f.k.a Gorilla Glue #4)) is easy to pick out of a crowd. This particular rendition from North Coast Growers was a polarizing force among our tasters, but the consensus brought this strain to #6 on our list. The close shave of the trim and subtlety of aroma and flavor were, for some, a miss. But others favored the trim and aroma, admiring its poignant odor of gas and pine. Hints of sweet white tea and aged sour cheese hit the palate on the exhale, a divisive but unique flavor that lacked somewhat in strength.\nFind GG4 Nearby\nFrom the Tasting Notebook:\n“Its flavor is sharp pine with a hint of parmesan funk. Really deep and complex earthy notes that finish sweet with a tingle of citrus.” –Will\n“This one has a deep herbal and pine aroma with a light skunky gas note. The onset of effects is jarring and intense—deeply euphoric and trippy.” –Bailey\n#7 | Jet Fuel by Sweet As!\n\nPrice: $36/eighth\nThis take on Jet Fuel by Sweet As! is decidedly one of the best values when its quality-to-price ratio is considered. The strain has immediate bag appeal, showing off fuzzy, healthy green buds under a coat of gluey resin. Sweet and earthy aromas fill the nose, hinting at a spice rack of different terpenes. Jet Fuel scored well across the board, proving to be an all-around solid choice for those seeking a potent strain with a moderate offering of fragrances and flavors.\nFind Jet Fuel Nearby\nFrom the Tasting Notebook:\n“It has a sweet, skunky zest with a funky sour aroma that opens up with bright intensity. When smoked, it tastes like turpentine.” –Bailey\n“Sweet, fresh, earthy aroma with subtle hints of spice and licorice when ground up. Effects are thought-provoking with cerebral energy out the gate.” –Will\n#8 | GG4 by From the Soil\n\nPrice: $50/eighth\nFrom the Soil’s GG4 (formerly known as GG4 (f.k.a Gorilla Glue #4)) is yet another solid take on the sticky, stinky favorite. The aroma of this strain was somewhat muted in the jar, but when ground up, the strain shares its fragrant secret in full: stinging fuel, sharp pine, and a whisper of sweet lemon. Its exhaled flavor is dampened by heat, giving rise to vague earthy flavors with a slight tinge of mint best preserved by a vaporizer. The effects rest neatly in the head, singing away stress and tension with warm euphoria.\nFrom the Tasting Notebook:\n“Buds offer little on the nose until broken up, but once cracked open, there’s a pleasant, funky aroma. Its swampy, earthy flavor sticks to the tongue but fades away pretty quickly.” –Jeremiah\n“Smells earthy, woody, and muted as a nug. When cracked open, it exposes a loud fuel/gas scent reminiscent of Kush. Smells fantastic when ground up!” –Will \nFind GG4 Nearby\n\n#9 | Golden Ticket by Khush Kush\n\nPrice: $50-65/eighth\nGolden Ticket from Khush Kush offers an alluring but subtle harmony of sweet flavors that dance lightly across the palate, charming you with notes of tropical fruit, lemon spearmint, and fresh pine. Its aroma carries similar traits, but with dialed-up citrus and orange blossom notes. The flower itself is a beautiful twisting of green, purple, and fire-orange hairs hiding under a brilliant coat of trichomes. A few minor flaws in the buds and a somewhat faint flavor profile knocked a few points off this strain’s score, but it’s definitely a catch for low-temp vaping.\nFind Golden Ticket Nearby\nFrom the Tasting Notebook:\n“Aroma is sweet, floral and sort of tropical. Ground up, it gets even sweeter, like a sour green apple or overripe pineapple. Flavor falls off a little compared to the smell, but is still sweet and tropical.” –Will\n“It has a sharp lemon-lime aroma with sweet pine and herbs, and a light, summery lime flavor.” –Bailey \n#10 | MK Ultra by Virginia Co.\n\nPrice: $50-65/eighth\nMK Ultra from Virginia Co. is a gorgeous flower that expresses itself with weaving hues of dark and light green under glittering trichomes. The aroma is complex but not super pungent. Where it catches your attention is in its unusual scent that can only be described as a compost bin full of overripe fruit and cheese rind. Its flavor releases a spicy, peppery essence with a touch of sweet flower. As for effects, the onset is immediate and intoxicating, favoring those with a stubborn tolerance to THC.\nFind MK Ultra Nearby\nFrom the Tasting Notebook:\n“Great bud structure with resinous knots that show off the flower’s unique shape. Peppery hashy taste that’s smooth on the inhale; some slight harshness on the exhale.” –Bailey\n“Aroma is pungent and smells a bit like rotten earth, skunk, and some lemon. The flavor is much more mellow than the smell: earthy, floral, and a touch of funk.” –Jeremiah","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/29155113/gabriel-sherbet-macro.jpg","urlslug":"/news/strains-products/best-thc-strains-washington-state-fall-2017"},{"id":"contentitems-31849","title":"Tips for Growing GG4 (f.k.a. Gorilla Glue #4) Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1498086938000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Created by cannabis breeder GG Strains, GG4 (f.k.a Gorilla Glue #4) is one of the most potent strains on the market today. Coming from Chem’s Sister, Sour Dub, and Chocolate Diesel, this hybrid strain has won multiple Cannabis Cups. With a THC content that regularly hits the 25-30% range, GG4 (f.k.a Gorilla Glue #4)’s earthy buds will glow with more trichomes than you’ve likely ever seen. It is a highly coveted strain that has been circulated only as a clone for now, with seeds soon coming from GG Strains directly.\nGrow Techniques: GG4 (f.k.a Gorilla Glue #4) will do wonders with a SCROG (screen of green) style grow as the plants will be fast to fill your garden space, especially if grown hydroponically. Giving all the buds equal chance for full sunlight will guarantee the entire plant reaches its peak potential while supporting its beautiful colas. Because GG4 (f.k.a Gorilla Glue #4) came from a hermaphroditic plant, so be aware that pollen sacs can develop from this strain.\nFlowering Time: 8-9 weeks\nYield: Moderate to high\nGrow Difficulty: Moderate\nClimate: Moderate climates between 68 and 85 degrees Fahrenheit. Keep humidity down while flowering to help against mold. Colder temperatures will also increase trichome production towards the end of flowering.\nIndoor/Outdoor: GG4 (f.k.a Gorilla Glue #4) can be grown both indoors and outdoors successfully. Trichomes are naturally water repellant, so this crystallized strain always has a raincoat on while flowering.\nFeeding: Try using potassium silicate-rich foods that will help strengthen the plant as these buds develop.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/28141521/gorilla-glue-strain-article.jpg","urlslug":"/news/growing/how-to-grow-gg4-marijuana"}],"reviewCount":3364,"flavors":[{"name":"Earthy","score":32.597959736617213},{"name":"Pungent","score":20.846597362641688},{"name":"Pine","score":16.456353423560845},{"name":"Woody","score":15.983464230002557},{"name":"Diesel","score":11.201314303664798}],"effects":[{"name":"Relaxed","score":80.2983198639564},{"name":"Euphoric","score":68.529998705755986},{"name":"Happy","score":58.399382593777666},{"name":"Uplifted","score":39.537943715183388},{"name":"Sleepy","score":31.711180529311996}],"symptoms":[{"name":"Stress","score":38.178283295366093},{"name":"Depression","score":29.682776511702166},{"name":"Pain","score":27.6497035820663},{"name":"Insomnia","score":22.099135710911408},{"name":"Lack of Appetite","score":18.084713603631272}],"conditions":[{"name":"Anxiety","score":25.211562042099207},{"name":"PTSD","score":13.720777070713421},{"name":"ADD/ADHD","score":10.174736274309421},{"name":"Migraines","score":7.8302114673023855},{"name":"Arthritis","score":7.2424332358256054}],"negatives":[{"name":"Dry Mouth","score":27.251905704821773},{"name":"Dry Eyes","score":15.238917124891392},{"name":"Paranoid","score":6.0779544649953561},{"name":"Dizzy","score":5.4133525607064659},{"name":"Anxious","score":4.7970261269781815}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/gg-4/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/gg-4/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_23a9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005508/b/gorilla-glue--4__primary_086c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_85d1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1004769/b/gorilla-glue--4__primary_429f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_00ae.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003601/b/gorilla-glue--4__primary_a05e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_6424.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003584/b/gorilla-glue--4__primary_9e5d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_8723.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003066/b/gorilla-glue--4__primary_2488.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_ded9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002966/b/gorilla-glue--4__primary_b9cc.jpg"}],"photoTotalCount":761,"popularCities":["Portland, OR","Los Angeles, CA","Denver, CO","Seattle, WA","Eugene, OR","Detroit, MI","Toronto, ON","Las Vegas, NV","Phoenix, AZ","San Francisco, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/gg-4","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.67627824019025/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Chem\u0027s Sister","subtitle":null,"slug":"chems-sister","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/chems-sister","symbol":"Csi","applink":"leafly://strain/chems-sister"},{"name":"Chocolate Diesel","subtitle":null,"slug":"chocolate-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/chocolate-diesel","symbol":"Cdl","applink":"leafly://strain/chocolate-diesel"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":"Tall","averageYield":"Medium","environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":65591,"slug":"gg-4","name":"GG4","subtitle":"(f.k.a. Gorilla Glue #4)","symbol":"Gg4","category":"Hybrid","description":"\u003cp\u003eGG4, formerly known as Gorilla Glue #4, developed by GG Strains, is a potent hybrid strain that delivers heavy-handed euphoria and relaxation, leaving you feeling \u0026ldquo;glued\u0026rdquo; to the couch. Its chunky,\u0026nbsp;resin-covered buds fill the room with pungent earthy and sour aromas inherited from its parent strains, \u003ca href=\"http://www.leafly.com/sativa/chems-sister\"\u003eChem\u0026rsquo;s Sister\u003c/a\u003e, Sour Dubb, and \u003ca href=\"http://www.leafly.com/sativa/chocolate-diesel\"\u003eChocolate Diesel\u003c/a\u003e. Taking first place in both the\u0026nbsp;Michigan and Los Angeles 2014 Cannabis Cups as well as the \u003cem\u003eHigh Times\u003c/em\u003e Jamaican World Cup, this multiple award-winning\u0026nbsp;hybrid\u0026#39;s supremacy\u0026nbsp;is no longer a secret,\u0026nbsp;and consumers will search far and wide to get their hands sticky with GG4.\u003c/p\u003e\n","descriptionPlain":"GG4, formerly known as Gorilla Glue #4, developed by GG Strains, is a potent hybrid strain that delivers heavy-handed euphoria and relaxation, leaving you feeling \u0026ldquo;glued\u0026rdquo; to the couch. Its chunky,\u0026nbsp;resin-covered buds fill the room with pungent earthy and sour aromas inherited from its parent strains, Chem\u0026rsquo;s Sister, Sour Dubb, and Chocolate Diesel. Taking first place in both the\u0026nbsp;Michigan and Los Angeles 2014 Cannabis Cups as well as the High Times Jamaican World Cup, this multiple award-winning\u0026nbsp;hybrid\u0026#39;s supremacy\u0026nbsp;is no longer a secret,\u0026nbsp;and consumers will search far and wide to get their hands sticky with GG4.\n","aka":"GG, Gorilla Glue, Guerrilla Glue, Gorilla Glue 4, Gorilla Glue #4, Gorilla Glue No. 4, Gorilla Glue No.4, Gorilla Glue No 4, GG#4, GG #4, GG 4","rating":4.68,"highlightedReviews":[{"id":1418982,"username":"chronicallymedicated","text":"Initial impression: My bud-tender said in the usual tone \"what\u0027ll it be?\" I chirped back, \"surprise me, something new from the cannaseur shelf\u0027 please\". So I was handed a newer strain aptly named \"Mother\u0027s Milk. The other one was Gorilla Glue #4 (GG)\" (reviewed in this post). Needless to say, I was pretty excited about both of these. I sampled this one in a pre-rolled cone form, also rolled with \"Raw Cones\" thanks to the talented hands of Jazzy J at Medicine Man\u0027s Medical Market, located in Glendale, CO.\n\nI use a scale of 10 points, 10 being the highest possible score in any category, with 3 total categories, Taste / Aroma / Potency.\n\nAroma: 10.0 (+1.) bonus.\nThis is the highest number of points I have ever awarded any strain for its aroma. The smell from this strain is so unique, I have never smelled anything like it ever. It had an incredibly strong pungent earthy aroma, with overtones of powerful industrial ammonia. Damn, is all I can really say about this strain. Kudos to the growers for this strain, really, it is something special. I would not want to grow a bunch of this indoors, you would need some serious filters, it would smell like a huge uncleaned litter box, in terms of a real strong odor of cat piss.\n\nTaste: 9.5\nThe taste of this bud was something quite different than its scent. Like the aroma, the taste was also heavy. I was glad that the taste of this did not overwhelm me like its aroma. The initial taste of this is more earthy and piney than its smell leads you to believe. Regardless, this is by far the tastiest strain I have had aside from Jenny Kush in quite a while. It was intense, and mellow at the same time. Really a wonderful strain, with lots to offer.\n\nPotency: 9.0\nThe strength of this euphoria was intense. This strain has provided me with one of the more intense body and head highs of any strain that I have reviewed to date. The high came on almost immediately, and was pretty intense in terms of its psychedelic intensity, the body high was great also, I felt lethargically focused, if that makes any sense. I was in full effect of the indica part also, and here is what I mean. I needed a seat belt for reality, but I was intensely focused on the movie I had on, \"The Big Lebowski\".\n\nFinal opinion: I thought this strain was really really great! The potency was strong, the aroma was powerful and the taste was exceptional, this is a textbook example of perfection. Great job to all of those involved in the production and distribution of this awesome strain. This strain when they have more will be in my private stash for the really long snow days we get in Denver. I would implore you (the reader) try this strain if you have the means to, it is absolutely worth it.\n\nTotal points awarded: 29.5 out of 30 (plus 1 bonus point in the aroma category). I would rate this strain 5.0 stars, I feel that this strain deserves every point it earned! This is not a strain for novices.\n\nCM~","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1642114,"username":"Davidpnin","text":"howdy space hoes, this is your king space hoe dr avocado.   I\u0027m here to report to you all that this strain destroys my sister and I love it too.  it makes me feel trippy without the heavy indica effect.  go slow then climb higher it you wish.  over and out.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-50073","title":"The Top THC-Dominant Strains of Washington State in Fall 2017","author":"Leafly Staff","category":null,"date":"\/Date(1512081671000)\/","text":"This fall, Leafly set out on a quest to find the very best cannabis in Washington state, and we came back with ten standout strains from talented growers on both sides of the Cascade Mountains.\nUsing a point-based method that rates cannabis by its aroma, flavor, appearance, cure, and overall experience, each of these strains received a 1-to-100 score (which you can read more about here). In this feature, we take a look at some of the best THC-dominant strains in Washington, but stay tuned for more product ratings in Washington and beyond.\nThese 10 strains—and their growers—each offered something unique among the sea of cannabis available throughout the state of Washington.\n(Click to enlarge)\nAll strains evaluated in this round have a THC-dominant cannabinoid profile, meaning its THC-to-CBD ratio is at least 5:1. Presidential Kush, which weighed in at just over 17% THC, demonstrates that quality is not measured by this one chemical alone. A diverse and compelling terpene profile—which the curing process can make or break—is often the key to a consumer’s heart, as terpenes augment the overall experience.\n(Click to enlarge)\nOur tasting panel draws experience from all corners of the industry, from budtending to cultivation. Avid curiosity and deep appreciation of cannabis products forms our common foundation, from which extends our individual preferences and experiences.\n#1 | Middlefork by Royal Tree Gardens\n\nPrice: $15-17.00/gram\nThe unanimous favorite among our three tasters was Royal Tree’s Middlefork, a true Washington native born just outside the city of Bellingham. Perfected over years from Dutch Treat parent genetics, it’s no surprise that its aroma and flavor stole our hearts: Effervescent citrus and fresh-cut pine linger on the exhale in an impressive translation of aroma to flavor. Middlefork is ruggedly attractive, growing fuzzy buds that are absolutely packed with sticky, enticing trichomes. Meanwhile, its effects are commanding in strength, bolting all three of us to our seats in stunned satisfaction.\nFind Middlefork Nearby\nFrom the Tasting Notebook:\n“Very attractive scent of sweet candied citrus fizz…I am definitely stoned.” –Will\n“Kind of tastes like vanilla chai mixed with orange spice creamsicle. After a few hits from the vaporizer, my eyes fell into crescents, and I was hopelessly glued to the couch in a state of bliss.” –Bailey\n#2 | Sherbet by Gabriel\n\nPrice: $45/eighth\nGabriel’s Sherbet weighed in as our panel’s second place flower, tying with Middlefork in its overall score but falling just inches short after calculating each panelist’s individual scoring. With Sherbet, we couldn’t help but obsess over the knotting of purple, blue, and green hues underneath the thick coat of trichomes and fiery orange hairs. Its aroma mimics that of a berry pie, from buttery crust to its fruity center, creating a unique bouquet that isn’t often captured by a single cannabis bud. Considering its price-to-quality ratio, Sherbet by Gabriel is among the best value on this list (plus, it’s pesticide-free).\nFind Gabriel Sherbet Nearby\nFrom the Tasting Notebook:\n“Beautiful bud with highly expressive features. Provides a heady, happy buzz with relaxing physical effects.” –Jeremiah\n“Its color is variated and intricate with a dessert-like aroma of sugary dough, sweet berry, and deep grape.” –Bailey \n#3 | Presidential Kush by Fifty Fold\n\nPrice: $50/eighth\nPresidential Kush by Fifty Fold is beauty in a bag, showing off a thick layer of frosty trichomes against its dark, cosmic purple coloration. The buds bloom with perfect conic uniformity, like a Christmas tree covered in luminescent white bulbs. Its aroma is full and nuanced, expressing sweet and sour notes of fruit and berry, but these delicate fragrances are lost with heat. Though its exceptional aroma and appearance tied its overall score up with our two frontrunners, Presidential Kush’s muted earthy flavor left some room for improvement.\nFind Presidential Kush Nearby\nFrom the Tasting Notebook:\n“Very complex and enticing smell of funky dankness and sweet sugary notes that keep me coming back to this bud. This was easily one of my favorite flowers in the whole lot.” –Will\n“Beautiful frosted buds with uniform shape, but the flavor left much to be desired after its wonderful aroma.” –Jeremiah\n#4 | Alien Dawg by NEBULA\n\nPrice: $48/eighth\nNebula Gardens is known for its bulky, resinous buds—and Alien Dawg is no exception thanks to its enormous, bulbous buds that build up off of each other to create an otherworldly mass of trichome-covered foliage. Gassy diesel aromas evaporate off the monolithic buds, intermixing with notes of pine and tangy fruit. This aroma translates well to flavor that carries hints of sweet earth, sandalwood, and herbs. The diversity of flavors and aromas combined with its commanding cerebral high made Alien Dawg a standout strain, especially among our tasters with a penchant for funky, gassy strains. It’s also pesticide-free.\nFind Alien Dawg Nearby\nFrom the Tasting Notebook:\n“Sweet and sour aroma with overripe tree fruit and fresh soil. Its effects are cerebrally stimulating without feeling too top-heavy.” –Bailey\n“It has the pungent funkiness of many other strains, but with a bright and peppery sweetness at the center.” –Jeremiah\n#5 | Lemonder by Seattle’s Private Reserve\n\nPrice: $45/eighth\nLemonder by Seattle’s Private Reserve leaves an immediate impression with an aroma that smells like fresh-squeezed lemons and flowering herbs. The soft lime-green buds crack open easily, filling the nose with a diversity of funky, floral, and citrus aromas inherited from its parent genetics: Lavender, OG Kush, and Super Lemon Haze. Its intricate but fragile flavor profile collapses with heat, delivering fleeting hints of candied lemon. This flavor is refreshing but subdued compared to its impeccable lemon astringent aroma. Anyone with a sweet tooth for lemon-loaded strains should not walk, but run to the nearest dispensary stocking Lemonder.\nFind Lemonder Nearby\nFrom the Tasting Notebook:\n“This is the best aroma I have smelled so far. Lemon, cream, spice, and a middle savory note that mellows the lemon in a weird way.” –Jeremiah\n“Very healthy-looking lime green coloration and incredible lemon astringent aroma. It’s easy to focus in the stillness of its pleasant effects.” –Bailey\n#6 | GG4 by North Coast Growers\n\nPrice: $50-63.00/eighth\nSticky, euphoric, and reeking of sour fuel, GG4 (formerly known as GG4 (f.k.a Gorilla Glue #4)) is easy to pick out of a crowd. This particular rendition from North Coast Growers was a polarizing force among our tasters, but the consensus brought this strain to #6 on our list. The close shave of the trim and subtlety of aroma and flavor were, for some, a miss. But others favored the trim and aroma, admiring its poignant odor of gas and pine. Hints of sweet white tea and aged sour cheese hit the palate on the exhale, a divisive but unique flavor that lacked somewhat in strength.\nFind GG4 Nearby\nFrom the Tasting Notebook:\n“Its flavor is sharp pine with a hint of parmesan funk. Really deep and complex earthy notes that finish sweet with a tingle of citrus.” –Will\n“This one has a deep herbal and pine aroma with a light skunky gas note. The onset of effects is jarring and intense—deeply euphoric and trippy.” –Bailey\n#7 | Jet Fuel by Sweet As!\n\nPrice: $36/eighth\nThis take on Jet Fuel by Sweet As! is decidedly one of the best values when its quality-to-price ratio is considered. The strain has immediate bag appeal, showing off fuzzy, healthy green buds under a coat of gluey resin. Sweet and earthy aromas fill the nose, hinting at a spice rack of different terpenes. Jet Fuel scored well across the board, proving to be an all-around solid choice for those seeking a potent strain with a moderate offering of fragrances and flavors.\nFind Jet Fuel Nearby\nFrom the Tasting Notebook:\n“It has a sweet, skunky zest with a funky sour aroma that opens up with bright intensity. When smoked, it tastes like turpentine.” –Bailey\n“Sweet, fresh, earthy aroma with subtle hints of spice and licorice when ground up. Effects are thought-provoking with cerebral energy out the gate.” –Will\n#8 | GG4 by From the Soil\n\nPrice: $50/eighth\nFrom the Soil’s GG4 (formerly known as GG4 (f.k.a Gorilla Glue #4)) is yet another solid take on the sticky, stinky favorite. The aroma of this strain was somewhat muted in the jar, but when ground up, the strain shares its fragrant secret in full: stinging fuel, sharp pine, and a whisper of sweet lemon. Its exhaled flavor is dampened by heat, giving rise to vague earthy flavors with a slight tinge of mint best preserved by a vaporizer. The effects rest neatly in the head, singing away stress and tension with warm euphoria.\nFrom the Tasting Notebook:\n“Buds offer little on the nose until broken up, but once cracked open, there’s a pleasant, funky aroma. Its swampy, earthy flavor sticks to the tongue but fades away pretty quickly.” –Jeremiah\n“Smells earthy, woody, and muted as a nug. When cracked open, it exposes a loud fuel/gas scent reminiscent of Kush. Smells fantastic when ground up!” –Will \nFind GG4 Nearby\n\n#9 | Golden Ticket by Khush Kush\n\nPrice: $50-65/eighth\nGolden Ticket from Khush Kush offers an alluring but subtle harmony of sweet flavors that dance lightly across the palate, charming you with notes of tropical fruit, lemon spearmint, and fresh pine. Its aroma carries similar traits, but with dialed-up citrus and orange blossom notes. The flower itself is a beautiful twisting of green, purple, and fire-orange hairs hiding under a brilliant coat of trichomes. A few minor flaws in the buds and a somewhat faint flavor profile knocked a few points off this strain’s score, but it’s definitely a catch for low-temp vaping.\nFind Golden Ticket Nearby\nFrom the Tasting Notebook:\n“Aroma is sweet, floral and sort of tropical. Ground up, it gets even sweeter, like a sour green apple or overripe pineapple. Flavor falls off a little compared to the smell, but is still sweet and tropical.” –Will\n“It has a sharp lemon-lime aroma with sweet pine and herbs, and a light, summery lime flavor.” –Bailey \n#10 | MK Ultra by Virginia Co.\n\nPrice: $50-65/eighth\nMK Ultra from Virginia Co. is a gorgeous flower that expresses itself with weaving hues of dark and light green under glittering trichomes. The aroma is complex but not super pungent. Where it catches your attention is in its unusual scent that can only be described as a compost bin full of overripe fruit and cheese rind. Its flavor releases a spicy, peppery essence with a touch of sweet flower. As for effects, the onset is immediate and intoxicating, favoring those with a stubborn tolerance to THC.\nFind MK Ultra Nearby\nFrom the Tasting Notebook:\n“Great bud structure with resinous knots that show off the flower’s unique shape. Peppery hashy taste that’s smooth on the inhale; some slight harshness on the exhale.” –Bailey\n“Aroma is pungent and smells a bit like rotten earth, skunk, and some lemon. The flavor is much more mellow than the smell: earthy, floral, and a touch of funk.” –Jeremiah","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/29155113/gabriel-sherbet-macro.jpg","urlslug":"/news/strains-products/best-thc-strains-washington-state-fall-2017"},{"id":"contentitems-31849","title":"Tips for Growing GG4 (f.k.a. Gorilla Glue #4) Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1498086938000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Created by cannabis breeder GG Strains, GG4 (f.k.a Gorilla Glue #4) is one of the most potent strains on the market today. Coming from Chem’s Sister, Sour Dub, and Chocolate Diesel, this hybrid strain has won multiple Cannabis Cups. With a THC content that regularly hits the 25-30% range, GG4 (f.k.a Gorilla Glue #4)’s earthy buds will glow with more trichomes than you’ve likely ever seen. It is a highly coveted strain that has been circulated only as a clone for now, with seeds soon coming from GG Strains directly.\nGrow Techniques: GG4 (f.k.a Gorilla Glue #4) will do wonders with a SCROG (screen of green) style grow as the plants will be fast to fill your garden space, especially if grown hydroponically. Giving all the buds equal chance for full sunlight will guarantee the entire plant reaches its peak potential while supporting its beautiful colas. Because GG4 (f.k.a Gorilla Glue #4) came from a hermaphroditic plant, so be aware that pollen sacs can develop from this strain.\nFlowering Time: 8-9 weeks\nYield: Moderate to high\nGrow Difficulty: Moderate\nClimate: Moderate climates between 68 and 85 degrees Fahrenheit. Keep humidity down while flowering to help against mold. Colder temperatures will also increase trichome production towards the end of flowering.\nIndoor/Outdoor: GG4 (f.k.a Gorilla Glue #4) can be grown both indoors and outdoors successfully. Trichomes are naturally water repellant, so this crystallized strain always has a raincoat on while flowering.\nFeeding: Try using potassium silicate-rich foods that will help strengthen the plant as these buds develop.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/28141521/gorilla-glue-strain-article.jpg","urlslug":"/news/growing/how-to-grow-gg4-marijuana"}],"reviewCount":3364,"flavors":[{"name":"Earthy","score":32.597959736617213},{"name":"Pungent","score":20.846597362641688},{"name":"Pine","score":16.456353423560845},{"name":"Woody","score":15.983464230002557},{"name":"Diesel","score":11.201314303664798}],"effects":[{"name":"Relaxed","score":80.2983198639564},{"name":"Euphoric","score":68.529998705755986},{"name":"Happy","score":58.399382593777666},{"name":"Uplifted","score":39.537943715183388},{"name":"Sleepy","score":31.711180529311996}],"symptoms":[{"name":"Stress","score":38.178283295366093},{"name":"Depression","score":29.682776511702166},{"name":"Pain","score":27.6497035820663},{"name":"Insomnia","score":22.099135710911408},{"name":"Lack of Appetite","score":18.084713603631272}],"conditions":[{"name":"Anxiety","score":25.211562042099207},{"name":"PTSD","score":13.720777070713421},{"name":"ADD/ADHD","score":10.174736274309421},{"name":"Migraines","score":7.8302114673023855},{"name":"Arthritis","score":7.2424332358256054}],"negatives":[{"name":"Dry Mouth","score":27.251905704821773},{"name":"Dry Eyes","score":15.238917124891392},{"name":"Paranoid","score":6.0779544649953561},{"name":"Dizzy","score":5.4133525607064659},{"name":"Anxious","score":4.7970261269781815}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/gg-4/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/gg-4/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_23a9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005508/b/gorilla-glue--4__primary_086c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_85d1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1004769/b/gorilla-glue--4__primary_429f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_00ae.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003601/b/gorilla-glue--4__primary_a05e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_6424.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003584/b/gorilla-glue--4__primary_9e5d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_8723.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003066/b/gorilla-glue--4__primary_2488.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/gorilla-glue--4_100x100_ded9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002966/b/gorilla-glue--4__primary_b9cc.jpg"}],"photoTotalCount":761,"popularCities":["Portland, OR","Los Angeles, CA","Denver, CO","Seattle, WA","Eugene, OR","Detroit, MI","Toronto, ON","Las Vegas, NV","Phoenix, AZ","San Francisco, CA"],"permalink":"https://mobileapi.leafly.com/hybrid/gg-4","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.67627824019025/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Chem\u0027s Sister","subtitle":null,"slug":"chems-sister","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/chems-sister","symbol":"Csi","applink":"leafly://strain/chems-sister"},{"name":"Chocolate Diesel","subtitle":null,"slug":"chocolate-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/chocolate-diesel","symbol":"Cdl","applink":"leafly://strain/chocolate-diesel"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":"Tall","averageYield":"Medium","environment":null,"growNotes":""}}
