{"sl_translate":"description,descriptionPlain,category","id":147248,"slug":"funfetti","name":"Funfetti","subtitle":null,"symbol":"Fun","category":"Hybrid","description":"\u003cp\u003eFunfetti is a 60/40 \u003ca href=\"http://www.leafly.com/explore/category-indica\"\u003eindica\u003c/a\u003e-dominant \u003ca href=\"http://www.leafly.com/explore/category-hybrid\"\u003ehybrid\u003c/a\u003e that crosses \u003ca href=\"http://www.leafly.com/hybrid/cherry-pie\"\u003eCherry Pie\u003c/a\u003e with a select \u003ca href=\"http://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\"\u003ephenotype\u003c/a\u003e of \u003ca href=\"http://www.leafly.com/hybrid/animal-cookies\"\u003eAnimal Cookies\u003c/a\u003e, nicknamed Secret Cookies. This strain was originally bred in Northern California by a group of breeders know as Bay Exclusives and was released in limited quantities. Funfetti expresses itself in dark shades of purple and blue\u0026nbsp;that contrast the bright orange pistils and milky trichomes covering all available surface area of the bud. It carries a \u003ca href=\"http://www.leafly.com/explore/flavors-pine\"\u003epiney\u003c/a\u003e \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003eOG\u003c/a\u003e undertone to go along with its \u003ca href=\"http://www.leafly.com/explore/flavors-sweet\"\u003esweet\u003c/a\u003e creamy flavor that is reminiscent of fresh baked birthday cake.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Funfetti is a 60/40 indica-dominant hybrid that crosses Cherry Pie with a select phenotype of Animal Cookies, nicknamed Secret Cookies. This strain was originally bred in Northern California by a group of breeders know as Bay Exclusives and was released in limited quantities. Funfetti expresses itself in dark shades of purple and blue\u0026nbsp;that contrast the bright orange pistils and milky trichomes covering all available surface area of the bud. It carries a piney OG undertone to go along with its sweet creamy flavor that is reminiscent of fresh baked birthday cake.\u0026nbsp;\n","aka":null,"rating":4.78,"highlightedReviews":[{"id":1346436,"username":"OnePDXOne","text":"Strain: Funfetti (Cherry Pie /Secret Cookies cross -- Heavy Indica leaning Hybrid)\nTHC: 20.46%\nCBD: 0.07%\nGrower: Resin Ranchers\nLocation found: Collective Awakenings\nDate purchased: 3.22.16\nPrice: $25 an ⅛th\nWeight: 3.5g\nMethod of Consumption: Herb Iron and small bong \nSmell: Purple, like out of grape drink. Straight up purple smell with hints of Kush, GDP and fruity highlights. When I put the scissors to it, the room was nearly assaulted by this smell...all this from a .33g nug being taken out of a jar and crosscut!\nLook: Beautiful. Purple (genetics not temperature manipulation), tight dark orange hairs and it is frosted. Not a light coating either! In good light, I saw the kif dumping off the nugget as I cut it up. Dense, ultra dense buds, trimmed to the point I have never had a sugar leaf from Resin Ranchers! A little dry but frankly it does not matter one bit to me. This is what cannabis that is done right looks like. Instant knowing without having to consider much else.\nTaste: I normally stay away from the purple strains but this one I seek out. It almost seems to be all Animal Cookies (the Secret cut) and then the flavor alters as I go. Purply, Kush, with herbs, flowers, fruit and berries together; mashed in a barrel like grapes for wine. It is a newer strain and it tastes like a classic. It reminds me of electronic music hitting a classic song better than the original. Hard to find sometimes but worth the trip.  \nRecommendation for medicine: Slow your day down or stop your night. It can be a show stopper, the sit you down and let you think before you pass out strain for you. It is very powerful at 20%+ THC. One hit and it is on that takes a little out of the sails gently and one does not even seem to know it. Time to go contemplate about life!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png"},{"id":1622090,"username":"Loudpacka","text":"A very unique strain-comes with its own smell that you\u0027ll always remember \u0026 the taste is just as that. very unique strain that all smokers will enjoy!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Pl-Y2_w7iIfXMq-susdCw64Abdk=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fZFL3vk8uSMmuki8G4w8c_old-school-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-28571","title":"5 Excellent Funk Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1495893637000)\/","text":"Originating in the 1960s, funk music was brought earthside by black American musicians who mixed rhythm, blues, soul, and jazz to give birth to a new genre of music that is as groovy as it is dance-inducing. Placing heavy emphasis on bass and drums, funk music is a distinctive genre that gets its name from the early etymology of the word, meaning “musty,” or “earthy.” Anyone who has watched a funk bassist get down knows the “stank face” all too well—it’s this pure, earth-driven vibe that gave funk its name and magnetic presence in the early scene.\n\nThere is truly no other genre like funk—a genre that can enliven, inspire, rejuvenate, and energize. It is a sound that is both euphoric and grounded. The following is a list of some suggested funk albums to get the bones shaking and heart pumping, best enjoyed with some happy, sativa-dominant strains. Have your own funk albums you love to listen to while high? Tell us all about them in the comments below!\nMothership Connection by Parliament-Funkadelic\n\nStrain Pairing Recommendation: Funfetti\n“Funk not only moves, it can remove,” go the intro lyrics in this delightfully stanky, purely funky iconic album by Parliament-Funkadelic. Led by singer-songwriter George Clinton, whose fresh sound sparked its own genre title known as “P-funk,” Parliament-Funkadelic’s vibe is quintessentially funk, and thus impossible not to groove to. Mothership Connection is an album that plays out like a performance: It begins with a lively introduction, like the opening act to a play, and then dives deep into a medley of groovy bass lines and Clinton’s seamless vocals. Mothership Connection is a collection of pure funk sound that will have the listener looking up, getting up, and feeling up—particularly in conjunction with the lively strain Funfetti.\nFugue State by Vulfpeck\n\nStrain Pairing Recommendation: Monkey Paw\nIf you haven’t heard of Vulfpeck yet, get ready to join the vulfpack. The American funk group with an imaginary German flair have been steadily taking the music scene by storm since they were founded in 2011. Fugue State, released in 2014, is one of their most popular albums despite containing only six songs and lasting about 18 minutes. While mostly instrumental, Vulfpeck does at times feature vocals such as those on the track “1612,” a thoroughly catchy offering.\nDespite its short playlist, Fugue State is not lacking in sound or diversity; and perhaps diversity of sound is what Vulfpeck does best. Each song, even each album, builds a distinctive vibe that somehow manages to be both modern and original while also maintaining a nostalgic and vintage je ne sais quoi.\nBeyond The Sun by Orgone\n\nStrain Pairing Recommendation: Lemon Bubble\nOrgone’s Beyond The Sun is a venerable pleasure from the first note to the last. The music is playful, fierce, and lively, with the powerful vocals of singer Fanny Franklin driving the sound like any of the best conductors. Although much of their music is instrumental, Beyond The Sun especially highlights Franklin’s impeccable tone. However, make no mistake—as riveting as Franklin’s voice may be, instrumentalists are not outmatched but rather perfectly paired, creating a delicious confection of funk for the cannabis-elevated ears to enjoy. This is an album that will delight and invigorate while encouraging participation through song and dance.\n\nNext by Soulive\n\nStrain Pairing Recommendation: The Sauce\nOriginating in the forever famous Woodstock, NY, Soulive is a jazz-funk trio that brings the sounds of soul, R\u0026B, rock, and jazz to their largely instrumental recordings. Soulive is certainly a jazzier take on funk, with Eric Krasno on guitar, Alan Evans on drums and Neal Evans on keys, organ, and clarinet. At times, it’s easy to forget Soulive is a trio with their sound so rich and full. Their album Next, released in 2002, adds saxophonist Sam Kininger to the mix, providing an extra depth to their already wildly intricate sound. The album invites the herbally enraptured listener to go on a smooth ride through funky highs and soulful lows, which wind together a sprinkle of vocals amongst a sea of invigorating instrumentals.\nRowdy Duty by Deep Banana Blackout\n\nStrain Pairing Recommendation: Banana Diesel  \nPunchy and powerful, Deep Banana Blackout’s live album Rowdy Duty transports the listener to a live funk show filled with delightful improvisation, stimulating instrumentals, and robust vocals. Recorded in a single night, the 13-track album truly encapsulates the band’s jazz-funk, New Orleans-style sound. The eight-piece ensemble includes a full horn section, creating a funk experience that is truly dynamic and full. All together, it’s an energetic funk soundscape that will lead the blissed-out listener through a maze of funky highs and spacey lows.\n\nFunk music is a music of joy that moves people physically as well as uplifting them mentally. It is perhaps one of the most distinctive genres and one of the most original to come out of the golden era of music in the 1960s. Funk enlivens, and listening to it is simply good for the soul. At the end of the day, funk is all about happiness.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/05/25124830/funk-albums-while-high.jpg","urlslug":"/news/lifestyle/best-funk-albums-to-listen-to-while-high"},{"id":"contentitems-3425","title":"New Strains Alert: The Grunk, MILF, Holy Ghost, Sourlope, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1427472000000)\/","text":"We\u0027ve uploaded a bunch of new strains to the Leafly Explorer and a few of this week\u0027s additions have some pretty unforgettable names, to say the least. If your experiences with any of these strains were as unforgettable as their names, leave some reviews telling us about them!\nThree of these strains come from our friends at Oregrown in Bend, OR, but be sure to check the \"Availability\" tab on the strain pages to find out if any of these are being offered at a location near you.\n \n   1. The Grunk\n\nThe Grunk is a perfect representation of its parent strains Grape Ape and Skunk #1. The aroma is sweet and fruity, mixing with pungent skunky notes to create a flavorful burst of earthy, grape flavors upon exhale. The relaxing indica-dominant effects calm body pains and are balanced by a clear-headed cerebral buzz that lifts away anxieties.\n\n \n   2. MILF\n\nMILF, also known as MILF Weed, from Mother Chucker’s Seeds takes its name from an acronym for Marijuana I’d Like to Flower. This sativa-heavy hybrid crosses White Widow with a select cut of Trainwreck from Arcata, California (e-32). While there is a known indica-dominant phenotype floating around, the MILF strain tends to be led by a strong heady buzz that elevates your mood.\n\n \n   3. Oregon Diesel\n\nOregon Diesel is an indica-dominant hybrid that combines NYC Diesel and Blackberry genetics in a blend bred by Homegrown Natural Wonders specifically for the Pacific Northwest climate. This strain was popularized by Oregrown as they hunted for quality genetics. Oregon Diesel is recommended for nighttime pain relief and its relaxing yet clear-headed effects will calm stress and help you avoid sleepless nights.\n\nAvailable at Oregrown in Bend, OR\n \n   4. The One\n\nThe One, originally bred by Clackamas Coots or CC, is a perfectly balanced hybrid of two landrace strains. It is sometimes referred to by its genetic combination Thai x Pure Afghan, with its sativa heritage stemming from its Thai background and the Afghan influence bringing a thick resinous frosting of trichomes. This specific combination of two cornerstone landrace strains is known to only be available through a select circle of breeders and growers in Oregon.\n\nAvailable at Oregrown in Bend, OR\n \n   5. Sourlope\n\nSourlope is a sativa-dominant cross known for its uplifting and energetic effects. Believed to be a hybrid of NYC Diesel and Cannalope Haze genetics, Sourlope creates a mix of tropical flavors that are sharpened by a strong diesel note. The elevated mood and creative head space attributed to this strain make it a great choice for daytime use and when combating stress and fatigue.\n\n \n   6. Funfetti\n\nFunfetti is a 60/40 indica-dominant hybrid that crosses Cherry Pie with a select phenotype of Animal Cookies, nicknamed Secret Cookies. This strain was originally bred in Northern California by a group of breeders know as Bay Exclusives and was released in limited quantities. Funfetti expresses itself in dark shades of purple and blue that contrast the bright orange pistils and milky trichomes covering all available surface area of the bud. It carries a piney OG undertone to go along with its sweet creamy flavor that is reminiscent of fresh baked birthday cake.\n\nAvailable at Oregrown in Bend, OR\n \n   7. Holy Ghost\n\nHoly Ghost is a harmony of attractive genetics that balance the relaxing nature of indicas with sativas’ cerebral activity. Parent strains Satori, Amnesia Haze, Pitbull, and Durban Poison combine to create a pungent blend of diesel and citrus aromas that are enhanced by an earthy exhale of spiced sandalwood. The interplay of sativa and indica genetics relax the body without putting you to sleep, and energize the mind without overstimulation. Holy Ghost is an enjoyable answer when faced with stress or depression.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/03/12002440/new-strains-alert-the-grunk-milf-holy-ghost-sourlope-and-more.png","urlslug":"/news/strains-products/new-strains-alert-the-grunk-milf-holy-ghost-sourlope-and-more"}],"reviewCount":32,"flavors":[{"name":"Berry","score":17.948717948717945},{"name":"Woody","score":17.948717948717945},{"name":"Sweet","score":5.7692307692307692},{"name":"Earthy","score":4.4871794871794872},{"name":"Flowery","score":3.8461538461538463}],"effects":[{"name":"Happy","score":91.666666666666657},{"name":"Relaxed","score":90.384615384615387},{"name":"Euphoric","score":73.7179487179487},{"name":"Uplifted","score":55.128205128205124},{"name":"Creative","score":53.846153846153847}],"symptoms":[{"name":"Inflammation","score":34.615384615384613},{"name":"Nausea","score":34.615384615384613},{"name":"Pain","score":20.512820512820511},{"name":"Insomnia","score":19.230769230769226},{"name":"Depression","score":18.589743589743588}],"conditions":[{"name":"Crohn\u0027s Disease","score":17.307692307692307},{"name":"Anxiety","score":1.9230769230769231},{"name":"Gastrointestinal Disorder","score":1.2820512820512819},{"name":"Arthritis","score":0.641025641025641},{"name":"Fibromyalgia","score":0.641025641025641}],"negatives":[{"name":"Dry Mouth","score":53.205128205128204},{"name":"Dizzy","score":1.2820512820512819},{"name":"Dry Eyes","score":1.2820512820512819},{"name":"Paranoid","score":0.641025641025641}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/funfetti_100x100_cc04.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/375243/b/funfetti__primary_71f8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/funfetti_100x100_bbae.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/356586/b/funfetti__primary_d7b5.jpg"}],"photoTotalCount":2,"popularCities":["Bend, OR","Corvallis, OR","Hillsboro, OR","Portland, OR"],"permalink":"https://mobileapi.leafly.com/hybrid/funfetti","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.78125/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Cherry Pie","subtitle":null,"slug":"cherry-pie","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/cherry-pie","symbol":"Cp","applink":"leafly://strain/cherry-pie"},{"name":"Animal Cookies","subtitle":null,"slug":"animal-cookies","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/animal-cookies","symbol":"Ac","applink":"leafly://strain/animal-cookies"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
