{
    "aka": "a.s.h.",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bruce Barcott",
            "category": null,
            "date": "/Date(1456084380000)/",
            "id": "contentitems-2631",
            "text": "A few years ago a friend of Corey Capasso’s called him up. “Corey, you know when you smoke a water pipe, how the water gets dirty?”\n“Yeah,” Capasso said. “So what?”\n“So the water is filtering out the tar from the smoke, making it cleaner. What if you could put something in the water to enhance the filtration?”\nCapasso thought for a moment. “That’s interesting,” he said.\nWhen Corey Capasso finds something interesting, things tend to happen. Nine years ago, as a finance major at the University of Wisconsin, Capasso sought out Tim Osswald, a mechanical engineering professor. Would it be possible, Capasso asked him, to create a flavored plastic? Osswald did so in 2008, and Capasso turned his tasty polymer into MoGo Sport, the company that invented the flavored sport mouthguard.\nAs he was getting MoGo off the ground, Capasso also did a little work on the side. He was intrigued by his friend’s water pipe question.\n“I did some research and realized that water is very polar,” Capasso recalled in a recent interview with Leafly. “The majority of the tars and carcinogens in smoke — both tobacco and marijuana — are very nonpolar. If we could put something in the water that was also nonpolar, the tars might be attracted and get trapped by it.”\nThe easiest way to understand molecular polarity is to think of it as the opposite of magnetism. With polarity, like attracts like. Oil and water don’t mix, for example, because water is extremely polar and oil is highly nonpolar.\nWhen he went looking for scientific research on water filtration of smoke, Capasso found slim pickings in the peer-reviewed literature. Surprisingly little research has been done on cannabis smoke filtration. There are essentially two publicly available water pipe studies, both conducted in the mid-1990s. One was by Dale Gieringer, director of California NORML. The other was by Nicholas Cozzi, director of the Laboratory for Neuropharmacology at the University of Wisconsin School of Medicine and Public Health and one of the world’s leading experts on hallucinogens and the human brain.\n\nThose studies found that water pipes are good at filtering out hot ash, but they’re generally lousy at trapping the tars contained in both tobacco and cannabis smoke. They obviously trap some — hence the nastiness of bong water — but in general the bong lets most of the tars slip through.\n“By weird coincidence, Dr. Cozzi was at the University of Wisconsin, where I was attending college,” Capasso recalled. He reached out to Cozzi and, as he had with Tim Osswald, convinced the professor to explore the possibilities of invention.\nAs it happened, Cozzi knew of a nonpolar material that just might work. It was a kind of macrobead — tiny, but larger than the microbeads currently causing so much trouble in toothpaste and facial scrubs — made of an inert, insoluble polymer that was highly attractive to nonpolar molecules. “It’s a substance used in chromatography,” Cozzi explained over the phone recently. “It separates mixtures of compounds into their elements.”\nThe stuff itself looks like large sugar crystals. “You pour it into the pipe and it floats on the water,” Capasso explained. “The smoke goes through the water, hits the beads, and those beads absorb ten times the amount of carcinogens as the water.” In early tests, Cozzi found that plain water removed 1.7 milligrams of tar per gram of water. The combination of Smoke Skreen beads and water extracted 20.6 milligrams of tar per gram.\n\nDetail of Smoke Skreen beads\nCapasso and Cozzi applied for patents on their invention, a “filtration agent” they named Smoke Skreen. That was in 2010. They waited. Years passed. From the U.S. Patent and Trademark Office came nothing but radio silence.\nIn the meantime, Capasso moved on to other entrepreneurial ventures. In 2010 he founded Spinback, an online analytics company, and sold it to Buddy Media. Then he created Nomi, an in-store analytics platform for retailers, and sold it to Brickstream.\nWhile casting about for his next analytics venture, Capasso received a surprise visit from the past. On Dec. 30, 2015, he opened an email from the U.S. Patent and Trademark Office in Arlington, Virginia. The patent for Smoke Skreen had finally been approved.\n\nIt had been so long — more than five years — that Capasso figured the office had lost or permanently shelved his application.\nThe patent itself had always been a long shot. The federal illegality of cannabis extends to “drug paraphernalia,” (see 21 USC Section 863), which specifically mentions water pipes and bongs. Though the law is rarely enforced, Tommy Chong famously got caught up in Operation Pipe Dreams, a 2003 federal paraphernalia sting that resulted in the arrest of 55 individuals. (Chong was the only one sent to prison. He served nine months for selling bongs.) Even today, head shops in legal states like Washington will sometimes evict customers who refer to their “tobacco water pipes” as bongs. That problematic legal status has made it difficult for inventors to obtain patents for any product that could be considered paraphernalia.\nThough Capasso and Cozzi made frequent mention of tobacco in their patent application, they specifically referenced “medical marijuana” in their patent documentation. “To my knowledge, as long as the product is described accurately and does not make any false claims under FTC regulations, there are no legal issues,” Capasso said.\nThe question every cannabis consumer will want to know: If it so effectively screens out tars, will it also screen out cannabinoids? Not so much, says Cozzi. “The tars are extremely nonpolar, and the THC, CBD and other cannabinoids are intermediate in polarity, meaning they contain both polar and nonpolar properties within the molecule.” The Smoke Skreen beads, Cozzi said, will preferentially remove the tars but not the cannabinoids. “Our empirical testing showed no effect on the psychoactive properties of the cannabis.”\nNow he’s talking with a number of companies and potential investors. Capasso is new to the legal cannabis space, but thinks his product has the potential to find a big audience. “As marijuana grows,” he says, “there’s nothing better to have in a regulated market than a product that creates safety.”",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/11235429/this-guy-just-made-your-bong-ten-times-better.jpg",
            "title": "This Guy Just Made Your Bong 10 Times Better",
            "urlslug": "/news/science-tech/this-guy-just-made-your-bong-ten-times-better"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 11.666666666666666
        },
        {
            "name": "ADD/ADHD",
            "score": 10
        },
        {
            "name": "Alzheimer's",
            "score": 10
        },
        {
            "name": "Anorexia",
            "score": 10
        },
        {
            "name": "Asthma",
            "score": 10
        }
    ],
    "description": "<p>Ash is an <a href=\"http://leafly.com/indica\">indica</a>-dominant&nbsp;<a href=\"http://www.leafly.com/hybrid\">hybrid</a> cross between <a href=\"http://www.leafly.com/hybrid/afghan-haze\">Afghan Haze</a> and <a href=\"http://www.leafly.com/indica/afghan-skunk\">Afghan Skunk</a>&nbsp;bred by Mr. Nice Seeds. These buds offer a fruity, <a href=\"http://www.leafly.com/explore#/explore/flavors-berry\">berry</a> aroma and effects that run the gamut between <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\">relaxing</a>&nbsp;indicas and <a href=\"http://www.leafly.com/explore#!/explore/tags-energetic\">stimulating</a>&nbsp;sativas. This strain&#39;s name, sometimes spelled&nbsp;A.S.H., is an&nbsp;acronym denoting its Afghani, Skunk, and Haze lineage.&nbsp;</p>\n",
    "descriptionPlain": "Ash is an indica-dominant&nbsp;hybrid cross between Afghan Haze and Afghan Skunk&nbsp;bred by Mr. Nice Seeds. These buds offer a fruity, berry aroma and effects that run the gamut between relaxing&nbsp;indicas and stimulating&nbsp;sativas. This strain&#39;s name, sometimes spelled&nbsp;A.S.H., is an&nbsp;acronym denoting its Afghani, Skunk, and Haze lineage.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 15
        },
        {
            "name": "Happy",
            "score": 13.333333333333334
        },
        {
            "name": "Uplifted",
            "score": 11.666666666666666
        },
        {
            "name": "Euphoric",
            "score": 11.666666666666666
        },
        {
            "name": "Sleepy",
            "score": 6.666666666666667
        }
    ],
    "flavors": [
        {
            "name": "Pungent",
            "score": 10
        },
        {
            "name": "Skunk",
            "score": 6.666666666666667
        },
        {
            "name": "Spicy/Herbal",
            "score": 5
        },
        {
            "name": "Earthy",
            "score": 5
        },
        {
            "name": "Woody",
            "score": 5
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": null,
        "environment": null,
        "floweringDays": 63,
        "growNotes": "\n\tIndoor grows flower between 8 and 10 weeks, yielding 450 to 600 grams per square meter\n\tComparable success with organic or hydro grows\n\n",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1369303,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Good strain my buddy grew a few times. Makes for a good head high but didn't last that long. ",
            "username": "Chizzlemang"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1267916,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Very chill but the excited start ends with a damn coma",
            "username": "Larson279"
        }
    ],
    "id": 101680,
    "name": "Ash",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 10
        },
        {
            "name": "Dry Eyes",
            "score": 8.333333333333332
        },
        {
            "name": "Dizzy",
            "score": 1.6666666666666667
        },
        {
            "name": "Headache",
            "score": 1.6666666666666667
        },
        {
            "name": "Anxious",
            "score": 1.6666666666666667
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/afghan-skunk",
            "category": "Indica",
            "name": "Afghan Skunk",
            "permalink": "https://mobileapi.leafly.com/indica/afghan-skunk",
            "slug": "afghan-skunk",
            "subtitle": null,
            "symbol": "Afs"
        },
        {
            "applink": "leafly://strain/afghan-haze",
            "category": "Hybrid",
            "name": "Afghan Haze",
            "permalink": "https://mobileapi.leafly.com/hybrid/afghan-haze",
            "slug": "afghan-haze",
            "subtitle": null,
            "symbol": "Ahz"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/ash",
    "photoTotalCount": 2,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/562927/b/ash__primary_d8e3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ash_100x100_0e12.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/326130/b/ash__primary_306f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ash_100x100_7fe3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Renton, WA"
    ],
    "rating": 4.5,
    "relatedStrains": [],
    "reviewCount": 14,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "ash",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.5/240",
    "subtitle": null,
    "symbol": "Ash",
    "symptoms": [
        {
            "name": "Pain",
            "score": 13.333333333333334
        },
        {
            "name": "Stress",
            "score": 13.333333333333334
        },
        {
            "name": "Depression",
            "score": 11.666666666666666
        },
        {
            "name": "Eye Pressure",
            "score": 11.666666666666666
        },
        {
            "name": "Headaches",
            "score": 11.666666666666666
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
