{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1460146080000)/",
            "id": "contentitems-3421",
            "text": "These seven strains were just added to the Leafly strain database! From heavy indicas to light CBD-rich hybrids, one of these strains is bound to be just what you need whether you plan to relax at home this weekend or stay busy. Don't forget to leave a review for the ones you've tried so the rest of us know what to expect when we finally get our hands on them.\n \n  1. Yeti OG\n\nOriginally known as the Headband BX, Yeti OG was bred by NorCal collective Loompa Farms and has become a highly sought after strain due to its incredible taste and heavy yields. This 70/30 indica-dominant strain usually has THC levels over 20% and CBD levels above 3%, making it a very good choice for relaxation and pain relief. Featuring a rich, creamy-tasting smoke with strong undertones of diesel fuel and hints of lemon and pine, Yeti OG is a favorite with connoisseurs of flavorful cannabis.\n\n \n  2. Tesla\n\nFrom Pacific Northwest breeder Alphakronic Genes, Tesla is a combination of two popular West Coast hybrids, Harle-Tsu and Gobstopper. Part of AKG’s new high-CBD line of genetics, Tesla carries one of the fruitiest terpene profile found in a high-CBD strain to date, with smells and flavors of raspberry, grape, blueberry and jasmine. Most phenotypes produce only 1-3% THC, which makes this a very good choice for treating certain symptoms and medical conditions in patients who don’t tolerate the psychoactive effects of cannabis very well.\n\n \n  3. Purple Hindu Kush\n\nA cross between Hindu Kush and Purple Afghani, Purple Hindu Kush is almost pure indica and offers the kind of high one would expect from its lineage: deep relaxation along with pronounced pain relief. Featuring dense lavender flowers with bright orange pistils and a thick blanket of trichomes, as well as a pungent sour grape and citrus flavor, PHK will be sure to please indica lovers everywhere.\n\n \n  4. Sour Headband\n\nAs its name implies, Sour Headband is a cross between two of the most famous cannabis strains in the United States, East Coast favorite Sour Diesel and the West Coast classic Headband. With large, dense, trichome encrusted flowers and an intense aroma/flavor combining diesel fuel and sour lemon, this one is a must-try strain for Sour Diesel lovers. Sour Headband is a sativa-dominant hybrid that is a good choice for daytime relief of tension and pain while maintaining a clear mind.\n\n \n  5. Deep Sleep\n\nAlso known as P.O. 4, Deep Sleep is a cross of the Larry OG and Pre-98 Bubba Kush from North Hollywood breeders Progressive Options. This indica-dominant hybrid is quite aptly named, as it quickly reduces users to a puddle of sleepy relaxation. The flavor of Deep Sleep is very sweet and fruity on the inhale with a nice OG funk on the exhale. Fans of OG Kush will love these thick, resinous, purple-tinted flowers.\n\n \n  6. IG Kush\n\nImperial Genetics was created by the breeders who originally brought the OG Kush craze to California and Colorado from Florida. Hoping to bring new, exciting flavors to their classic genetics, they crossed some of their original strains with other West Coast clones, and the IG Kush is one of the first resulting seed lines. Crossing Deadhead OG with ‘92 OG Kush, IG Kush has the sturdy structure and dense, high potency flowers typical of OG Kush strains along with a sweet fruity flavor likened to sour gummy candy. It generally has a THC content ranging from 20-25% with a strong hybrid high combining cerebral and body effects.\n\n \n  7. Rip City Purps\n\nRip City Purps is a mostly indica hybrid from Alphakronic Genes that pays homage to Portland, Oregon, the city where they got their start. By using their own hybrid Gobstopper, itself a cross of Purple Urkle and Sin City Kush, and then backcrossing it with the Purple Urkle, AKG has created a seed line that adds better production, faster veg times, and some floral notes to the dense, dank-grape flavored buds of the Purple Urkle. An indica designed for the Pacific Northwest, this line will do well outdoors and is resistant to powdery mildew.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/04/12002434/new-strains-alert-tesla-yeti-og-sour-headband-purple-hindu-kush-a.jpg",
            "title": "New Strains Alert: Tesla, Yeti OG, Sour Headband, Purple Hindu Kush, and More",
            "urlslug": "/news/strains-products/new-strains-alert-tesla-yeti-og-sour-headband-purple-hindu-kush-a"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 53.125
        },
        {
            "name": "PMS",
            "score": 50
        },
        {
            "name": "ADD/ADHD",
            "score": 3.125
        },
        {
            "name": "Bipolar Disorder",
            "score": 3.125
        }
    ],
    "description": "<p>From Pacific Northwest breeder Alphakronic Genes, Tesla is a combination of two popular West Coast hybrids, <a href=\"https://www.leafly.com/hybrid/harle-tsu\">Harle-Tsu</a> and Gobstopper. Part of AKG&rsquo;s new <a href=\"https://www.leafly.com/news/cannabis-101/whats-the-deal-with-these-high-cbd-strains\">high-CBD</a> line of genetics, Tesla carries one of the fruitiest terpene profile found in a high-CBD strain to date, with smells and flavors of raspberry, grape, blueberry and jasmine. Most <a href=\"https://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\">phenotypes</a> produce only 1-3% THC, which makes this a very good choice for treating certain symptoms and medical conditions in patients who don&rsquo;t tolerate the psychoactive effects of cannabis very well.</p>\n",
    "descriptionPlain": "From Pacific Northwest breeder Alphakronic Genes, Tesla is a combination of two popular West Coast hybrids, Harle-Tsu and Gobstopper. Part of AKG&rsquo;s new high-CBD line of genetics, Tesla carries one of the fruitiest terpene profile found in a high-CBD strain to date, with smells and flavors of raspberry, grape, blueberry and jasmine. Most phenotypes produce only 1-3% THC, which makes this a very good choice for treating certain symptoms and medical conditions in patients who don&rsquo;t tolerate the psychoactive effects of cannabis very well.\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 59.375
        },
        {
            "name": "Relaxed",
            "score": 59.375
        },
        {
            "name": "Happy",
            "score": 56.25
        },
        {
            "name": "Euphoric",
            "score": 53.125
        },
        {
            "name": "Energetic",
            "score": 3.125
        }
    ],
    "flavors": [
        {
            "name": "Tropical",
            "score": 50
        },
        {
            "name": "Pepper",
            "score": 3.125
        },
        {
            "name": "Sweet",
            "score": 3.125
        },
        {
            "name": "Strawberry",
            "score": 3.125
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1333515,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Great for overly nervous patients, found it helps some with seizures/fits caused by stress. Very good medicine.",
            "username": "hjointsmoke"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1546441,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Very potent and hard hitting strain. My friend and I enjoyed it greatly however my other friend had a less pleasant experience. He couldn’t stop coughing after 2 hits and almost threw up. He was asked to leave the coffee shop (Amsterdam) because he looked so sick. After then going to a pizza place he could no longer speak English and became very angry even when enjoying his pizza.",
            "username": "tommyinglethorpe"
        }
    ],
    "id": 217296,
    "name": "Tesla",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 3.125
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/harle-tsu",
            "category": "Hybrid",
            "name": "Harle-Tsu",
            "permalink": "https://mobileapi.leafly.com/hybrid/harle-tsu",
            "slug": "harle-tsu",
            "subtitle": null,
            "symbol": "Hts"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/tesla",
    "photoTotalCount": 1,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/652084/b/tesla__primary_9440.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tesla_100x100_6a53.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [],
    "rating": 4.71,
    "relatedStrains": [],
    "reviewCount": 7,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "tesla",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.71428571428571/240",
    "subtitle": null,
    "symbol": "Tes",
    "symptoms": [
        {
            "name": "Depression",
            "score": 56.25
        },
        {
            "name": "Stress",
            "score": 56.25
        },
        {
            "name": "Cramps",
            "score": 50
        },
        {
            "name": "Lack of Appetite",
            "score": 50
        },
        {
            "name": "Inflammation",
            "score": 3.125
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
