{"sl_translate":"description,descriptionPlain,category","id":74511,"slug":"dream-star","name":"Dream Star","subtitle":null,"symbol":"Drs","category":"Hybrid","description":"\u003cp\u003eA cross between \u003ca href=\"http://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/stardawg\"\u003eStardawg\u003c/a\u003e, Dream Star is a sativa-dominant \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e bred by Oaksterdam Seed Co. Its aroma is \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-tree-fruit\"\u003efruity\u003c/a\u003e, with sour accents that hint at Dream Star\u0026rsquo;s \u003ca href=\"http://www.leafly.com/hybrid/chemdawg\"\u003eChemdawg\u003c/a\u003e lineage. This strain\u0026rsquo;s psychoactive onset begins in the head and evens out over time into a mellow full-body \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003ecalm\u003c/a\u003e. Dream Star is used by patients to treat a variety of symptoms and conditions including \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-headaches\"\u003eheadaches\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-depression\"\u003edepression\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-multiple-sclerosis\"\u003emultiple sclerosis\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-parkinsons\"\u003eParkinson\u0026rsquo;s\u003c/a\u003e. This hybrid might come as a challenge to novice growers, but cultivators of this strain should wait nine weeks for indoor plants to flower.\u003c/p\u003e\n","descriptionPlain":"A cross between Blue Dream and Stardawg, Dream Star is a sativa-dominant hybrid bred by Oaksterdam Seed Co. Its aroma is sweet and fruity, with sour accents that hint at Dream Star\u0026rsquo;s Chemdawg lineage. This strain\u0026rsquo;s psychoactive onset begins in the head and evens out over time into a mellow full-body calm. Dream Star is used by patients to treat a variety of symptoms and conditions including headaches, pain, depression, multiple sclerosis, and Parkinson\u0026rsquo;s. This hybrid might come as a challenge to novice growers, but cultivators of this strain should wait nine weeks for indoor plants to flower.\n","aka":null,"rating":4.7,"highlightedReviews":[{"id":1360008,"username":"sushizawa","text":"The smoke goes straight to your head and lasts around 20 mins. After that, the high goes from your head and into your body which gives it a nice \"floaty\" feeling. Highly recommended for all you canna-nerds. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1621976,"username":"Metalmainia4_2_0","text":"This strain for me was very good it gave me motivation for the day love it and MMEC fast delivery","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-7858","title":"Pair These Cannabis Strains With 5 of Stephen King\u0027s Best Novels","author":"Gage Peake","category":null,"date":"\/Date(1474584346000)\/","text":"From classics like The Green Mile and Rita Hayworth and Shawshank Redemption to supernatural spookers like Carrie and The Shining, Stephen King has gifted the world with magnificent pieces of literature that feature surprising depth. If you’re thinking of picking up one of his works, here are some cannabis strains that pair well with some of our favorite stories from the King of Horror.\nCujo\n\nYou might remember this classic from 1981. Cujo, a sweet good-natured dog in the beginning of the story, gets bit on the nose by a rabid bat and ultimately transforms into a killing machine that tears into neighbors and police sheriffs indiscriminately. Like all of the entries on this list, Cujo was adapted into a movie in 1983.\nStrain Pairing: Snoop’s Dream\n\nPicking a strain to pair with this story proved difficult, but after some consideration, we had to choose one of our favorite dog-themed strains, Snoop Dream. Named after the hip-hop superstar, Snoop’s Dream is a mix of Blue Dream and Master Kush, making for medium-sized dense buds covered in orange hairs. The hybrid’s relaxing qualities would be the perfect mix to calm down a killer dog terrorizing a small town in Maine.\nIT\n\nAnother Stephen King Horror novel, IT, published in 1986, follows the exploits of seven children as they are terrorized by the eponymous being, which exploits the fears and phobias of its victims in order to disguise itself while hunting its prey. Pennywise, the villain in the book, primarily appears in the form of a clown in the story, making this a truly riveting tale that was the best-selling book in the United States the year it came out.\nStrain Pairing: Pennywise\n\nPairing this story with a cannabis strain was easy — we recommend Pennywise, which got its name from King’s book. Pennywise is a high-CBD indica cross between Harlequin and Jack the Ripper, a combination that lends this strain its killer clown name. The high CBD would help with any pain brought on by a psychopathic killer clown.\nRita Hayworth and Shawshank Redemption (from Different Seasons)\n\nMy personal favorite Stephen King story, Rita Hayworth and Shawshank Redemption, appears in his anthology Different Seasons, published in 1982. It was adapted for the big screen in 1994 as The Shawshank Redemption, one of the most critically acclaimed movies of all time. The story follows a man named Andy Dufrense, a banker from Maine, who was convicted for the double murder of his wife and her lover. The only problem? He didn’t commit the crimes. Dufresne spends nearly 30 years in prison before escaping through a tunnel he’d spent two decades digging with a rock hammer.\nStrain Pairing: Star Killer\n\nStar Killer is a solid pairing with Shawshank, as the dense, purple buds offer a sweet, lemon flavor and aid in treating pain, insomnia, and PTSD, among other things. It’s a good option for a person who just dug his way out of prison after spending nearly three decades there locked up.\nThe Shining\n\nPublished in 1977, Stephen King’s The Shining is still captivating audiences all around the world. The book was King’s first hardback bestseller, establishing himas a preeminent author in the horror genre. The Shining centers on the life of Jack Torrance, an aspiring writer and recovering alcoholic, who takes over the historic Overlook Hotel in the Colorado Rockies. His family joins him, including his young son Danny, who possesses “the shining,” an array of psychic abilities that allow him to see the hotel’s horrific past. While the family is holed up in the hotel for the winter, supernatural forces emerge and put the whole family in grave danger.\nStrain Pairing: Jack Herer\nWe paired this story with Jack Herer, a sativa-dominant cannabis strain, as a nod to one of the famous lines from Stanley Kubrick’s film adaption of the novel, “All work and no play makes Jack a dull boy.” With this strain, there will be no dullness in your life, that’s for sure.\nThe Green Mile\n\nLast but certainly not least is the serial novel The Green Mile. Another one of my personal favorites, the story is about a death row supervisor’s encounter with John Coffey, an unusual inmate who displays inexplicable healing and empathetic abilities. Written in 1996, the book takes place in Louisiana in the early 1930s.\nStrain Pairing: Supernatural\nWe paired it with the cannabis strain Supernatural, something that is very relatable to Mr. Coffey. The strain is a sativa-dominant blend that is a great indoor option, with a biting, skunky zest and uplifting sativa effects that will surely bring you supernatural powers.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/22140726/stephen-king.jpg","urlslug":"/news/strains-products/pair-cannabis-strains-5-stephen-kings-best-novels"},{"id":"contentitems-3009","title":"9 Holy Strains That Can Change Pope Francis\u0027 Opinion of Cannabis","author":"Rebecca Kelley","category":null,"date":"\/Date(1405011600000)\/","text":"Ever since Pope Francis (née Jorge Mario Bergoglio) was elected to succeed Pope Benedict XVI on March 13, 2013, the world has for the most part responded positively to His Holiness\u0027 behavior at the top of the religious food chain. As of December 2013, 88% of American Catholics approve of how he\u0027s handling his role as head of the Catholic church, and even non-religious people admire Pope Francis\u0027 humility, his vow to live simply, his acts of compassion, and his love for and acceptance of folks from all walks of life. Dude was even a bar bouncer and a janitor before becoming a priest. What\u0027s not to like about him? \nWell, it turns out pope-in\u0027 ain\u0027t easy, and as much as I admire Pope Francis for being the pope-iest Pope to come along in decades, he holds one opinion that broke my little heathen heart. Last week, he condemned efforts to legalize cannabis, saying that limited attempts to legalize recreational drugs \"are not only highly questionable from a legislative standpoint, but they fail to produce the desired effects.\" He also added, \"the problem of drug use is not solved with drugs!\"\nPope Francis, I get where you\u0027re coming from. You\u0027ve previously spoken out against the evils of drug addiction, so I can see how you\u0027d be wary about cannabis legalization. However, cannabis is far less addictive (9-10%) than tobacco smokers (20%-30%), heroin users (23-25%), alcohol users (15%), and cocaine users (15%-20%), plus it has therapeutic and medical benefits.\nMaybe you need a little bit of cannabis education, Mr. Pope. For instance, did you know that cannabis and religion often go hand-in-hand? It\u0027s true! As a matter of fact, I\u0027ve got a list of nine strains that I think are right up your pious alley. Check out a few of these holy wonders and you\u0027ll see that cannabis isn\u0027t so bad, after all. \n1. 3 Kings\nIn the biblical sense, the Three Kings, also known as the biblical Magi or the three Wise Men (not to be confused with the \"Ooohhhhh a wise guy, eh?\" schtick of the Three Stooges) were a trio of foreigners who visited Jesus after his birth. They brought gifts of gold, frankincense, and myrrh because they had no idea what sort of thing newborn babies are into (in hindsight, burping cloths and a Baby Bjorn would have probably been more ideal than pungent tree resin, though the gold was a classy touch).\nWhat better way to commemorate the birth of baby Jesus than with the hybrid 3 Kings strain, known for its appropriately piney, pungent smell and its euphoric, happy effects. Pair it with Dream Star to simulate the Star of Bethlehem and you\u0027ve got yourself a pretty uplifting birthday celebration.\n2. Endless Sky\nIsn\u0027t heaven supposed to be some sort of Endless Sky where everyone lives on a fluffy cloud and gets free access to Backstreet Boys concerts? If so, let its indica counterpart bring you relaxation so you can dream about the day you get to meet your maker and high-five Him for inviting you through the pearly gates.\n3. Holy Grail Kush\nThe Holy Grail has had quite the heyday in pop culture, from Monty Python to Indiana Jones. There\u0027s no way you\u0027re not an Indiana Jones fan, Mr. Pope, so I strongly recommend you partake in this woody hybrid while commemorating the supposed vessel of the Last Supper with a viewing of the 1989 classic. Just know with Holy Grail Kush, you have chosen wisely.\n4. Jesus OG\nTry the indica named after Mr. JC himself, Jesus OG. Its citrus, earthy flavors and focused effects may channel the power of Christ to compel you to pair it with the hybrid Bio-Jesus, a euphoric hybrid that provides exceptional pain relief. That\u0027s double the Jesus in one session — think of it as hitting up church twice on the same Sunday.\n5. Soul Shine\nNot to be confused with Soul Glo (just let your soooooooooullllll glowwwwwwww!), Soul Shine is an arousing hybrid that will amplify your love for the man upstairs. (Not the dude who lives in the apartment above yours, I mean the actual Man Upstairs.) As Pope, I imagine you\u0027ve got one of the shiniest souls around, so this is a great option for someone with your sparkly innards.\n6. Lamb\u0027s Bread\nIn religious terms, lamb\u0027s bread is also known as sacramental bread, the body of Christ, altar bread, or Communion bread. It\u0027s used in the Christian ritual of the Eucharist/Holy Communion, where Christians accept a sacrament in the form of a piece of bread or cracker and a sip of wine or grape juice. In cannabis terms, Lamb\u0027s Bread is an earthy sativa that brings euphoric, uplifting, and creative effects. That sounds like a better Communion offering to me, don\u0027t you agree, Pope? Think of how much more amazing the church songs would be once the congregation gets their creative juices flowing (and we all know Christian hymns could use some oomph).    \n7. Trinity\nThe Trinity in Christian terms describes God as three expressions: the Father, the Son (aka Jesus), and the Holy Spirit. If God is a hybrid of these three, it\u0027s only fitting that the Trinity cannabis strain is also a hybrid (though I would hope God isn\u0027t as skunky-smelling). Try this one out for its trio of happy, uplifting, and energetic qualities and you\u0027ll think three is a magic number, indeed.\n8. Exodus Cheese\nThe Book of Exodus tells the story of Moses leading the Israelites out of slavery in Egypt, where they wandered the desert for a ridiculous amount of time, subsisting on manna and miraculous water. They didn\u0027t even have any cheese, which to me is easily the biggest sacrifice (well, that and the whole \"wandering aimlessly through the dessert in search of a safe haven\" part). So pick up some of the hybrid Exodus Cheese, enjoy its sweet, cheesy flavors, and reflect on how thankful you are to eat cheese whenever you want instead of manna for the 40th day in a row (hopefully you\u0027re not lactose intolerant, Mr. Pope).\n9. God\u0027s Treat\n…or God\u0027s Gift, or God Bud. Whatever your preference, know that a number of strains are named after The Big Guy because a lot of growers are thankful that one of His creations was this incredible plant with therapeutic purposes. So whaddya say, Pope Francis, why don\u0027t you pick up some hybrid God\u0027s Treat and acknowledge that there are many positive aspects of cannabis that benefit millions of people around the world? After all, it must be stressful to be Pope, and this Treat can deliver relaxing and sleepy effects to help you rest up so you can continue to spread your goodwill to those in need…much how cannabis does.    ","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/07/12001344/9-holy-strains-that-can-change-the-popes-opinion-of-cannabis.jpg","urlslug":"/news/strains-products/9-holy-strains-that-can-change-the-popes-opinion-of-cannabis"}],"reviewCount":40,"flavors":[{"name":"Earthy","score":38.055555555555557},{"name":"Sweet","score":29.027777777777775},{"name":"Berry","score":26.249999999999996},{"name":"Citrus","score":26.249999999999996},{"name":"Blueberry","score":25.555555555555554}],"effects":[{"name":"Uplifted","score":85.694444444444443},{"name":"Happy","score":85.694444444444443},{"name":"Energetic","score":84.305555555555543},{"name":"Talkative","score":82.222222222222214},{"name":"Euphoric","score":70.555555555555557}],"symptoms":[{"name":"Fatigue","score":50.416666666666664},{"name":"Stress","score":42.222222222222221},{"name":"Inflammation","score":26.249999999999996},{"name":"Muscle Spasms","score":24.861111111111107},{"name":"Seizures","score":24.166666666666664}],"conditions":[{"name":"Anxiety","score":38.75},{"name":"Epilepsy","score":20},{"name":"PTSD","score":8.3333333333333321},{"name":"Migraines","score":7.6388888888888884},{"name":"Bipolar Disorder","score":7.6388888888888884}],"negatives":[{"name":"Dry Mouth","score":30.416666666666664},{"name":"Paranoid","score":20.694444444444443},{"name":"Dry Eyes","score":6.9444444444444438},{"name":"Dizzy","score":4.1666666666666661}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-star_100x100_0862.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/365871/b/dream-star__primary_7cd2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-star_100x100_f8a7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/365376/b/dream-star__primary_b6be.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-star_100x100_7b81.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/215735/b/dream-star__primary_fb8d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-star_100x100_10ff.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/148573/b/dream-star_825x550_c5ad.jpg"}],"photoTotalCount":4,"popularCities":["Grants Pass, OR","Medford, OR","Sparks, NV"],"permalink":"https://mobileapi.leafly.com/hybrid/dream-star","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.7/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"},{"name":"Stardawg","subtitle":null,"slug":"stardawg","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/stardawg","symbol":"Sta","applink":"leafly://strain/stardawg"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":74511,"slug":"dream-star","name":"Dream Star","subtitle":null,"symbol":"Drs","category":"Hybrid","description":"\u003cp\u003eA cross between \u003ca href=\"http://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/stardawg\"\u003eStardawg\u003c/a\u003e, Dream Star is a sativa-dominant \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e bred by Oaksterdam Seed Co. Its aroma is \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-tree-fruit\"\u003efruity\u003c/a\u003e, with sour accents that hint at Dream Star\u0026rsquo;s \u003ca href=\"http://www.leafly.com/hybrid/chemdawg\"\u003eChemdawg\u003c/a\u003e lineage. This strain\u0026rsquo;s psychoactive onset begins in the head and evens out over time into a mellow full-body \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003ecalm\u003c/a\u003e. Dream Star is used by patients to treat a variety of symptoms and conditions including \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-headaches\"\u003eheadaches\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-depression\"\u003edepression\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-multiple-sclerosis\"\u003emultiple sclerosis\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-parkinsons\"\u003eParkinson\u0026rsquo;s\u003c/a\u003e. This hybrid might come as a challenge to novice growers, but cultivators of this strain should wait nine weeks for indoor plants to flower.\u003c/p\u003e\n","descriptionPlain":"A cross between Blue Dream and Stardawg, Dream Star is a sativa-dominant hybrid bred by Oaksterdam Seed Co. Its aroma is sweet and fruity, with sour accents that hint at Dream Star\u0026rsquo;s Chemdawg lineage. This strain\u0026rsquo;s psychoactive onset begins in the head and evens out over time into a mellow full-body calm. Dream Star is used by patients to treat a variety of symptoms and conditions including headaches, pain, depression, multiple sclerosis, and Parkinson\u0026rsquo;s. This hybrid might come as a challenge to novice growers, but cultivators of this strain should wait nine weeks for indoor plants to flower.\n","aka":null,"rating":4.7,"highlightedReviews":[{"id":1360008,"username":"sushizawa","text":"The smoke goes straight to your head and lasts around 20 mins. After that, the high goes from your head and into your body which gives it a nice \"floaty\" feeling. Highly recommended for all you canna-nerds. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1621976,"username":"Metalmainia4_2_0","text":"This strain for me was very good it gave me motivation for the day love it and MMEC fast delivery","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-7858","title":"Pair These Cannabis Strains With 5 of Stephen King\u0027s Best Novels","author":"Gage Peake","category":null,"date":"\/Date(1474584346000)\/","text":"From classics like The Green Mile and Rita Hayworth and Shawshank Redemption to supernatural spookers like Carrie and The Shining, Stephen King has gifted the world with magnificent pieces of literature that feature surprising depth. If you’re thinking of picking up one of his works, here are some cannabis strains that pair well with some of our favorite stories from the King of Horror.\nCujo\n\nYou might remember this classic from 1981. Cujo, a sweet good-natured dog in the beginning of the story, gets bit on the nose by a rabid bat and ultimately transforms into a killing machine that tears into neighbors and police sheriffs indiscriminately. Like all of the entries on this list, Cujo was adapted into a movie in 1983.\nStrain Pairing: Snoop’s Dream\n\nPicking a strain to pair with this story proved difficult, but after some consideration, we had to choose one of our favorite dog-themed strains, Snoop Dream. Named after the hip-hop superstar, Snoop’s Dream is a mix of Blue Dream and Master Kush, making for medium-sized dense buds covered in orange hairs. The hybrid’s relaxing qualities would be the perfect mix to calm down a killer dog terrorizing a small town in Maine.\nIT\n\nAnother Stephen King Horror novel, IT, published in 1986, follows the exploits of seven children as they are terrorized by the eponymous being, which exploits the fears and phobias of its victims in order to disguise itself while hunting its prey. Pennywise, the villain in the book, primarily appears in the form of a clown in the story, making this a truly riveting tale that was the best-selling book in the United States the year it came out.\nStrain Pairing: Pennywise\n\nPairing this story with a cannabis strain was easy — we recommend Pennywise, which got its name from King’s book. Pennywise is a high-CBD indica cross between Harlequin and Jack the Ripper, a combination that lends this strain its killer clown name. The high CBD would help with any pain brought on by a psychopathic killer clown.\nRita Hayworth and Shawshank Redemption (from Different Seasons)\n\nMy personal favorite Stephen King story, Rita Hayworth and Shawshank Redemption, appears in his anthology Different Seasons, published in 1982. It was adapted for the big screen in 1994 as The Shawshank Redemption, one of the most critically acclaimed movies of all time. The story follows a man named Andy Dufrense, a banker from Maine, who was convicted for the double murder of his wife and her lover. The only problem? He didn’t commit the crimes. Dufresne spends nearly 30 years in prison before escaping through a tunnel he’d spent two decades digging with a rock hammer.\nStrain Pairing: Star Killer\n\nStar Killer is a solid pairing with Shawshank, as the dense, purple buds offer a sweet, lemon flavor and aid in treating pain, insomnia, and PTSD, among other things. It’s a good option for a person who just dug his way out of prison after spending nearly three decades there locked up.\nThe Shining\n\nPublished in 1977, Stephen King’s The Shining is still captivating audiences all around the world. The book was King’s first hardback bestseller, establishing himas a preeminent author in the horror genre. The Shining centers on the life of Jack Torrance, an aspiring writer and recovering alcoholic, who takes over the historic Overlook Hotel in the Colorado Rockies. His family joins him, including his young son Danny, who possesses “the shining,” an array of psychic abilities that allow him to see the hotel’s horrific past. While the family is holed up in the hotel for the winter, supernatural forces emerge and put the whole family in grave danger.\nStrain Pairing: Jack Herer\nWe paired this story with Jack Herer, a sativa-dominant cannabis strain, as a nod to one of the famous lines from Stanley Kubrick’s film adaption of the novel, “All work and no play makes Jack a dull boy.” With this strain, there will be no dullness in your life, that’s for sure.\nThe Green Mile\n\nLast but certainly not least is the serial novel The Green Mile. Another one of my personal favorites, the story is about a death row supervisor’s encounter with John Coffey, an unusual inmate who displays inexplicable healing and empathetic abilities. Written in 1996, the book takes place in Louisiana in the early 1930s.\nStrain Pairing: Supernatural\nWe paired it with the cannabis strain Supernatural, something that is very relatable to Mr. Coffey. The strain is a sativa-dominant blend that is a great indoor option, with a biting, skunky zest and uplifting sativa effects that will surely bring you supernatural powers.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/22140726/stephen-king.jpg","urlslug":"/news/strains-products/pair-cannabis-strains-5-stephen-kings-best-novels"},{"id":"contentitems-3009","title":"9 Holy Strains That Can Change Pope Francis\u0027 Opinion of Cannabis","author":"Rebecca Kelley","category":null,"date":"\/Date(1405011600000)\/","text":"Ever since Pope Francis (née Jorge Mario Bergoglio) was elected to succeed Pope Benedict XVI on March 13, 2013, the world has for the most part responded positively to His Holiness\u0027 behavior at the top of the religious food chain. As of December 2013, 88% of American Catholics approve of how he\u0027s handling his role as head of the Catholic church, and even non-religious people admire Pope Francis\u0027 humility, his vow to live simply, his acts of compassion, and his love for and acceptance of folks from all walks of life. Dude was even a bar bouncer and a janitor before becoming a priest. What\u0027s not to like about him? \nWell, it turns out pope-in\u0027 ain\u0027t easy, and as much as I admire Pope Francis for being the pope-iest Pope to come along in decades, he holds one opinion that broke my little heathen heart. Last week, he condemned efforts to legalize cannabis, saying that limited attempts to legalize recreational drugs \"are not only highly questionable from a legislative standpoint, but they fail to produce the desired effects.\" He also added, \"the problem of drug use is not solved with drugs!\"\nPope Francis, I get where you\u0027re coming from. You\u0027ve previously spoken out against the evils of drug addiction, so I can see how you\u0027d be wary about cannabis legalization. However, cannabis is far less addictive (9-10%) than tobacco smokers (20%-30%), heroin users (23-25%), alcohol users (15%), and cocaine users (15%-20%), plus it has therapeutic and medical benefits.\nMaybe you need a little bit of cannabis education, Mr. Pope. For instance, did you know that cannabis and religion often go hand-in-hand? It\u0027s true! As a matter of fact, I\u0027ve got a list of nine strains that I think are right up your pious alley. Check out a few of these holy wonders and you\u0027ll see that cannabis isn\u0027t so bad, after all. \n1. 3 Kings\nIn the biblical sense, the Three Kings, also known as the biblical Magi or the three Wise Men (not to be confused with the \"Ooohhhhh a wise guy, eh?\" schtick of the Three Stooges) were a trio of foreigners who visited Jesus after his birth. They brought gifts of gold, frankincense, and myrrh because they had no idea what sort of thing newborn babies are into (in hindsight, burping cloths and a Baby Bjorn would have probably been more ideal than pungent tree resin, though the gold was a classy touch).\nWhat better way to commemorate the birth of baby Jesus than with the hybrid 3 Kings strain, known for its appropriately piney, pungent smell and its euphoric, happy effects. Pair it with Dream Star to simulate the Star of Bethlehem and you\u0027ve got yourself a pretty uplifting birthday celebration.\n2. Endless Sky\nIsn\u0027t heaven supposed to be some sort of Endless Sky where everyone lives on a fluffy cloud and gets free access to Backstreet Boys concerts? If so, let its indica counterpart bring you relaxation so you can dream about the day you get to meet your maker and high-five Him for inviting you through the pearly gates.\n3. Holy Grail Kush\nThe Holy Grail has had quite the heyday in pop culture, from Monty Python to Indiana Jones. There\u0027s no way you\u0027re not an Indiana Jones fan, Mr. Pope, so I strongly recommend you partake in this woody hybrid while commemorating the supposed vessel of the Last Supper with a viewing of the 1989 classic. Just know with Holy Grail Kush, you have chosen wisely.\n4. Jesus OG\nTry the indica named after Mr. JC himself, Jesus OG. Its citrus, earthy flavors and focused effects may channel the power of Christ to compel you to pair it with the hybrid Bio-Jesus, a euphoric hybrid that provides exceptional pain relief. That\u0027s double the Jesus in one session — think of it as hitting up church twice on the same Sunday.\n5. Soul Shine\nNot to be confused with Soul Glo (just let your soooooooooullllll glowwwwwwww!), Soul Shine is an arousing hybrid that will amplify your love for the man upstairs. (Not the dude who lives in the apartment above yours, I mean the actual Man Upstairs.) As Pope, I imagine you\u0027ve got one of the shiniest souls around, so this is a great option for someone with your sparkly innards.\n6. Lamb\u0027s Bread\nIn religious terms, lamb\u0027s bread is also known as sacramental bread, the body of Christ, altar bread, or Communion bread. It\u0027s used in the Christian ritual of the Eucharist/Holy Communion, where Christians accept a sacrament in the form of a piece of bread or cracker and a sip of wine or grape juice. In cannabis terms, Lamb\u0027s Bread is an earthy sativa that brings euphoric, uplifting, and creative effects. That sounds like a better Communion offering to me, don\u0027t you agree, Pope? Think of how much more amazing the church songs would be once the congregation gets their creative juices flowing (and we all know Christian hymns could use some oomph).    \n7. Trinity\nThe Trinity in Christian terms describes God as three expressions: the Father, the Son (aka Jesus), and the Holy Spirit. If God is a hybrid of these three, it\u0027s only fitting that the Trinity cannabis strain is also a hybrid (though I would hope God isn\u0027t as skunky-smelling). Try this one out for its trio of happy, uplifting, and energetic qualities and you\u0027ll think three is a magic number, indeed.\n8. Exodus Cheese\nThe Book of Exodus tells the story of Moses leading the Israelites out of slavery in Egypt, where they wandered the desert for a ridiculous amount of time, subsisting on manna and miraculous water. They didn\u0027t even have any cheese, which to me is easily the biggest sacrifice (well, that and the whole \"wandering aimlessly through the dessert in search of a safe haven\" part). So pick up some of the hybrid Exodus Cheese, enjoy its sweet, cheesy flavors, and reflect on how thankful you are to eat cheese whenever you want instead of manna for the 40th day in a row (hopefully you\u0027re not lactose intolerant, Mr. Pope).\n9. God\u0027s Treat\n…or God\u0027s Gift, or God Bud. Whatever your preference, know that a number of strains are named after The Big Guy because a lot of growers are thankful that one of His creations was this incredible plant with therapeutic purposes. So whaddya say, Pope Francis, why don\u0027t you pick up some hybrid God\u0027s Treat and acknowledge that there are many positive aspects of cannabis that benefit millions of people around the world? After all, it must be stressful to be Pope, and this Treat can deliver relaxing and sleepy effects to help you rest up so you can continue to spread your goodwill to those in need…much how cannabis does.    ","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/07/12001344/9-holy-strains-that-can-change-the-popes-opinion-of-cannabis.jpg","urlslug":"/news/strains-products/9-holy-strains-that-can-change-the-popes-opinion-of-cannabis"}],"reviewCount":40,"flavors":[{"name":"Earthy","score":38.055555555555557},{"name":"Sweet","score":29.027777777777775},{"name":"Berry","score":26.249999999999996},{"name":"Citrus","score":26.249999999999996},{"name":"Blueberry","score":25.555555555555554}],"effects":[{"name":"Uplifted","score":85.694444444444443},{"name":"Happy","score":85.694444444444443},{"name":"Energetic","score":84.305555555555543},{"name":"Talkative","score":82.222222222222214},{"name":"Euphoric","score":70.555555555555557}],"symptoms":[{"name":"Fatigue","score":50.416666666666664},{"name":"Stress","score":42.222222222222221},{"name":"Inflammation","score":26.249999999999996},{"name":"Muscle Spasms","score":24.861111111111107},{"name":"Seizures","score":24.166666666666664}],"conditions":[{"name":"Anxiety","score":38.75},{"name":"Epilepsy","score":20},{"name":"PTSD","score":8.3333333333333321},{"name":"Migraines","score":7.6388888888888884},{"name":"Bipolar Disorder","score":7.6388888888888884}],"negatives":[{"name":"Dry Mouth","score":30.416666666666664},{"name":"Paranoid","score":20.694444444444443},{"name":"Dry Eyes","score":6.9444444444444438},{"name":"Dizzy","score":4.1666666666666661}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-star_100x100_0862.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/365871/b/dream-star__primary_7cd2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-star_100x100_f8a7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/365376/b/dream-star__primary_b6be.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-star_100x100_7b81.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/215735/b/dream-star__primary_fb8d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-star_100x100_10ff.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/148573/b/dream-star_825x550_c5ad.jpg"}],"photoTotalCount":4,"popularCities":["Grants Pass, OR","Medford, OR","Sparks, NV"],"permalink":"https://mobileapi.leafly.com/hybrid/dream-star","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.7/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"},{"name":"Stardawg","subtitle":null,"slug":"stardawg","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/stardawg","symbol":"Sta","applink":"leafly://strain/stardawg"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":74511,"slug":"dream-star","name":"Dream Star","subtitle":null,"symbol":"Drs","category":"Hybrid","description":"\u003cp\u003eA cross between \u003ca href=\"http://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/stardawg\"\u003eStardawg\u003c/a\u003e, Dream Star is a sativa-dominant \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e bred by Oaksterdam Seed Co. Its aroma is \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-tree-fruit\"\u003efruity\u003c/a\u003e, with sour accents that hint at Dream Star\u0026rsquo;s \u003ca href=\"http://www.leafly.com/hybrid/chemdawg\"\u003eChemdawg\u003c/a\u003e lineage. This strain\u0026rsquo;s psychoactive onset begins in the head and evens out over time into a mellow full-body \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003ecalm\u003c/a\u003e. Dream Star is used by patients to treat a variety of symptoms and conditions including \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-headaches\"\u003eheadaches\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-depression\"\u003edepression\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-multiple-sclerosis\"\u003emultiple sclerosis\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-parkinsons\"\u003eParkinson\u0026rsquo;s\u003c/a\u003e. This hybrid might come as a challenge to novice growers, but cultivators of this strain should wait nine weeks for indoor plants to flower.\u003c/p\u003e\n","descriptionPlain":"A cross between Blue Dream and Stardawg, Dream Star is a sativa-dominant hybrid bred by Oaksterdam Seed Co. Its aroma is sweet and fruity, with sour accents that hint at Dream Star\u0026rsquo;s Chemdawg lineage. This strain\u0026rsquo;s psychoactive onset begins in the head and evens out over time into a mellow full-body calm. Dream Star is used by patients to treat a variety of symptoms and conditions including headaches, pain, depression, multiple sclerosis, and Parkinson\u0026rsquo;s. This hybrid might come as a challenge to novice growers, but cultivators of this strain should wait nine weeks for indoor plants to flower.\n","aka":null,"rating":4.7,"highlightedReviews":[{"id":1360008,"username":"sushizawa","text":"The smoke goes straight to your head and lasts around 20 mins. After that, the high goes from your head and into your body which gives it a nice \"floaty\" feeling. Highly recommended for all you canna-nerds. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1621976,"username":"Metalmainia4_2_0","text":"This strain for me was very good it gave me motivation for the day love it and MMEC fast delivery","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-7858","title":"Pair These Cannabis Strains With 5 of Stephen King\u0027s Best Novels","author":"Gage Peake","category":null,"date":"\/Date(1474584346000)\/","text":"From classics like The Green Mile and Rita Hayworth and Shawshank Redemption to supernatural spookers like Carrie and The Shining, Stephen King has gifted the world with magnificent pieces of literature that feature surprising depth. If you’re thinking of picking up one of his works, here are some cannabis strains that pair well with some of our favorite stories from the King of Horror.\nCujo\n\nYou might remember this classic from 1981. Cujo, a sweet good-natured dog in the beginning of the story, gets bit on the nose by a rabid bat and ultimately transforms into a killing machine that tears into neighbors and police sheriffs indiscriminately. Like all of the entries on this list, Cujo was adapted into a movie in 1983.\nStrain Pairing: Snoop’s Dream\n\nPicking a strain to pair with this story proved difficult, but after some consideration, we had to choose one of our favorite dog-themed strains, Snoop Dream. Named after the hip-hop superstar, Snoop’s Dream is a mix of Blue Dream and Master Kush, making for medium-sized dense buds covered in orange hairs. The hybrid’s relaxing qualities would be the perfect mix to calm down a killer dog terrorizing a small town in Maine.\nIT\n\nAnother Stephen King Horror novel, IT, published in 1986, follows the exploits of seven children as they are terrorized by the eponymous being, which exploits the fears and phobias of its victims in order to disguise itself while hunting its prey. Pennywise, the villain in the book, primarily appears in the form of a clown in the story, making this a truly riveting tale that was the best-selling book in the United States the year it came out.\nStrain Pairing: Pennywise\n\nPairing this story with a cannabis strain was easy — we recommend Pennywise, which got its name from King’s book. Pennywise is a high-CBD indica cross between Harlequin and Jack the Ripper, a combination that lends this strain its killer clown name. The high CBD would help with any pain brought on by a psychopathic killer clown.\nRita Hayworth and Shawshank Redemption (from Different Seasons)\n\nMy personal favorite Stephen King story, Rita Hayworth and Shawshank Redemption, appears in his anthology Different Seasons, published in 1982. It was adapted for the big screen in 1994 as The Shawshank Redemption, one of the most critically acclaimed movies of all time. The story follows a man named Andy Dufrense, a banker from Maine, who was convicted for the double murder of his wife and her lover. The only problem? He didn’t commit the crimes. Dufresne spends nearly 30 years in prison before escaping through a tunnel he’d spent two decades digging with a rock hammer.\nStrain Pairing: Star Killer\n\nStar Killer is a solid pairing with Shawshank, as the dense, purple buds offer a sweet, lemon flavor and aid in treating pain, insomnia, and PTSD, among other things. It’s a good option for a person who just dug his way out of prison after spending nearly three decades there locked up.\nThe Shining\n\nPublished in 1977, Stephen King’s The Shining is still captivating audiences all around the world. The book was King’s first hardback bestseller, establishing himas a preeminent author in the horror genre. The Shining centers on the life of Jack Torrance, an aspiring writer and recovering alcoholic, who takes over the historic Overlook Hotel in the Colorado Rockies. His family joins him, including his young son Danny, who possesses “the shining,” an array of psychic abilities that allow him to see the hotel’s horrific past. While the family is holed up in the hotel for the winter, supernatural forces emerge and put the whole family in grave danger.\nStrain Pairing: Jack Herer\nWe paired this story with Jack Herer, a sativa-dominant cannabis strain, as a nod to one of the famous lines from Stanley Kubrick’s film adaption of the novel, “All work and no play makes Jack a dull boy.” With this strain, there will be no dullness in your life, that’s for sure.\nThe Green Mile\n\nLast but certainly not least is the serial novel The Green Mile. Another one of my personal favorites, the story is about a death row supervisor’s encounter with John Coffey, an unusual inmate who displays inexplicable healing and empathetic abilities. Written in 1996, the book takes place in Louisiana in the early 1930s.\nStrain Pairing: Supernatural\nWe paired it with the cannabis strain Supernatural, something that is very relatable to Mr. Coffey. The strain is a sativa-dominant blend that is a great indoor option, with a biting, skunky zest and uplifting sativa effects that will surely bring you supernatural powers.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/22140726/stephen-king.jpg","urlslug":"/news/strains-products/pair-cannabis-strains-5-stephen-kings-best-novels"},{"id":"contentitems-3009","title":"9 Holy Strains That Can Change Pope Francis\u0027 Opinion of Cannabis","author":"Rebecca Kelley","category":null,"date":"\/Date(1405011600000)\/","text":"Ever since Pope Francis (née Jorge Mario Bergoglio) was elected to succeed Pope Benedict XVI on March 13, 2013, the world has for the most part responded positively to His Holiness\u0027 behavior at the top of the religious food chain. As of December 2013, 88% of American Catholics approve of how he\u0027s handling his role as head of the Catholic church, and even non-religious people admire Pope Francis\u0027 humility, his vow to live simply, his acts of compassion, and his love for and acceptance of folks from all walks of life. Dude was even a bar bouncer and a janitor before becoming a priest. What\u0027s not to like about him? \nWell, it turns out pope-in\u0027 ain\u0027t easy, and as much as I admire Pope Francis for being the pope-iest Pope to come along in decades, he holds one opinion that broke my little heathen heart. Last week, he condemned efforts to legalize cannabis, saying that limited attempts to legalize recreational drugs \"are not only highly questionable from a legislative standpoint, but they fail to produce the desired effects.\" He also added, \"the problem of drug use is not solved with drugs!\"\nPope Francis, I get where you\u0027re coming from. You\u0027ve previously spoken out against the evils of drug addiction, so I can see how you\u0027d be wary about cannabis legalization. However, cannabis is far less addictive (9-10%) than tobacco smokers (20%-30%), heroin users (23-25%), alcohol users (15%), and cocaine users (15%-20%), plus it has therapeutic and medical benefits.\nMaybe you need a little bit of cannabis education, Mr. Pope. For instance, did you know that cannabis and religion often go hand-in-hand? It\u0027s true! As a matter of fact, I\u0027ve got a list of nine strains that I think are right up your pious alley. Check out a few of these holy wonders and you\u0027ll see that cannabis isn\u0027t so bad, after all. \n1. 3 Kings\nIn the biblical sense, the Three Kings, also known as the biblical Magi or the three Wise Men (not to be confused with the \"Ooohhhhh a wise guy, eh?\" schtick of the Three Stooges) were a trio of foreigners who visited Jesus after his birth. They brought gifts of gold, frankincense, and myrrh because they had no idea what sort of thing newborn babies are into (in hindsight, burping cloths and a Baby Bjorn would have probably been more ideal than pungent tree resin, though the gold was a classy touch).\nWhat better way to commemorate the birth of baby Jesus than with the hybrid 3 Kings strain, known for its appropriately piney, pungent smell and its euphoric, happy effects. Pair it with Dream Star to simulate the Star of Bethlehem and you\u0027ve got yourself a pretty uplifting birthday celebration.\n2. Endless Sky\nIsn\u0027t heaven supposed to be some sort of Endless Sky where everyone lives on a fluffy cloud and gets free access to Backstreet Boys concerts? If so, let its indica counterpart bring you relaxation so you can dream about the day you get to meet your maker and high-five Him for inviting you through the pearly gates.\n3. Holy Grail Kush\nThe Holy Grail has had quite the heyday in pop culture, from Monty Python to Indiana Jones. There\u0027s no way you\u0027re not an Indiana Jones fan, Mr. Pope, so I strongly recommend you partake in this woody hybrid while commemorating the supposed vessel of the Last Supper with a viewing of the 1989 classic. Just know with Holy Grail Kush, you have chosen wisely.\n4. Jesus OG\nTry the indica named after Mr. JC himself, Jesus OG. Its citrus, earthy flavors and focused effects may channel the power of Christ to compel you to pair it with the hybrid Bio-Jesus, a euphoric hybrid that provides exceptional pain relief. That\u0027s double the Jesus in one session — think of it as hitting up church twice on the same Sunday.\n5. Soul Shine\nNot to be confused with Soul Glo (just let your soooooooooullllll glowwwwwwww!), Soul Shine is an arousing hybrid that will amplify your love for the man upstairs. (Not the dude who lives in the apartment above yours, I mean the actual Man Upstairs.) As Pope, I imagine you\u0027ve got one of the shiniest souls around, so this is a great option for someone with your sparkly innards.\n6. Lamb\u0027s Bread\nIn religious terms, lamb\u0027s bread is also known as sacramental bread, the body of Christ, altar bread, or Communion bread. It\u0027s used in the Christian ritual of the Eucharist/Holy Communion, where Christians accept a sacrament in the form of a piece of bread or cracker and a sip of wine or grape juice. In cannabis terms, Lamb\u0027s Bread is an earthy sativa that brings euphoric, uplifting, and creative effects. That sounds like a better Communion offering to me, don\u0027t you agree, Pope? Think of how much more amazing the church songs would be once the congregation gets their creative juices flowing (and we all know Christian hymns could use some oomph).    \n7. Trinity\nThe Trinity in Christian terms describes God as three expressions: the Father, the Son (aka Jesus), and the Holy Spirit. If God is a hybrid of these three, it\u0027s only fitting that the Trinity cannabis strain is also a hybrid (though I would hope God isn\u0027t as skunky-smelling). Try this one out for its trio of happy, uplifting, and energetic qualities and you\u0027ll think three is a magic number, indeed.\n8. Exodus Cheese\nThe Book of Exodus tells the story of Moses leading the Israelites out of slavery in Egypt, where they wandered the desert for a ridiculous amount of time, subsisting on manna and miraculous water. They didn\u0027t even have any cheese, which to me is easily the biggest sacrifice (well, that and the whole \"wandering aimlessly through the dessert in search of a safe haven\" part). So pick up some of the hybrid Exodus Cheese, enjoy its sweet, cheesy flavors, and reflect on how thankful you are to eat cheese whenever you want instead of manna for the 40th day in a row (hopefully you\u0027re not lactose intolerant, Mr. Pope).\n9. God\u0027s Treat\n…or God\u0027s Gift, or God Bud. Whatever your preference, know that a number of strains are named after The Big Guy because a lot of growers are thankful that one of His creations was this incredible plant with therapeutic purposes. So whaddya say, Pope Francis, why don\u0027t you pick up some hybrid God\u0027s Treat and acknowledge that there are many positive aspects of cannabis that benefit millions of people around the world? After all, it must be stressful to be Pope, and this Treat can deliver relaxing and sleepy effects to help you rest up so you can continue to spread your goodwill to those in need…much how cannabis does.    ","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/07/12001344/9-holy-strains-that-can-change-the-popes-opinion-of-cannabis.jpg","urlslug":"/news/strains-products/9-holy-strains-that-can-change-the-popes-opinion-of-cannabis"}],"reviewCount":40,"flavors":[{"name":"Earthy","score":38.055555555555557},{"name":"Sweet","score":29.027777777777775},{"name":"Berry","score":26.249999999999996},{"name":"Citrus","score":26.249999999999996},{"name":"Blueberry","score":25.555555555555554}],"effects":[{"name":"Uplifted","score":85.694444444444443},{"name":"Happy","score":85.694444444444443},{"name":"Energetic","score":84.305555555555543},{"name":"Talkative","score":82.222222222222214},{"name":"Euphoric","score":70.555555555555557}],"symptoms":[{"name":"Fatigue","score":50.416666666666664},{"name":"Stress","score":42.222222222222221},{"name":"Inflammation","score":26.249999999999996},{"name":"Muscle Spasms","score":24.861111111111107},{"name":"Seizures","score":24.166666666666664}],"conditions":[{"name":"Anxiety","score":38.75},{"name":"Epilepsy","score":20},{"name":"PTSD","score":8.3333333333333321},{"name":"Migraines","score":7.6388888888888884},{"name":"Bipolar Disorder","score":7.6388888888888884}],"negatives":[{"name":"Dry Mouth","score":30.416666666666664},{"name":"Paranoid","score":20.694444444444443},{"name":"Dry Eyes","score":6.9444444444444438},{"name":"Dizzy","score":4.1666666666666661}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-star_100x100_0862.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/365871/b/dream-star__primary_7cd2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-star_100x100_f8a7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/365376/b/dream-star__primary_b6be.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-star_100x100_7b81.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/215735/b/dream-star__primary_fb8d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dream-star_100x100_10ff.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/148573/b/dream-star_825x550_c5ad.jpg"}],"photoTotalCount":4,"popularCities":["Grants Pass, OR","Medford, OR","Sparks, NV"],"permalink":"https://mobileapi.leafly.com/hybrid/dream-star","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.7/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"},{"name":"Stardawg","subtitle":null,"slug":"stardawg","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/stardawg","symbol":"Sta","applink":"leafly://strain/stardawg"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
