{
    "aka": "Chocalope Kush, Chocolate Kush",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1511894705000)/",
            "id": "contentitems-49877",
            "text": "As we explored recently with our list of 9 Most Overhyped Cannabis Strains, a few of the best-known cannabis varieties on the market are a little overrated. Correspondingly, it’s no surprise that there are some underrated cannabis strains out there, too.\n\nThe following represent 11 varieties of cannabis that we think get less love than they deserve, based on Leafly review data, regional availability, and the personal experiences of our cannabis expert team. This is far from an exhaustive list—with thousands of strains available in the world, it’s virtually impossible to give all of them the attention we wish we could. Nevertheless, take the following as just a few recommendations of lesser-known types you should keep an eye out for—who knows? You just might find your new favorite strain among them.\nTahoe OG Kush\nStrain type: Hybrid\nParent strains: OG Kush, SFV OG Kush\nWhy it’s underrated: “Tahoe OG isn’t underrated in the traditional sense of the word. In fact, most people I know who’ve come across this select OG Kush phenotype will share their excitement for the pungent, piney sweetness and the strain’s dynamic mix of deep relaxation and profound euphoria. However, when I think of the OG family tree, the Tahoe cut doesn’t seem to get quite the same notoriety that some of its relatives. The SFV, Larry, and Fire OGs manage to capture a lot of the buzz, while other cuts, like the Ghost and WiFi OGs, have somewhat cult followings. This leaves room for Tahoe OG to stand on its own, which is OK by me. I love its dank, complex aroma and the sedating effects, so the less hype there is for Tahoe OG, the more of this delicious strain is available for me!” —Will Hyde\n\nLodi Dodi\nStrain type: Hybrid\nParent strains: Undisclosed\nWhy it’s underrated: “This strain is a mainstay in the Pacific Northwest, but still flies beneath the radar outside the region. Sativa-dominant in effect, this unknown cultivar has been propagated throughout the Evergreen State for decades. Lodi Dodi’s airy physical lightness and uplifting mental buzz allow the consumer to metaphorically levitate two inches above their problems and their pain. I personally enjoy working out after consuming this strain for its stimulating aura and a mental haze that allows me to fade into my headphones and run forever. It’s equally satisfying on the dancefloor or in the bedroom, as long as you mind your dosage. Lodi Dodi came to party—it don’t cause trouble or bother nobody.” —Jeremiah Wilhelm\nChocolope Kush\nStrain type: Hybrid\nParent strains:  Chocolope, Kosher Kush\nWhy it’s underrated: “This is, weirdly, one of the lowest-rated strains on Leafly (yep, a four-star rating is on the low end—Leafly reviewers give most cannabis pretty high marks), but riddle me this: How can a marriage of superstars like Chocolope and Kosher Kush possibly be bad? Those parent strains are two of our all-time faves (in fact, both landed on our Top 100 Strains list) and given that the apple rarely falls far from the tree, this super-low rating for Chocolate Kush is undeserved.” —Brett Konen\n\nDancehall\nStrain type: Hybrid\nParent strains: Juanita La Lagrimosa, Kalijah\nWhy it’s underrated: “Dancehall is an exceptional CBD-dominant strain that doesn’t get much recognition by comparison to CBD hallmarks like Harlequin, ACDC, Charlotte’s Web, and Cannatonic. With a near 21:1 CBD:THC ratio, Dancehall delivers soothing, easygoing effects with just enough sativa-dominant influence to elevate mood, which makes it a constant companion for consumers who like to stay level and clearheaded while enjoying cannabis. The terpene profile also offers deeper, skunkier notes than the usual grassy, hay-like aroma CBD strains are known for. Whether you’re enjoying it for what it is, or blending with your THC-dominant strains, Dancehall adds something special and drastically underappreciate to any joint or bowl.” —Jeremiah Wilhelm\nBay Dream\nStrain type: Sativa\nParent strains: Blue Dream, Bay 11\nWhy it’s underrated: “Bay Dream is an uplifting strain with sharp citrus notes and subtle earthiness. It seems to be overlooked because of its polarizing parent strain, Blue Dream, but in combination with the sweet, skunky flavors and focused headspace of Bay 11 the mix is a pleasant surprise. I appreciate that Bay Dream trades some of Blue Dream’s fruit notes for a deeper, more poignant Kush-like palate of flavors. So, if you’re in the ‘Blue Dream is overrated’ crowd, don’t shy away from Bay Dream—you might be amazed by how much this strain expresses its individuality.” —Will Hyde\n\nSour Urkle\nStrain type: Hybrid\nParent strains: Sour Diesel, Purple Urkle\nWhy it’s underrated: “Sour Urkle is the potent union of pungent, polar opposites. Created from Sour Diesel and Purple Urkle, this funky and surprisingly affordable bud packs the best of both strains into one frosty package. This strain emits an odd floral and chemical aroma that is contrasted against a latent but tangible sweetness brought forth by the fruitiness of Purple Urkle. This flavor profile can be challenging for some, but the effects are undeniably heady while draping the body in a soothing, mellow aura.” —Jeremiah Wilhelm\nPresidential Kush\nStrain type: Indica\nParent strains: Bubble Gum, OG Kush\nWhy it’s underrated: “Easily one of the more picturesque strains I’ve come across, Presidential Kush (also known as Presidential OG) expresses itself with deep green and purple hues. A thick blanket of trichomes adds another dimension to the strain’s aesthetic, but PK is so much more than just a pretty flower. It’s a potent, complex, and flavorful experience that only takes a puff or two before you feel the comforting weight of deep relaxation wash over you. The piney, diesel flavors make it hard to put down, and I still find myself embarking on epic journeys just to track down this beautiful bud. In my opinion, genetics this compelling should be easier to find and should be garnering more attention in the cannabis community, so for that reason, I’d like to encourage more growers to add this strain to their stable, and if you find it at your local dispensary as a consumer, definitely do not overlook it!” —Will Hyde\n\nDurban Poison\nStrain type: Sativa\nParent strains: African\nWhy it’s underrated: “Landrace strains, including Durban Poison, are hard to find and often faked. As such, many people have had a less-enjoyable-than-average experience with a strain they believed, mistakenly, to be the landrace advertised on the packaging. Durban Poison is a fantastic pure sativa that many people, including myself, loved at first smoke, so if Durban Poison didn’t wow you the first time around, give it another chance—that first batch might have been something else that was merely masquerading as this iconic strain.” —Brett Konen\nApple Jack\nStrain type: Hybrid\nParent strains: Jack Herer, White Widow\nWhy it’s underrated: “Apple Jack hasn’t gained much in the way of ratings on Leafly, but that doesn’t mean it’s a dud. It blends two well-known cuts together (Jack Herer x White Widow) to create something greater than the sum of its parts. Apple Jack’s initially clear-headed high relieves stress while elevating the mind and encouraging creativity. The happy effects and accessible THC concentration make it a friendly flower for consumers of all potency levels. And even though its flavor doesn’t always live up the name, Apple Jack’s sweet, earthy terpene profile still offers satisfying flavors alongside a productive buzz.” —Jeremiah Wilhelm\n\nPlushberry\nStrain type: Indica\nParent strains: Black Cherry Soda, Space Queen\nWhy it’s underrated: “Plushberry is an incredible strain that’s underrated simply because it hasn’t appeared to travel beyond the Pacific Northwest. Wrapped in beautiful lavender foliage, it smells like sweet wildflowers and mixed berries, and if you have the chance to try it while you’re in the area, Plushberry is a strain you won’t soon forget.” —Bailey Rahn\nSkunk No. 1\nStrain type: Hybrid\nParent strains: Afghani, Acapulco Gold, Colombian Gold\nWhy it’s underrated: “Even if you don’t love the flavor of the flower itself, you’ve got to respect a strain that’s given us so many of our favorites on the market—I’m talking Green Crack, Island Sweet Skunk, Amnesia, Pineapple Chunk, UK Cheese, and so many more. Skunk No. 1 is a true original among cannabis strains, and while its skunky flavor is an acquired taste, you’re smoking a piece of history with Skunk No. 1—so respect your elders.” —Brett Konen",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/28103218/most-underrated-cannabis-strains.jpg",
            "title": "11 Unsung Cannabis Strains Worth Discovering",
            "urlslug": "/news/strains-products/11-underrated-marijuana-strains"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 22.499999999999996
        },
        {
            "name": "ADD/ADHD",
            "score": 9.86111111111111
        },
        {
            "name": "Migraines",
            "score": 9.722222222222221
        },
        {
            "name": "PTSD",
            "score": 9.583333333333332
        },
        {
            "name": "Multiple Sclerosis",
            "score": 8.61111111111111
        }
    ],
    "description": "<p>Chocolope Kush, also known as Chocolate Kush, is a&nbsp;sativa-dominant strain is from the lineage of <a href=\"http://www.leafly.com/sativa/chocolope\">Chocolope</a> (multiple Cannabis Cup winner) and <a href=\"http://www.leafly.com/indica/kosher-kush\">Kosher Kush</a>. Kosher Kush has been the front runner in each cannabis event it has competed in and has been published by <em>High Times</em> as the 7th overall strongest strain in the world. The buds on Chocolope&nbsp;Kush are dense and dark colored with a large amount of white crystals. It is known to have the aroma of vanilla mixed with chocolate. The high is described as a heavy cerebral one, and has a THC content of up to 14% along with a CBD of approximately 1%.</p>\n",
    "descriptionPlain": "Chocolope Kush, also known as Chocolate Kush, is a&nbsp;sativa-dominant strain is from the lineage of Chocolope (multiple Cannabis Cup winner) and Kosher Kush. Kosher Kush has been the front runner in each cannabis event it has competed in and has been published by High Times as the 7th overall strongest strain in the world. The buds on Chocolope&nbsp;Kush are dense and dark colored with a large amount of white crystals. It is known to have the aroma of vanilla mixed with chocolate. The high is described as a heavy cerebral one, and has a THC content of up to 14% along with a CBD of approximately 1%.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 66.52777777777777
        },
        {
            "name": "Uplifted",
            "score": 57.08333333333333
        },
        {
            "name": "Creative",
            "score": 55.27777777777777
        },
        {
            "name": "Focused",
            "score": 53.74999999999999
        },
        {
            "name": "Euphoric",
            "score": 50.27777777777777
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 12.777777777777777
        },
        {
            "name": "Sweet",
            "score": 10.833333333333332
        },
        {
            "name": "Skunk",
            "score": 9.86111111111111
        },
        {
            "name": "Vanilla",
            "score": 9.444444444444443
        },
        {
            "name": "Pungent",
            "score": 2.638888888888889
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 63,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png",
            "id": 1416872,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Chocolate Kush has been one of the staples in my medicine cabinet for nearly 2 years now. It's an extremely well-rounded hybrid that honestly doesn't seem sativa dominant to me. Maybe I'm consuming a different breeder's Chocolate Kush, but regardless, this strain I keep receiving is wonderful.\nEffects are mostly in the body for me with a slight head change. Mellow, but not going to knock you out unless you go overboard. Potency isn't it's strong suit, but it's not bad either (regularly within the 18-22% THC range). I consider this one of my cannasseur strains as it tastes amazing, the smoke is as smooth as silk with little expansion, and the effects are great for me anywhere from noon to night (I use a different strain, like a pure indica right before bed). \nThe flavor to me is very earthy with a hint of dry chocolate on the exhale. The best way I can describe it is that it seems as if some Nesquik chocolate powder was lightly sprinkled over the top of the buds. It's faint, but distinct to me. Smell is also outstanding with no hints of chocolate in that aspect, but it does have a sweet sort of characteristic to it along with that same earthy note.\nAppearance-wise, this strain shines. Extremely similar to Blackberry Kush in that it's more \"furry\" than \"frosty\". Coated in white with amazing bag appeal. The nugs are decent in density, size, & structure with shades of green broken apart by purple veins & accents and at times, trichome coverage is so dominant that it appears there's cotton fabric weaved within the nugs' structure. An absolutely beautiful specimen every time I've picked it up.\nOverall, I personally love this strain. It's not the most potent strain out there, but that's hardly an issue as I keep a decent number of strains in my medicine cabinet for different purposes. I'd say the potency is average with the ability to be good (18-25%, usually on the lower end). This strain is the type you'd want to consume as a treat/reward for yourself. It could be after dinner as a dessert, after a long day of work to release some stress/tension, or even during your day almost as an escape to get your mind right. When grown properly, this strain will always have a place within my medicine cabinet.\n\nEdit: For reference, the sample of Chocolate Kush I consumed is up in the photo section and are the nugs with the blue backgrounds. It's from TJ's Organic Gardens and the review before mine seems to mirror my thoughts on this strain from TJ's lineup. Hope this helps anyone in the Pacific Northwest find an amazing representation of this strain. Not overpowering, great flavor, nice effects, and gorgeous. It's my most commonly consumed strain for a reason and unless it's late at night, the sample you get is grown horribly, or you want something extremely potent, you'll likely love this strain.",
            "username": "PieRomania"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1643241,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Guys it’s chocolope kush, not chocolate kush...",
            "username": "cantreallydothat"
        }
    ],
    "id": 218,
    "name": "Chocolope Kush",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 15.277777777777777
        },
        {
            "name": "Dry Eyes",
            "score": 3.6111111111111107
        },
        {
            "name": "Dizzy",
            "score": 1.8055555555555554
        },
        {
            "name": "Headache",
            "score": 1.3888888888888888
        },
        {
            "name": "Paranoid",
            "score": 1.3888888888888888
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/chocolope",
            "category": "Sativa",
            "name": "Chocolope",
            "permalink": "https://mobileapi.leafly.com/sativa/chocolope",
            "slug": "chocolope",
            "subtitle": null,
            "symbol": "Chc"
        },
        {
            "applink": "leafly://strain/kosher-kush",
            "category": "Indica",
            "name": "Kosher Kush",
            "permalink": "https://mobileapi.leafly.com/indica/kosher-kush",
            "slug": "kosher-kush",
            "subtitle": null,
            "symbol": "Kos"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/chocolope-kush",
    "photoTotalCount": 43,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/647634/b/chocolope-kush__primary_ac88.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chocolope-kush_100x100_1c4b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/565910/b/chocolope-kush__primary_2c39.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chocolope-kush_100x100_52dd.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/505900/b/chocolope-kush__primary_c9b4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chocolope-kush_100x100_d2f5.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/478867/b/chocolope-kush__primary_8496.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chocolope-kush_100x100_8a39.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/389496/b/chocolope-kush__primary_ac30.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chocolope-kush_100x100_9a15.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/378328/b/chocolope-kush__primary_cefd.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chocolope-kush_100x100_21d2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Tucson, AZ",
        "Daly City, CA",
        "Detroit, MI",
        "Durango, CO",
        "Green Valley, AZ",
        "Newport, OR",
        "Nunica, MI",
        "Pueblo West, CO",
        "San Francisco, CA"
    ],
    "rating": 4.02,
    "relatedStrains": [],
    "reviewCount": 129,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "chocolope-kush",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.01550387596899/240",
    "subtitle": null,
    "symbol": "Cok",
    "symptoms": [
        {
            "name": "Stress",
            "score": 24.999999999999996
        },
        {
            "name": "Depression",
            "score": 20.83333333333333
        },
        {
            "name": "Pain",
            "score": 14.86111111111111
        },
        {
            "name": "Insomnia",
            "score": 4.722222222222222
        },
        {
            "name": "Nausea",
            "score": 2.9166666666666665
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
