{"sl_translate":"description,descriptionPlain,category","id":598,"slug":"sour-kush","name":"Sour Kush","subtitle":null,"symbol":"Sk","category":"Hybrid","description":"\u003cp class=\"p1\"\u003eThis cross between \u003ca href=\"http://www.leafly.com/sativa/sour-diesel\"\u003e\u003cspan class=\"s1\"\u003eSour Diesel \u003c/span\u003e\u003c/a\u003eand \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003e\u003cspan class=\"s1\"\u003eOG Kush\u003c/span\u003e\u003c/a\u003e\u0026nbsp;from DNA Genetics is a winning combination. For those looking for daytime pain relief, Sour Kush might be one of the best choices out there. Providing consumers with an uplifting experience without overwhelming sedative effects, this hybrid is great for day-to-day consumption. Sour Kush is slightly sativa-dominant, igniting a giggly and euphoric feeling. The indica effects, however, present themselves a few minutes after consumption. This strain is extremely pungent, so it\u0026rsquo;s best stored in tightly sealed containers.\u003c/p\u003e\n","descriptionPlain":"This cross between Sour Diesel and OG Kush\u0026nbsp;from DNA Genetics is a winning combination. For those looking for daytime pain relief, Sour Kush might be one of the best choices out there. Providing consumers with an uplifting experience without overwhelming sedative effects, this hybrid is great for day-to-day consumption. Sour Kush is slightly sativa-dominant, igniting a giggly and euphoric feeling. The indica effects, however, present themselves a few minutes after consumption. This strain is extremely pungent, so it\u0026rsquo;s best stored in tightly sealed containers.\n","aka":"Sour OG Kush, Sour Diesel OG, Sour OG","rating":4.31,"highlightedReviews":[{"id":1417939,"username":"wasserpol59","text":"Sour Kush is a mighty herb at that. Love it\u0027s aromatic, tangy bite and the high is what keeps enthusiasts like me coming back for more. Love any strain of sour. \r\n\r\n0:00; bowl of SK is smoked, almost instantaneously I am lifted. My heart rate increases slightly, then my head feels heavy, then things subside until I take another hit. \r\n+0:15; the high is already comfortable and onset wasn\u0027t anything. No anxiety, no holy-*\u0026$% I smoked way too much way too fast, nothing. Smooth sailing.\r\n+0:30; about to smoke another half-gram bowl before work. Things should be a breeze and I should get a lot done. \r\nThis is definitely an herb that doesn\u0027t knock you out or give you that \u0027stoned\u0027 feel. I mean, you\u0027ll be stoned, though you probably won\u0027t look it or feel the negative subjective effects that come with being stoned, fatigue, acting like a brick wall, virtually unable to complete or comprehend anything. No no, sirs and ma\u0027ams, this is an herb for motivation, unlike a previous review I wrote on Romulan. WOW.....","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"},{"id":1624919,"username":"emwyllie","text":"This strain was amazing for sleep aid. Even after the general head high wore off, I found the body relaxation lasted quite a bit longer. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3621","title":"Which Strains Did Leafly Users Consume on 4/20?","author":"Sara Dilley","category":null,"date":"\/Date(1429750800000)\/","text":"April 20th, or \"4/20\", is a day of celebration in the cannabis industry, and most consumers spent the day doing just that: consuming! We asked Leafly users on social media how they’d be spending the holiday, and the responses painted a colorful list of strains spanning the spectrum from euphoria-inducing sativas to pain-relieving indicas.\nHere’s a glimpse of what Leafly users consumed on this year\u0027s 4/20:\n \nGranddaddy Purple\n\nGranddaddy Purple, the famous cross of Purple Urkle and Big Bud, is a California staple that can be found all along the west coast. With a sweet grape and berry aroma, this powerful indica exhibits potent psychoactive effects that are felt in both the mind and body. Those who consumed GDP on 4/20 likely found their minds drifting toward a cerebral bliss while their bodies were firmly locked to the couch.\n \nJack Diesel\n\nIf you consumed Jack Diesel for the holiday, you were in for an exciting, energetic day. Jack Diesel is a cross of Jack Herer and NYC Diesel that brings on potent, long-lasting sativa effects. What begins as an uplifting buzz gives way to immediate relaxation, followed by an energetic, creative rush. A great choice for those who spent the day at events!\n \nJack Herer\n\nYou don’t have to be an activist to appreciate the blissful, clear-headed, creative effects of Jack Herer. Named for Jack Herer, the marijuana activist and author of The Emperor Wears No Clothes, this strain offers cerebral elevation while also boasting the heavy resin of indicas. Those who consumed Jack Herer for 4/20 were in for a day of truly joyous, energetic celebration!\n \nMango\n\nDon’t let Mango\u0027s namesake orange coloring fool you: this strain is indica all the way. If you smoked, vaporized, or otherwise consumed Mango on 4/20, you no doubt felt a wave of relaxation kick in almost immediately. Soothing relaxation quickly gives way to a blissful euphoria, leaving you ready and willing to celebrate even more!\n \nMaster Yoda\n\nHad a wonderful and relaxing 4/20 with Master Yoda, you did. This mostly indica buzz is peppered with an uplifting sativa balance that blends creativity and euphoria with the relaxing indica properties. The force is strong with this strain, and we have no doubt it enabled a truly other-worldly 4/20!\n \nNorthern Lights\n\nNorthern Lights is another strain best consumed by those who observed the holiday from the comforts of home. One of the most famous and beloved strains of all time, it exhibits pungently sweet, spicy aromas that radiate from crystal-coated buds. Northern Lights\u0027 pronounced relaxing effects resonate throughout the body, soothing muscles and calming the mind into blissful euphoria.\n \nPlatinum GSC (f.k.a Girl Scout Cookies)\n\nPlatinum GSC (f.k.a Girl Scout Cookies) is just the trick for patients who wanted to celebrate the holiday while also relieving their severe pain, nausea, swelling, migraines, or stress. After filling your nose with a berry sweetness, the effects of this strain melt away physical and mental symptoms of stress, leaving your mind clear and your body ready to celebrate 4/20 pain-free.\n \nSour Diesel\n\nKnown for its happy, uplifting euphoria, Sour Diesel is a great choice for patients and recreational consumers alike. Those who rung in the holiday with this strain were treated to fast-acting energy and dreamy cerebral effects that lasted throughout the day. A perfect choice for 4/20!\n \nSour Kush\n\nSour Kush is a citrus-flavored hybrid offers the best of both worlds: it provides consumers an uplifting experience without overwhelming sedative effects, but it also delivers powerful pain relief. For this reason, it’s a great daytime strain for medical patients seeking relief. On 4/20, Sour Kush delivered the pain-relieving qualities you needed without sacrificing your energy.\n \nWhite Widow\n\nWhite Widow has achieved worldwide fame and it’s no wonder that Leafly users chose to celebrate the biggest industry holiday with this classic. The hybrid delivers a powerful burst of euphoria and energy from the start, boosting creativity and conversation. A blissful state of mind follows, leaving you ready for anything that comes your way. A truly great fit for any 4/20 itinerary!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12003021/which-strains-did-leafly-users-consume-on-420.jpg","urlslug":"/news/strains-products/which-strains-did-leafly-users-consume-on-420"},{"id":"contentitems-3303","title":"New Strains Alert: Green Lantern, Black Cherry OG, Cosmic Collision, Medibud, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1428080400000)\/","text":"It\u0027s Friday and you know what that means: new strains! Oh yeah. Here are just 10 of the many new varieties added to the Leafly database this week. If any of them look familiar to you, leave a review sharing your thoughts! Also, be sure to check out more details on where to find these strains near you by navigating to their strain pages. Happy strain hunting!\n \n   1. Pineapple Purple Skunk\n\nBred by MTG Seeds, Pineapple Purple Skunk is a hybrid cannabis strain that combines Pineapple and Purple Skunk genetics. Together, these parent strains pass on a sweet and sour blend of fruity and berry flavors. Pineapple Purple Skunk blooms in vibrant hues of purple and green and shows resilience against mold.\n\n \n   2. Green Lantern\n\nGreen Lantern is a mostly sativa strain whose undocumented history poses frustrations for genetic enthusiasts. While some rumors mark the 1960s as Green Lantern’s beginning, others tell us that Green Lantern is a newer strain that resulted from crossing Green Crack and White Rhino. Whatever its parentage may be, Green Lantern inherits mellow euphoric effects and a peppery pine aroma comparable to that of Jack Herer. Its aroma suggests the presence of caryophyllene and pinene, which are terpenes that fight inflammation and promote focus.\n\n \n   3. Afghan Sour Kush\n\nAfghan Sour Kush is an indica-dominant cross between Afghani and Sour Kush. Its heavy, relaxing effects are ushered in by a sweet berry aroma and a sharp spicy flavor typical of Kush varieties. Stout and sturdy, Afghan Sour Kush plants have tight internodal spacing and finish flowering in about 60 days.\n\n \n   4. Medibud\n\nMedibud (or Medi Bud) is an uplifting hybrid strain of unknown genetic origins, but many attribute its upbeat, active effects to sativa parentage. Others claim Medibud is a 60/40 indica-dominant cross, so it’s possible that this strain expresses itself in various phenotypes. Typically, you can expect high-energy euphoria and heightened sensory awareness from Medibud, but its indica-leaning phenotypes may induce heavier, more relaxing effects.\n\n \n   5. Black Cherry OG\n\nBlack Cherry OG is an indica strain bred by Grand Daddy Purple that combines Ken’s OG with an unknown Granddaddy Purple hybrid. Dense buds take on an intense purple hue at the end of Black Cherry OG’s maturation and develop a sweet aroma like fruity tea. Relaxing full-body effects take over, ridding you of pain and insomnia while lifting the mood.\n\n \n   6. Cosmic Collision\n\nCosmic Collision is a sativa-dominant strain from MTG Seeds, who crossed Cosmic Charlie and Piña Collision into a fusion that boasts both flavor and potency. The exhale releases a tropical medley of pineapple and kiwi that hints at the Pineapple in this strain’s lineage. Uplifting and euphoric, Cosmic Collision offers a brighter outlook for those suffering from stress and depression.\n\n \n   7. Heaven Scent\n\nHeaven Scent is a hybrid cannabis strain that crosses genetics from God’s Gift and Green Crack. The polar opposite effects of its indica and sativa parents meet halfway, delivering you to a balanced state of blissful, relaxed happiness. Its buds express themselves in hues that range from deep blue to dark purple.\n\n \n   8. Godfather Purple Kush\n\nGodfather Purple Kush is an indica-dominant cross between Godfather, Purple Kush, and Afghani. This trifecta of indica genetics come together to produce heavy effects that ease your mind and body into full relaxation. Its dark purple buds give off an earthy, spicy aroma accented by sweet notes of berry.\n\n \n   9. Sour Strawberry Diesel\n\nSour Strawberry Diesel is a hybrid cross between Sour Strawberry and Turbo Diesel. With a sweet and spicy aroma, Sour Strawberry Diesel delivers a warm, uplifting buzz that melts away stress and bad moods. Its flowers grow into chunky buds with red and purple hues following its 8 to 9 week flowering cycle.\n\n \n   10. Cherry Diesel\n\nCherry Diesel combines Cherry OG and Turbo Diesel into one sweet-smelling, uplifting hybrid strain. Its plants bloom with dense, sticky buds that give off a fragrant cherry aroma after its 8 to 9 week flowering cycle.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12002141/new-strains-alert-green-lantern-black-cherry-og-cosmic-collision.png","urlslug":"/news/strains-products/new-strains-alert-green-lantern-black-cherry-og-cosmic-collision"}],"reviewCount":523,"flavors":[{"name":"Pungent","score":29.578600537587793},{"name":"Diesel","score":24.076013757623052},{"name":"Earthy","score":18.310933842018557},{"name":"Skunk","score":10.038006878811526},{"name":"Woody","score":9.1730974883667145}],"effects":[{"name":"Relaxed","score":76.409491603803573},{"name":"Happy","score":54.735888320471688},{"name":"Euphoric","score":53.553686522731873},{"name":"Uplifted","score":50.4217751958149},{"name":"Focused","score":27.097979710396256}],"symptoms":[{"name":"Pain","score":34.55169224544062},{"name":"Stress","score":34.042082141102341},{"name":"Depression","score":30.023960230064453},{"name":"Headaches","score":14.112691118240411},{"name":"Lack of Appetite","score":13.693141420272262}],"conditions":[{"name":"Anxiety","score":25.131477788375385},{"name":"PTSD","score":11.37134021214486},{"name":"ADD/ADHD","score":10.869418191277205},{"name":"Arthritis","score":10.169253446631405},{"name":"Bipolar Disorder","score":7.7085175872135023}],"negatives":[{"name":"Dry Mouth","score":29.110176594699269},{"name":"Dizzy","score":9.8732622330125146},{"name":"Paranoid","score":8.0868811237319},{"name":"Dry Eyes","score":6.1339923119165292},{"name":"Anxious","score":5.7985779935836295}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/sour-kush/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/sour-kush/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_cfee.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002629/b/sour-kush__primary_cfb8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_960e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001157/b/sour-kush__primary_a549.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_6189.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/672110/b/sour-kush__primary_d19d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_2580.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/660972/b/sour-kush__primary_e0a3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_4117.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617296/b/sour-kush__primary_1ce6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_706d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617171/b/sour-kush__primary_948f.jpg"}],"photoTotalCount":129,"popularCities":["Portland, OR","Detroit, MI","Los Angeles, CA","Montréal, QC","Calgary, AB","Edmonton, AB","San Diego, CA","Seattle, WA","Spokane, WA","Winnipeg, MB"],"permalink":"https://mobileapi.leafly.com/hybrid/sour-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.30592734225621/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Sour Diesel","subtitle":null,"slug":"sour-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/sour-diesel","symbol":"Sd","applink":"leafly://strain/sour-diesel"},{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":67,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":598,"slug":"sour-kush","name":"Sour Kush","subtitle":null,"symbol":"Sk","category":"Hybrid","description":"\u003cp class=\"p1\"\u003eThis cross between \u003ca href=\"http://www.leafly.com/sativa/sour-diesel\"\u003e\u003cspan class=\"s1\"\u003eSour Diesel \u003c/span\u003e\u003c/a\u003eand \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003e\u003cspan class=\"s1\"\u003eOG Kush\u003c/span\u003e\u003c/a\u003e\u0026nbsp;from DNA Genetics is a winning combination. For those looking for daytime pain relief, Sour Kush might be one of the best choices out there. Providing consumers with an uplifting experience without overwhelming sedative effects, this hybrid is great for day-to-day consumption. Sour Kush is slightly sativa-dominant, igniting a giggly and euphoric feeling. The indica effects, however, present themselves a few minutes after consumption. This strain is extremely pungent, so it\u0026rsquo;s best stored in tightly sealed containers.\u003c/p\u003e\n","descriptionPlain":"This cross between Sour Diesel and OG Kush\u0026nbsp;from DNA Genetics is a winning combination. For those looking for daytime pain relief, Sour Kush might be one of the best choices out there. Providing consumers with an uplifting experience without overwhelming sedative effects, this hybrid is great for day-to-day consumption. Sour Kush is slightly sativa-dominant, igniting a giggly and euphoric feeling. The indica effects, however, present themselves a few minutes after consumption. This strain is extremely pungent, so it\u0026rsquo;s best stored in tightly sealed containers.\n","aka":"Sour OG Kush, Sour Diesel OG, Sour OG","rating":4.31,"highlightedReviews":[{"id":1417939,"username":"wasserpol59","text":"Sour Kush is a mighty herb at that. Love it\u0027s aromatic, tangy bite and the high is what keeps enthusiasts like me coming back for more. Love any strain of sour. \r\n\r\n0:00; bowl of SK is smoked, almost instantaneously I am lifted. My heart rate increases slightly, then my head feels heavy, then things subside until I take another hit. \r\n+0:15; the high is already comfortable and onset wasn\u0027t anything. No anxiety, no holy-*\u0026$% I smoked way too much way too fast, nothing. Smooth sailing.\r\n+0:30; about to smoke another half-gram bowl before work. Things should be a breeze and I should get a lot done. \r\nThis is definitely an herb that doesn\u0027t knock you out or give you that \u0027stoned\u0027 feel. I mean, you\u0027ll be stoned, though you probably won\u0027t look it or feel the negative subjective effects that come with being stoned, fatigue, acting like a brick wall, virtually unable to complete or comprehend anything. No no, sirs and ma\u0027ams, this is an herb for motivation, unlike a previous review I wrote on Romulan. WOW.....","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"},{"id":1624919,"username":"emwyllie","text":"This strain was amazing for sleep aid. Even after the general head high wore off, I found the body relaxation lasted quite a bit longer. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3621","title":"Which Strains Did Leafly Users Consume on 4/20?","author":"Sara Dilley","category":null,"date":"\/Date(1429750800000)\/","text":"April 20th, or \"4/20\", is a day of celebration in the cannabis industry, and most consumers spent the day doing just that: consuming! We asked Leafly users on social media how they’d be spending the holiday, and the responses painted a colorful list of strains spanning the spectrum from euphoria-inducing sativas to pain-relieving indicas.\nHere’s a glimpse of what Leafly users consumed on this year\u0027s 4/20:\n \nGranddaddy Purple\n\nGranddaddy Purple, the famous cross of Purple Urkle and Big Bud, is a California staple that can be found all along the west coast. With a sweet grape and berry aroma, this powerful indica exhibits potent psychoactive effects that are felt in both the mind and body. Those who consumed GDP on 4/20 likely found their minds drifting toward a cerebral bliss while their bodies were firmly locked to the couch.\n \nJack Diesel\n\nIf you consumed Jack Diesel for the holiday, you were in for an exciting, energetic day. Jack Diesel is a cross of Jack Herer and NYC Diesel that brings on potent, long-lasting sativa effects. What begins as an uplifting buzz gives way to immediate relaxation, followed by an energetic, creative rush. A great choice for those who spent the day at events!\n \nJack Herer\n\nYou don’t have to be an activist to appreciate the blissful, clear-headed, creative effects of Jack Herer. Named for Jack Herer, the marijuana activist and author of The Emperor Wears No Clothes, this strain offers cerebral elevation while also boasting the heavy resin of indicas. Those who consumed Jack Herer for 4/20 were in for a day of truly joyous, energetic celebration!\n \nMango\n\nDon’t let Mango\u0027s namesake orange coloring fool you: this strain is indica all the way. If you smoked, vaporized, or otherwise consumed Mango on 4/20, you no doubt felt a wave of relaxation kick in almost immediately. Soothing relaxation quickly gives way to a blissful euphoria, leaving you ready and willing to celebrate even more!\n \nMaster Yoda\n\nHad a wonderful and relaxing 4/20 with Master Yoda, you did. This mostly indica buzz is peppered with an uplifting sativa balance that blends creativity and euphoria with the relaxing indica properties. The force is strong with this strain, and we have no doubt it enabled a truly other-worldly 4/20!\n \nNorthern Lights\n\nNorthern Lights is another strain best consumed by those who observed the holiday from the comforts of home. One of the most famous and beloved strains of all time, it exhibits pungently sweet, spicy aromas that radiate from crystal-coated buds. Northern Lights\u0027 pronounced relaxing effects resonate throughout the body, soothing muscles and calming the mind into blissful euphoria.\n \nPlatinum GSC (f.k.a Girl Scout Cookies)\n\nPlatinum GSC (f.k.a Girl Scout Cookies) is just the trick for patients who wanted to celebrate the holiday while also relieving their severe pain, nausea, swelling, migraines, or stress. After filling your nose with a berry sweetness, the effects of this strain melt away physical and mental symptoms of stress, leaving your mind clear and your body ready to celebrate 4/20 pain-free.\n \nSour Diesel\n\nKnown for its happy, uplifting euphoria, Sour Diesel is a great choice for patients and recreational consumers alike. Those who rung in the holiday with this strain were treated to fast-acting energy and dreamy cerebral effects that lasted throughout the day. A perfect choice for 4/20!\n \nSour Kush\n\nSour Kush is a citrus-flavored hybrid offers the best of both worlds: it provides consumers an uplifting experience without overwhelming sedative effects, but it also delivers powerful pain relief. For this reason, it’s a great daytime strain for medical patients seeking relief. On 4/20, Sour Kush delivered the pain-relieving qualities you needed without sacrificing your energy.\n \nWhite Widow\n\nWhite Widow has achieved worldwide fame and it’s no wonder that Leafly users chose to celebrate the biggest industry holiday with this classic. The hybrid delivers a powerful burst of euphoria and energy from the start, boosting creativity and conversation. A blissful state of mind follows, leaving you ready for anything that comes your way. A truly great fit for any 4/20 itinerary!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12003021/which-strains-did-leafly-users-consume-on-420.jpg","urlslug":"/news/strains-products/which-strains-did-leafly-users-consume-on-420"},{"id":"contentitems-3303","title":"New Strains Alert: Green Lantern, Black Cherry OG, Cosmic Collision, Medibud, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1428080400000)\/","text":"It\u0027s Friday and you know what that means: new strains! Oh yeah. Here are just 10 of the many new varieties added to the Leafly database this week. If any of them look familiar to you, leave a review sharing your thoughts! Also, be sure to check out more details on where to find these strains near you by navigating to their strain pages. Happy strain hunting!\n \n   1. Pineapple Purple Skunk\n\nBred by MTG Seeds, Pineapple Purple Skunk is a hybrid cannabis strain that combines Pineapple and Purple Skunk genetics. Together, these parent strains pass on a sweet and sour blend of fruity and berry flavors. Pineapple Purple Skunk blooms in vibrant hues of purple and green and shows resilience against mold.\n\n \n   2. Green Lantern\n\nGreen Lantern is a mostly sativa strain whose undocumented history poses frustrations for genetic enthusiasts. While some rumors mark the 1960s as Green Lantern’s beginning, others tell us that Green Lantern is a newer strain that resulted from crossing Green Crack and White Rhino. Whatever its parentage may be, Green Lantern inherits mellow euphoric effects and a peppery pine aroma comparable to that of Jack Herer. Its aroma suggests the presence of caryophyllene and pinene, which are terpenes that fight inflammation and promote focus.\n\n \n   3. Afghan Sour Kush\n\nAfghan Sour Kush is an indica-dominant cross between Afghani and Sour Kush. Its heavy, relaxing effects are ushered in by a sweet berry aroma and a sharp spicy flavor typical of Kush varieties. Stout and sturdy, Afghan Sour Kush plants have tight internodal spacing and finish flowering in about 60 days.\n\n \n   4. Medibud\n\nMedibud (or Medi Bud) is an uplifting hybrid strain of unknown genetic origins, but many attribute its upbeat, active effects to sativa parentage. Others claim Medibud is a 60/40 indica-dominant cross, so it’s possible that this strain expresses itself in various phenotypes. Typically, you can expect high-energy euphoria and heightened sensory awareness from Medibud, but its indica-leaning phenotypes may induce heavier, more relaxing effects.\n\n \n   5. Black Cherry OG\n\nBlack Cherry OG is an indica strain bred by Grand Daddy Purple that combines Ken’s OG with an unknown Granddaddy Purple hybrid. Dense buds take on an intense purple hue at the end of Black Cherry OG’s maturation and develop a sweet aroma like fruity tea. Relaxing full-body effects take over, ridding you of pain and insomnia while lifting the mood.\n\n \n   6. Cosmic Collision\n\nCosmic Collision is a sativa-dominant strain from MTG Seeds, who crossed Cosmic Charlie and Piña Collision into a fusion that boasts both flavor and potency. The exhale releases a tropical medley of pineapple and kiwi that hints at the Pineapple in this strain’s lineage. Uplifting and euphoric, Cosmic Collision offers a brighter outlook for those suffering from stress and depression.\n\n \n   7. Heaven Scent\n\nHeaven Scent is a hybrid cannabis strain that crosses genetics from God’s Gift and Green Crack. The polar opposite effects of its indica and sativa parents meet halfway, delivering you to a balanced state of blissful, relaxed happiness. Its buds express themselves in hues that range from deep blue to dark purple.\n\n \n   8. Godfather Purple Kush\n\nGodfather Purple Kush is an indica-dominant cross between Godfather, Purple Kush, and Afghani. This trifecta of indica genetics come together to produce heavy effects that ease your mind and body into full relaxation. Its dark purple buds give off an earthy, spicy aroma accented by sweet notes of berry.\n\n \n   9. Sour Strawberry Diesel\n\nSour Strawberry Diesel is a hybrid cross between Sour Strawberry and Turbo Diesel. With a sweet and spicy aroma, Sour Strawberry Diesel delivers a warm, uplifting buzz that melts away stress and bad moods. Its flowers grow into chunky buds with red and purple hues following its 8 to 9 week flowering cycle.\n\n \n   10. Cherry Diesel\n\nCherry Diesel combines Cherry OG and Turbo Diesel into one sweet-smelling, uplifting hybrid strain. Its plants bloom with dense, sticky buds that give off a fragrant cherry aroma after its 8 to 9 week flowering cycle.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12002141/new-strains-alert-green-lantern-black-cherry-og-cosmic-collision.png","urlslug":"/news/strains-products/new-strains-alert-green-lantern-black-cherry-og-cosmic-collision"}],"reviewCount":523,"flavors":[{"name":"Pungent","score":29.578600537587793},{"name":"Diesel","score":24.076013757623052},{"name":"Earthy","score":18.310933842018557},{"name":"Skunk","score":10.038006878811526},{"name":"Woody","score":9.1730974883667145}],"effects":[{"name":"Relaxed","score":76.409491603803573},{"name":"Happy","score":54.735888320471688},{"name":"Euphoric","score":53.553686522731873},{"name":"Uplifted","score":50.4217751958149},{"name":"Focused","score":27.097979710396256}],"symptoms":[{"name":"Pain","score":34.55169224544062},{"name":"Stress","score":34.042082141102341},{"name":"Depression","score":30.023960230064453},{"name":"Headaches","score":14.112691118240411},{"name":"Lack of Appetite","score":13.693141420272262}],"conditions":[{"name":"Anxiety","score":25.131477788375385},{"name":"PTSD","score":11.37134021214486},{"name":"ADD/ADHD","score":10.869418191277205},{"name":"Arthritis","score":10.169253446631405},{"name":"Bipolar Disorder","score":7.7085175872135023}],"negatives":[{"name":"Dry Mouth","score":29.110176594699269},{"name":"Dizzy","score":9.8732622330125146},{"name":"Paranoid","score":8.0868811237319},{"name":"Dry Eyes","score":6.1339923119165292},{"name":"Anxious","score":5.7985779935836295}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/sour-kush/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/sour-kush/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_cfee.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002629/b/sour-kush__primary_cfb8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_960e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001157/b/sour-kush__primary_a549.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_6189.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/672110/b/sour-kush__primary_d19d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_2580.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/660972/b/sour-kush__primary_e0a3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_4117.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617296/b/sour-kush__primary_1ce6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_706d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617171/b/sour-kush__primary_948f.jpg"}],"photoTotalCount":129,"popularCities":["Portland, OR","Detroit, MI","Los Angeles, CA","Montréal, QC","Calgary, AB","Edmonton, AB","San Diego, CA","Seattle, WA","Spokane, WA","Winnipeg, MB"],"permalink":"https://mobileapi.leafly.com/hybrid/sour-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.30592734225621/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Sour Diesel","subtitle":null,"slug":"sour-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/sour-diesel","symbol":"Sd","applink":"leafly://strain/sour-diesel"},{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":67,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":598,"slug":"sour-kush","name":"Sour Kush","subtitle":null,"symbol":"Sk","category":"Hybrid","description":"\u003cp class=\"p1\"\u003eThis cross between \u003ca href=\"http://www.leafly.com/sativa/sour-diesel\"\u003e\u003cspan class=\"s1\"\u003eSour Diesel \u003c/span\u003e\u003c/a\u003eand \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003e\u003cspan class=\"s1\"\u003eOG Kush\u003c/span\u003e\u003c/a\u003e\u0026nbsp;from DNA Genetics is a winning combination. For those looking for daytime pain relief, Sour Kush might be one of the best choices out there. Providing consumers with an uplifting experience without overwhelming sedative effects, this hybrid is great for day-to-day consumption. Sour Kush is slightly sativa-dominant, igniting a giggly and euphoric feeling. The indica effects, however, present themselves a few minutes after consumption. This strain is extremely pungent, so it\u0026rsquo;s best stored in tightly sealed containers.\u003c/p\u003e\n","descriptionPlain":"This cross between Sour Diesel and OG Kush\u0026nbsp;from DNA Genetics is a winning combination. For those looking for daytime pain relief, Sour Kush might be one of the best choices out there. Providing consumers with an uplifting experience without overwhelming sedative effects, this hybrid is great for day-to-day consumption. Sour Kush is slightly sativa-dominant, igniting a giggly and euphoric feeling. The indica effects, however, present themselves a few minutes after consumption. This strain is extremely pungent, so it\u0026rsquo;s best stored in tightly sealed containers.\n","aka":"Sour OG Kush, Sour Diesel OG, Sour OG","rating":4.31,"highlightedReviews":[{"id":1417939,"username":"wasserpol59","text":"Sour Kush is a mighty herb at that. Love it\u0027s aromatic, tangy bite and the high is what keeps enthusiasts like me coming back for more. Love any strain of sour. \r\n\r\n0:00; bowl of SK is smoked, almost instantaneously I am lifted. My heart rate increases slightly, then my head feels heavy, then things subside until I take another hit. \r\n+0:15; the high is already comfortable and onset wasn\u0027t anything. No anxiety, no holy-*\u0026$% I smoked way too much way too fast, nothing. Smooth sailing.\r\n+0:30; about to smoke another half-gram bowl before work. Things should be a breeze and I should get a lot done. \r\nThis is definitely an herb that doesn\u0027t knock you out or give you that \u0027stoned\u0027 feel. I mean, you\u0027ll be stoned, though you probably won\u0027t look it or feel the negative subjective effects that come with being stoned, fatigue, acting like a brick wall, virtually unable to complete or comprehend anything. No no, sirs and ma\u0027ams, this is an herb for motivation, unlike a previous review I wrote on Romulan. WOW.....","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"},{"id":1624919,"username":"emwyllie","text":"This strain was amazing for sleep aid. Even after the general head high wore off, I found the body relaxation lasted quite a bit longer. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3621","title":"Which Strains Did Leafly Users Consume on 4/20?","author":"Sara Dilley","category":null,"date":"\/Date(1429750800000)\/","text":"April 20th, or \"4/20\", is a day of celebration in the cannabis industry, and most consumers spent the day doing just that: consuming! We asked Leafly users on social media how they’d be spending the holiday, and the responses painted a colorful list of strains spanning the spectrum from euphoria-inducing sativas to pain-relieving indicas.\nHere’s a glimpse of what Leafly users consumed on this year\u0027s 4/20:\n \nGranddaddy Purple\n\nGranddaddy Purple, the famous cross of Purple Urkle and Big Bud, is a California staple that can be found all along the west coast. With a sweet grape and berry aroma, this powerful indica exhibits potent psychoactive effects that are felt in both the mind and body. Those who consumed GDP on 4/20 likely found their minds drifting toward a cerebral bliss while their bodies were firmly locked to the couch.\n \nJack Diesel\n\nIf you consumed Jack Diesel for the holiday, you were in for an exciting, energetic day. Jack Diesel is a cross of Jack Herer and NYC Diesel that brings on potent, long-lasting sativa effects. What begins as an uplifting buzz gives way to immediate relaxation, followed by an energetic, creative rush. A great choice for those who spent the day at events!\n \nJack Herer\n\nYou don’t have to be an activist to appreciate the blissful, clear-headed, creative effects of Jack Herer. Named for Jack Herer, the marijuana activist and author of The Emperor Wears No Clothes, this strain offers cerebral elevation while also boasting the heavy resin of indicas. Those who consumed Jack Herer for 4/20 were in for a day of truly joyous, energetic celebration!\n \nMango\n\nDon’t let Mango\u0027s namesake orange coloring fool you: this strain is indica all the way. If you smoked, vaporized, or otherwise consumed Mango on 4/20, you no doubt felt a wave of relaxation kick in almost immediately. Soothing relaxation quickly gives way to a blissful euphoria, leaving you ready and willing to celebrate even more!\n \nMaster Yoda\n\nHad a wonderful and relaxing 4/20 with Master Yoda, you did. This mostly indica buzz is peppered with an uplifting sativa balance that blends creativity and euphoria with the relaxing indica properties. The force is strong with this strain, and we have no doubt it enabled a truly other-worldly 4/20!\n \nNorthern Lights\n\nNorthern Lights is another strain best consumed by those who observed the holiday from the comforts of home. One of the most famous and beloved strains of all time, it exhibits pungently sweet, spicy aromas that radiate from crystal-coated buds. Northern Lights\u0027 pronounced relaxing effects resonate throughout the body, soothing muscles and calming the mind into blissful euphoria.\n \nPlatinum GSC (f.k.a Girl Scout Cookies)\n\nPlatinum GSC (f.k.a Girl Scout Cookies) is just the trick for patients who wanted to celebrate the holiday while also relieving their severe pain, nausea, swelling, migraines, or stress. After filling your nose with a berry sweetness, the effects of this strain melt away physical and mental symptoms of stress, leaving your mind clear and your body ready to celebrate 4/20 pain-free.\n \nSour Diesel\n\nKnown for its happy, uplifting euphoria, Sour Diesel is a great choice for patients and recreational consumers alike. Those who rung in the holiday with this strain were treated to fast-acting energy and dreamy cerebral effects that lasted throughout the day. A perfect choice for 4/20!\n \nSour Kush\n\nSour Kush is a citrus-flavored hybrid offers the best of both worlds: it provides consumers an uplifting experience without overwhelming sedative effects, but it also delivers powerful pain relief. For this reason, it’s a great daytime strain for medical patients seeking relief. On 4/20, Sour Kush delivered the pain-relieving qualities you needed without sacrificing your energy.\n \nWhite Widow\n\nWhite Widow has achieved worldwide fame and it’s no wonder that Leafly users chose to celebrate the biggest industry holiday with this classic. The hybrid delivers a powerful burst of euphoria and energy from the start, boosting creativity and conversation. A blissful state of mind follows, leaving you ready for anything that comes your way. A truly great fit for any 4/20 itinerary!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12003021/which-strains-did-leafly-users-consume-on-420.jpg","urlslug":"/news/strains-products/which-strains-did-leafly-users-consume-on-420"},{"id":"contentitems-3303","title":"New Strains Alert: Green Lantern, Black Cherry OG, Cosmic Collision, Medibud, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1428080400000)\/","text":"It\u0027s Friday and you know what that means: new strains! Oh yeah. Here are just 10 of the many new varieties added to the Leafly database this week. If any of them look familiar to you, leave a review sharing your thoughts! Also, be sure to check out more details on where to find these strains near you by navigating to their strain pages. Happy strain hunting!\n \n   1. Pineapple Purple Skunk\n\nBred by MTG Seeds, Pineapple Purple Skunk is a hybrid cannabis strain that combines Pineapple and Purple Skunk genetics. Together, these parent strains pass on a sweet and sour blend of fruity and berry flavors. Pineapple Purple Skunk blooms in vibrant hues of purple and green and shows resilience against mold.\n\n \n   2. Green Lantern\n\nGreen Lantern is a mostly sativa strain whose undocumented history poses frustrations for genetic enthusiasts. While some rumors mark the 1960s as Green Lantern’s beginning, others tell us that Green Lantern is a newer strain that resulted from crossing Green Crack and White Rhino. Whatever its parentage may be, Green Lantern inherits mellow euphoric effects and a peppery pine aroma comparable to that of Jack Herer. Its aroma suggests the presence of caryophyllene and pinene, which are terpenes that fight inflammation and promote focus.\n\n \n   3. Afghan Sour Kush\n\nAfghan Sour Kush is an indica-dominant cross between Afghani and Sour Kush. Its heavy, relaxing effects are ushered in by a sweet berry aroma and a sharp spicy flavor typical of Kush varieties. Stout and sturdy, Afghan Sour Kush plants have tight internodal spacing and finish flowering in about 60 days.\n\n \n   4. Medibud\n\nMedibud (or Medi Bud) is an uplifting hybrid strain of unknown genetic origins, but many attribute its upbeat, active effects to sativa parentage. Others claim Medibud is a 60/40 indica-dominant cross, so it’s possible that this strain expresses itself in various phenotypes. Typically, you can expect high-energy euphoria and heightened sensory awareness from Medibud, but its indica-leaning phenotypes may induce heavier, more relaxing effects.\n\n \n   5. Black Cherry OG\n\nBlack Cherry OG is an indica strain bred by Grand Daddy Purple that combines Ken’s OG with an unknown Granddaddy Purple hybrid. Dense buds take on an intense purple hue at the end of Black Cherry OG’s maturation and develop a sweet aroma like fruity tea. Relaxing full-body effects take over, ridding you of pain and insomnia while lifting the mood.\n\n \n   6. Cosmic Collision\n\nCosmic Collision is a sativa-dominant strain from MTG Seeds, who crossed Cosmic Charlie and Piña Collision into a fusion that boasts both flavor and potency. The exhale releases a tropical medley of pineapple and kiwi that hints at the Pineapple in this strain’s lineage. Uplifting and euphoric, Cosmic Collision offers a brighter outlook for those suffering from stress and depression.\n\n \n   7. Heaven Scent\n\nHeaven Scent is a hybrid cannabis strain that crosses genetics from God’s Gift and Green Crack. The polar opposite effects of its indica and sativa parents meet halfway, delivering you to a balanced state of blissful, relaxed happiness. Its buds express themselves in hues that range from deep blue to dark purple.\n\n \n   8. Godfather Purple Kush\n\nGodfather Purple Kush is an indica-dominant cross between Godfather, Purple Kush, and Afghani. This trifecta of indica genetics come together to produce heavy effects that ease your mind and body into full relaxation. Its dark purple buds give off an earthy, spicy aroma accented by sweet notes of berry.\n\n \n   9. Sour Strawberry Diesel\n\nSour Strawberry Diesel is a hybrid cross between Sour Strawberry and Turbo Diesel. With a sweet and spicy aroma, Sour Strawberry Diesel delivers a warm, uplifting buzz that melts away stress and bad moods. Its flowers grow into chunky buds with red and purple hues following its 8 to 9 week flowering cycle.\n\n \n   10. Cherry Diesel\n\nCherry Diesel combines Cherry OG and Turbo Diesel into one sweet-smelling, uplifting hybrid strain. Its plants bloom with dense, sticky buds that give off a fragrant cherry aroma after its 8 to 9 week flowering cycle.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12002141/new-strains-alert-green-lantern-black-cherry-og-cosmic-collision.png","urlslug":"/news/strains-products/new-strains-alert-green-lantern-black-cherry-og-cosmic-collision"}],"reviewCount":523,"flavors":[{"name":"Pungent","score":29.578600537587793},{"name":"Diesel","score":24.076013757623052},{"name":"Earthy","score":18.310933842018557},{"name":"Skunk","score":10.038006878811526},{"name":"Woody","score":9.1730974883667145}],"effects":[{"name":"Relaxed","score":76.409491603803573},{"name":"Happy","score":54.735888320471688},{"name":"Euphoric","score":53.553686522731873},{"name":"Uplifted","score":50.4217751958149},{"name":"Focused","score":27.097979710396256}],"symptoms":[{"name":"Pain","score":34.55169224544062},{"name":"Stress","score":34.042082141102341},{"name":"Depression","score":30.023960230064453},{"name":"Headaches","score":14.112691118240411},{"name":"Lack of Appetite","score":13.693141420272262}],"conditions":[{"name":"Anxiety","score":25.131477788375385},{"name":"PTSD","score":11.37134021214486},{"name":"ADD/ADHD","score":10.869418191277205},{"name":"Arthritis","score":10.169253446631405},{"name":"Bipolar Disorder","score":7.7085175872135023}],"negatives":[{"name":"Dry Mouth","score":29.110176594699269},{"name":"Dizzy","score":9.8732622330125146},{"name":"Paranoid","score":8.0868811237319},{"name":"Dry Eyes","score":6.1339923119165292},{"name":"Anxious","score":5.7985779935836295}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/sour-kush/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/sour-kush/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_cfee.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002629/b/sour-kush__primary_cfb8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_960e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001157/b/sour-kush__primary_a549.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_6189.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/672110/b/sour-kush__primary_d19d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_2580.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/660972/b/sour-kush__primary_e0a3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_4117.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617296/b/sour-kush__primary_1ce6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-kush_100x100_706d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617171/b/sour-kush__primary_948f.jpg"}],"photoTotalCount":129,"popularCities":["Portland, OR","Detroit, MI","Los Angeles, CA","Montréal, QC","Calgary, AB","Edmonton, AB","San Diego, CA","Seattle, WA","Spokane, WA","Winnipeg, MB"],"permalink":"https://mobileapi.leafly.com/hybrid/sour-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.30592734225621/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Sour Diesel","subtitle":null,"slug":"sour-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/sour-diesel","symbol":"Sd","applink":"leafly://strain/sour-diesel"},{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":67,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
