{
    "aka": "Three Kings, the three kings",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Rebecca Kelley",
            "category": null,
            "date": "/Date(1405011600000)/",
            "id": "contentitems-3009",
            "text": "Ever since Pope Francis (née Jorge Mario Bergoglio) was elected to succeed Pope Benedict XVI on March 13, 2013, the world has for the most part responded positively to His Holiness' behavior at the top of the religious food chain. As of December 2013, 88% of American Catholics approve of how he's handling his role as head of the Catholic church, and even non-religious people admire Pope Francis' humility, his vow to live simply, his acts of compassion, and his love for and acceptance of folks from all walks of life. Dude was even a bar bouncer and a janitor before becoming a priest. What's not to like about him? \nWell, it turns out pope-in' ain't easy, and as much as I admire Pope Francis for being the pope-iest Pope to come along in decades, he holds one opinion that broke my little heathen heart. Last week, he condemned efforts to legalize cannabis, saying that limited attempts to legalize recreational drugs \"are not only highly questionable from a legislative standpoint, but they fail to produce the desired effects.\" He also added, \"the problem of drug use is not solved with drugs!\"\nPope Francis, I get where you're coming from. You've previously spoken out against the evils of drug addiction, so I can see how you'd be wary about cannabis legalization. However, cannabis is far less addictive (9-10%) than tobacco smokers (20%-30%), heroin users (23-25%), alcohol users (15%), and cocaine users (15%-20%), plus it has therapeutic and medical benefits.\nMaybe you need a little bit of cannabis education, Mr. Pope. For instance, did you know that cannabis and religion often go hand-in-hand? It's true! As a matter of fact, I've got a list of nine strains that I think are right up your pious alley. Check out a few of these holy wonders and you'll see that cannabis isn't so bad, after all. \n1. 3 Kings\nIn the biblical sense, the Three Kings, also known as the biblical Magi or the three Wise Men (not to be confused with the \"Ooohhhhh a wise guy, eh?\" schtick of the Three Stooges) were a trio of foreigners who visited Jesus after his birth. They brought gifts of gold, frankincense, and myrrh because they had no idea what sort of thing newborn babies are into (in hindsight, burping cloths and a Baby Bjorn would have probably been more ideal than pungent tree resin, though the gold was a classy touch).\nWhat better way to commemorate the birth of baby Jesus than with the hybrid 3 Kings strain, known for its appropriately piney, pungent smell and its euphoric, happy effects. Pair it with Dream Star to simulate the Star of Bethlehem and you've got yourself a pretty uplifting birthday celebration.\n2. Endless Sky\nIsn't heaven supposed to be some sort of Endless Sky where everyone lives on a fluffy cloud and gets free access to Backstreet Boys concerts? If so, let its indica counterpart bring you relaxation so you can dream about the day you get to meet your maker and high-five Him for inviting you through the pearly gates.\n3. Holy Grail Kush\nThe Holy Grail has had quite the heyday in pop culture, from Monty Python to Indiana Jones. There's no way you're not an Indiana Jones fan, Mr. Pope, so I strongly recommend you partake in this woody hybrid while commemorating the supposed vessel of the Last Supper with a viewing of the 1989 classic. Just know with Holy Grail Kush, you have chosen wisely.\n4. Jesus OG\nTry the indica named after Mr. JC himself, Jesus OG. Its citrus, earthy flavors and focused effects may channel the power of Christ to compel you to pair it with the hybrid Bio-Jesus, a euphoric hybrid that provides exceptional pain relief. That's double the Jesus in one session — think of it as hitting up church twice on the same Sunday.\n5. Soul Shine\nNot to be confused with Soul Glo (just let your soooooooooullllll glowwwwwwww!), Soul Shine is an arousing hybrid that will amplify your love for the man upstairs. (Not the dude who lives in the apartment above yours, I mean the actual Man Upstairs.) As Pope, I imagine you've got one of the shiniest souls around, so this is a great option for someone with your sparkly innards.\n6. Lamb's Bread\nIn religious terms, lamb's bread is also known as sacramental bread, the body of Christ, altar bread, or Communion bread. It's used in the Christian ritual of the Eucharist/Holy Communion, where Christians accept a sacrament in the form of a piece of bread or cracker and a sip of wine or grape juice. In cannabis terms, Lamb's Bread is an earthy sativa that brings euphoric, uplifting, and creative effects. That sounds like a better Communion offering to me, don't you agree, Pope? Think of how much more amazing the church songs would be once the congregation gets their creative juices flowing (and we all know Christian hymns could use some oomph).    \n7. Trinity\nThe Trinity in Christian terms describes God as three expressions: the Father, the Son (aka Jesus), and the Holy Spirit. If God is a hybrid of these three, it's only fitting that the Trinity cannabis strain is also a hybrid (though I would hope God isn't as skunky-smelling). Try this one out for its trio of happy, uplifting, and energetic qualities and you'll think three is a magic number, indeed.\n8. Exodus Cheese\nThe Book of Exodus tells the story of Moses leading the Israelites out of slavery in Egypt, where they wandered the desert for a ridiculous amount of time, subsisting on manna and miraculous water. They didn't even have any cheese, which to me is easily the biggest sacrifice (well, that and the whole \"wandering aimlessly through the dessert in search of a safe haven\" part). So pick up some of the hybrid Exodus Cheese, enjoy its sweet, cheesy flavors, and reflect on how thankful you are to eat cheese whenever you want instead of manna for the 40th day in a row (hopefully you're not lactose intolerant, Mr. Pope).\n9. God's Treat\n…or God's Gift, or God Bud. Whatever your preference, know that a number of strains are named after The Big Guy because a lot of growers are thankful that one of His creations was this incredible plant with therapeutic purposes. So whaddya say, Pope Francis, why don't you pick up some hybrid God's Treat and acknowledge that there are many positive aspects of cannabis that benefit millions of people around the world? After all, it must be stressful to be Pope, and this Treat can deliver relaxing and sleepy effects to help you rest up so you can continue to spread your goodwill to those in need…much how cannabis does.    ",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/07/12001344/9-holy-strains-that-can-change-the-popes-opinion-of-cannabis.jpg",
            "title": "9 Holy Strains That Can Change Pope Francis' Opinion of Cannabis",
            "urlslug": "/news/strains-products/9-holy-strains-that-can-change-the-popes-opinion-of-cannabis"
        },
        {
            "author": "Rebecca Kelley",
            "category": null,
            "date": "/Date(1396641600000)/",
            "id": "contentitems-2973",
            "text": "We’re big fans of Game of Thrones here at Leafly and the crew is super stoked for the season 4 debut this Sunday on HBO. If you’re planning on hosting a viewing party to kick off the premiere of one of the best shows on television, why not pick up some of these Game of Thrones-themed strains to properly celebrate?\nHere are 24 strains (some standing solo, some paired together) we feel tie in with the Game of Thrones universe perfectly (spoilers below if you aren’t caught up to season 4 by now). Yes, 24. That’s how much we love both our strains and this show. Even though All Men Must Die, their memories will live on thanks to this list of green.\n1. Mad Dawg \n\nThis earthy hybrid is in honor of Mad King Aerys II Targaryen, the kooky ruler who started this whole mess in the first place. Dude, all you had to do was not murder a bunch of people and threaten to burn down King’s Landing and we wouldn’t even have a Game of Thrones battle royale waging. If only he had a little stash of Mad Dawg to keep him feeling euphoric and relaxed.\n2. 3 Kings\n\nThe hybrid 3 Kings strain may be a fusion of Headband, Sour Diesel, and OG Kush, but it also signifies the three kings currently left standing in Game of Thrones at the start of season 4: Joffrey Lannister (aka The Worst Person Ever), Stannis Baratheon (aka “Stannis the Mannis,” self-proclaimed King of the Andals), and Balon Greyjoy (aka World’s Not-Greatest Dad), king of the Iron Islands. Maybe this pungent strain will clear some of the crazy out of their sinuses.\n3. Permafrost\n\nBecause, as House Stark constantly reminds us, “Winter is coming,” so you might as well hunker down and wait for it to arrive with some piney Permafrost.\nSpeaking of House Stark…\n4. Northern Lights\n\nThe North remembers, and though their numbers are dwindling and the Starks are constantly having George R. R. Martin take a never-ending dump on them, there are still a few scrappy surviving members who have a glimmer of hope shining, however dimly at the moment. Northern Lights is good for combating stress, and I’m guessing the Starks are feeling a little overwhelmed right about now.\n5. Lions Gate\n\nThis royal purple indica is in honor of the proud and wealthy Lannisters, who happen to use a lion as their sigil. The Lannisters appear to be sitting pretty right now – they rule the Seven Kingdoms, Jamie’s been returned (mostly intact), Tywin’s only been moderately cranky – but we’ll see if their good luck streak will continue in season 4. They’ll need the focus that the Lions Gate strain brings.\n6. Richie Rich + Power Kush \n\nSpeaking of Tywin Lannister, if you combine the hybrid Richie Rich with the indica Power Kush, you’ll have a father who loves to play the game more than he loves his own family. I bet he’s sneering in every family portrait that’s been commissioned – it’s the ye olde equivalent of blinking in photos.\n7. Killer Queen + Sour Power \n\nSticking with the Lannisters, let’s shift gears to Cersei, former queen of Westeros and current queen of the “Who farted?” face. A Killer Queen willing to do whatever it takes to get as close to the Iron Throne as possible, this icy blonde beauty has felt her power go a little sour once she realized that her turd of a son can’t be controlled. Talk about a disappointed parent. She really takes after her father, doesn’t she?\n8. Little Devil + Abusive OG\n\nUgh, Joffrey is the worst. We can’t think of a better pairing for the little pissant than the hybrid Little Devil and the indica Abusive OG. If ever King Joffrey’s horrible ways feel a little too heavy for your tastes, just remember that he got b-slapped by the best character ever:\n\nSpeaking of which…\n9. Royal Dwarf \n\nTyrion Lannister is rumored to be one of the characters George R. R. Martin’s wife made him promise he would never kill off. I think every Game of Thrones fan can agree – even though he’s a Lannister, he’s still a Royal Dwarf and one of the best characters on the show.\nAnother favorite character?\n10. Jane Doe + Odyssey \n\nFierce little Arya Stark has seen many of her family members fall victim to the Game of Thrones and now she’s out for blood. This pint-sized warrior in the making has abandoned her identity and gone all Jane Doe in an attempt to take out the people on her shit list. How will her revenge Odyssey pan out?\n11. Critical Mass\n\nSticking with the Starks, we’ve never had a drastic shift in character sympathy than for poor Sansa. Sure, she was a naive, stuck-up teenager in season 1, but she’s had most of her family murdered, been held prisoner, and was nearly forced to marry a psychopath Lannister before being forced to marry another Lannister. Tyrion’s been kind to her so far but honestly, how much more suffering do you have in store for Sansa, George R. R. Martin? She seems to be at Critical Mass right now and could use a little of the happy effects this indica brings.\nKnow who else is feeling a little blue?\n12. Blue Bastard \n\nOh, Jon Snow. The bastard son of Ned Stark has been on his own Odyssey but he can’t seem to make up his mind as to what he wants (maybe he really does know “nuthing”). Is it revenge for the Starks? Does he want to protect the Night’s Watch or defect from them? Or maybe he wants to catch a glimpse of another Ogre with Ygritte (although “Jon Snuhhhh” isn’t exactly in her good graces right now). It’s been a depressing journey for him thus far – good thing Blue Bastard is good for relieving depression.\n13. White Zombie + Snow Monster\n\nWe’ve already seen a few of the horrors that lie north of the Wall, including a White Zombie who looked like a frigid Iggy Pop. Can Jon Snow protect the Seven Kingdoms from the Snow Monsters that are advancing?\n14. Super Sour Widow \n\nPoor Catelyn Stark. Even though she could never love the bastard Jon Snow, she still didn’t deserve to have her entire family either murdered or scattered across the Seven Kingdoms. Talk about a Super Sour Widow.\nAnd to make matters worse…\n15. Red Haze \n\nThat Red Wedding was effed up, yo. Like seriously. After watching that episode, you probably felt as amped up as the effects the sativa Red Haze can bring (and you were likely in a Red Haze of your own once “The Rains of Castamere” started playing).\n16. Blackwater + Green Haze\n\nAnother iconic moment in Game of Thrones, this event was less heart-breaking than the Red Wedding and more awe-inspiring. The Battle of the Blackwater has been the biggest battle in the War of the Five Kings so far. Tyrion’s use of wildfire put Stannis’ army in a Green Haze and protected King’s Landing from being overrun. By combining the indica Blackwater and the sativa Green Haze, you’re creating quite the explosive hybrid strain yourself.\n17. Cherry Bomb\n\nCherry Bomb continue to deliver (both literally and figuratively), or will her influence over him go up in flames?\n \n18. Anesthesia\n\nA little something both Jaime Lannister and Theon Greyjoy could have used throughout season 3, amirite guys? The indica Anesthesia is widely used for pain management, making it an appropriate option for these two whipping boys.\n19. Lifesaver\n\nJaime owes you one, Brienne of Tarth. Why not have him pick up this euphoric hybrid Lifesaver strain while you two bathe and reminisce about the time you both faced off against a friggin’ grizzly bear?\n20. Brains Damage\n\nWhat better way to celebrate the possibly brain-damaged but entertainingly verbose Hodor with this Hodor, I mean hybrid strain that brings sleepiness, Hodor, and Hodor Hodor.\n21. Bordello\n\nAny Game of Thrones viewer is all-too familiar with the show’s numerous “sexposition” scenes that occur in a brothel or during sex scenes to spruce up an otherwise boring plot advancement. Take a taste of the hybrid Bordello whenever a sexposition scene pops up and you’ll feel so relaxed, you’ll forget how shamelessly (and entertainingly) gratuitous these parts actually are.\n22. True OG \n\nWho will end up winning the Game of Thrones? Who do you feel is the rightful ruler of the Seven Kingdoms? Partake in this relaxing indica while you ponder who you feel the “True OG” should be.\nWill it be…\n23. Dream Queen + Triple Diesel\n\nMany Game of Thrones fans are rooting for their “Dream Queen,” Daenerys Targaryen, who’s using her Triple Diesel dragons to kick ass, free slaves, and chew bubblegum (and she’s all out of bubblegum).\nAnd finally…\n24. F*cking Incredible\n\nWhich is exactly what this show is. Happy watching!\nImage credits: mad king, House Lannister",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12001238/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie.jpg",
            "title": "24 Strains to Prepare You for the Game of Thrones Season 4 Premiere",
            "urlslug": "/news/strains-products/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 20.070420656014175
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 10.819804241783814
        },
        {
            "name": "ADD/ADHD",
            "score": 7.222320065750852
        },
        {
            "name": "Migraines",
            "score": 5.036984853821767
        },
        {
            "name": "Arthritis",
            "score": 3.0086885053422563
        }
    ],
    "description": "<p><span style=\"line-height: 1.6em;\">The 3 Kings marijuana strain, a holy trinity of <a href=\"http://www.leafly.com/hybrid/headband\">Headband</a>, <a href=\"http://www.leafly.com/sativa/sour-diesel\">Sour Diesel</a>, and <a href=\"http://www.leafly.com/hybrid/og-kush\">OG Kush</a>, is a sativa-dominant hybrid and genetic masterpiece. Sour tanginess reek from the sage green buds, and its frosty coat gives you a fair warning of the 3 Kings&rsquo; potency. Medical patients will appreciate the versatility of this strain&rsquo;s medicinal effects as it relieves pain, stress, and nausea without heavy sedation.</span></p>\n",
    "descriptionPlain": "The 3 Kings marijuana strain, a holy trinity of Headband, Sour Diesel, and OG Kush, is a sativa-dominant hybrid and genetic masterpiece. Sour tanginess reek from the sage green buds, and its frosty coat gives you a fair warning of the 3 Kings&rsquo; potency. Medical patients will appreciate the versatility of this strain&rsquo;s medicinal effects as it relieves pain, stress, and nausea without heavy sedation.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 64.72896453083139
        },
        {
            "name": "Uplifted",
            "score": 38.48679646055483
        },
        {
            "name": "Euphoric",
            "score": 38.48679646055483
        },
        {
            "name": "Focused",
            "score": 37.19699638156841
        },
        {
            "name": "Creative",
            "score": 32.701308612721085
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 33.23259897317664
        },
        {
            "name": "Diesel",
            "score": 14.651846040539244
        },
        {
            "name": "Sweet",
            "score": 12.773250290862126
        },
        {
            "name": "Skunk",
            "score": 12.099597596251348
        },
        {
            "name": "Sage",
            "score": 11.72534609924536
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1413682,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Three Kings is a first for me, and I was given the royal treatment! I've been active for 30 years, lived in Hawaii, California, and grew up largely in Colorado. \n\nThis is an impressive high; quick to the head where it settles in, drops the lids, and then moves to the whole body; intense; long-lasting; great for daytime use & engaging in other activities; it tapers off evenly & slowly; smooth. This is not one for true newbies because it packs a punch...a nice punch, but you feel it.\n\nThe smell is a sour-diesel with a hint of citrus (lemon to me). The first taste has the aroma of fibrous soil, almost like sandlewood, from the OG, followed by a nice, crisp diesel taste with a hint of lemon that it gets from S. Diesel.\n\nI've by no means tasted even half of everything out there! But as an older head, I've been around. So it's not often that a strain gets immediate \"high\" marks from me.",
            "username": "SourJax"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1637890,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "How could you go wrong with this bud lineage: Headband, Sour Diesel & OG Kush. Real head strong buzz which provides a clear mind, with a slight body buzz. My first inhale was smooth, Exhale I just felt so relaxed, with an invigorating upbeat, chill, mellow, productive high. ",
            "username": "macekushdu"
        }
    ],
    "id": 58095,
    "name": "3 Kings",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 32.94053604021903
        },
        {
            "name": "Dizzy",
            "score": 15.721765026097536
        },
        {
            "name": "Paranoid",
            "score": 11.500795201041768
        },
        {
            "name": "Anxious",
            "score": 10.520403044179023
        },
        {
            "name": "Headache",
            "score": 10.445552744777824
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/headband",
            "category": "Hybrid",
            "name": "Headband",
            "permalink": "https://mobileapi.leafly.com/hybrid/headband",
            "slug": "headband",
            "subtitle": null,
            "symbol": "Hb"
        },
        {
            "applink": "leafly://strain/sour-diesel",
            "category": "Sativa",
            "name": "Sour Diesel",
            "permalink": "https://mobileapi.leafly.com/sativa/sour-diesel",
            "slug": "sour-diesel",
            "subtitle": null,
            "symbol": "Sd"
        },
        {
            "applink": "leafly://strain/og-kush",
            "category": "Hybrid",
            "name": "OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/og-kush",
            "slug": "og-kush",
            "subtitle": null,
            "symbol": "Ogk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/3-kings",
    "photoTotalCount": 78,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/650698/b/3-kings__primary_8aee.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/3-kings_100x100_1af7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/649196/b/3-kings__primary_f533.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/3-kings_100x100_630d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/632236/b/3-kings__primary_8436.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/3-kings_100x100_a1ef.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617041/b/3-kings__primary_1ef9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/3-kings_100x100_0418.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/614316/b/3-kings__primary_807b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/3-kings_100x100_84a3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/610770/b/3-kings__primary_0d8b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/3-kings_100x100_b5b3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Eugene, OR",
        "Los Angeles, CA",
        "Salem, OR",
        "Arcata, CA",
        "Grants Pass, OR",
        "Renton, WA",
        "Santa Ana, CA",
        "Auburn, WA",
        "Bend, OR"
    ],
    "rating": 4.41,
    "relatedStrains": [],
    "reviewCount": 282,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "3-kings",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.40780141843972/240",
    "subtitle": null,
    "symbol": "3k",
    "symptoms": [
        {
            "name": "Stress",
            "score": 39.8240951252575
        },
        {
            "name": "Depression",
            "score": 39.681732791102284
        },
        {
            "name": "Pain",
            "score": 27.58213519485094
        },
        {
            "name": "Headaches",
            "score": 16.612630354264734
        },
        {
            "name": "Fatigue",
            "score": 14.65918430518642
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
