{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1514934606000)/",
            "id": "contentitems-53439",
            "text": "I’m a firm believer that quality cannabis should captivate all of the senses, starting with the nose. Aroma has always been an important characteristic when choosing a cannabis strain, and it’s generally the first thing that will attract you to a specific variety. A strain’s smell is a major indicator the flower’s flavor profile and gives you some semblance of what tastes can be expected when you inhale.\nMost connoisseurs will tell you that cannabis should be purchased with your nose, letting the natural harmony of terpenes guide your decision. One of the flaws with state regulations requiring pre-packaged cannabis is that it removes the nose from the equation and forces you to wait until you get home to find out how pungent the purchased flower may be. To help overcome this roadblock the legal cannabis market presents, I’ll share some of my favorite strains available in Washington that carry truly exceptional and complex aromas.\n\n#1 | Lemonder by Seattle’s Private Reserve\n\nLemonder from Seattle’s Private Reserve is a 91-point strain that was awarded the Best Aroma in Washington State using Leafly’s Cannabis Rating System. While somewhat wispy in appearance, it was the only qualifying strain that scored perfectly for its aroma. The strain is a hybrid of Super Lemon Haze, OG Kush, and Lavender, and it produces a sweet citrus aroma with the added pungent zest of fruit when ground up. Its flavor is a fruity, floral experience that reminds me of candied orange.\nFind Lemonder Nearby\nFrom the Tasting Notebook:\n “Lemon, cream, spice, and some middle savory note that is mellowing the lemon in an unexpected way.” –Jeremiah Wilhelm, Strain Researcher\n\n#2 | White Tahoe Cookies by Royal Tree Gardens\n\nRoyal Tree Gardens has a diverse mix of aromas and flavors coming from their flowering rooms. Their White Tahoe Cookies is a prime example of the quality and consistency their garden produces. A 94-point strain overall, White Tahoe Cookies’ aroma is a compelling mix of its parent genetics, The White, Tahoe OG, and an unspecified GSC cut. This flower has a grape and berry sweetness that blends with notes of musky mint, pine, and skunky earth to complete its enchanting bouquet.\nFind White Tahoe Cookies Nearby\nFrom the Tasting Notebook:\n“Robust grape and berry notes charged with a hint of dank, musky Kush and a sweet finish. Aromas of mint, eucalyptus, and pine forest erupt when this bud is broken down into shake.” –Will Hyde, Cannabis Expert\n\n#3 | Gummo by Gabriel Cannabis\n\nGummo from Gabriel Cannabis is an irresistible 92-point strain that crosses the sweetness of Bubble Gum with the intricate citrus aroma of Orange Bud. The tight buds covered in fiery orange hairs emit an intense citrus sour with soft floral sweetness. The flavor follows suit with a sharper, spiced finish reminiscent of cinnamon and sandalwood. The resulting effects are immediate, heady, and introspective.\nFind Gummo Nearby\nFrom the Tasting Notebook:\n“Loud, ripe berry aroma that expands into a sweet citrus medley of mandarin and tangerine.” –Bailey Rahn, Strains & Products Editor\n\nGummo grown by Gabriel Cannabis.\n#4 | Blueberry Pancakes by Nebula Gardens\n\nA truly amazing flower with a captivating, nuanced, and unique terpene profile, Blueberry Pancakes from Nebula Gardens really does emulate its namesake: a mix of berry notes that finish with a creamy touch of citrus, evoking memories of fresh baked muffins. Scoring 89 points overall and near perfect for its aroma, Blueberry Pancakes provides soothing effects that pair nicely with its pungent essence.\nFind Blueberry Pancakes Nearby\nFrom the Tasting Notebook:\n“Bright strawberry, wildflower, and sweet pine with doughy vanilla. Its aroma feels clarifying with diverse nuance.”–Bailey Rahn, Strains & Products Editor\n\n#5 | Golden Ticket by Khush Kush\n\nAn 87-point strain overall, Golden Ticket from Khush Kush is a flower with fragrant fruity notes of citrus and subtle undertones of tropical flowers. The nuanced smells of Golden Ticket were just a couple points shy of a perfect aroma score. Its complex smell gives way to fresh pine and spearmint flavors with just a touch of sharp lime upon exhale.\nFind Golden Ticket Nearby\nFrom the Tasting Notebook:\n“Sweet, floral, and sort of tropical like a papaya\u2028. Reminds me of a Trainwreck\u2028 cross. When I grind it up, the aroma is even sweeter like a sour green apple or an overripe pineapple\u2028.” –Will Hyde, Cannabis Expert",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/02145135/lemonader-macro.jpg",
            "title": "5 Best-Smelling Cannabis Strains in Washington",
            "urlslug": "/news/strains-products/best-smelling-strains-in-washington-fall-2017"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1513710785000)/",
            "id": "contentitems-52310",
            "text": "Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis flower products of 2017. How many have you tried? What was your favorite flower of 2017? Share with us in the comments below!\n\nChocolope by Gabriel\nAvailable in: Washington\nChocolope’s bright and dreamy sativa effects are magnified by the exceptional grow practices laid out in Gabriel’s airtight facilities. Their cultivation rooms are sealed from the outside, offering perfect environmental control that is carefully manipulated to stimulate the growth of the best quality flower.\nAlso featured in:\n\nWhat Are You Smoking? Episode 15\nWashington’s Best Tasting Strains From Fall 2017\n\nKosher Kush by Santa Cruz Veteran’s Alliance\nAvailable in: California\nThe high-THC indica Kosher Kush is the perfect strain to crush symptoms of PTSD, and the Santa Cruz Veteran’s Alliance—owned and operated by military veterans—produces this pain-relieving strain for those suffering. We love that members are offered free cannabis grown by fellow veterans in rooms meant to exude peace as the cannabis flower blooms.\nAlso featured in: The VA Can’t Provide Cannabis to Veterans With PTSD, so This Group Gives It Out for Free\nDutchberry by Artizen\nAvailable in: Washington\nWith around 27% THC to 8% CBD, the cheerful hybrid Dutchberry boasts one of the highest cannabinoid contents of all time. To house such a powerhouse strain, Artizen moves in tandem with their flower from growth to packaging—and delivers some excellent buds. We love that they slow down and take a little time with their cannabis crops from start to finish.\n\nPineapple by Fire Bros.\nAvailable in: Washington\nA Seattle favorite, Fire Bros. works with their own phenotypes to produce the most effective cannabis flower for consumers. For an uplifting hybrid strain such as Pineapple, stress-relieving characteristics are an important facet enhanced by Fire Bros.’ hand-selection process.\nHybrid Blend by Lowell Farms\nAvailable in: California\nLowell Farms, which works exclusively with flower, offers seasonal blends of their best strains, and we can’t get enough of their hybrid pre-rolls. We appreciate that they’re thinking outside the box in focusing on balanced flower mixes rather than strain-specific products. Grown in organic fertilizer free of pesticides, Lowell takes pride in their dedication to all-natural cannabis as well as in providing good wages for their workers.\nAlso featured in: What Are You Smoking? Episode 3\nZkittlez by Royal Choice Farms\nAvailable in: Arizona\nArizona does not require pesticide testing for cannabis, so it’s all the more important to find a grower you can trust. Royal Choice Farms chose to be an all-organic operation built on a whole lot of love and no pesticides. By instating natural grow methods, Royal Choice keeps our minds at ease when we’re lighting up their sweet indica Zkittles.\n\nCBD Blue Shark by Marley Natural Red\nAvailable in: California, Oregon, Washington*\nWith a full cannabis operation dedicated to Jamaica’s rich culture, Marley Natural hits it out of the park with their hand-selected flower line—notably, the anti-inflammatory and CBD-rich hybrid CBD Blue Shark. Cultivated by independent growers, we love Marley Natural’s dedication to craft cannabis, their commitment to sustainable growing practices, and their RISE UP social justice program.\nBlack Cherry Soda by Royal Tree Gardens\nAvailable in: Washington\nHaving built a facility from the ground up, Washington’s Royal Tree Gardens is a company steeped in perseverance. Licensed since 2014, Royal Tree Farms has been producing fantastic cannabis ever since, and their sativa-dominant Black Cherry Soda is no exception. We’ve been packing our bowls with this strain for its potent relief, particularly for the medical patients among us.\nDo-Si-Dos by Matrix NV\nAvailable in: Nevada\nOne of the best in medical-grade cannabis production, Nevada’s Matrix NV keeps their focus on the people who will consume their products, and that’s why we love them. Their flower, including the deliciously heavy indica Do-Si-Dos, is cared for by a team of passionate people who use purified and organic products to cultivate their hand-trimmed flower collection.\nAlso featured in: Leafly TV’s Growers: Episode 101\n\nOrange Blossom by Falcanna\nAvailable in: Washington\nA small medical operation turned Tier III licensed producer, Falcanna has seen it all when comes to cannabis—from the garden to the shop. Their dedication to the herb started as a dream between founders Bethany and Justin Rondeau and turned into a full grow facility delivering exceptional cannabis across Washington State. Their bright, floral hybrid Orange Blossom is as tasty as it is elevating and provides a perfect example of their dedication to quality flower.\nWhite Tahoe Cookies by Archive Portland\nAvailable in: Oregon\nWith multiple awards under their belt, Archive Portland boasts a team of growers with over 35 years of collective cannabis growing experience. That dedication to quality trickles down to the buds, where the exceptional indica White Tahoe Cookies takes on a smooth sedative high that keeps us coming back for more.\nLemonder by Seattle’s Private Reserve\nAvailable in: Washington\nWe save Seattle’s Private Reserve flower for special occasions; grown in a facility that is tightly sealed and meticulously controlled, the euphoric hybrid Lemonder has found its way into our stash boxes and smoke circles throughout 2017. SPR’s rigorous testing of all their cannabis products lets us consume with full peace of mind.\nLead image by Nastasic/iStock\n*Editor’s note: Leafly and Marley Natural are owned by the same parent company. Also, Marley Natural Red is available in California, Oregon, and Washington but may be a different high-CBD strain in each market.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/19103646/leafly-faves-flower.jpg",
            "title": "Leafly’s Faves 2017: Flower",
            "urlslug": "/news/strains-products/leaflys-faves-2017-flower"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 32.745098039215684
        },
        {
            "name": "ADD/ADHD",
            "score": 28.333333333333332
        },
        {
            "name": "PTSD",
            "score": 20
        },
        {
            "name": "Epilepsy",
            "score": 9.80392156862745
        },
        {
            "name": "Cancer",
            "score": 8.333333333333332
        }
    ],
    "description": "<p>Lemonder is a body-heavy hybrid with an outstanding aroma. This strain is a cross of&nbsp;<a href=\"https://www.leafly.com/indica/lavender\">Lavender</a>, <a href=\"https://www.leafly.com/sativa/super-lemon-haze\">Super Lemon Haze</a>, and <a href=\"https://www.leafly.com/hybrid/og-kush\">OG Kush</a>, and offers alert mental clarity and relaxing physical effects. The buds glitter with trichomes and are tangled in orange/bronze hairs. Its aroma smells like lemon peel, pine needles, and a sprinkling of earthy spice. Enjoy Lemonder throughout the day as its effects are manageable and won&rsquo;t pull too firmly toward stimulation or relaxation. Expect smile-inducing euphoria and a calming, carefree body buzz.&nbsp;</p>\n",
    "descriptionPlain": "Lemonder is a body-heavy hybrid with an outstanding aroma. This strain is a cross of&nbsp;Lavender, Super Lemon Haze, and OG Kush, and offers alert mental clarity and relaxing physical effects. The buds glitter with trichomes and are tangled in orange/bronze hairs. Its aroma smells like lemon peel, pine needles, and a sprinkling of earthy spice. Enjoy Lemonder throughout the day as its effects are manageable and won&rsquo;t pull too firmly toward stimulation or relaxation. Expect smile-inducing euphoria and a calming, carefree body buzz.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 97.15686274509804
        },
        {
            "name": "Happy",
            "score": 95.29411764705883
        },
        {
            "name": "Uplifted",
            "score": 69.41176470588235
        },
        {
            "name": "Euphoric",
            "score": 65.49019607843137
        },
        {
            "name": "Focused",
            "score": 41.07843137254902
        }
    ],
    "flavors": [
        {
            "name": "Lemon",
            "score": 118.62745098039215
        },
        {
            "name": "Flowery",
            "score": 42.94117647058823
        },
        {
            "name": "Citrus",
            "score": 39.2156862745098
        },
        {
            "name": "Lavender",
            "score": 31.274509803921568
        },
        {
            "name": "Pungent",
            "score": 29.803921568627448
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1411012,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "smooth, mellow, relaxed high without losing consciousness! Smell  and flavor are delightful and inviting.",
            "username": "dragon67"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1595557,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I wouldn’t be surprised if a luxury candle maker tried to make candles out of it. I would probably buy some. When you smoke it there’s a pleasant aftertaste that reminds me of yellow skittles. The high is relaxing and fun but not very affecting of the mind. It’s great for hanging out with people who aren’t smoking with you, so it doesn’t put you too much in a different headspace from them. ",
            "username": "jeweloree"
        }
    ],
    "id": 248271,
    "name": "Lemonder",
    "negatives": [],
    "parents": [
        {
            "applink": "leafly://strain/lavender",
            "category": "Indica",
            "name": "Lavender",
            "permalink": "https://mobileapi.leafly.com/indica/lavender",
            "slug": "lavender",
            "subtitle": null,
            "symbol": "Lar"
        },
        {
            "applink": "leafly://strain/og-kush",
            "category": "Hybrid",
            "name": "OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/og-kush",
            "slug": "og-kush",
            "subtitle": null,
            "symbol": "Ogk"
        },
        {
            "applink": "leafly://strain/super-lemon-haze",
            "category": "Sativa",
            "name": "Super Lemon Haze",
            "permalink": "https://mobileapi.leafly.com/sativa/super-lemon-haze",
            "slug": "super-lemon-haze",
            "subtitle": null,
            "symbol": "Slh"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/lemonder",
    "photoTotalCount": 1,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/567523/b/lemonder__primary_c8c6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/lemonder_100x100_9bf6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Bellevue, WA",
        "Bothell, WA",
        "Ellensburg, WA",
        "Everett, WA",
        "Granite Falls, WA",
        "Lynden, WA",
        "Mountlake Terrace, WA",
        "Ocean Shores, WA",
        "Port Angeles, WA"
    ],
    "rating": 4.56,
    "relatedStrains": [],
    "reviewCount": 16,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "lemonder",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.5625/240",
    "subtitle": null,
    "symbol": "Lmd",
    "symptoms": [
        {
            "name": "Stress",
            "score": 102.54901960784312
        },
        {
            "name": "Depression",
            "score": 64.01960784313725
        },
        {
            "name": "Insomnia",
            "score": 29.803921568627448
        },
        {
            "name": "Pain",
            "score": 19.6078431372549
        },
        {
            "name": "Fatigue",
            "score": 9.80392156862745
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
