{"sl_translate":"description,descriptionPlain,category","id":69232,"slug":"stardawg","name":"Stardawg","subtitle":null,"symbol":"Sta","category":"Hybrid","description":"\u003cp\u003eStardawg, possibly named after the bright, sparkling crystal trichomes that blanket the strain like stars, is a \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e cross between \u003ca href=\"http://www.leafly.com/indica/chemdawg-4\"\u003eChemdawg 4\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/tres-dawg\"\u003eTres Dawg\u003c/a\u003e. \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eEarthy\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-pine\"\u003epine\u003c/a\u003e with sour notes of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-diesel\"\u003ediesel\u003c/a\u003e color Stardawg, whose \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e effects may help patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-fatigue\"\u003efatigue\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-anxiety\"\u003eanxiety disorders\u003c/a\u003e. Stardawg flowers in 67 days indoors with moderate yields.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Stardawg, possibly named after the bright, sparkling crystal trichomes that blanket the strain like stars, is a hybrid cross between Chemdawg 4 and Tres Dawg. Earthy pine with sour notes of diesel color Stardawg, whose uplifting effects may help patients treating stress, fatigue, and anxiety disorders. Stardawg flowers in 67 days indoors with moderate yields.\u0026nbsp;\n","aka":"Star Dawg","rating":4.46,"highlightedReviews":[{"id":1416306,"username":"OnePDXOne","text":"Strain: Stardawg (Chemdawg 4 / Tres Dawg -- Sativa leaning Hybrid)\nTHC: 23.92%\nCBD: 0.00%\nLocation found: KaLeafa \nDate purchased: 3.29.16 \nPrice: $8.00\nWeight: 1.2g\nMethod of Consumption: Herb Iron and small bong \nSmell: Diesel damp earth with a little pine sol fragrance when the scissors cut through the bud.\nLook: Mid-sized green bud with fine orange hairs. Small amount of sugar leaf left behind and the bud looks good but the structure is lacking a little. The crystal coating glimmers in the light...literally twinkling or appears to be wet.\nTaste: Wonderful. It is like Chemdawg but filtered through the pure dirt of an untouched part of the world. I know Chemdawg is not a flavor or taste per se but it really is. The earthy flavor is only muted slightly by the solid SourD type taste hidden somewhere in the recesses of this creature. It is a magical flavor, even if the list below was not extensive, it would be worth smoking for flavor alone.\nRecommendation for medicine: One uplifting and happy high. Euphoric, a little hunger inducing and I had a deeper sense of feeling along with this strain’s wonderful taste. There are key strains to me that are pure medicine (Strawberry Cough, XJ-13, Sour Diesel and various CBD strains) and this one, if it stands the test of time, may be added to a very elite list that was tasted, sampled numerous times and panned out to be some of the best for PTSD, depression, uplifting and anxiety relieving qualities. I would try to find one that is at least 18%+THC and looks good. Give it a try, it could be daytime medicine, a creative burst, an extra meal eaten if needed or just a better way to get through your day!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png"},{"id":1641054,"username":"tannerm11","text":"This is by far my favorite strain. Everything that stimulates your mind is just awesome, no overthinking or paranoia for me. Would recommend to folks who typically stay on the lower THC side but want to see what the big leagues are like. Listen to some tunes, go on a hike, chill by a river and campfire - this is a beautiful strain that will make you forget all the bullshit in life and awaken your surroundings. I  recommend and show this strain to all my friends, never anything but great reviews. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-66121","title":"Try These Strains Before Attending Your Next Sporting Event","author":"Dante Jordan","category":null,"date":"\/Date(1526423695000)\/","text":"If you don’t get high before attending a sporting event, then you’re doing it all wrong. I mean, sure, you can have a good time while being sober, but you can have a great time while being lifted.\nSo with that said, I curated a list of suggested strains for you to indulge in, depending on which sport you’re going to see. Peep the list, use Leafly’s Finder to locate the dispensaries stocking these strains, purchase, and enjoy some good ol’ sportsball.\nStrains to Pair With Exciting Sports (Basketball, Football, Soccer, Hockey)\nSports that fall under this category are the types of sports that include constant back and forth action, which keeps you engaged from start to finish. A big play is always looming, so you’re stuck to the edge of your seat because you don’t want to miss that big dunk or the chance to yell “GOOOOAAALLLLL” in the face of whoever’s sitting next to you. For that reason, you should indulge in strains that’ll have you uplifted and energetic, feeling hyped and ready for that big moment.\n  Candyland\nCandyland’s a high-THC, sativa-dominant hybrid that’ll have you super smacked without the paranoia. As a mix of Grandaddy Purple and Platinum GSC, it’s got an earthy type of scent and a sweet flavor, with effects that will have you uplifted, engaged, and in a whole entire world of euphoria. Smoke these before an exciting sport and those big plays will feel that much bigger.\nFind Candyland Nearby\n  Green Crack\nEveryone knows how good, energized, and focused Green Crack can make you feel. It’s one of those strains that you can smoke and power through the day like you drank 84 cold brews, so it’s perfect to smoke before a sporting event that you want to be locked into.\nFind Green Crack Nearby\n  Cotton Candy Kush\nCotton Candy Kush is another high-THC strain that leaves you feeling good, feeling great, feeling great, feeling good, like Outkast on “GhettoMusick.” As a mix of Power Plant and Lavender, its powerful effects are relaxing yet still energetic while inducing happiness, freedom, and overall euphoria, so you’ll be that much more excited when you see that Ronaldo bicycle kick for the game-winning goal live and in person.\nFind Cotton Candy Kush Nearby\n  Stardawg\nStardawg is one of the best smelling, best tasting, most euphoric, most energetic, most everything strains I’ve ever come across. Gifted to me by LTRMN in Portland, I smoked this and walked around the city for hours, falling in love with everything and everybody. It’s definitely a strain I’d recommend smoking before a sporting event, because every single dunk, touchdown, and goal will likely feel like the greatest moment in sports history for you.\nFind Stardawg Nearby\nStrains to Pair With Chill Sports (Baseball, Golf, Tennis)\nSports that fall under this category tend to be a lot more laid-back and reserved. Baseball games can be long and boring, and golf and tennis matches require damn near complete silence, with light clapping being the most excited you can get, so if you’re overly hyped at any of them, you may feel a bit uncomfortable or out-of-place. These strains will help you lean a little more towards the indica side of things.\n  Obama Kush\nObama Kush is a great indica with a relatively mild THC percentage that’ll chill you out without knocking you out. I smoked a gram joint of Obama Kush a few weeks ago and knocked out the entire first season of Girls Incarcerated on Netflix, which is still shorter than one full-length baseball game.\nFind Obama Kush Nearby\n  Larry OG\nLarry OG is a hybrid of OG Kush and SFV OG, whose indica effects will overtake your body and have you with your feet in the air like your Cares-to-Give Meter is at zero. Smoke a little of this and you’ll have no problem sitting through an entire round of golf, where the most exciting thing possible is a fox running across the course.\nFind Larry OG Nearby\n  Cheese\nCheese is an indica-dominant hybrid that:\n\nactually smells like Cheese, which is wild; and\nwill have you feeling relaxed while avoiding the sleepy sleepy nap nap state of mind.\n\nYou can smoke some Cheese and kick back in comfort for hours, so if you’re going to see one of the chill sports where everything’s deathly silent and calm, Cheese is a good strain to indulge in beforehand.\nFind Cheese Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/05/15152818/strains-before-sports-event.jpg","urlslug":"/news/strains-products/try-these-strains-before-attending-your-next-sporting-event"},{"id":"contentitems-29132","title":"The 6 Best Documentaries to Watch While High","author":"Hannah Meadows","category":null,"date":"\/Date(1497189652000)\/","text":"Firing up a documentary whilst high is hardly a new idea, but it’s usually a good one (hello, Planet Earth). There’s so much to learn and explore via films that showcase unique and mind-bending experiences—especially with a little help from a well-packed bowl. Additionally, the truthfulness of documentaries comes as a breath of fresh air amid the throngs of lowbrow comedies and overly intense dramas that tend to flood the average Netflix queue.\n\nTo elevate this classic cannabis-enhanced activity, we mined the opinions of the staff at the Leafly office and compiled a list of the best documentaries to watch while high. In narrowing from a list that included scores of suggestions, I personally vetted the top picks to bring you the following finalists. From explorations of history to non-verbal spectaculars, there’s a bit of something for everyone below. Spark up a pre-roll or bake a batch of edibles, then get comfortable on the couch and press play—we’re willing to bet you’ll discover a new favorite.\nRecently watched a noteworthy documentary? Tell us about it in the comments below!\nCave of Forgotten Dreams\n\nFamed documentary director Werner Herzog knocked it out of the park—yet again—with his video exploration of the Chauvet Cave of Southern France. Discovered by three explorers in 1994, the cave houses ancient paintings that are the oldest ever recorded in human history, dating back between 28,000 and 35,000 years. The paintings are perfectly preserved—along with the bones of long extinct animals—having never been touched by natural light or exposure to the elements.\nBefore watching this film, I lit up some Blue Dream and even through a small computer screen (I, uh…don’t own a TV), the paintings, their meanings, and Herzog’s beautifully crafted narrative combined to create a film that was truly breathtaking. Long after the film ended, I thought about the person or people who made these, the gods they may have worshipped, the natural world in which they lived, and the ancient culture to which they belonged.\nI doubt sober thoughts would have gravitated toward the essence and deeper meaning these paintings hold in regard to human life and the history of mankind like my Blue Dream-induced thoughts did. I recommend this documentary for the music, the art, the history, the curiosity—everything about it.\nGoing Clear: Scientology and the Prison of Belief\n\nDocumentaries exploring religious sects or cults are my bread and butter. Documentaries exploring religions that are widely regarded as cults are even better—the extra-sweet jam to that bread and butter. Enter Going Clear, an eye-opening expose of L. Ron Hubbard and his imaginative, interwoven ideals of science fiction and religion that ultimately led to the creation of the Church of Scientology.\nIn this documentary, we hear stories from ex-Scientologists. These aren’t just “tried it out for a week and left” Scientologists—these people were indoctrinated into the religion for years, even decades, before getting out. Some moved up to the highest levels of the religion before calling it quits.\nSober, this is an interesting journey down the rabbit hole of Scientology. High, this documentary will open your thoughts to science, religion, and how people respond to both in a whole new light. Load a bowl of the buzzy White Fire OG before pressing play.\nSamsara\n\nNonverbal and utterly breathtaking, Samsara is the younger sister to the popular 1992 documentary Baraka (the previous nonverbal narrative exploration of nature and human life). Like Bakara, Samsara was directed by Mond Russell and produced by Mark Magidson, so the quality and feel stay true to the original.\nSamsara will leave you in awe of its gorgeous, lingering landscapes, and rich visions of people from all over the world. This colossal documentary took five years to film and spanned about 25 countries.\nThroughout this entire spectacular, cannabis will keep your eyes peeled and your mind enamored with this hour-and-a-half film of explosive color and life. Creative strains such as Pineapple Trainwreck or Berry White will let your mind completely soak in this remarkable film.\nFor an extra boost, check out the classic Koyaanisqatsi which pre-dates Samsara by about 20 years. The score is done by the famous composer Philip Glass with cinematography by Ron Fricke (who also worked on Samsara and Baraka). Though Koyaanisqatsi may not be as visually crisp as Samasara or Baraka, it was the core inspiration for both stunning films.\n\nBeware of Mr. Baker\n\nThe colorful life of Ginger Baker, legendary drummer of the popular rock bands Cream and Blind Faith, is front and center in this exploratory documentary. Rock legends laud him as the greatest drummer who ever lived, but the “behind the scenes” of Baker’s life shows a volatile man with a short fuse and passionate air.\nHe’s a true character in every sense of the word, having traveled the world and experienced a life that only one in a billion could mirror. Though hard drug use and angry outbursts (mostly fueled by said hard drug use) clouded his legend, his life story remains remarkable in every way.\nRegardless of whether or not you know who Ginger Baker is, this film is fascinating and will appeal to everyone—especially lovers of rock music. I recommend lighting up a little Durban Poison as you watch this film.\nInto the Inferno\n\nWerner Herzog makes another appearance on this list with his relatively new Netflix documentary Into the Inferno. Much like Cave of Forgotten Dreams, Into the Inferno touches on the history of human life. After delving into the world of volcanic activity, Herzog explores the religions that have developed across cultures greatly influenced by local volcanic eruptions.\nIn true Herzog style, the documentary approaches these subjects with both historical and artistic flair. Some of the most touching and beautiful points in the film are the sweeping shots of erupting volcanoes punctuated with classical or operatic music.\nJuxtaposed with these beautiful shots are scenes of ceremonial activities conducted by worshippers who believe certain volcanoes house spirits of long-dead loved ones and mighty gods. Also wrapped up with all this is the discovery of an ancient human fossil as well as the recounting of the lives of two famous volcano photographers. In short, Herzog does quite a lot with this film, and it’s all compelling.\nYet another amazing documentary that, when paired with cannabis, leaves you contemplating it days after the credits roll. Reach for some Stardawg to pair with this incredible film.\nTickled\n\nFor something well off the beaten path in terms of documentaries, I suggest you sit down and watch Tickled. It starts off innocently enough, with the director, David Farrier, simply wanting to explore an interesting subject: the world of endurance tickling. Sure, it’s an odd sport to most, but why not get a feel for something a bit different? No harm … right?\n…Right?\nWell, much to the filmmakers’ surprise—as well as my own—there is a bit of harm in exploring the unknown. Not to give too much away, the endurance competitions held by professional ticklers are more than just a good laugh.\nYou’ll be on the edge of your seat while Farrier dives down the deep and twisty hole that goes straight to the mystifying and sometimes terrifying underworld of tickling competitions. To really get into this film, you’ll want to have some Permafrost close at hand—its effects will help take the edge off the strangeness in this documentary.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/09155343/best-documentaries-to-watch-while-high.jpg","urlslug":"/news/lifestyle/best-high-documentaries"}],"reviewCount":355,"flavors":[{"name":"Diesel","score":35.407256850346279},{"name":"Earthy","score":34.06541704305932},{"name":"Pine","score":25.020701595904846},{"name":"Woody","score":18.059319482083708},{"name":"Spicy/Herbal","score":17.720566094549834}],"effects":[{"name":"Happy","score":82.036660644384227},{"name":"Relaxed","score":72.991945197229754},{"name":"Euphoric","score":70.029735019572414},{"name":"Uplifted","score":62.048328816621492},{"name":"Talkative","score":59.180216802168026}],"symptoms":[{"name":"Depression","score":31.686615477265885},{"name":"Stress","score":27.657332128876842},{"name":"Lack of Appetite","score":18.475233363444744},{"name":"Pain","score":16.884974405299609},{"name":"Headaches","score":14.955962059620596}],"conditions":[{"name":"Anxiety","score":28.060072267389337},{"name":"PTSD","score":9.8163203854260761},{"name":"Bipolar Disorder","score":8.73607347184583},{"name":"ADD/ADHD","score":8.14890093345378},{"name":"Migraines","score":6.9914935260463711}],"negatives":[{"name":"Dry Mouth","score":39.976663655525449},{"name":"Dry Eyes","score":16.083258054802769},{"name":"Dizzy","score":12.332505269497139},{"name":"Paranoid","score":8.2429990966576323},{"name":"Anxious","score":6.9613821138211378}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/stardawg/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/stardawg/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_c151.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005513/b/stardawg__primary_8fdf.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_39cb.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003354/b/stardawg__primary_a79c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_6aa3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001825/b/stardawg__primary_119f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_3fab.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001437/b/stardawg__primary_7b82.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_4b9e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/706125/b/stardawg__primary_f142.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_9e8f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/704623/b/stardawg__primary_19fd.jpg"}],"photoTotalCount":83,"popularCities":["Portland, OR","Denver, CO","Seattle, WA","Las Vegas, NV","Detroit, MI","Spokane, WA","Toronto, ON","Colorado Springs, CO","Lynnwood, WA","Ottawa, ON"],"permalink":"https://mobileapi.leafly.com/hybrid/stardawg","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.46197183098592/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Chemdawg 4","subtitle":null,"slug":"chemdawg-4","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/chemdawg-4","symbol":"Cd4","applink":"leafly://strain/chemdawg-4"},{"name":"Tres Dawg","subtitle":null,"slug":"tres-dawg","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/tres-dawg","symbol":"Td","applink":"leafly://strain/tres-dawg"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":69232,"slug":"stardawg","name":"Stardawg","subtitle":null,"symbol":"Sta","category":"Hybrid","description":"\u003cp\u003eStardawg, possibly named after the bright, sparkling crystal trichomes that blanket the strain like stars, is a \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e cross between \u003ca href=\"http://www.leafly.com/indica/chemdawg-4\"\u003eChemdawg 4\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/tres-dawg\"\u003eTres Dawg\u003c/a\u003e. \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eEarthy\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-pine\"\u003epine\u003c/a\u003e with sour notes of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-diesel\"\u003ediesel\u003c/a\u003e color Stardawg, whose \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e effects may help patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-fatigue\"\u003efatigue\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-anxiety\"\u003eanxiety disorders\u003c/a\u003e. Stardawg flowers in 67 days indoors with moderate yields.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Stardawg, possibly named after the bright, sparkling crystal trichomes that blanket the strain like stars, is a hybrid cross between Chemdawg 4 and Tres Dawg. Earthy pine with sour notes of diesel color Stardawg, whose uplifting effects may help patients treating stress, fatigue, and anxiety disorders. Stardawg flowers in 67 days indoors with moderate yields.\u0026nbsp;\n","aka":"Star Dawg","rating":4.46,"highlightedReviews":[{"id":1416306,"username":"OnePDXOne","text":"Strain: Stardawg (Chemdawg 4 / Tres Dawg -- Sativa leaning Hybrid)\nTHC: 23.92%\nCBD: 0.00%\nLocation found: KaLeafa \nDate purchased: 3.29.16 \nPrice: $8.00\nWeight: 1.2g\nMethod of Consumption: Herb Iron and small bong \nSmell: Diesel damp earth with a little pine sol fragrance when the scissors cut through the bud.\nLook: Mid-sized green bud with fine orange hairs. Small amount of sugar leaf left behind and the bud looks good but the structure is lacking a little. The crystal coating glimmers in the light...literally twinkling or appears to be wet.\nTaste: Wonderful. It is like Chemdawg but filtered through the pure dirt of an untouched part of the world. I know Chemdawg is not a flavor or taste per se but it really is. The earthy flavor is only muted slightly by the solid SourD type taste hidden somewhere in the recesses of this creature. It is a magical flavor, even if the list below was not extensive, it would be worth smoking for flavor alone.\nRecommendation for medicine: One uplifting and happy high. Euphoric, a little hunger inducing and I had a deeper sense of feeling along with this strain’s wonderful taste. There are key strains to me that are pure medicine (Strawberry Cough, XJ-13, Sour Diesel and various CBD strains) and this one, if it stands the test of time, may be added to a very elite list that was tasted, sampled numerous times and panned out to be some of the best for PTSD, depression, uplifting and anxiety relieving qualities. I would try to find one that is at least 18%+THC and looks good. Give it a try, it could be daytime medicine, a creative burst, an extra meal eaten if needed or just a better way to get through your day!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png"},{"id":1641054,"username":"tannerm11","text":"This is by far my favorite strain. Everything that stimulates your mind is just awesome, no overthinking or paranoia for me. Would recommend to folks who typically stay on the lower THC side but want to see what the big leagues are like. Listen to some tunes, go on a hike, chill by a river and campfire - this is a beautiful strain that will make you forget all the bullshit in life and awaken your surroundings. I  recommend and show this strain to all my friends, never anything but great reviews. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-66121","title":"Try These Strains Before Attending Your Next Sporting Event","author":"Dante Jordan","category":null,"date":"\/Date(1526423695000)\/","text":"If you don’t get high before attending a sporting event, then you’re doing it all wrong. I mean, sure, you can have a good time while being sober, but you can have a great time while being lifted.\nSo with that said, I curated a list of suggested strains for you to indulge in, depending on which sport you’re going to see. Peep the list, use Leafly’s Finder to locate the dispensaries stocking these strains, purchase, and enjoy some good ol’ sportsball.\nStrains to Pair With Exciting Sports (Basketball, Football, Soccer, Hockey)\nSports that fall under this category are the types of sports that include constant back and forth action, which keeps you engaged from start to finish. A big play is always looming, so you’re stuck to the edge of your seat because you don’t want to miss that big dunk or the chance to yell “GOOOOAAALLLLL” in the face of whoever’s sitting next to you. For that reason, you should indulge in strains that’ll have you uplifted and energetic, feeling hyped and ready for that big moment.\n  Candyland\nCandyland’s a high-THC, sativa-dominant hybrid that’ll have you super smacked without the paranoia. As a mix of Grandaddy Purple and Platinum GSC, it’s got an earthy type of scent and a sweet flavor, with effects that will have you uplifted, engaged, and in a whole entire world of euphoria. Smoke these before an exciting sport and those big plays will feel that much bigger.\nFind Candyland Nearby\n  Green Crack\nEveryone knows how good, energized, and focused Green Crack can make you feel. It’s one of those strains that you can smoke and power through the day like you drank 84 cold brews, so it’s perfect to smoke before a sporting event that you want to be locked into.\nFind Green Crack Nearby\n  Cotton Candy Kush\nCotton Candy Kush is another high-THC strain that leaves you feeling good, feeling great, feeling great, feeling good, like Outkast on “GhettoMusick.” As a mix of Power Plant and Lavender, its powerful effects are relaxing yet still energetic while inducing happiness, freedom, and overall euphoria, so you’ll be that much more excited when you see that Ronaldo bicycle kick for the game-winning goal live and in person.\nFind Cotton Candy Kush Nearby\n  Stardawg\nStardawg is one of the best smelling, best tasting, most euphoric, most energetic, most everything strains I’ve ever come across. Gifted to me by LTRMN in Portland, I smoked this and walked around the city for hours, falling in love with everything and everybody. It’s definitely a strain I’d recommend smoking before a sporting event, because every single dunk, touchdown, and goal will likely feel like the greatest moment in sports history for you.\nFind Stardawg Nearby\nStrains to Pair With Chill Sports (Baseball, Golf, Tennis)\nSports that fall under this category tend to be a lot more laid-back and reserved. Baseball games can be long and boring, and golf and tennis matches require damn near complete silence, with light clapping being the most excited you can get, so if you’re overly hyped at any of them, you may feel a bit uncomfortable or out-of-place. These strains will help you lean a little more towards the indica side of things.\n  Obama Kush\nObama Kush is a great indica with a relatively mild THC percentage that’ll chill you out without knocking you out. I smoked a gram joint of Obama Kush a few weeks ago and knocked out the entire first season of Girls Incarcerated on Netflix, which is still shorter than one full-length baseball game.\nFind Obama Kush Nearby\n  Larry OG\nLarry OG is a hybrid of OG Kush and SFV OG, whose indica effects will overtake your body and have you with your feet in the air like your Cares-to-Give Meter is at zero. Smoke a little of this and you’ll have no problem sitting through an entire round of golf, where the most exciting thing possible is a fox running across the course.\nFind Larry OG Nearby\n  Cheese\nCheese is an indica-dominant hybrid that:\n\nactually smells like Cheese, which is wild; and\nwill have you feeling relaxed while avoiding the sleepy sleepy nap nap state of mind.\n\nYou can smoke some Cheese and kick back in comfort for hours, so if you’re going to see one of the chill sports where everything’s deathly silent and calm, Cheese is a good strain to indulge in beforehand.\nFind Cheese Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/05/15152818/strains-before-sports-event.jpg","urlslug":"/news/strains-products/try-these-strains-before-attending-your-next-sporting-event"},{"id":"contentitems-29132","title":"The 6 Best Documentaries to Watch While High","author":"Hannah Meadows","category":null,"date":"\/Date(1497189652000)\/","text":"Firing up a documentary whilst high is hardly a new idea, but it’s usually a good one (hello, Planet Earth). There’s so much to learn and explore via films that showcase unique and mind-bending experiences—especially with a little help from a well-packed bowl. Additionally, the truthfulness of documentaries comes as a breath of fresh air amid the throngs of lowbrow comedies and overly intense dramas that tend to flood the average Netflix queue.\n\nTo elevate this classic cannabis-enhanced activity, we mined the opinions of the staff at the Leafly office and compiled a list of the best documentaries to watch while high. In narrowing from a list that included scores of suggestions, I personally vetted the top picks to bring you the following finalists. From explorations of history to non-verbal spectaculars, there’s a bit of something for everyone below. Spark up a pre-roll or bake a batch of edibles, then get comfortable on the couch and press play—we’re willing to bet you’ll discover a new favorite.\nRecently watched a noteworthy documentary? Tell us about it in the comments below!\nCave of Forgotten Dreams\n\nFamed documentary director Werner Herzog knocked it out of the park—yet again—with his video exploration of the Chauvet Cave of Southern France. Discovered by three explorers in 1994, the cave houses ancient paintings that are the oldest ever recorded in human history, dating back between 28,000 and 35,000 years. The paintings are perfectly preserved—along with the bones of long extinct animals—having never been touched by natural light or exposure to the elements.\nBefore watching this film, I lit up some Blue Dream and even through a small computer screen (I, uh…don’t own a TV), the paintings, their meanings, and Herzog’s beautifully crafted narrative combined to create a film that was truly breathtaking. Long after the film ended, I thought about the person or people who made these, the gods they may have worshipped, the natural world in which they lived, and the ancient culture to which they belonged.\nI doubt sober thoughts would have gravitated toward the essence and deeper meaning these paintings hold in regard to human life and the history of mankind like my Blue Dream-induced thoughts did. I recommend this documentary for the music, the art, the history, the curiosity—everything about it.\nGoing Clear: Scientology and the Prison of Belief\n\nDocumentaries exploring religious sects or cults are my bread and butter. Documentaries exploring religions that are widely regarded as cults are even better—the extra-sweet jam to that bread and butter. Enter Going Clear, an eye-opening expose of L. Ron Hubbard and his imaginative, interwoven ideals of science fiction and religion that ultimately led to the creation of the Church of Scientology.\nIn this documentary, we hear stories from ex-Scientologists. These aren’t just “tried it out for a week and left” Scientologists—these people were indoctrinated into the religion for years, even decades, before getting out. Some moved up to the highest levels of the religion before calling it quits.\nSober, this is an interesting journey down the rabbit hole of Scientology. High, this documentary will open your thoughts to science, religion, and how people respond to both in a whole new light. Load a bowl of the buzzy White Fire OG before pressing play.\nSamsara\n\nNonverbal and utterly breathtaking, Samsara is the younger sister to the popular 1992 documentary Baraka (the previous nonverbal narrative exploration of nature and human life). Like Bakara, Samsara was directed by Mond Russell and produced by Mark Magidson, so the quality and feel stay true to the original.\nSamsara will leave you in awe of its gorgeous, lingering landscapes, and rich visions of people from all over the world. This colossal documentary took five years to film and spanned about 25 countries.\nThroughout this entire spectacular, cannabis will keep your eyes peeled and your mind enamored with this hour-and-a-half film of explosive color and life. Creative strains such as Pineapple Trainwreck or Berry White will let your mind completely soak in this remarkable film.\nFor an extra boost, check out the classic Koyaanisqatsi which pre-dates Samsara by about 20 years. The score is done by the famous composer Philip Glass with cinematography by Ron Fricke (who also worked on Samsara and Baraka). Though Koyaanisqatsi may not be as visually crisp as Samasara or Baraka, it was the core inspiration for both stunning films.\n\nBeware of Mr. Baker\n\nThe colorful life of Ginger Baker, legendary drummer of the popular rock bands Cream and Blind Faith, is front and center in this exploratory documentary. Rock legends laud him as the greatest drummer who ever lived, but the “behind the scenes” of Baker’s life shows a volatile man with a short fuse and passionate air.\nHe’s a true character in every sense of the word, having traveled the world and experienced a life that only one in a billion could mirror. Though hard drug use and angry outbursts (mostly fueled by said hard drug use) clouded his legend, his life story remains remarkable in every way.\nRegardless of whether or not you know who Ginger Baker is, this film is fascinating and will appeal to everyone—especially lovers of rock music. I recommend lighting up a little Durban Poison as you watch this film.\nInto the Inferno\n\nWerner Herzog makes another appearance on this list with his relatively new Netflix documentary Into the Inferno. Much like Cave of Forgotten Dreams, Into the Inferno touches on the history of human life. After delving into the world of volcanic activity, Herzog explores the religions that have developed across cultures greatly influenced by local volcanic eruptions.\nIn true Herzog style, the documentary approaches these subjects with both historical and artistic flair. Some of the most touching and beautiful points in the film are the sweeping shots of erupting volcanoes punctuated with classical or operatic music.\nJuxtaposed with these beautiful shots are scenes of ceremonial activities conducted by worshippers who believe certain volcanoes house spirits of long-dead loved ones and mighty gods. Also wrapped up with all this is the discovery of an ancient human fossil as well as the recounting of the lives of two famous volcano photographers. In short, Herzog does quite a lot with this film, and it’s all compelling.\nYet another amazing documentary that, when paired with cannabis, leaves you contemplating it days after the credits roll. Reach for some Stardawg to pair with this incredible film.\nTickled\n\nFor something well off the beaten path in terms of documentaries, I suggest you sit down and watch Tickled. It starts off innocently enough, with the director, David Farrier, simply wanting to explore an interesting subject: the world of endurance tickling. Sure, it’s an odd sport to most, but why not get a feel for something a bit different? No harm … right?\n…Right?\nWell, much to the filmmakers’ surprise—as well as my own—there is a bit of harm in exploring the unknown. Not to give too much away, the endurance competitions held by professional ticklers are more than just a good laugh.\nYou’ll be on the edge of your seat while Farrier dives down the deep and twisty hole that goes straight to the mystifying and sometimes terrifying underworld of tickling competitions. To really get into this film, you’ll want to have some Permafrost close at hand—its effects will help take the edge off the strangeness in this documentary.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/09155343/best-documentaries-to-watch-while-high.jpg","urlslug":"/news/lifestyle/best-high-documentaries"}],"reviewCount":355,"flavors":[{"name":"Diesel","score":35.407256850346279},{"name":"Earthy","score":34.06541704305932},{"name":"Pine","score":25.020701595904846},{"name":"Woody","score":18.059319482083708},{"name":"Spicy/Herbal","score":17.720566094549834}],"effects":[{"name":"Happy","score":82.036660644384227},{"name":"Relaxed","score":72.991945197229754},{"name":"Euphoric","score":70.029735019572414},{"name":"Uplifted","score":62.048328816621492},{"name":"Talkative","score":59.180216802168026}],"symptoms":[{"name":"Depression","score":31.686615477265885},{"name":"Stress","score":27.657332128876842},{"name":"Lack of Appetite","score":18.475233363444744},{"name":"Pain","score":16.884974405299609},{"name":"Headaches","score":14.955962059620596}],"conditions":[{"name":"Anxiety","score":28.060072267389337},{"name":"PTSD","score":9.8163203854260761},{"name":"Bipolar Disorder","score":8.73607347184583},{"name":"ADD/ADHD","score":8.14890093345378},{"name":"Migraines","score":6.9914935260463711}],"negatives":[{"name":"Dry Mouth","score":39.976663655525449},{"name":"Dry Eyes","score":16.083258054802769},{"name":"Dizzy","score":12.332505269497139},{"name":"Paranoid","score":8.2429990966576323},{"name":"Anxious","score":6.9613821138211378}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/stardawg/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/stardawg/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_c151.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005513/b/stardawg__primary_8fdf.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_39cb.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003354/b/stardawg__primary_a79c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_6aa3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001825/b/stardawg__primary_119f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_3fab.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001437/b/stardawg__primary_7b82.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_4b9e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/706125/b/stardawg__primary_f142.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_9e8f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/704623/b/stardawg__primary_19fd.jpg"}],"photoTotalCount":83,"popularCities":["Portland, OR","Denver, CO","Seattle, WA","Las Vegas, NV","Detroit, MI","Spokane, WA","Toronto, ON","Colorado Springs, CO","Lynnwood, WA","Ottawa, ON"],"permalink":"https://mobileapi.leafly.com/hybrid/stardawg","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.46197183098592/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Chemdawg 4","subtitle":null,"slug":"chemdawg-4","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/chemdawg-4","symbol":"Cd4","applink":"leafly://strain/chemdawg-4"},{"name":"Tres Dawg","subtitle":null,"slug":"tres-dawg","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/tres-dawg","symbol":"Td","applink":"leafly://strain/tres-dawg"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":69232,"slug":"stardawg","name":"Stardawg","subtitle":null,"symbol":"Sta","category":"Hybrid","description":"\u003cp\u003eStardawg, possibly named after the bright, sparkling crystal trichomes that blanket the strain like stars, is a \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e cross between \u003ca href=\"http://www.leafly.com/indica/chemdawg-4\"\u003eChemdawg 4\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/tres-dawg\"\u003eTres Dawg\u003c/a\u003e. \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eEarthy\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-pine\"\u003epine\u003c/a\u003e with sour notes of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-diesel\"\u003ediesel\u003c/a\u003e color Stardawg, whose \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e effects may help patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-fatigue\"\u003efatigue\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-anxiety\"\u003eanxiety disorders\u003c/a\u003e. Stardawg flowers in 67 days indoors with moderate yields.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Stardawg, possibly named after the bright, sparkling crystal trichomes that blanket the strain like stars, is a hybrid cross between Chemdawg 4 and Tres Dawg. Earthy pine with sour notes of diesel color Stardawg, whose uplifting effects may help patients treating stress, fatigue, and anxiety disorders. Stardawg flowers in 67 days indoors with moderate yields.\u0026nbsp;\n","aka":"Star Dawg","rating":4.46,"highlightedReviews":[{"id":1416306,"username":"OnePDXOne","text":"Strain: Stardawg (Chemdawg 4 / Tres Dawg -- Sativa leaning Hybrid)\nTHC: 23.92%\nCBD: 0.00%\nLocation found: KaLeafa \nDate purchased: 3.29.16 \nPrice: $8.00\nWeight: 1.2g\nMethod of Consumption: Herb Iron and small bong \nSmell: Diesel damp earth with a little pine sol fragrance when the scissors cut through the bud.\nLook: Mid-sized green bud with fine orange hairs. Small amount of sugar leaf left behind and the bud looks good but the structure is lacking a little. The crystal coating glimmers in the light...literally twinkling or appears to be wet.\nTaste: Wonderful. It is like Chemdawg but filtered through the pure dirt of an untouched part of the world. I know Chemdawg is not a flavor or taste per se but it really is. The earthy flavor is only muted slightly by the solid SourD type taste hidden somewhere in the recesses of this creature. It is a magical flavor, even if the list below was not extensive, it would be worth smoking for flavor alone.\nRecommendation for medicine: One uplifting and happy high. Euphoric, a little hunger inducing and I had a deeper sense of feeling along with this strain’s wonderful taste. There are key strains to me that are pure medicine (Strawberry Cough, XJ-13, Sour Diesel and various CBD strains) and this one, if it stands the test of time, may be added to a very elite list that was tasted, sampled numerous times and panned out to be some of the best for PTSD, depression, uplifting and anxiety relieving qualities. I would try to find one that is at least 18%+THC and looks good. Give it a try, it could be daytime medicine, a creative burst, an extra meal eaten if needed or just a better way to get through your day!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png"},{"id":1641054,"username":"tannerm11","text":"This is by far my favorite strain. Everything that stimulates your mind is just awesome, no overthinking or paranoia for me. Would recommend to folks who typically stay on the lower THC side but want to see what the big leagues are like. Listen to some tunes, go on a hike, chill by a river and campfire - this is a beautiful strain that will make you forget all the bullshit in life and awaken your surroundings. I  recommend and show this strain to all my friends, never anything but great reviews. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-66121","title":"Try These Strains Before Attending Your Next Sporting Event","author":"Dante Jordan","category":null,"date":"\/Date(1526423695000)\/","text":"If you don’t get high before attending a sporting event, then you’re doing it all wrong. I mean, sure, you can have a good time while being sober, but you can have a great time while being lifted.\nSo with that said, I curated a list of suggested strains for you to indulge in, depending on which sport you’re going to see. Peep the list, use Leafly’s Finder to locate the dispensaries stocking these strains, purchase, and enjoy some good ol’ sportsball.\nStrains to Pair With Exciting Sports (Basketball, Football, Soccer, Hockey)\nSports that fall under this category are the types of sports that include constant back and forth action, which keeps you engaged from start to finish. A big play is always looming, so you’re stuck to the edge of your seat because you don’t want to miss that big dunk or the chance to yell “GOOOOAAALLLLL” in the face of whoever’s sitting next to you. For that reason, you should indulge in strains that’ll have you uplifted and energetic, feeling hyped and ready for that big moment.\n  Candyland\nCandyland’s a high-THC, sativa-dominant hybrid that’ll have you super smacked without the paranoia. As a mix of Grandaddy Purple and Platinum GSC, it’s got an earthy type of scent and a sweet flavor, with effects that will have you uplifted, engaged, and in a whole entire world of euphoria. Smoke these before an exciting sport and those big plays will feel that much bigger.\nFind Candyland Nearby\n  Green Crack\nEveryone knows how good, energized, and focused Green Crack can make you feel. It’s one of those strains that you can smoke and power through the day like you drank 84 cold brews, so it’s perfect to smoke before a sporting event that you want to be locked into.\nFind Green Crack Nearby\n  Cotton Candy Kush\nCotton Candy Kush is another high-THC strain that leaves you feeling good, feeling great, feeling great, feeling good, like Outkast on “GhettoMusick.” As a mix of Power Plant and Lavender, its powerful effects are relaxing yet still energetic while inducing happiness, freedom, and overall euphoria, so you’ll be that much more excited when you see that Ronaldo bicycle kick for the game-winning goal live and in person.\nFind Cotton Candy Kush Nearby\n  Stardawg\nStardawg is one of the best smelling, best tasting, most euphoric, most energetic, most everything strains I’ve ever come across. Gifted to me by LTRMN in Portland, I smoked this and walked around the city for hours, falling in love with everything and everybody. It’s definitely a strain I’d recommend smoking before a sporting event, because every single dunk, touchdown, and goal will likely feel like the greatest moment in sports history for you.\nFind Stardawg Nearby\nStrains to Pair With Chill Sports (Baseball, Golf, Tennis)\nSports that fall under this category tend to be a lot more laid-back and reserved. Baseball games can be long and boring, and golf and tennis matches require damn near complete silence, with light clapping being the most excited you can get, so if you’re overly hyped at any of them, you may feel a bit uncomfortable or out-of-place. These strains will help you lean a little more towards the indica side of things.\n  Obama Kush\nObama Kush is a great indica with a relatively mild THC percentage that’ll chill you out without knocking you out. I smoked a gram joint of Obama Kush a few weeks ago and knocked out the entire first season of Girls Incarcerated on Netflix, which is still shorter than one full-length baseball game.\nFind Obama Kush Nearby\n  Larry OG\nLarry OG is a hybrid of OG Kush and SFV OG, whose indica effects will overtake your body and have you with your feet in the air like your Cares-to-Give Meter is at zero. Smoke a little of this and you’ll have no problem sitting through an entire round of golf, where the most exciting thing possible is a fox running across the course.\nFind Larry OG Nearby\n  Cheese\nCheese is an indica-dominant hybrid that:\n\nactually smells like Cheese, which is wild; and\nwill have you feeling relaxed while avoiding the sleepy sleepy nap nap state of mind.\n\nYou can smoke some Cheese and kick back in comfort for hours, so if you’re going to see one of the chill sports where everything’s deathly silent and calm, Cheese is a good strain to indulge in beforehand.\nFind Cheese Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/05/15152818/strains-before-sports-event.jpg","urlslug":"/news/strains-products/try-these-strains-before-attending-your-next-sporting-event"},{"id":"contentitems-29132","title":"The 6 Best Documentaries to Watch While High","author":"Hannah Meadows","category":null,"date":"\/Date(1497189652000)\/","text":"Firing up a documentary whilst high is hardly a new idea, but it’s usually a good one (hello, Planet Earth). There’s so much to learn and explore via films that showcase unique and mind-bending experiences—especially with a little help from a well-packed bowl. Additionally, the truthfulness of documentaries comes as a breath of fresh air amid the throngs of lowbrow comedies and overly intense dramas that tend to flood the average Netflix queue.\n\nTo elevate this classic cannabis-enhanced activity, we mined the opinions of the staff at the Leafly office and compiled a list of the best documentaries to watch while high. In narrowing from a list that included scores of suggestions, I personally vetted the top picks to bring you the following finalists. From explorations of history to non-verbal spectaculars, there’s a bit of something for everyone below. Spark up a pre-roll or bake a batch of edibles, then get comfortable on the couch and press play—we’re willing to bet you’ll discover a new favorite.\nRecently watched a noteworthy documentary? Tell us about it in the comments below!\nCave of Forgotten Dreams\n\nFamed documentary director Werner Herzog knocked it out of the park—yet again—with his video exploration of the Chauvet Cave of Southern France. Discovered by three explorers in 1994, the cave houses ancient paintings that are the oldest ever recorded in human history, dating back between 28,000 and 35,000 years. The paintings are perfectly preserved—along with the bones of long extinct animals—having never been touched by natural light or exposure to the elements.\nBefore watching this film, I lit up some Blue Dream and even through a small computer screen (I, uh…don’t own a TV), the paintings, their meanings, and Herzog’s beautifully crafted narrative combined to create a film that was truly breathtaking. Long after the film ended, I thought about the person or people who made these, the gods they may have worshipped, the natural world in which they lived, and the ancient culture to which they belonged.\nI doubt sober thoughts would have gravitated toward the essence and deeper meaning these paintings hold in regard to human life and the history of mankind like my Blue Dream-induced thoughts did. I recommend this documentary for the music, the art, the history, the curiosity—everything about it.\nGoing Clear: Scientology and the Prison of Belief\n\nDocumentaries exploring religious sects or cults are my bread and butter. Documentaries exploring religions that are widely regarded as cults are even better—the extra-sweet jam to that bread and butter. Enter Going Clear, an eye-opening expose of L. Ron Hubbard and his imaginative, interwoven ideals of science fiction and religion that ultimately led to the creation of the Church of Scientology.\nIn this documentary, we hear stories from ex-Scientologists. These aren’t just “tried it out for a week and left” Scientologists—these people were indoctrinated into the religion for years, even decades, before getting out. Some moved up to the highest levels of the religion before calling it quits.\nSober, this is an interesting journey down the rabbit hole of Scientology. High, this documentary will open your thoughts to science, religion, and how people respond to both in a whole new light. Load a bowl of the buzzy White Fire OG before pressing play.\nSamsara\n\nNonverbal and utterly breathtaking, Samsara is the younger sister to the popular 1992 documentary Baraka (the previous nonverbal narrative exploration of nature and human life). Like Bakara, Samsara was directed by Mond Russell and produced by Mark Magidson, so the quality and feel stay true to the original.\nSamsara will leave you in awe of its gorgeous, lingering landscapes, and rich visions of people from all over the world. This colossal documentary took five years to film and spanned about 25 countries.\nThroughout this entire spectacular, cannabis will keep your eyes peeled and your mind enamored with this hour-and-a-half film of explosive color and life. Creative strains such as Pineapple Trainwreck or Berry White will let your mind completely soak in this remarkable film.\nFor an extra boost, check out the classic Koyaanisqatsi which pre-dates Samsara by about 20 years. The score is done by the famous composer Philip Glass with cinematography by Ron Fricke (who also worked on Samsara and Baraka). Though Koyaanisqatsi may not be as visually crisp as Samasara or Baraka, it was the core inspiration for both stunning films.\n\nBeware of Mr. Baker\n\nThe colorful life of Ginger Baker, legendary drummer of the popular rock bands Cream and Blind Faith, is front and center in this exploratory documentary. Rock legends laud him as the greatest drummer who ever lived, but the “behind the scenes” of Baker’s life shows a volatile man with a short fuse and passionate air.\nHe’s a true character in every sense of the word, having traveled the world and experienced a life that only one in a billion could mirror. Though hard drug use and angry outbursts (mostly fueled by said hard drug use) clouded his legend, his life story remains remarkable in every way.\nRegardless of whether or not you know who Ginger Baker is, this film is fascinating and will appeal to everyone—especially lovers of rock music. I recommend lighting up a little Durban Poison as you watch this film.\nInto the Inferno\n\nWerner Herzog makes another appearance on this list with his relatively new Netflix documentary Into the Inferno. Much like Cave of Forgotten Dreams, Into the Inferno touches on the history of human life. After delving into the world of volcanic activity, Herzog explores the religions that have developed across cultures greatly influenced by local volcanic eruptions.\nIn true Herzog style, the documentary approaches these subjects with both historical and artistic flair. Some of the most touching and beautiful points in the film are the sweeping shots of erupting volcanoes punctuated with classical or operatic music.\nJuxtaposed with these beautiful shots are scenes of ceremonial activities conducted by worshippers who believe certain volcanoes house spirits of long-dead loved ones and mighty gods. Also wrapped up with all this is the discovery of an ancient human fossil as well as the recounting of the lives of two famous volcano photographers. In short, Herzog does quite a lot with this film, and it’s all compelling.\nYet another amazing documentary that, when paired with cannabis, leaves you contemplating it days after the credits roll. Reach for some Stardawg to pair with this incredible film.\nTickled\n\nFor something well off the beaten path in terms of documentaries, I suggest you sit down and watch Tickled. It starts off innocently enough, with the director, David Farrier, simply wanting to explore an interesting subject: the world of endurance tickling. Sure, it’s an odd sport to most, but why not get a feel for something a bit different? No harm … right?\n…Right?\nWell, much to the filmmakers’ surprise—as well as my own—there is a bit of harm in exploring the unknown. Not to give too much away, the endurance competitions held by professional ticklers are more than just a good laugh.\nYou’ll be on the edge of your seat while Farrier dives down the deep and twisty hole that goes straight to the mystifying and sometimes terrifying underworld of tickling competitions. To really get into this film, you’ll want to have some Permafrost close at hand—its effects will help take the edge off the strangeness in this documentary.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/09155343/best-documentaries-to-watch-while-high.jpg","urlslug":"/news/lifestyle/best-high-documentaries"}],"reviewCount":355,"flavors":[{"name":"Diesel","score":35.407256850346279},{"name":"Earthy","score":34.06541704305932},{"name":"Pine","score":25.020701595904846},{"name":"Woody","score":18.059319482083708},{"name":"Spicy/Herbal","score":17.720566094549834}],"effects":[{"name":"Happy","score":82.036660644384227},{"name":"Relaxed","score":72.991945197229754},{"name":"Euphoric","score":70.029735019572414},{"name":"Uplifted","score":62.048328816621492},{"name":"Talkative","score":59.180216802168026}],"symptoms":[{"name":"Depression","score":31.686615477265885},{"name":"Stress","score":27.657332128876842},{"name":"Lack of Appetite","score":18.475233363444744},{"name":"Pain","score":16.884974405299609},{"name":"Headaches","score":14.955962059620596}],"conditions":[{"name":"Anxiety","score":28.060072267389337},{"name":"PTSD","score":9.8163203854260761},{"name":"Bipolar Disorder","score":8.73607347184583},{"name":"ADD/ADHD","score":8.14890093345378},{"name":"Migraines","score":6.9914935260463711}],"negatives":[{"name":"Dry Mouth","score":39.976663655525449},{"name":"Dry Eyes","score":16.083258054802769},{"name":"Dizzy","score":12.332505269497139},{"name":"Paranoid","score":8.2429990966576323},{"name":"Anxious","score":6.9613821138211378}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/stardawg/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/hybrid/stardawg/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_c151.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005513/b/stardawg__primary_8fdf.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_39cb.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003354/b/stardawg__primary_a79c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_6aa3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001825/b/stardawg__primary_119f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_3fab.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001437/b/stardawg__primary_7b82.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_4b9e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/706125/b/stardawg__primary_f142.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/stardawg_100x100_9e8f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/704623/b/stardawg__primary_19fd.jpg"}],"photoTotalCount":83,"popularCities":["Portland, OR","Denver, CO","Seattle, WA","Las Vegas, NV","Detroit, MI","Spokane, WA","Toronto, ON","Colorado Springs, CO","Lynnwood, WA","Ottawa, ON"],"permalink":"https://mobileapi.leafly.com/hybrid/stardawg","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.46197183098592/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Chemdawg 4","subtitle":null,"slug":"chemdawg-4","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/chemdawg-4","symbol":"Cd4","applink":"leafly://strain/chemdawg-4"},{"name":"Tres Dawg","subtitle":null,"slug":"tres-dawg","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/tres-dawg","symbol":"Td","applink":"leafly://strain/tres-dawg"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
