{"sl_translate":"description,descriptionPlain,category","id":25519,"slug":"holy-grail-kush","name":"Holy Grail Kush","subtitle":null,"symbol":"Hol","category":"Hybrid","description":"\u003cp\u003eHoly Grail Kush is a newer strain created by seed breeders DNA Genetics and Reserva Privada Colorado. It entered into the Seed Company Hybrids category at the 2011 \u003cem\u003eHigh Times \u003c/em\u003eCannabis Cup. As the offspring of multi-award winners \u003ca href=\"http://www.leafly.com/hybrid/og-18\"\u003eOG #18\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/indica/kosher-kush\"\u003eKosher Kush\u003c/a\u003e, it\u0026rsquo;s no surprise that Holy Grail Kush came out on top and is said to have nabbed the competition\u0026rsquo;s first-ever perfect score. The plants are easy to grow, with large, dense buds appearing at 9 to 10 weeks. Most of Holy Grail Kush\u0026rsquo;s praise centers around its potency; THC levels have tested at over 20%, but this hybrid produces a more mellow relaxation than the melt-your-face-off indica sensation the name might suggest. The aroma of this plant is pure kush and has a strong spicy citrus smell, both while growing and once harvested, that is uniquely complex.\u003c/p\u003e\n","descriptionPlain":"Holy Grail Kush is a newer strain created by seed breeders DNA Genetics and Reserva Privada Colorado. It entered into the Seed Company Hybrids category at the 2011 High Times Cannabis Cup. As the offspring of multi-award winners OG #18 and Kosher Kush, it\u0026rsquo;s no surprise that Holy Grail Kush came out on top and is said to have nabbed the competition\u0026rsquo;s first-ever perfect score. The plants are easy to grow, with large, dense buds appearing at 9 to 10 weeks. Most of Holy Grail Kush\u0026rsquo;s praise centers around its potency; THC levels have tested at over 20%, but this hybrid produces a more mellow relaxation than the melt-your-face-off indica sensation the name might suggest. The aroma of this plant is pure kush and has a strong spicy citrus smell, both while growing and once harvested, that is uniquely complex.\n","aka":"Holy Grail OG","rating":4.53,"highlightedReviews":[{"id":1416486,"username":"weazal","text":"Immediately after smoking you can feel how high-quality it is. Extremely pleasure inducing - both mentally and physically. It really makes you feel GOOD! There\u0027s a sizzling all over your body that\u0027s tantalizing along with an awesomely encouraging thrill in your chest. The indica element brings a noticeable depth, distant headspace, and tangible weight on the top of your head - but it\u0027s never overbearing and always pleasant. Impossible to wipe the smile off your face :) Despite how strong the effects are, the high always remains \"easy\" without a lick of anxiety, edginess, or any sign that you could smoke too much. Music is utterly exquisite and captivating in a way that completely encompasses you. Wonderfully heightened arousal (again, both physically and mentally). Would work perfectly as an aphrodisiac.\n\nWhat a high quality high! Exploding with feel-good sensations, substantial gone-ness, and delightfully heightened senses. Holy Grail deserves a place in the top 5 (or 10) of all time.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/kZ3iwRmPT5O6arIA05kqrPWjazc=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2fdZCCCxYREQnXfPfK6mXSTpqotAY%3d%2f120x120%2fhttps%253A%252F%252Fs3.amazonaws.com%252Fleafly%252Fbin%252FGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1636299,"username":"SirSparky","text":"Smell is fuel on pine with limey undertones. Taste is just the same but the lime is much more pronounced. Smoke is not smooth but not harsh, definitely leaves a trail in the throat but it’s tolerable.\nNugs are small and spade shaped with bright and pale green tones interleaved.\nThe high starts as a small click of energy in the head and spine which turns on full blast a few minutes later. At first it’s intense but the relaxing body effects won’t allow anxiety or paranoia.\nGrab a book or video game controller and head for a place to lay back and chill. This is stay put and enjoy your existence stuff, pleasant, utterly relaxing and never too overwhelming. A good first heavy strain for intermediate users to graduate from less potent strains. Nighttime or lazy Sundays only, definite drowsiness.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3569","title":"The Leafly Strain Reviews Hall of Fame: Where Cold Fusion and Space Squids Collide","author":"Sara Dilley","category":null,"date":"\/Date(1409849400000)\/","text":"Come one, come all, to witness the auspicious reading of August’s Strain Review Hall of Fame! As summer drew to a close, Leafly reviewers were out in full force, regaling us with tales of cold fusion and divine yoga pants and dancing squids in space. Behold the crème de la crème of August’s strain reviews.\nXJ-13\nDoes your strain inspire full orchestral suites, complete with tiny dancers and exotic scents? If not, you’re missing out. \n\nWhen I open the jar to smell this XJ-13 it\u0027s almost as if little angels carrying baskets of citrus fruits are swirling past me, while a single pine tree stands center of the jar filled with peppermints, all the while a clan of gnomes lay below harvesting honey from the bee hives atop the pine tree… You get the picture.\n\nThin-Mint\nAnd to think, some people argue cannabis doesn’t stimulate intellectualism.\n\nTook some of this to relax and ended up in a 30 minute debate with my wife about the political ramifications of sci-fi levels of discoveries, like cold fusion or first contact.\n\nGSC (f.k.a Girl Scout Cookies)\nAnd on the 5th day God created… Yoga pants? \n\nCannabis has many things to be proud of and this strain is it.. pretty sure Leafly was created on it.. god created yoga pants on it, the oceans grew, the gods bathe in it, its little waynes cologne… well maybe\n\nPurple Kush\nSome people like to consume and enjoy the munchies, other people like to become their munchies.\n\nI feel pretty good at the moment, I feel like tartar sauce and warm water or a stick of butter melting over a steamy hot cob of corn. And a biscuit with butter and peanut butter, and chicken, with olives on the side and a coke please. (: \n\nNorthern Lights\nBut does it also make you feel like a cynical anthropomorphic octopus? \n\nI feel like Squidward in space\n\nHoly Grail Kush\nEven the Knights who say \"Ni\" would have to agree that a strain which inspires poetry is fine indeed.\n\nYou\u0027ll laugh and you\u0027ll cry \nBut you\u0027ll sure not die \nBut now I\u0027m in a cloud \nBut my rain is dry. \nugh he\u0027s so annoying.\n\nSuper Sour Diesel\nAre we talking a 5K or an Ironman?\n\nIt\u0027s not a dash right off sprinting type of weed but rather a walking-speedy walking-jogging- and then running weed. Super amazing once you get running.\n\nAmnesia Haze\nNot only does this strain deliver a tranquil high, it will nearly deliver you to any place your heart desires!\n\nWhen asked how I felt I said \"I feel like I’m on a pebble of waterfalls\" and visualized a giant smooth white quartz pebble with waterfalls draining off the edge; it felt tranquil. \n \n\nGreen Crack\nSometimes you just gotta shake yo’ groove thang.\n\nI JUST WANNA DANCE YOU GUISE!!!111!!!\n\n\nWanted to Jam Out and Shake my Ass! #bam \n\nphoto credit (cropped): roryrory via photopin cc","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/09/12002854/the-leafly-strain-reviews-hall-of-fame-where-cold-fusion-and-spac.jpg","urlslug":"/news/strains-products/the-leafly-strain-reviews-hall-of-fame-where-cold-fusion-and-spac"},{"id":"contentitems-3009","title":"9 Holy Strains That Can Change Pope Francis\u0027 Opinion of Cannabis","author":"Rebecca Kelley","category":null,"date":"\/Date(1405011600000)\/","text":"Ever since Pope Francis (née Jorge Mario Bergoglio) was elected to succeed Pope Benedict XVI on March 13, 2013, the world has for the most part responded positively to His Holiness\u0027 behavior at the top of the religious food chain. As of December 2013, 88% of American Catholics approve of how he\u0027s handling his role as head of the Catholic church, and even non-religious people admire Pope Francis\u0027 humility, his vow to live simply, his acts of compassion, and his love for and acceptance of folks from all walks of life. Dude was even a bar bouncer and a janitor before becoming a priest. What\u0027s not to like about him? \nWell, it turns out pope-in\u0027 ain\u0027t easy, and as much as I admire Pope Francis for being the pope-iest Pope to come along in decades, he holds one opinion that broke my little heathen heart. Last week, he condemned efforts to legalize cannabis, saying that limited attempts to legalize recreational drugs \"are not only highly questionable from a legislative standpoint, but they fail to produce the desired effects.\" He also added, \"the problem of drug use is not solved with drugs!\"\nPope Francis, I get where you\u0027re coming from. You\u0027ve previously spoken out against the evils of drug addiction, so I can see how you\u0027d be wary about cannabis legalization. However, cannabis is far less addictive (9-10%) than tobacco smokers (20%-30%), heroin users (23-25%), alcohol users (15%), and cocaine users (15%-20%), plus it has therapeutic and medical benefits.\nMaybe you need a little bit of cannabis education, Mr. Pope. For instance, did you know that cannabis and religion often go hand-in-hand? It\u0027s true! As a matter of fact, I\u0027ve got a list of nine strains that I think are right up your pious alley. Check out a few of these holy wonders and you\u0027ll see that cannabis isn\u0027t so bad, after all. \n1. 3 Kings\nIn the biblical sense, the Three Kings, also known as the biblical Magi or the three Wise Men (not to be confused with the \"Ooohhhhh a wise guy, eh?\" schtick of the Three Stooges) were a trio of foreigners who visited Jesus after his birth. They brought gifts of gold, frankincense, and myrrh because they had no idea what sort of thing newborn babies are into (in hindsight, burping cloths and a Baby Bjorn would have probably been more ideal than pungent tree resin, though the gold was a classy touch).\nWhat better way to commemorate the birth of baby Jesus than with the hybrid 3 Kings strain, known for its appropriately piney, pungent smell and its euphoric, happy effects. Pair it with Dream Star to simulate the Star of Bethlehem and you\u0027ve got yourself a pretty uplifting birthday celebration.\n2. Endless Sky\nIsn\u0027t heaven supposed to be some sort of Endless Sky where everyone lives on a fluffy cloud and gets free access to Backstreet Boys concerts? If so, let its indica counterpart bring you relaxation so you can dream about the day you get to meet your maker and high-five Him for inviting you through the pearly gates.\n3. Holy Grail Kush\nThe Holy Grail has had quite the heyday in pop culture, from Monty Python to Indiana Jones. There\u0027s no way you\u0027re not an Indiana Jones fan, Mr. Pope, so I strongly recommend you partake in this woody hybrid while commemorating the supposed vessel of the Last Supper with a viewing of the 1989 classic. Just know with Holy Grail Kush, you have chosen wisely.\n4. Jesus OG\nTry the indica named after Mr. JC himself, Jesus OG. Its citrus, earthy flavors and focused effects may channel the power of Christ to compel you to pair it with the hybrid Bio-Jesus, a euphoric hybrid that provides exceptional pain relief. That\u0027s double the Jesus in one session — think of it as hitting up church twice on the same Sunday.\n5. Soul Shine\nNot to be confused with Soul Glo (just let your soooooooooullllll glowwwwwwww!), Soul Shine is an arousing hybrid that will amplify your love for the man upstairs. (Not the dude who lives in the apartment above yours, I mean the actual Man Upstairs.) As Pope, I imagine you\u0027ve got one of the shiniest souls around, so this is a great option for someone with your sparkly innards.\n6. Lamb\u0027s Bread\nIn religious terms, lamb\u0027s bread is also known as sacramental bread, the body of Christ, altar bread, or Communion bread. It\u0027s used in the Christian ritual of the Eucharist/Holy Communion, where Christians accept a sacrament in the form of a piece of bread or cracker and a sip of wine or grape juice. In cannabis terms, Lamb\u0027s Bread is an earthy sativa that brings euphoric, uplifting, and creative effects. That sounds like a better Communion offering to me, don\u0027t you agree, Pope? Think of how much more amazing the church songs would be once the congregation gets their creative juices flowing (and we all know Christian hymns could use some oomph).    \n7. Trinity\nThe Trinity in Christian terms describes God as three expressions: the Father, the Son (aka Jesus), and the Holy Spirit. If God is a hybrid of these three, it\u0027s only fitting that the Trinity cannabis strain is also a hybrid (though I would hope God isn\u0027t as skunky-smelling). Try this one out for its trio of happy, uplifting, and energetic qualities and you\u0027ll think three is a magic number, indeed.\n8. Exodus Cheese\nThe Book of Exodus tells the story of Moses leading the Israelites out of slavery in Egypt, where they wandered the desert for a ridiculous amount of time, subsisting on manna and miraculous water. They didn\u0027t even have any cheese, which to me is easily the biggest sacrifice (well, that and the whole \"wandering aimlessly through the dessert in search of a safe haven\" part). So pick up some of the hybrid Exodus Cheese, enjoy its sweet, cheesy flavors, and reflect on how thankful you are to eat cheese whenever you want instead of manna for the 40th day in a row (hopefully you\u0027re not lactose intolerant, Mr. Pope).\n9. God\u0027s Treat\n…or God\u0027s Gift, or God Bud. Whatever your preference, know that a number of strains are named after The Big Guy because a lot of growers are thankful that one of His creations was this incredible plant with therapeutic purposes. So whaddya say, Pope Francis, why don\u0027t you pick up some hybrid God\u0027s Treat and acknowledge that there are many positive aspects of cannabis that benefit millions of people around the world? After all, it must be stressful to be Pope, and this Treat can deliver relaxing and sleepy effects to help you rest up so you can continue to spread your goodwill to those in need…much how cannabis does.    ","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/07/12001344/9-holy-strains-that-can-change-the-popes-opinion-of-cannabis.jpg","urlslug":"/news/strains-products/9-holy-strains-that-can-change-the-popes-opinion-of-cannabis"}],"reviewCount":595,"flavors":[{"name":"Citrus","score":34.09404028807014},{"name":"Earthy","score":25.368176599519884},{"name":"Pine","score":19.567633858678636},{"name":"Pungent","score":17.115645548481371},{"name":"Woody","score":14.401941342239851}],"effects":[{"name":"Relaxed","score":75.902828514768814},{"name":"Happy","score":67.060588665066291},{"name":"Euphoric","score":63.647583759524061},{"name":"Uplifted","score":53.387955328253838},{"name":"Sleepy","score":31.8528859200501}],"symptoms":[{"name":"Stress","score":47.672215843857643},{"name":"Depression","score":29.102390147166268},{"name":"Pain","score":28.627491911074},{"name":"Insomnia","score":24.8757958459451},{"name":"Fatigue","score":17.420415405490033}],"conditions":[{"name":"Anxiety","score":37.086421041644925},{"name":"Bipolar Disorder","score":12.44129005323035},{"name":"PMS","score":9.7208015864732289},{"name":"Migraines","score":9.4296002504957723},{"name":"PTSD","score":9.042897401106357}],"negatives":[{"name":"Dry Eyes","score":36.189854921198204},{"name":"Dry Mouth","score":34.789948857113039},{"name":"Dizzy","score":7.3061267091117834},{"name":"Anxious","score":5.3149462477820686},{"name":"Paranoid","score":1.3195386702849388}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/holy-grail-kush_100x100_0426.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/708084/b/holy-grail-kush__primary_ae56.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/holy-grail-kush_100x100_7d4d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/665936/b/holy-grail-kush__primary_0367.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/holy-grail-kush_100x100_69cb.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/640236/b/holy-grail-kush__primary_b187.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/holy-grail-kush_100x100_7423.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/637708/b/holy-grail-kush__primary_50a5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/holy-grail-kush_100x100_c0b9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/622097/b/holy-grail-kush__primary_5c5e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/holy-grail-kush_100x100_57b4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617555/b/holy-grail-kush__primary_6fd0.jpg"}],"photoTotalCount":128,"popularCities":["Toronto, ON","Vancouver, BC","Calgary, AB","Los Angeles, CA","Montréal, QC","China","Denver, CO","Edmonton, AB","Hamilton, ON","Ottawa, ON"],"permalink":"https://mobileapi.leafly.com/hybrid/holy-grail-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.5344537815126/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"OG #18","subtitle":null,"slug":"og-18","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-18","symbol":"O18","applink":"leafly://strain/og-18"},{"name":"Kosher Kush","subtitle":null,"slug":"kosher-kush","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/kosher-kush","symbol":"Kos","applink":"leafly://strain/kosher-kush"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":63,"outdoorFinish":null,"height":"Medium","averageYield":"Medium","environment":null,"growNotes":""}}
