{
    "aka": "Golden Panda Bear, Panda",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1465599600000)/",
            "id": "contentitems-3399",
            "text": "This week at Leafly we've added some user-submitted strains. The majority of these fine flowers are hybridized versions of gorgeous, popular cuts like Bubba Kush and Blue Dream.\nHybrids blend complimentary effects and attributes to create strains with depth and nuance that pure genetics might not possess. A prime example is the lustrous mammalian newcomer Golden Panda. This strain joins powerful parentage that flows through Golden Pineapple (Golden Goat x Pineapple Kush), GSC (f.k.a Girl Scout Cookies) (OG Kush x Durban Poison), and Jack Herer to transmute medical-grade sedation (from Kush and Cookies) and mental clarity (from Jack Herer) into something greater than the sum of its parts.\nThe other strains on this list have their own unique hybrid nuances as well, so check them out and let us know what you think by leaving a review of the ones you've tried. Thank you to all of the cannabis lovers who suggested we add these to our database!\n \n   1. Golden Panda\n\nGold Panda is a cross between Golden Pineapple and Gold Nugget. This sativa-dominant hybrid has the earthiness and trichome production of GSC (f.k.a Girl Scout Cookies), with light green buds that pack rich tropical and spicy notes. Like other Kush derivatives, this strain is built to fight physical discomfort, showing powerful body effects stilted by a luminous mental state brought forward by its recessive Jack Herer genetics.\n\n \n   2. Blob OG\n\nBlob OG is supposedly a strain that originated in Western Washington. The heavy hitting, body-driven strain incorporates the stimulating mental elements of Diesel crossed against the potent indica-dominant genetics of Pre-99 Chemdawg. This cross offers lightness in the body and a mental edge from the Diesel. Because it can stretch toward 30% THC, sativa-dominant hybrid or not, this much potency will absolutely put the uninitiated consumer down for the count.\n\n \n   3. Silverhawks OG\n\nSilverhawks OG is a strong cross between Super Silver Haze and White Fire Alien OG, preferred by consumers for daytime use. This sativa-dominant strain is creative and energizing while remaining useful for relieving discomforts such as cramps, muscle spasms, and anxiety. Expect a funky, pungent citrus aroma with hints of fuel.\n\n \n   4. Silverfalls Kush\n\nSilverfalls Kush is a disease-resistant strain that is known to grow strong and tall in many different environments. Its 50/50 hybrid genetics make it versatile and well suited for mood enhancement and paint relief. This particular Kush is highly sought after as an outdoor strain due to its resilient genetics and strong effects that make it enjoyable both at home or outdoors.\n\n \n   5. Mendo Breath\n\nMendo Breath is an interesting mix of OGKB (OG Kush Breath, which is the supposed patriarch in the Cookies Fam genetics) and Mendo Montage. Their forces combined make dense frosty buds that reek of sweet vanilla and caramel. But no matter how good this smells, save it for after work. This thumper can pivot your entire day’s plans with its powerful body high built for chronic pain and discomfort.\n\n \n   6. Sour Bubba\n\nSour Bubba blends two famous strains that are robust all on their own but, when unified, show unique flavors and effects that speak to their long, potent lineages. With forward-leaning mental stimulation brought on by Diesel and a high-end Kush oriented body aura brought on by Bubba, Sour Bubba relaxes while providing ample mental energy to enjoy stationary activities like board games, video games, and movies.\n\n \n   7. Blue Kiss\n\nBlue Dream and Mistress OG come together to form the potent indica-dominant hybrid strain known as Blue Kiss. Seductive and sweet, Blue Kiss elicits relaxation and anti-anxiety effects that are easy on the mind and calm on the body. Mistress OG may have semi-sedative overtones, but its Blue Dream parentage still offers a tangible euphoria that crests as the sedation fades.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12002356/new-strains-alert-sour-bubba-golden-panda-silverfalls-kush-and-mo.png",
            "title": "New Strains Alert: Sour Bubba, Golden Panda, Silverfalls Kush, and More",
            "urlslug": "/news/strains-products/new-strains-alert-sour-bubba-golden-panda-silverfalls-kush-and-mo"
        }
    ],
    "articlesAvailable": true,
    "category": "Hybrid",
    "conditions": [
        {
            "name": "Migraines",
            "score": 121.66666666666666
        },
        {
            "name": "Anxiety",
            "score": 118.33333333333333
        },
        {
            "name": "ADD/ADHD",
            "score": 111.66666666666666
        },
        {
            "name": "PTSD",
            "score": 110
        },
        {
            "name": "Tinnitus",
            "score": 108.33333333333333
        }
    ],
    "description": "<p>Gold Panda is a cross between <a href=\"https://www.leafly.com/hybrid/golden-pineapple\">Golden Pineapple</a> and Gold Nugget. This sativa-dominant hybrid has the earthiness and trichome production of <a href=\"https://www.leafly.com/hybrid/girl-scout-cookie\">Girl Scout Cookies</a>, with light green buds that pack&nbsp;rich tropical and spicy notes. Like other Kush derivatives, this strain is built to fight physical discomfort, showing powerful body effects stilted by a luminous mental state brought forward by its recessive <a href=\"https://www.leafly.com/sativa/jack-herer\">Jack Herer</a> genetics.&nbsp;</p>\n",
    "descriptionPlain": "Gold Panda is a cross between Golden Pineapple and Gold Nugget. This sativa-dominant hybrid has the earthiness and trichome production of Girl Scout Cookies, with light green buds that pack&nbsp;rich tropical and spicy notes. Like other Kush derivatives, this strain is built to fight physical discomfort, showing powerful body effects stilted by a luminous mental state brought forward by its recessive Jack Herer genetics.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 143.33333333333331
        },
        {
            "name": "Happy",
            "score": 130
        },
        {
            "name": "Uplifted",
            "score": 124.99999999999999
        },
        {
            "name": "Creative",
            "score": 116.66666666666666
        },
        {
            "name": "Aroused",
            "score": 111.66666666666666
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 6.666666666666667
        },
        {
            "name": "Pungent",
            "score": 5
        },
        {
            "name": "Citrus",
            "score": 3.3333333333333335
        },
        {
            "name": "Earthy",
            "score": 3.3333333333333335
        },
        {
            "name": "Spicy/Herbal",
            "score": 1.6666666666666667
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1378449,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This is one of my favorites, we did a sweet review while smoking this strain. it was definetly a deep crystal heavy hitter that had us lifted as a team, the creative ideas where flowing and we had pretty good energy. I think we hit up 3-4 locations for the sohot that night. Check out the review at marijuanaTV.org\n\n-Jay",
            "username": "GreenLife"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1610847,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Definitely gaining an appreciation for this strain! Didn’t initially think it did much, but then realized I’d cleaned, played w/ the dogs & made food for my sexy (this makes him even sexier) man.  \nSorry... i just smoked a bowl & feeling it (a creeper).  This makes the mind go to fun places! \nFor a girl who must have MMJ multiple times throughout the day, I’m loving this! Not euphoric or scattered. Just happy! And my pain went from level 7 to a 5.  I normally need a damn stoney indica or hybrid to do that, but then couched for an hour. Very high tolerance!! \nThis is a keeper! Reminding myself to pick up 1/4-1/2oz later. Perfect daytime med!",
            "username": "monstapuss"
        }
    ],
    "id": 229583,
    "name": "Golden Panda",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 118.33333333333333
        },
        {
            "name": "Dry Eyes",
            "score": 116.66666666666666
        },
        {
            "name": "Paranoid",
            "score": 9.999999999999998
        },
        {
            "name": "Anxious",
            "score": 8.333333333333332
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/golden-pineapple",
            "category": "Hybrid",
            "name": "Golden Pineapple",
            "permalink": "https://mobileapi.leafly.com/hybrid/golden-pineapple",
            "slug": "golden-pineapple",
            "subtitle": null,
            "symbol": "Gp"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/hybrid/golden-panda",
    "photoTotalCount": 2,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503914/b/golden-panda__primary_3ff6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-panda_100x100_40df.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503318/b/golden-panda__primary_e83b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/golden-panda_100x100_ac97.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Everett, WA",
        "Seattle, WA",
        "Shoreline, WA",
        "Bothell, WA",
        "Calgary, AB",
        "Casa Grande, AZ",
        "Chandler, AZ",
        "Edmonds, WA",
        "Granite Falls, WA",
        "Hamilton, ON"
    ],
    "rating": 4.65,
    "relatedStrains": [],
    "reviewCount": 17,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "golden-panda",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.64705882352941/240",
    "subtitle": null,
    "symbol": "Gpd",
    "symptoms": [
        {
            "name": "Fatigue",
            "score": 118.33333333333333
        },
        {
            "name": "Headaches",
            "score": 118.33333333333333
        },
        {
            "name": "Stress",
            "score": 115
        },
        {
            "name": "Insomnia",
            "score": 111.66666666666666
        },
        {
            "name": "Lack of Appetite",
            "score": 111.66666666666666
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
