{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1501426821000)/",
            "id": "contentitems-35532",
            "text": "One of the things that makes every cannabis strain unique is its aroma. From sweet berry and fruit to earthy, herbal, and floral, an attractive fragrance is native to most strains.\nAnd then there are those that, whether by accident or breeder’s intention, inherited flavors that truly challenge the palate. With names like “Cat Piss” and “Dog Shit,” it’s clear that no one is in denial of this odiferous reality.\nOddly enough, either by novelty or quality of effects, many of these remain staples in the cannabis community despite their strange, borderline terrible aromas.\n\n   Sour Cheese\nSour Cheese, UK Cheese, Exodus Cheese…all of these strains refer to a lineage characterized by a sour, savory aroma. Offering mellow euphoria that lifts energy and mood, Sour Cheese is a delightful hybrid strain with a funky flavor that most consumers can look past. But with a fragrance this stinky, we see polarized opinions.\nSome love it so much, it inspires poetry. Just magical:\n\n“When you open the jar and take a whiff you are greeted with a splash of pungent sour that quickly turns into a smooth cheese. The buds release a satisfying snap that throws trichomes into the air when broken from the stems.” – Neemix\n\nBut then:\n\n“[S]mells like puke.” – soop21\n\n\n   Cat Piss\nThis sativa has a pungent aroma that is reminiscent of ammonia–and thus, cat urine. But there’s a reason Cat Piss keeps getting planted, and it has something to do with the buzzy, stimulating effects considered to be worth the funk, according to many Leafly reviewers.\n\n“Besides the [wretched] taste that leaves you wanting water and a mint, soon you will be too uplifted to care! Effects are amazing and are long lasting.” –misterbest\n\nHowever, if you’re susceptible to paranoia and anxiety like this poor reviewer, maybe avoid this novelty strain altogether:\n\n“Yuck. It really does smell like cat piss. Strong, racy sativa. Made me paranoid.” –aarvind\n\n\n   Dog Shit\nSpeaking of animal waste you’d never expect to find yourself smoking, Dog Shit is yet another strain named for its foul-smelling aroma. A hybrid strain most easily acquired in Oregon, its odor doesn’t always come out smelling like sour, funky “doody pies.” But even when it does, Dog Shit retains an unexpected fan base:\n\n“My first impressions of the bud were that they were very stinky and definitely lived up to their name however once I smoked it the smell evolved into something more sweet and pleasant.” – DogeKing\n\nBut, to the shock of absolutely no one, this poopy scented strain ain’t for everyone:\n\n“I got very anxious and paranoid when taking this and it smells kinda bad.” – BONECRUSHER27\n\n\n   M-39\nBased on descriptions from Leafly users, M-39 sounds like Canadian ditchweed grown in a tar pit. And, according to reviews, its aroma is most commonly likened to just that–tar. Some say that its abundance can be attributed to its dull, lackluster aroma that made it easier to smuggle. Across the board, it seems the quality of this strain varies, as well as opinions of it:\n\n“It has a very strong smell almost a combination of paint and smelly body odor.” – StoneySundays\n\nBut I guess it isn’t always bad:\n\n“[H]as a soft smoke with notes of peanut butter and fall aroma.” – ray8753\n\nSo does it taste like tar or warm autumnal cookies? You’ll probably have to wander over to Canada’s black market to find out.\n\n   Grandpa’s Breath\nThere’s a slightly musty hint to this strain, but it’s really not as bad as it sounds. Grandpa’s Breath is more aptly named for the Granddaddy Purple genetics used to breed it, but still, expectations set by the name can shape the experience.\n\n“Real nice body high, heavy relaxed head feeling, taste isn’t amazing but isn’t unpleasant either.” – hazefordayz\n\nBut this reviewer not only loves Grandpa’s Breath – he/she “loooooves” it:\n\n“This is one of the best tasting and medicating, fragrant strains I’ve ever had. I looooove Grandpa’s Breath!” – Strandz\n\nIt’s clear that there’s a layer of subjectivity when it comes to cannabis flavors–even flavors as unusual and questionable as those explored in this roundup. Although you may never want to try any of these, they do demonstrate the vast aromatic spectrum cannabis has to offer. And that, at the very least, is kind of impressive.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/28114836/cannabis-aroma-1.jpg",
            "title": "5 Cannabis Strains With Unusual (and Arguably Terrible) Aromas",
            "urlslug": "/news/strains-products/cannabis-strains-with-unusual-aromas"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 33.333333333333336
        },
        {
            "name": "ADD/ADHD",
            "score": 26.666666666666668
        },
        {
            "name": "PTSD",
            "score": 26.666666666666668
        },
        {
            "name": "Arthritis",
            "score": 23.333333333333332
        },
        {
            "name": "Asthma",
            "score": 20
        }
    ],
    "description": "<p>Grandpa&rsquo;s Breath is a semi-sedative indica-dominant strain that provides functional relaxation. This special cut combining parent strains <a href=\"https://www.leafly.com/hybrid/og-kush\">OG Kush</a> and <a href=\"https://www.leafly.com/indica/granddaddy-purple\">Granddaddy Purple</a> was bred by Dungeons Vault Genetics, and it emits pungent, earthy <a href=\"https://www.leafly.com/news/cannabis-101/terpenes-the-flavors-of-cannabis-aromatherapy\">terpenes</a> with a little fruitiness intermixed. Grandpa&rsquo;s Breath has an above average yield, but also tends to take a touch longer to flower. Utilize Grandpa&rsquo;s Breath in the evening to maximize the deep relaxation central to its effects. &nbsp;&nbsp;</p>\n\n<p>&nbsp;</p>\n",
    "descriptionPlain": "Grandpa&rsquo;s Breath is a semi-sedative indica-dominant strain that provides functional relaxation. This special cut combining parent strains OG Kush and Granddaddy Purple was bred by Dungeons Vault Genetics, and it emits pungent, earthy terpenes with a little fruitiness intermixed. Grandpa&rsquo;s Breath has an above average yield, but also tends to take a touch longer to flower. Utilize Grandpa&rsquo;s Breath in the evening to maximize the deep relaxation central to its effects. &nbsp;&nbsp;\n\n&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 66.66666666666667
        },
        {
            "name": "Focused",
            "score": 43.333333333333336
        },
        {
            "name": "Euphoric",
            "score": 36.666666666666664
        },
        {
            "name": "Sleepy",
            "score": 33.333333333333336
        },
        {
            "name": "Uplifted",
            "score": 33.333333333333336
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 53.333333333333336
        },
        {
            "name": "Diesel",
            "score": 26.666666666666668
        },
        {
            "name": "Pungent",
            "score": 26.666666666666668
        },
        {
            "name": "Woody",
            "score": 23.333333333333332
        },
        {
            "name": "Plum",
            "score": 20
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1412522,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Grandpa's Breath has been by far the most PTSD/anxiety/insomnia friendly strain I've ever had. I'm still present, able to think clearly, but I am extremely relaxed, and also reminded of the beauty in my life: I feel grateful for so much, including this strain. Grandpa has a calming presence, and gentle wisdom. Namaste.",
            "username": "friendlysmoker"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1603276,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "This strain is mainly a relaxation station. This is perfect for body aches and pains! If a completely healthy person were to smoke this just for fun, it would be most effective to smoke it at night time as it most likely will put you in a comfy atmosphere.",
            "username": "Vapescape"
        }
    ],
    "id": 287087,
    "name": "Grandpa’s Breath",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 30
        },
        {
            "name": "Headache",
            "score": 20
        },
        {
            "name": "Dry Eyes",
            "score": 6.666666666666667
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/indica/grandpas-breath",
    "photoTotalCount": 0,
    "photos": [],
    "popularCities": [
        "Portland, OR",
        "Lansing, MI",
        "Bend, OR",
        "Cle Elum, WA",
        "Denver, CO",
        "Everett, WA",
        "Lincoln City, OR",
        "Mount Shasta, CA",
        "Phoenix, AZ",
        "Santa Ana, CA"
    ],
    "rating": 4.65,
    "relatedStrains": [],
    "reviewCount": 17,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "grandpas-breath",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.64705882352941/240",
    "subtitle": null,
    "symbol": "Gpb",
    "symptoms": [
        {
            "name": "Stress",
            "score": 36.666666666666664
        },
        {
            "name": "Cramps",
            "score": 26.666666666666668
        },
        {
            "name": "Pain",
            "score": 26.666666666666668
        },
        {
            "name": "Inflammation",
            "score": 23.333333333333332
        },
        {
            "name": "Muscle Spasms",
            "score": 23.333333333333332
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
