{
    "aka": "The Remedy",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1519851079000)/",
            "id": "contentitems-59186",
            "text": "Cannabidiol, or CBD, is becoming a mainstay in consumers’ medicine cabinets as it combats pain, inflammation, anxiety, and much more. However, even as CBD strains and products become more readily available, the price tag can often make one flinch. For this reason, it’s worth knowing which products will bring the best value based on CBD abundance.\n\nLooking at data from cannabis testing labs across Washington State, we compiled a list of strains that tend to produce significant amount of CBD. These numbers are derived from the testing samples of cannabis flowers and do not include CBD concentrates.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nIn the above graph, you’ll find the average cannabinoid contents of ten popular CBD-dominant strains. You’ll notice that many of these strains contain only trace amounts of THC, while others exhibit a more balanced CBD:THC ratio (which means they will be more euphoric in effect). This graph is based on datasets from multiple reliable testing labs across Washington State. However, it’s worth noting that the datasets from each individual lab differ slightly.\nTake a look at the cannabinoid data from one lab, and notice how the numbers shift slightly.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nMost strains maintain a CBD:THC ratio similar to that in the averaged dataset. However, you’ll also see deviations, like ACDC which exhibits a more balanced CBD:THC ratio according to this lab’s individual testing results.\nNow let’s see how the dataset of Lab A compares to a different lab, also represented in the larger, averaged dataset above.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nAs you can see, the CBD levels from Lab B are much higher on average than those from Lab A. There are a number of possible explanations for this. A lab may manufacture bloated cannabinoid profiles, as we’ve seen some labs do in the past. It could also be that Lab B simply tested samples from growers who achieved higher CBD levels in their harvest.\nThe main takeaway here is this: the cannabinoid profile printed on your product depends not only on the strain’s genetics and expertise of the grower, but also on the testing methods (and ethics) of the local lab that performed the chemical analysis. The Dancehall you bought on your last trip to the dispensary is likely to reflect the cannabinoid data illustrated in the above graphs–however, if you see deviation, the reason lies in the many layers of strain and data variability.\n\nCannabis Strains With High Levels of CBD\nWith this caveat in mind, let’s look at the strains that expressed the highest levels of CBD according to the above lab data.\n\nFind Dancehall Nearby\nDancehall is an upbeat and inspiring strain meant to lift your spirits while coercing creativity. With a CBD:THC ratio of nearly 20:1 on average, this strain delivers little to no euphoric effects that might distract focus or dampen cognition in THC-sensitive consumers.\n\nFind ACDC Nearby\nKnown for its keen ability to lift anxiety of all shades, ACDC is a godsend to consumers susceptible to the side effects of THC. This strain allows you to harness many of the desirable traits of cannabis, like light-footed physical relaxation and gentle mood elevation, without the cost of a clear, calm mind.\n\nFind Suzy Q Nearby\nSuzy Q is a CBD-dominant strain with an extremely modest amount of THC, making it another mellow strain with little to no high. The mild effects of this pine-scented strain help you shed anxious or demotivating mental blocks that stood in the way of creativity and productivity.\n\nFind Ringo’s Gift Nearby\nNamed in recognition of the CBD pioneer Lawrence Ringo, Ringo’s Gift imbues the consumer with a sense of wellbeing alongside steady relief in the body. Use this strain to take the edge off pain and stress, while allowing the mind to roam free without the shackles of paranoia or distracting euphoria.\n\nFind Charlotte’s Web Nearby\nCharlotte’s Web was the first CBD strain to receive media attention, and has achieved legendary status among CBD varieties ever since. Although its reputation is built upon its success in treating epilepsy, this strain has aided patients treating many other conditions including pain, anxiety, and inflammation. Charlotte’s Web is grown by CW Pharmaceuticals in Colorado.\n\nFind Remedy Nearby\nRemedy is a high-CBD strain that quietly ushers in easy relaxation without mental fog. For consumers seeking something a little more relaxing than a cup of tea, Remedy offers a solution with effects that rid the mind of anxiety while soothing aches, pains, and inflammation.\n\nFind Sour Tsunami Nearby\nSour Tsunami has become a household name among high-CBD strains. This variety tends to produce less than 1-2% of THC, so you can reap its medicinal benefits without the high. Sour Tsunami is fairly prolific, so keep an eye out for this strain at your next dispensary visit if you’re looking to quell pain or anxiety symptoms without the interference of THC.\n\nFind Hawaiian Dream Nearby\nIf you’re looking to harness the benefits of THC and CBD but wary of getting too high, Hawaiian Dream is the strain for you. With a THC content of around 5% and a CBD profile stretching between 5-10%, Hawaiian Dream can help abate symptoms with only mild, gentle euphoria. As an added bonus, this strain throws in a little tropical flavor to sweeten the experience.\n\nFind Dance World Nearby\nDance World is a CBD-dominant strain that almost achieves a balanced CBD:THC ratio, making it especially appropriate for consumers struggling with pain, depression, and lack of appetite. This synergy of THC and CBD helps to inspire positivity and more vibrant moods by handing you subdued euphoria on a leash.\n\nFind Nordle Nearby\nNordle offers a balanced abundance of both THC and CBD that makes it especially suitable for patients dealing with pain, insomnia, muscle spasms, and anxiety. If your symptoms are keeping you up at night, Nordle is a great nightcap solution for dialing down pain and worries so you can spend less time tossing and turning.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28121936/high-cbd-strains.jpg",
            "title": "Which Cannabis Strains Are Highest in CBD, According to Lab Data?",
            "urlslug": "/news/strains-products/high-cbd-marijuana-strains-according-to-lab-data"
        },
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1514495213000)/",
            "id": "contentitems-52994",
            "text": "New Year’s resolutions are an excellent way to jump-start your goals and keep you focused for the year ahead. But they can also be difficult to maintain as time moves forward—motivation wanes and life gets in the way. We get it, so to help you accomplish your goals, we gathered a few cannabis strains that will keep you on the right track (long past January).\n\nWhether you want to get fit, obtain a healthy weight, increase your productivity, get more sleep, or lower your stress levels, there’s a strain that can help you stay on top of these resolutions and enhance your overall well-being. Head to your favorite dispensary to load up on these picks before the clock strikes midnight on December 31st.\nWhat strains do you use to stay motivated? Tell us about them in the comments.\nUp Your Fitness Game With Green Crack\nIf your goals include running a 10K, bench pressing your partner, or simply increasing your confidence, there are plenty of reasons why working out is such a popular New Year’s resolution. It can be hard to stay motivated when it comes to fitness, so choosing a strain that offers an abundance of energy is a great way to boost morale and steer you away from winter hibernation.\nStrain Recommendation: Green Crack is the perfect strain for spiking your energy, holding your focus, and warding off fatigue. With a fruity, sweet flavor that pairs perfectly with a healthy breakfast, this bright sativa will kick you into high gear and stick with you on your morning run.\n\nEmbrace Self Care and Get More Sleep With Northern Lights\nIt’s a busy world, and too many of us get so wrapped up in our responsibilities that we forget about one of the most important things we can do for our health: sleep. Lack of sleep increases your risk for a variety of health issues, while quality sleep can improve focus, concentration, memory, and physical well-being. The first step to a great day is a good night’s sleep; to ensure you are performing at your best, avoid strains that will keep you wired into the late evening and opt for ones that promote a healing slumber.\nStrain Recommendation: Northern Lights is the optimal strain for bedtime bliss. This pure indica melts into the body and calms the mind. Make a cup of tea, light up a joint, and sink into pure alleviation.\nStay Focused and Be Productive With Durban Poison\nIf you’re like me, you’re constantly thinking about how to be a more productive person, but maintaining focus doesn’t always come easy. The New Year is the perfect time to reassess your productivity goals so you can be your best self in work, school, or any other important obligations. If this is your goal, reach for a strain that complements and enhances a sharp mind.\nStrain Recommendation: Durban Poison is the cure for de-motivation. Known for its energizing properties and aid to creativity, this sativa will uplift your mood and give you the push you need to become a productivity machine.\n\nObtain a Healthy Weight With Remedy and Banana OG\nOne of the top goals on everyone’s New Year’s resolutions lists is to lose weight. But for some, it can be equally important to maintain or put on a few pounds. Whatever your goal, reaching a healthy weight can seem a daunting task that is especially difficult to sustain. With a little help from cannabis, you may be able to cross this resolution off your list sooner than you think.\nStrain Recommendation: Remedy is a great strain for avoiding the munchies. A high-CBD indica, this strain has trace amounts of THC, but packs a powerful punch against pain, anxiety, and superfluous hunger. Its sweet, floral, and citrus notes will leave you free to indulge in a tasty treat—without all the calories.\nBanana OG steps up to the plate for those who need a little help stimulating their appetite. If you have a hard time keeping weight on or maintaining your weight without the scale dropping, Banana OG will open you up to the munchies and keep you feeling comfortable in indulging. This strong hybrid suits its name with powerful banana flavors and a 25% THC content that will get your stomach rumbling in no time.\n\nLower Your Stress Levels With Blue Dream\nWhen looking back over the past year, with all of its trials and tribulations, you may feel that all you did was stress. You’re not alone, and that’s why the promise of a new year can bring renewed peace and tranquility for so many. If your New Year’s resolution is to stress less and live more, then you’ll want a cannabis strain that can take the edge off.\nStrain Recommendation: Blue Dream is a legendary strain for a reason, and when it comes to conquering stress, few do it as well as a bowl packed with this long-time favorite. This buzzy hybrid works wonders for embracing full-body relaxation without a sedating mental fog—replacing stress with euphoric calm.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/28130345/strains-new-year-resolution.jpg",
            "title": "5 Strains to Help You Reach Your Goals in the New Year",
            "urlslug": "/news/strains-products/5-strains-goals-in-the-new-year"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 56.29778672032193
        },
        {
            "name": "Arthritis",
            "score": 48.158953722334005
        },
        {
            "name": "ADD/ADHD",
            "score": 38.86317907444668
        },
        {
            "name": "Spinal Cord Injury",
            "score": 28.92354124748491
        },
        {
            "name": "PTSD",
            "score": 24.949698189134807
        }
    ],
    "description": "<p>Remedy, a cross between <a href=\"http://www.leafly.com/news/lifestyle/whats-the-deal-with-these-high-cbd-strains\">Cannatonic</a> and <a href=\"http://www.leafly.com/indica/afghan-skunk\">Afghan Skunk</a>, is a <a href=\"http://www.leafly.com/news/lifestyle/whats-the-deal-with-these-high-cbd-strains\">high-CBD</a> strain that induces little to no psychoactive effects. Remedy can reach CBD levels as high as 15% while THC is found in only trace amounts of less than 1%. Yellow-tinted buds hide under a sheath of crystal trichomes and carry a lemon-pine scent. Upon inhaling the sweet, floral notes of Remedy, the consumer is lifted into a state of mellow relaxation that differs greatly from the jarring experience induced by high THC strains. Patients looking to medicate without the pronounced head and body effects may turn to Remedy to treat seizures, pain, autism, inflammation, and anxiety disorders. Growers hoping to cultivate this highly medicinal strain should allow a 6 to 8 week flowering time in indoor gardens.</p>\n",
    "descriptionPlain": "Remedy, a cross between Cannatonic and Afghan Skunk, is a high-CBD strain that induces little to no psychoactive effects. Remedy can reach CBD levels as high as 15% while THC is found in only trace amounts of less than 1%. Yellow-tinted buds hide under a sheath of crystal trichomes and carry a lemon-pine scent. Upon inhaling the sweet, floral notes of Remedy, the consumer is lifted into a state of mellow relaxation that differs greatly from the jarring experience induced by high THC strains. Patients looking to medicate without the pronounced head and body effects may turn to Remedy to treat seizures, pain, autism, inflammation, and anxiety disorders. Growers hoping to cultivate this highly medicinal strain should allow a 6 to 8 week flowering time in indoor gardens.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 107.29376257545272
        },
        {
            "name": "Happy",
            "score": 68.82293762575453
        },
        {
            "name": "Sleepy",
            "score": 48.8430583501006
        },
        {
            "name": "Focused",
            "score": 40.97585513078471
        },
        {
            "name": "Uplifted",
            "score": 36.710261569416495
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 71.3682092555332
        },
        {
            "name": "Flowery",
            "score": 34.63782696177062
        },
        {
            "name": "Woody",
            "score": 27.43460764587525
        },
        {
            "name": "Citrus",
            "score": 20.684104627766597
        },
        {
            "name": "Pine",
            "score": 18.53118712273642
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 49,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1414021,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Straight to the point, I don.t like to get high but I also don,t like taking pharmaceutical  for sleep and pain,got some of this epic strain from a collective in whatcom county, tested at .6 thc and 14%cbd plain an simple , kills the pain! helps me sleep and I don!to get all Waco stoned. This is about as true mmj medicine  as it gets. Hat",
            "username": "CaptTodd"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1626125,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "My favorite strain I have ever tried by far. Not really psychoactive, but definitely medicinal. If you have anxiety this is the strain for you. Anxiety will melt away and then some. The first time I tried this strain was as a preroll from a dispo in Seattle and after finishing it I wanted to go do some parkour. You will feel high on this strain, but you won't really be high due to how low in thc it is.  Great strain for just about any time of the day and any situation. While it is an indica, I find the body sedation is very minimal compared to a traditional high thc indica.",
            "username": "Cbadrunner94"
        }
    ],
    "id": 66369,
    "name": "Remedy",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 28.55130784708249
        },
        {
            "name": "Dry Eyes",
            "score": 2.857142857142857
        },
        {
            "name": "Headache",
            "score": 1.7806841046277666
        },
        {
            "name": "Dizzy",
            "score": 1.4285714285714286
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/cannatonic",
            "category": "Hybrid",
            "name": "Cannatonic",
            "permalink": "https://mobileapi.leafly.com/hybrid/cannatonic",
            "slug": "cannatonic",
            "subtitle": null,
            "symbol": "Ct"
        },
        {
            "applink": "leafly://strain/afghan-skunk",
            "category": "Indica",
            "name": "Afghan Skunk",
            "permalink": "https://mobileapi.leafly.com/indica/afghan-skunk",
            "slug": "afghan-skunk",
            "subtitle": null,
            "symbol": "Afs"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/remedy",
    "photoTotalCount": 6,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648715/b/remedy__primary_2356.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/remedy_100x100_56c8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502902/b/remedy__primary_2e4f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/remedy_100x100_72cc.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503218/b/remedy__primary_6eec.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/remedy_100x100_7d13.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/378323/b/remedy__primary_6963.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/remedy_100x100_34d9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/358607/b/remedy__primary_dba2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/remedy_100x100_9feb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/247341/b/remedy__primary_4423.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/remedy_100x100_ee95.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Portland, OR",
        "Los Angeles, CA",
        "Seattle, WA",
        "Boulder, CO",
        "Eugene, OR",
        "Aurora, CO",
        "Everett, WA",
        "Medford, OR",
        "Trinidad, CO"
    ],
    "rating": 4.62,
    "relatedStrains": [],
    "reviewCount": 86,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "remedy",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.61627906976744/240",
    "subtitle": null,
    "symbol": "Rem",
    "symptoms": [
        {
            "name": "Pain",
            "score": 101.63983903420524
        },
        {
            "name": "Stress",
            "score": 58.45070422535211
        },
        {
            "name": "Muscle Spasms",
            "score": 40.2917505030181
        },
        {
            "name": "Insomnia",
            "score": 37.06237424547284
        },
        {
            "name": "Depression",
            "score": 33.16901408450704
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
