{
    "aka": "AK Skunk",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1443207600000)/",
            "id": "contentitems-3409",
            "text": "These strains have just been added to the Leafly Explorer! For the ones you've tried, you should leave a review reminiscing over all the good times with that strain. If you haven't had the chance to test any of these varieties out, don't fret — the links below will tell you whether or not that strain is being offered at a shop near you.\n \n 1. Strawberry Fields \n\nStrawberry Fields by Sagarmatha Seeds is an indica-dominant hybrid strain that takes the flavorful Strawberry Cough and crosses it with an undisclosed indica parent. This strain is destined for consumers who love that strawberry aroma, but would prefer something more tranquilizing than the Strawberry Cough sativa. Its heavier effects also make Strawberry Fields a better choice for patients treating pain, insomnia, and appetite loss.\n\nFind out which locations are currently carrying Strawberry Fields\n \n 2. Blurple\n\nBlurple, also known as Blue Dream Purple, is a balanced hybrid cross between Blue Dream and Mendocino Purps. Its effects position themselves cerebrally at first, with gentle body relaxation that keeps you feeling light and free of tension. Drawing from both sides of the family, Blurple carries a sweet, dessert-like berry and grape aroma that comes to life on the inhale. This strain earns its name as bluish purple hues swirl throughout Blurple’s green buds.\n\nFind out which locations are currently carrying Blurple\n \n 3. Kona Gold\n\nKona Gold is a sativa strain that has traveled far from its native origin, the volcanic soils of Hawaii’s Big Island. Soaring cerebral-focused euphoria captures the mind while leaving the body light and functional, making this sativa a perfect pair with or replacement for your morning cup of coffee. A tropical medley of pineapple and citrus flavors are cut by a sharp sour aroma that could almost be compared to diesel fuel. The authentic Kona Gold is unique to its mineral-rich homeland, but its replications overseas still have much to offer sativa enthusiasts.\n\nKona Gold is currently available at QPC in Everett, WA\n \n 4. Skunk 47\n\nSkunk 47, offspring of Skunk #1 and AK-47, is a sour-smelling hybrid strain that leans far to the indica side of the family. Bred by World of Seeds Bank, Skunk 47’s parents were selected for pungent aromas and fast flowering cycles. Additionally, Skunk 47 plants have a high resistance to mold and pests. Its indica tendencies come out strong in this strain’s effects, delivering a crushing heaviness perfect for stubborn pain or sleepless nights.\n\nFind out which locations are currently carrying Skunk 47\n \n 5. Blackberry Trainwreck\n\nBlackberry Trainwreck, or Blackberry Wreck, is a hybrid strain parented by two notable varieties, Blackberry Kush and Trainwreck. Led by indica genetics, Blackberry Trainwreck typically grows into chunky, dense conic buds that offer a sweet and earthy mix of berry flavors. Tension and stress melt away from the body on the exhale while the mind elevates to lighthearted positivity.\n\nFind out which locations are currently carrying Blackberry Trainwreck\n \n 6. Whitaker Blues\n\nWhitaker Blues is a classic indica-dominant strain that blends genetics from Quimby (a West Coast indica) and Blueberry. Breeder DJ Short is famous for his Blueberry line, but this strain was actually developed by his son, JD. A true indica in appearance and effect, Whitaker Blues grows into stout bushy plants and delivers a sedating stone that leaves you feeling heavy with dreamy bliss. Its flavors can span the entire spectrum of sweetness, so you may find yourself detecting anything from floral vanilla to fruity citrus. Whitaker Blues’ effects are initially enlivening but taper down into a deep transcendental calm conducive for meditation or lazy days.\n\nFind out which locations are currently carrying Whitaker Blues\n \n 7. Double Barrel OG\n\nDouble Barrel OG offers a double shot of OG genetics as this hybrid combines White Fire OG with Raskal’s OG Kush. Its dense, resin-packed buds give rise to flavors both sweet and sour, a pungent fusion of sweet lemons and fuel-drenched pine. This hybrid travels straight to the head, launching you into thick euphoric lucidity that lets you forget any heaviness in mind or body. As the acute effects settle, Double Barrel OG eases you into a motivated and functional buzz perfect for afternoon productivity.\n\nFind out which locations are currently carrying Double Barrel OG\n \nCheck out our other new strains recently added to the Leafly Explorer, or catch up on last week's New Strains Alert!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/09/12002409/new-strains-alert-strawberry-fields-kona-gold-blurple-blackberry.png",
            "title": "New Strains Alert: Strawberry Fields, Kona Gold, Blurple, Blackberry Trainwreck, and More",
            "urlslug": "/news/strains-products/new-strains-alert-strawberry-fields-kona-gold-blurple-blackberry"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 17.12962962962963
        },
        {
            "name": "PTSD",
            "score": 14.351851851851851
        },
        {
            "name": "Arthritis",
            "score": 13.425925925925926
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 12.5
        },
        {
            "name": "Tinnitus",
            "score": 12.5
        }
    ],
    "description": "<p>Skunk 47, offspring of <a href=\"https://www.leafly.com/hybrid/skunk-1\">Skunk #1</a> and <a href=\"https://www.leafly.com/hybrid/ak-47\">AK-47</a>, is a sour-smelling hybrid strain that leans far to the indica side of the family. Bred by World of Seeds Bank, Skunk 47&rsquo;s parents were selected for pungent aromas and fast flowering cycles. Additionally, Skunk 47 plants have a high resistance to mold and pests. Its indica tendencies come out strong in this strain&rsquo;s effects, delivering a crushing heaviness perfect for stubborn pain or sleepless nights.</p>\n",
    "descriptionPlain": "Skunk 47, offspring of Skunk #1 and AK-47, is a sour-smelling hybrid strain that leans far to the indica side of the family. Bred by World of Seeds Bank, Skunk 47&rsquo;s parents were selected for pungent aromas and fast flowering cycles. Additionally, Skunk 47 plants have a high resistance to mold and pests. Its indica tendencies come out strong in this strain&rsquo;s effects, delivering a crushing heaviness perfect for stubborn pain or sleepless nights.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 162.96296296296296
        },
        {
            "name": "Happy",
            "score": 122.68518518518519
        },
        {
            "name": "Sleepy",
            "score": 117.12962962962963
        },
        {
            "name": "Euphoric",
            "score": 105.55555555555556
        },
        {
            "name": "Giggly",
            "score": 105.55555555555556
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 134.25925925925927
        },
        {
            "name": "Skunk",
            "score": 121.75925925925927
        },
        {
            "name": "Berry",
            "score": 113.42592592592592
        },
        {
            "name": "Blueberry",
            "score": 112.5
        },
        {
            "name": "Pungent",
            "score": 104.62962962962963
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 57,
        "growNotes": "",
        "height": null,
        "outdoorFinish": "Early October",
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1394662,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Got this at Old Toby in Chehalis, WA.  Check my blog out AgingEnt.com\n\n\n--\nBrand: Orgrow\nStrain: Skunk 47\nIndica\n\nPotency Analysis: TTL 22.5% THC 0.18% CBD 0.32% THCA 21.6%\n\nHarvested: 12/09/2014\nSmoked: 06/16/2015\n\nPackaging: 5\"x3.5\" mylar-back 10mil plastic zip top bag\nCost: $12.50/gram (2 gram package)\n\n--\n\nOverall, this was a decent weed.  It reminded me very much of any of the variety of standard buds that passed through my hands before I lived in Washington.  With the pricing I was not expecting super-duper quality.  One thing I will say is pretty remarkable is the density and thickness of the hairs.  These dark red hairs were crazy.  Interestingly, it did not smell skunky to me - not even a little.\n\n--\n\nOverall the flavor was decent, good marijuana.  Tasty, no particular outstanding overtones in anyway, but definitely a nice smell. One of my neighbors smelled me and said, \"Hey it smells like home over there!\" so I invited her over to enjoy a bit as well.  She got blazed on the first hit, her eyes lit up red almost instantly and she coughed a little.  On the second hit, she was clearly done - tears and coughing hard - so I finished by myself.\n\n--\n\nYou can see pictures and read the rest of my review at agingent.com",
            "username": "AgingEnt"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1585202,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "What a beautiful lime green strain that I would definitely recommend it for night time smoking. Very sedating, relaxing and definitely good for pain, depression and insomnia. 22% and smells delicious",
            "username": "CypressSkill95"
        }
    ],
    "id": 179988,
    "name": "Skunk 47",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 132.40740740740742
        },
        {
            "name": "Dry Eyes",
            "score": 27.77777777777778
        },
        {
            "name": "Dizzy",
            "score": 0.9259259259259258
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/skunk-1",
            "category": "Hybrid",
            "name": "Skunk No. 1",
            "permalink": "https://mobileapi.leafly.com/hybrid/skunk-1",
            "slug": "skunk-1",
            "subtitle": null,
            "symbol": "Sk1"
        },
        {
            "applink": "leafly://strain/ak-47",
            "category": "Hybrid",
            "name": "AK-47",
            "permalink": "https://mobileapi.leafly.com/hybrid/ak-47",
            "slug": "ak-47",
            "subtitle": null,
            "symbol": "Ak"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/skunk-47",
    "photoTotalCount": 3,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/631035/b/skunk-47__primary_8b4f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/skunk-47_100x100_1b01.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/460906/b/skunk-47__primary_70d0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/skunk-47_100x100_dc45.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/396511/b/skunk-47__primary_3a87.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/skunk-47_100x100_de9f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Vancouver, WA",
        "Seattle, WA",
        "Anacortes, WA",
        "Ann Arbor, MI",
        "Bothell, WA",
        "Everett, WA",
        "Gig Harbor, WA",
        "Granite Falls, WA",
        "Kirkland, WA",
        "Port Angeles, WA"
    ],
    "rating": 4.33,
    "relatedStrains": [],
    "reviewCount": 27,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "skunk-47",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.33333333333333/240",
    "subtitle": null,
    "symbol": "S47",
    "symptoms": [
        {
            "name": "Stress",
            "score": 119.9074074074074
        },
        {
            "name": "Pain",
            "score": 118.98148148148148
        },
        {
            "name": "Depression",
            "score": 118.05555555555556
        },
        {
            "name": "Insomnia",
            "score": 116.20370370370371
        },
        {
            "name": "Fatigue",
            "score": 100.92592592592592
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
