{"sl_translate":"description,descriptionPlain,category","id":5773,"slug":"true-og","name":"True OG","subtitle":null,"symbol":"Tru","category":"Indica","description":"\u003cp\u003eTrue OG is a popular indica strain that was originally discovered in Southern California, where the term \u0026ldquo;OG\u0026rdquo; originally meant \u0026ldquo;ocean grown.\u0026rdquo; Bred with genetics from the very popular \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003eOG Kush\u003c/a\u003e, True OG is potent enough for mellow, lasting effects combined with a more focused head high. Flowers have a pungent, crisp citrus and evergreen scent. True OG has snagged the 2nd place indica spot in every High Times Medical Cup since 2010.\u003c/p\u003e\n","descriptionPlain":"True OG is a popular indica strain that was originally discovered in Southern California, where the term \u0026ldquo;OG\u0026rdquo; originally meant \u0026ldquo;ocean grown.\u0026rdquo; Bred with genetics from the very popular OG Kush, True OG is potent enough for mellow, lasting effects combined with a more focused head high. Flowers have a pungent, crisp citrus and evergreen scent. True OG has snagged the 2nd place indica spot in every High Times Medical Cup since 2010.\n","aka":"Kobe OG","rating":4.46,"highlightedReviews":[{"id":1417280,"username":"kasmoss","text":"I have a question...  And forgive me if I seem excited...  But, WTF is in pot that makes me feel \"normal\"????!!!!  Shittiest fucking day...  Feel like fucking crap and ready to cut open a vein - End it all!  Yeah!!!...  I take two hits off of my vape pen of True OG and I feel FUCKING NORMAL!  Wow...  \"Regular\" people thoughts...  A thirst for life...  If this is what the *Normals* feel like all the time, can we just hire some geneticist to manipulate our cells to infiltrate depression, anxiety, and PTSD cells and make them happy again?  Oh wait...  That would mean corporate funding...  Damn.\n\nSeriously, what is making the depression, anxiety, and PTSD sit in the back seat and fucking heel?","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"},{"id":1639163,"username":"moonstar11187","text":"I received this strain from a desp in LA and omg it was so good. Potent and strong tasting with a very mellowing stone feeling. The popcorn nuhs were small and easily broke up. Very good indica strain , should be used in late evening or before bed. Not a day time strain unless you are trying to take a nap.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3027","title":"The Best Cannabis Strains for Focus and ADD/ADHD","author":"Bailey Rahn","category":null,"date":"\/Date(1452633240000)\/","text":"Whether or not you’ve been diagnosed with ADD or ADHD, sometimes we need a little help concentrating. You’ve probably noticed that certain varieties of cannabis help you stay focused and productive while others can send your mind completely off the rails. Finding that perfect focusing strain requires a little self-analysis first: What is it that’s impeding your concentration? Are you disengaged? Do your thoughts race? Think of the below sections as your roadmap to the right strain.\nWe’re still waiting for research to provide more guidance on why cannabis might or might not help someone with ADD/ADHD, but we’re limited mostly to personal anecdotes. It’s not a bad idea to try a few different strains – a high-THC strain, a low-THC strain, high-CBD, balanced THC-CBD, and so on. At the end of this list, you’ll also find some appetite-boosting, sleep-inducing strains for those of you experiencing the negative side effects of stimulant ADD/ADHD medications.\n \nStrains for Mental Energy and Engagement\n \nCinex is the strain you reach for when that cup of coffee didn’t do the job. Providing wired euphoria that feeds creativity, this sativa can rekindle interest in tasks that may otherwise be a drag. Take caution with this one if you’re prone to anxiety and racing thoughts; Cinex can turn that up in some individuals.\n \n \nIt’s famous for a reason. Sour Diesel is one of the highest-rated strains on Leafly for treatment of ADD/ADHD, quite possibly due to its ability to shine a new, engaging light on activities and tasks. Speedy euphoria lets your mind stay nimble, but remember that dosing is key. Overdoing a potent sativa like Sour Diesel can have the opposite of your desired effect.\n\n“It makes your frontal lobe act in ways you could never have imagined. It’s almost like Sour Diesel is a key, a key that opens up whole realms of your mind that you were once ignorant of.”\n \n \nAccording to lore, this sativa was dubbed Green Crack by Snoop Dogg because its effects were so intensely stimulating. Green Crack had to make the list because, in my experience, few other strains can match its energy and focus. It sharpens the senses and brings vibrancy to the dull, all with an enticing tropical citrus flavor.\nClick here to browse more strains with stimulating, focused effects.\n \nStrains for Calming Focus\n \nSometimes what you need to concentrate isn’t a strain that speeds your brain up, it’s one that can slow the brain down. The indica-dominant True OG is touted among reviewers for knocking down stress and distractions for easier focus.\n\n“Comes on kind of slowly. Is a chilling high, but you can easily focus and do things like schoolwork, cleaning, etc.”\n \n \nBlueberry Headband captures the perfect synergy of its two parents. From Headband, it inherits a supercharged cerebral effect that lends a spark of creativity. The Blueberry parent softens the euphoric intensity of Headband, providing a mellow, full-body experience that allows your thoughts run at a more manageable pace.\nClick here to browse more strains with relaxing, focused effects.\n \nStrains for Cognitive Clarity\n \nA cross between Sour Tsunami and Harlequin, Harle-Tsu is a high-CBD strain that contains minimal levels of THC. It eases you into a sober, clear-headed calm as its relaxing effects come with minimal psychoactive impact, so you can keep your cognitive faculties intact. If you’re having trouble finding Harle-Tsu near you, try finding its high-CBD parent strains or close relative, Canna-Tsu.\n\n“A good herb for relaxation. Not much of a cerebral high, but what little high you do get is focused and energetic but calm. Its good to mix with some powerful indicas to even it out.”\n \n \nCalming physical sensations coupled with agile cerebral focus, Harlequin is another high-CBD strain that should be on your radar if concentration is hard to come by. Although this ratio can fluctuate, Harlequin typically expresses a 5:2 ratio of CBD:THC, so expect some euphoric stimulation in the mind.\nClick here to browse more strains with a high CBD content.\n \nStrains for ADD/ADHD Medication Side Effects*\n \nA genetic cross between Blueberry and Hindu Kush, Goo provides the golden trifecta of effects for those treating ADD/ADHD: appetite, sleepiness, and focus. This strain is meant for winding down, which can be difficult if you’re prescribed psychostimulant drugs that may stunt the appetite and keep you tossing and turning at night.\n\n“Currently one of my favorite strains. When my brain is too active I smoke this and it helps calm it down.”\n \n \nJupiter OG is another indica strain that can help restore appetite and restfulness when the side effects of your medications are at their worst. This indica may still provide a little kick of focus, but it should definitely be saved for later in the night when you’re ready to help your brain shut down.\nClick here to browse more appetite-enhancing, sedating strains.\n*Please consult with your doctor if you are being prescribed medication to treat your ADD/ADHD or another medical condition and ask if it’s advisable to supplement your regimen with medical marijuana.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12001420/best-cannabis-strains-for-focus-and-addadhd.jpg","urlslug":"/news/strains-products/best-cannabis-strains-for-focus-and-addadhd"},{"id":"contentitems-2973","title":"24 Strains to Prepare You for the Game of Thrones Season 4 Premiere","author":"Rebecca Kelley","category":null,"date":"\/Date(1396641600000)\/","text":"We’re big fans of Game of Thrones here at Leafly and the crew is super stoked for the season 4 debut this Sunday on HBO. If you’re planning on hosting a viewing party to kick off the premiere of one of the best shows on television, why not pick up some of these Game of Thrones-themed strains to properly celebrate?\nHere are 24 strains (some standing solo, some paired together) we feel tie in with the Game of Thrones universe perfectly (spoilers below if you aren’t caught up to season 4 by now). Yes, 24. That’s how much we love both our strains and this show. Even though All Men Must Die, their memories will live on thanks to this list of green.\n1. Mad Dawg \n\nThis earthy hybrid is in honor of Mad King Aerys II Targaryen, the kooky ruler who started this whole mess in the first place. Dude, all you had to do was not murder a bunch of people and threaten to burn down King’s Landing and we wouldn’t even have a Game of Thrones battle royale waging. If only he had a little stash of Mad Dawg to keep him feeling euphoric and relaxed.\n2. 3 Kings\n\nThe hybrid 3 Kings strain may be a fusion of Headband, Sour Diesel, and OG Kush, but it also signifies the three kings currently left standing in Game of Thrones at the start of season 4: Joffrey Lannister (aka The Worst Person Ever), Stannis Baratheon (aka “Stannis the Mannis,” self-proclaimed King of the Andals), and Balon Greyjoy (aka World’s Not-Greatest Dad), king of the Iron Islands. Maybe this pungent strain will clear some of the crazy out of their sinuses.\n3. Permafrost\n\nBecause, as House Stark constantly reminds us, “Winter is coming,” so you might as well hunker down and wait for it to arrive with some piney Permafrost.\nSpeaking of House Stark…\n4. Northern Lights\n\nThe North remembers, and though their numbers are dwindling and the Starks are constantly having George R. R. Martin take a never-ending dump on them, there are still a few scrappy surviving members who have a glimmer of hope shining, however dimly at the moment. Northern Lights is good for combating stress, and I’m guessing the Starks are feeling a little overwhelmed right about now.\n5. Lions Gate\n\nThis royal purple indica is in honor of the proud and wealthy Lannisters, who happen to use a lion as their sigil. The Lannisters appear to be sitting pretty right now – they rule the Seven Kingdoms, Jamie’s been returned (mostly intact), Tywin’s only been moderately cranky – but we’ll see if their good luck streak will continue in season 4. They’ll need the focus that the Lions Gate strain brings.\n6. Richie Rich + Power Kush \n\nSpeaking of Tywin Lannister, if you combine the hybrid Richie Rich with the indica Power Kush, you’ll have a father who loves to play the game more than he loves his own family. I bet he’s sneering in every family portrait that’s been commissioned – it’s the ye olde equivalent of blinking in photos.\n7. Killer Queen + Sour Power \n\nSticking with the Lannisters, let’s shift gears to Cersei, former queen of Westeros and current queen of the “Who farted?” face. A Killer Queen willing to do whatever it takes to get as close to the Iron Throne as possible, this icy blonde beauty has felt her power go a little sour once she realized that her turd of a son can’t be controlled. Talk about a disappointed parent. She really takes after her father, doesn’t she?\n8. Little Devil + Abusive OG\n\nUgh, Joffrey is the worst. We can’t think of a better pairing for the little pissant than the hybrid Little Devil and the indica Abusive OG. If ever King Joffrey’s horrible ways feel a little too heavy for your tastes, just remember that he got b-slapped by the best character ever:\n\nSpeaking of which…\n9. Royal Dwarf \n\nTyrion Lannister is rumored to be one of the characters George R. R. Martin’s wife made him promise he would never kill off. I think every Game of Thrones fan can agree – even though he’s a Lannister, he’s still a Royal Dwarf and one of the best characters on the show.\nAnother favorite character?\n10. Jane Doe + Odyssey \n\nFierce little Arya Stark has seen many of her family members fall victim to the Game of Thrones and now she’s out for blood. This pint-sized warrior in the making has abandoned her identity and gone all Jane Doe in an attempt to take out the people on her shit list. How will her revenge Odyssey pan out?\n11. Critical Mass\n\nSticking with the Starks, we’ve never had a drastic shift in character sympathy than for poor Sansa. Sure, she was a naive, stuck-up teenager in season 1, but she’s had most of her family murdered, been held prisoner, and was nearly forced to marry a psychopath Lannister before being forced to marry another Lannister. Tyrion’s been kind to her so far but honestly, how much more suffering do you have in store for Sansa, George R. R. Martin? She seems to be at Critical Mass right now and could use a little of the happy effects this indica brings.\nKnow who else is feeling a little blue?\n12. Blue Bastard \n\nOh, Jon Snow. The bastard son of Ned Stark has been on his own Odyssey but he can’t seem to make up his mind as to what he wants (maybe he really does know “nuthing”). Is it revenge for the Starks? Does he want to protect the Night’s Watch or defect from them? Or maybe he wants to catch a glimpse of another Ogre with Ygritte (although “Jon Snuhhhh” isn’t exactly in her good graces right now). It’s been a depressing journey for him thus far – good thing Blue Bastard is good for relieving depression.\n13. White Zombie + Snow Monster\n\nWe’ve already seen a few of the horrors that lie north of the Wall, including a White Zombie who looked like a frigid Iggy Pop. Can Jon Snow protect the Seven Kingdoms from the Snow Monsters that are advancing?\n14. Super Sour Widow \n\nPoor Catelyn Stark. Even though she could never love the bastard Jon Snow, she still didn’t deserve to have her entire family either murdered or scattered across the Seven Kingdoms. Talk about a Super Sour Widow.\nAnd to make matters worse…\n15. Red Haze \n\nThat Red Wedding was effed up, yo. Like seriously. After watching that episode, you probably felt as amped up as the effects the sativa Red Haze can bring (and you were likely in a Red Haze of your own once “The Rains of Castamere” started playing).\n16. Blackwater + Green Haze\n\nAnother iconic moment in Game of Thrones, this event was less heart-breaking than the Red Wedding and more awe-inspiring. The Battle of the Blackwater has been the biggest battle in the War of the Five Kings so far. Tyrion’s use of wildfire put Stannis’ army in a Green Haze and protected King’s Landing from being overrun. By combining the indica Blackwater and the sativa Green Haze, you’re creating quite the explosive hybrid strain yourself.\n17. Cherry Bomb\n\nCherry Bomb continue to deliver (both literally and figuratively), or will her influence over him go up in flames?\n \n18. Anesthesia\n\nA little something both Jaime Lannister and Theon Greyjoy could have used throughout season 3, amirite guys? The indica Anesthesia is widely used for pain management, making it an appropriate option for these two whipping boys.\n19. Lifesaver\n\nJaime owes you one, Brienne of Tarth. Why not have him pick up this euphoric hybrid Lifesaver strain while you two bathe and reminisce about the time you both faced off against a friggin’ grizzly bear?\n20. Brains Damage\n\nWhat better way to celebrate the possibly brain-damaged but entertainingly verbose Hodor with this Hodor, I mean hybrid strain that brings sleepiness, Hodor, and Hodor Hodor.\n21. Bordello\n\nAny Game of Thrones viewer is all-too familiar with the show’s numerous “sexposition” scenes that occur in a brothel or during sex scenes to spruce up an otherwise boring plot advancement. Take a taste of the hybrid Bordello whenever a sexposition scene pops up and you’ll feel so relaxed, you’ll forget how shamelessly (and entertainingly) gratuitous these parts actually are.\n22. True OG \n\nWho will end up winning the Game of Thrones? Who do you feel is the rightful ruler of the Seven Kingdoms? Partake in this relaxing indica while you ponder who you feel the “True OG” should be.\nWill it be…\n23. Dream Queen + Triple Diesel\n\nMany Game of Thrones fans are rooting for their “Dream Queen,” Daenerys Targaryen, who’s using her Triple Diesel dragons to kick ass, free slaves, and chew bubblegum (and she’s all out of bubblegum).\nAnd finally…\n24. F*cking Incredible\n\nWhich is exactly what this show is. Happy watching!\nImage credits: mad king, House Lannister","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12001238/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie.jpg","urlslug":"/news/strains-products/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie"}],"reviewCount":373,"flavors":[{"name":"Earthy","score":37.949065352847413},{"name":"Pine","score":20.961563541515723},{"name":"Citrus","score":18.522605419504419},{"name":"Woody","score":15.63443703811042},{"name":"Sweet","score":13.108861034632662}],"effects":[{"name":"Relaxed","score":92.165302130126079},{"name":"Euphoric","score":61.416606288943633},{"name":"Happy","score":57.72000434719606},{"name":"Sleepy","score":52.576401970728881},{"name":"Creative","score":41.906499058107521}],"symptoms":[{"name":"Stress","score":46.250978119113171},{"name":"Pain","score":39.241450514418204},{"name":"Depression","score":38.634654397913344},{"name":"Insomnia","score":34.69533400956383},{"name":"Headaches","score":32.814266048398785}],"conditions":[{"name":"Anxiety","score":43.466055644109552},{"name":"PTSD","score":34.941023040139115},{"name":"Bipolar Disorder","score":28.623424141428778},{"name":"ADD/ADHD","score":23.790537603245905},{"name":"Migraines","score":16.918997246775827}],"negatives":[{"name":"Dry Mouth","score":42.234350094189253},{"name":"Dry Eyes","score":30.539233444428341},{"name":"Anxious","score":7.1671134618171273},{"name":"Dizzy","score":6.5240907114910884},{"name":"Headache","score":5.4137443848717579}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/indica/true-og/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/indica/true-og/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/true-og_100x100_b803.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/625871/b/true-og__primary_f172.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/true-og_100x100_c9a2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/614317/b/true-og__primary_9f98.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/true-og_100x100_4192.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/584534/b/true-og__primary_b7b8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/true-og_100x100_db6c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/584667/b/true-og__primary_ebe5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/true-og_100x100_8385.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/578223/b/true-og__primary_e8b2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/true-og_100x100_831c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/578161/b/true-og__primary_676e.jpg"}],"photoTotalCount":80,"popularCities":["Los Angeles, CA","Seattle, WA","Portland, OR","Phoenix, AZ","Spokane, WA","Eugene, OR","San Diego, CA","Everett, WA","San Francisco, CA","Toronto, ON"],"permalink":"https://mobileapi.leafly.com/indica/true-og","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.46112600536193/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":5773,"slug":"true-og","name":"True OG","subtitle":null,"symbol":"Tru","category":"Indica","description":"\u003cp\u003eTrue OG is a popular indica strain that was originally discovered in Southern California, where the term \u0026ldquo;OG\u0026rdquo; originally meant \u0026ldquo;ocean grown.\u0026rdquo; Bred with genetics from the very popular \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003eOG Kush\u003c/a\u003e, True OG is potent enough for mellow, lasting effects combined with a more focused head high. Flowers have a pungent, crisp citrus and evergreen scent. True OG has snagged the 2nd place indica spot in every High Times Medical Cup since 2010.\u003c/p\u003e\n","descriptionPlain":"True OG is a popular indica strain that was originally discovered in Southern California, where the term \u0026ldquo;OG\u0026rdquo; originally meant \u0026ldquo;ocean grown.\u0026rdquo; Bred with genetics from the very popular OG Kush, True OG is potent enough for mellow, lasting effects combined with a more focused head high. Flowers have a pungent, crisp citrus and evergreen scent. True OG has snagged the 2nd place indica spot in every High Times Medical Cup since 2010.\n","aka":"Kobe OG","rating":4.46,"highlightedReviews":[{"id":1417280,"username":"kasmoss","text":"I have a question...  And forgive me if I seem excited...  But, WTF is in pot that makes me feel \"normal\"????!!!!  Shittiest fucking day...  Feel like fucking crap and ready to cut open a vein - End it all!  Yeah!!!...  I take two hits off of my vape pen of True OG and I feel FUCKING NORMAL!  Wow...  \"Regular\" people thoughts...  A thirst for life...  If this is what the *Normals* feel like all the time, can we just hire some geneticist to manipulate our cells to infiltrate depression, anxiety, and PTSD cells and make them happy again?  Oh wait...  That would mean corporate funding...  Damn.\n\nSeriously, what is making the depression, anxiety, and PTSD sit in the back seat and fucking heel?","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"},{"id":1639163,"username":"moonstar11187","text":"I received this strain from a desp in LA and omg it was so good. Potent and strong tasting with a very mellowing stone feeling. The popcorn nuhs were small and easily broke up. Very good indica strain , should be used in late evening or before bed. Not a day time strain unless you are trying to take a nap.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3027","title":"The Best Cannabis Strains for Focus and ADD/ADHD","author":"Bailey Rahn","category":null,"date":"\/Date(1452633240000)\/","text":"Whether or not you’ve been diagnosed with ADD or ADHD, sometimes we need a little help concentrating. You’ve probably noticed that certain varieties of cannabis help you stay focused and productive while others can send your mind completely off the rails. Finding that perfect focusing strain requires a little self-analysis first: What is it that’s impeding your concentration? Are you disengaged? Do your thoughts race? Think of the below sections as your roadmap to the right strain.\nWe’re still waiting for research to provide more guidance on why cannabis might or might not help someone with ADD/ADHD, but we’re limited mostly to personal anecdotes. It’s not a bad idea to try a few different strains – a high-THC strain, a low-THC strain, high-CBD, balanced THC-CBD, and so on. At the end of this list, you’ll also find some appetite-boosting, sleep-inducing strains for those of you experiencing the negative side effects of stimulant ADD/ADHD medications.\n \nStrains for Mental Energy and Engagement\n \nCinex is the strain you reach for when that cup of coffee didn’t do the job. Providing wired euphoria that feeds creativity, this sativa can rekindle interest in tasks that may otherwise be a drag. Take caution with this one if you’re prone to anxiety and racing thoughts; Cinex can turn that up in some individuals.\n \n \nIt’s famous for a reason. Sour Diesel is one of the highest-rated strains on Leafly for treatment of ADD/ADHD, quite possibly due to its ability to shine a new, engaging light on activities and tasks. Speedy euphoria lets your mind stay nimble, but remember that dosing is key. Overdoing a potent sativa like Sour Diesel can have the opposite of your desired effect.\n\n“It makes your frontal lobe act in ways you could never have imagined. It’s almost like Sour Diesel is a key, a key that opens up whole realms of your mind that you were once ignorant of.”\n \n \nAccording to lore, this sativa was dubbed Green Crack by Snoop Dogg because its effects were so intensely stimulating. Green Crack had to make the list because, in my experience, few other strains can match its energy and focus. It sharpens the senses and brings vibrancy to the dull, all with an enticing tropical citrus flavor.\nClick here to browse more strains with stimulating, focused effects.\n \nStrains for Calming Focus\n \nSometimes what you need to concentrate isn’t a strain that speeds your brain up, it’s one that can slow the brain down. The indica-dominant True OG is touted among reviewers for knocking down stress and distractions for easier focus.\n\n“Comes on kind of slowly. Is a chilling high, but you can easily focus and do things like schoolwork, cleaning, etc.”\n \n \nBlueberry Headband captures the perfect synergy of its two parents. From Headband, it inherits a supercharged cerebral effect that lends a spark of creativity. The Blueberry parent softens the euphoric intensity of Headband, providing a mellow, full-body experience that allows your thoughts run at a more manageable pace.\nClick here to browse more strains with relaxing, focused effects.\n \nStrains for Cognitive Clarity\n \nA cross between Sour Tsunami and Harlequin, Harle-Tsu is a high-CBD strain that contains minimal levels of THC. It eases you into a sober, clear-headed calm as its relaxing effects come with minimal psychoactive impact, so you can keep your cognitive faculties intact. If you’re having trouble finding Harle-Tsu near you, try finding its high-CBD parent strains or close relative, Canna-Tsu.\n\n“A good herb for relaxation. Not much of a cerebral high, but what little high you do get is focused and energetic but calm. Its good to mix with some powerful indicas to even it out.”\n \n \nCalming physical sensations coupled with agile cerebral focus, Harlequin is another high-CBD strain that should be on your radar if concentration is hard to come by. Although this ratio can fluctuate, Harlequin typically expresses a 5:2 ratio of CBD:THC, so expect some euphoric stimulation in the mind.\nClick here to browse more strains with a high CBD content.\n \nStrains for ADD/ADHD Medication Side Effects*\n \nA genetic cross between Blueberry and Hindu Kush, Goo provides the golden trifecta of effects for those treating ADD/ADHD: appetite, sleepiness, and focus. This strain is meant for winding down, which can be difficult if you’re prescribed psychostimulant drugs that may stunt the appetite and keep you tossing and turning at night.\n\n“Currently one of my favorite strains. When my brain is too active I smoke this and it helps calm it down.”\n \n \nJupiter OG is another indica strain that can help restore appetite and restfulness when the side effects of your medications are at their worst. This indica may still provide a little kick of focus, but it should definitely be saved for later in the night when you’re ready to help your brain shut down.\nClick here to browse more appetite-enhancing, sedating strains.\n*Please consult with your doctor if you are being prescribed medication to treat your ADD/ADHD or another medical condition and ask if it’s advisable to supplement your regimen with medical marijuana.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12001420/best-cannabis-strains-for-focus-and-addadhd.jpg","urlslug":"/news/strains-products/best-cannabis-strains-for-focus-and-addadhd"},{"id":"contentitems-2973","title":"24 Strains to Prepare You for the Game of Thrones Season 4 Premiere","author":"Rebecca Kelley","category":null,"date":"\/Date(1396641600000)\/","text":"We’re big fans of Game of Thrones here at Leafly and the crew is super stoked for the season 4 debut this Sunday on HBO. If you’re planning on hosting a viewing party to kick off the premiere of one of the best shows on television, why not pick up some of these Game of Thrones-themed strains to properly celebrate?\nHere are 24 strains (some standing solo, some paired together) we feel tie in with the Game of Thrones universe perfectly (spoilers below if you aren’t caught up to season 4 by now). Yes, 24. That’s how much we love both our strains and this show. Even though All Men Must Die, their memories will live on thanks to this list of green.\n1. Mad Dawg \n\nThis earthy hybrid is in honor of Mad King Aerys II Targaryen, the kooky ruler who started this whole mess in the first place. Dude, all you had to do was not murder a bunch of people and threaten to burn down King’s Landing and we wouldn’t even have a Game of Thrones battle royale waging. If only he had a little stash of Mad Dawg to keep him feeling euphoric and relaxed.\n2. 3 Kings\n\nThe hybrid 3 Kings strain may be a fusion of Headband, Sour Diesel, and OG Kush, but it also signifies the three kings currently left standing in Game of Thrones at the start of season 4: Joffrey Lannister (aka The Worst Person Ever), Stannis Baratheon (aka “Stannis the Mannis,” self-proclaimed King of the Andals), and Balon Greyjoy (aka World’s Not-Greatest Dad), king of the Iron Islands. Maybe this pungent strain will clear some of the crazy out of their sinuses.\n3. Permafrost\n\nBecause, as House Stark constantly reminds us, “Winter is coming,” so you might as well hunker down and wait for it to arrive with some piney Permafrost.\nSpeaking of House Stark…\n4. Northern Lights\n\nThe North remembers, and though their numbers are dwindling and the Starks are constantly having George R. R. Martin take a never-ending dump on them, there are still a few scrappy surviving members who have a glimmer of hope shining, however dimly at the moment. Northern Lights is good for combating stress, and I’m guessing the Starks are feeling a little overwhelmed right about now.\n5. Lions Gate\n\nThis royal purple indica is in honor of the proud and wealthy Lannisters, who happen to use a lion as their sigil. The Lannisters appear to be sitting pretty right now – they rule the Seven Kingdoms, Jamie’s been returned (mostly intact), Tywin’s only been moderately cranky – but we’ll see if their good luck streak will continue in season 4. They’ll need the focus that the Lions Gate strain brings.\n6. Richie Rich + Power Kush \n\nSpeaking of Tywin Lannister, if you combine the hybrid Richie Rich with the indica Power Kush, you’ll have a father who loves to play the game more than he loves his own family. I bet he’s sneering in every family portrait that’s been commissioned – it’s the ye olde equivalent of blinking in photos.\n7. Killer Queen + Sour Power \n\nSticking with the Lannisters, let’s shift gears to Cersei, former queen of Westeros and current queen of the “Who farted?” face. A Killer Queen willing to do whatever it takes to get as close to the Iron Throne as possible, this icy blonde beauty has felt her power go a little sour once she realized that her turd of a son can’t be controlled. Talk about a disappointed parent. She really takes after her father, doesn’t she?\n8. Little Devil + Abusive OG\n\nUgh, Joffrey is the worst. We can’t think of a better pairing for the little pissant than the hybrid Little Devil and the indica Abusive OG. If ever King Joffrey’s horrible ways feel a little too heavy for your tastes, just remember that he got b-slapped by the best character ever:\n\nSpeaking of which…\n9. Royal Dwarf \n\nTyrion Lannister is rumored to be one of the characters George R. R. Martin’s wife made him promise he would never kill off. I think every Game of Thrones fan can agree – even though he’s a Lannister, he’s still a Royal Dwarf and one of the best characters on the show.\nAnother favorite character?\n10. Jane Doe + Odyssey \n\nFierce little Arya Stark has seen many of her family members fall victim to the Game of Thrones and now she’s out for blood. This pint-sized warrior in the making has abandoned her identity and gone all Jane Doe in an attempt to take out the people on her shit list. How will her revenge Odyssey pan out?\n11. Critical Mass\n\nSticking with the Starks, we’ve never had a drastic shift in character sympathy than for poor Sansa. Sure, she was a naive, stuck-up teenager in season 1, but she’s had most of her family murdered, been held prisoner, and was nearly forced to marry a psychopath Lannister before being forced to marry another Lannister. Tyrion’s been kind to her so far but honestly, how much more suffering do you have in store for Sansa, George R. R. Martin? She seems to be at Critical Mass right now and could use a little of the happy effects this indica brings.\nKnow who else is feeling a little blue?\n12. Blue Bastard \n\nOh, Jon Snow. The bastard son of Ned Stark has been on his own Odyssey but he can’t seem to make up his mind as to what he wants (maybe he really does know “nuthing”). Is it revenge for the Starks? Does he want to protect the Night’s Watch or defect from them? Or maybe he wants to catch a glimpse of another Ogre with Ygritte (although “Jon Snuhhhh” isn’t exactly in her good graces right now). It’s been a depressing journey for him thus far – good thing Blue Bastard is good for relieving depression.\n13. White Zombie + Snow Monster\n\nWe’ve already seen a few of the horrors that lie north of the Wall, including a White Zombie who looked like a frigid Iggy Pop. Can Jon Snow protect the Seven Kingdoms from the Snow Monsters that are advancing?\n14. Super Sour Widow \n\nPoor Catelyn Stark. Even though she could never love the bastard Jon Snow, she still didn’t deserve to have her entire family either murdered or scattered across the Seven Kingdoms. Talk about a Super Sour Widow.\nAnd to make matters worse…\n15. Red Haze \n\nThat Red Wedding was effed up, yo. Like seriously. After watching that episode, you probably felt as amped up as the effects the sativa Red Haze can bring (and you were likely in a Red Haze of your own once “The Rains of Castamere” started playing).\n16. Blackwater + Green Haze\n\nAnother iconic moment in Game of Thrones, this event was less heart-breaking than the Red Wedding and more awe-inspiring. The Battle of the Blackwater has been the biggest battle in the War of the Five Kings so far. Tyrion’s use of wildfire put Stannis’ army in a Green Haze and protected King’s Landing from being overrun. By combining the indica Blackwater and the sativa Green Haze, you’re creating quite the explosive hybrid strain yourself.\n17. Cherry Bomb\n\nCherry Bomb continue to deliver (both literally and figuratively), or will her influence over him go up in flames?\n \n18. Anesthesia\n\nA little something both Jaime Lannister and Theon Greyjoy could have used throughout season 3, amirite guys? The indica Anesthesia is widely used for pain management, making it an appropriate option for these two whipping boys.\n19. Lifesaver\n\nJaime owes you one, Brienne of Tarth. Why not have him pick up this euphoric hybrid Lifesaver strain while you two bathe and reminisce about the time you both faced off against a friggin’ grizzly bear?\n20. Brains Damage\n\nWhat better way to celebrate the possibly brain-damaged but entertainingly verbose Hodor with this Hodor, I mean hybrid strain that brings sleepiness, Hodor, and Hodor Hodor.\n21. Bordello\n\nAny Game of Thrones viewer is all-too familiar with the show’s numerous “sexposition” scenes that occur in a brothel or during sex scenes to spruce up an otherwise boring plot advancement. Take a taste of the hybrid Bordello whenever a sexposition scene pops up and you’ll feel so relaxed, you’ll forget how shamelessly (and entertainingly) gratuitous these parts actually are.\n22. True OG \n\nWho will end up winning the Game of Thrones? Who do you feel is the rightful ruler of the Seven Kingdoms? Partake in this relaxing indica while you ponder who you feel the “True OG” should be.\nWill it be…\n23. Dream Queen + Triple Diesel\n\nMany Game of Thrones fans are rooting for their “Dream Queen,” Daenerys Targaryen, who’s using her Triple Diesel dragons to kick ass, free slaves, and chew bubblegum (and she’s all out of bubblegum).\nAnd finally…\n24. F*cking Incredible\n\nWhich is exactly what this show is. Happy watching!\nImage credits: mad king, House Lannister","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12001238/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie.jpg","urlslug":"/news/strains-products/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie"}],"reviewCount":373,"flavors":[{"name":"Earthy","score":37.949065352847413},{"name":"Pine","score":20.961563541515723},{"name":"Citrus","score":18.522605419504419},{"name":"Woody","score":15.63443703811042},{"name":"Sweet","score":13.108861034632662}],"effects":[{"name":"Relaxed","score":92.165302130126079},{"name":"Euphoric","score":61.416606288943633},{"name":"Happy","score":57.72000434719606},{"name":"Sleepy","score":52.576401970728881},{"name":"Creative","score":41.906499058107521}],"symptoms":[{"name":"Stress","score":46.250978119113171},{"name":"Pain","score":39.241450514418204},{"name":"Depression","score":38.634654397913344},{"name":"Insomnia","score":34.69533400956383},{"name":"Headaches","score":32.814266048398785}],"conditions":[{"name":"Anxiety","score":43.466055644109552},{"name":"PTSD","score":34.941023040139115},{"name":"Bipolar Disorder","score":28.623424141428778},{"name":"ADD/ADHD","score":23.790537603245905},{"name":"Migraines","score":16.918997246775827}],"negatives":[{"name":"Dry Mouth","score":42.234350094189253},{"name":"Dry Eyes","score":30.539233444428341},{"name":"Anxious","score":7.1671134618171273},{"name":"Dizzy","score":6.5240907114910884},{"name":"Headache","score":5.4137443848717579}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/indica/true-og/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/indica/true-og/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/true-og_100x100_b803.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/625871/b/true-og__primary_f172.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/true-og_100x100_c9a2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/614317/b/true-og__primary_9f98.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/true-og_100x100_4192.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/584534/b/true-og__primary_b7b8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/true-og_100x100_db6c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/584667/b/true-og__primary_ebe5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/true-og_100x100_8385.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/578223/b/true-og__primary_e8b2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/true-og_100x100_831c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/578161/b/true-og__primary_676e.jpg"}],"photoTotalCount":80,"popularCities":["Los Angeles, CA","Seattle, WA","Portland, OR","Phoenix, AZ","Spokane, WA","Eugene, OR","San Diego, CA","Everett, WA","San Francisco, CA","Toronto, ON"],"permalink":"https://mobileapi.leafly.com/indica/true-og","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.46112600536193/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
