{
    "aka": "Tiger Milk, Tigers Milk",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Hannah Meadows",
            "category": null,
            "date": "/Date(1487715733000)/",
            "id": "contentitems-19058",
            "text": "Since the dawn of the silver screen, music and movies have gone together like Thelma and Louise. In the old films of yesteryear, when audio technology for spoken dialogue was not yet established, music brought to life the actions and scenes presented to an audience without the use of speech. Since then, tunes in movies have played a large part in manipulating audience emotion and setting tones for dramatic, comedic, horrific, and all manner of theatrical movements.\nTo celebrate the upcoming Oscars awards ceremony (which airs Sunday, February 26), we compiled a range of movie soundtracks to listen to while high. From past Academy Award winners to general good beats, turn off your screens and instead opt for a pair of headphones to truly soak in these incredible scores.\nThe Lord of the Rings\n\nThis entire adventure series was composed, conducted, produced, and orchestrated by Howard Shore, who contributed more than 10 hours of music for the epic saga. The films’ scores were so enigmatic that two of them took home Academy awards for Best Original Score – one for The Fellowship of the Ring (2002) and one for The Return of the King (2004).\nBased on our own personal experience, we couldn’t possibly turn our noses up at one of the best and most emotional instrumental scores punctuating The Lord of the Rings series. From the moment we hear those familiar Hobbit-inspired flutes to the dramatic deep strings regaling Sauron’s lair, listening to this broad soundtrack is a mix of nostalgia and a new sense of adventure. Clear your schedule for hours of bold and beautiful tunes, and be sure to pair this daring collection with the hybrid Hobbit.\nPretty in Pink\n\nThough this film’s soundtrack didn’t take home any awards, it’d be a mistake not to include it in our collection of picks. You’ll be bringing back the ’80s with now-classics (considered “new wave” at the time) played in one of John Hughes’ biggest hits. From bands New Order to The Smiths, we don’t think you’ll mind getting any of these tracks stuck in your head. Dance your heart out and pair this movie soundtrack with the sweet hybrid Pink Kush.\nWilly Wonka and the Chocolate Factory\n\nThis 1971 children’s classic gave audiences around the world a wild ride that also extends to its assorted soundtrack. From sticky-sweet “The Candy Man” to Charlie’s mother’s lamenting “Cheer-Up Charlie,” all the way to the odd fear-driven track accompanying the infamous tunnel scene, the original Willy Wonka touches on all facets of human emotion. Gather up your favorite candy and pair this soundtrack with its perfect match, sativa Willy Wonka.\nLife of Pi\n\nWorldly, charismatic, and just plain beautiful, the Life of Pi score won the 2013 Academy Award for Best Original Music Score as well as the Golden Globe for the same title (composed by Mychael Danna). Cranking up this soundtrack is sure to transport you to faraway lands. We recommend pairing Life of Pi’s gorgeous pieces with the cerebral indica Tiger’s Milk.\nForrest Gump\n\nReaching gold and platinum status from countries around the world, the Forrest Gump soundtrack is flanked with its own original score as well as a huge array of classic rock pieces. It was nominated for Best Music and Original Score in 1995 (beat out by The Lion King), and it’s definitely not difficult to see why. From Scott McKenzie’s “San Francisco” to Simon and Garfunkel’s “Mrs. Robinson,” be sure to light up the hybrid Jenny Kush and sink into the various tunes of the late greats.\nInterstellar\n\nIf you’re looking to smoke up alongside tracks that could transport you across planes of time, look no further than the music of Interstellar. We recommend you invest in a little star projector, shut off all the lights in your room, and bask in the mind-blowing complexities of the universe while the Interstellar score quietly plays in your ears. Pair this haunting soundtrack with the indica StarBud or the intense sativa Timewreck.\nHave your own soundtrack suggestions? Leave them in the comments below!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/02/21142338/soundtracks-to-listen-to.jpg",
            "title": "6 Movie Soundtracks to Listen to While High",
            "urlslug": "/news/lifestyle/6-movie-soundtracks-listen-high"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1420822800000)/",
            "id": "contentitems-3429",
            "text": "Happy Friday! With the weekend coming up, it may be time to stock up on some new strains and we've highlighted a few possibilities below. These five newest additions to the Leafly Explorer were nominated by our app users, and you can check their availability near you by visiting their strain detail pages. If you're one of the lucky few able to locate and try one of these new strains, be sure to share your thoughts and opinions in a review.\nHappy strain hunting!\n   1. Tiger's Milk\nCharacteristics of Tiger's Milk:\n\nTiger’s Milk by Bodhi Seeds is a powerful indica-dominant strain that descends from Bubba Kush and Appalachia. Initially, Tiger’s Milk hits with intense cerebral euphoria, an experience described by its breeders as being borderline psychedelic. Tapering down to restful relaxation over time, this indica is commonly looked to for its pain-relieving and sleepy qualities. Its aroma is a complex mix of earthy notes, led by hints of sweet honey and hashy spice.\n\n 2. Thai Lights\nCharacteristics of Thai Lights:\n\nThai Lights is a sativa-dominant blend that crosses the uplifting effects of Thai Haze with the stable and robust Northern Lights. Originally bred by Dr. Atomic, Thai lights is a dynamic hybrid that boasts sweet earthy flavors and a cerebral buzz that accommodates social outings with an energetic rush of happiness. Medical patients applaud Thai Lights’ ability to combat depression and minimize the debilitating effects of migraine headaches.\n\n 3. Incredible Bulk\nCharacteristics of Incredible Bulk:\n\nIncredible Bulk is a mixture of three notable indicas. Big Bud combines with Super Skunk and Green Spirit to create the sweet earthy flavors of hash that usher in Incredible Bulk’s relaxing effects. Its sedating effects make Incredible Bulk a great choice to help you unwind at the end of the day. Originally bred by Dr. Krippling for its heavy yields and ease of growth, Incredible Bulk is a very stable plant that makes a compelling case for indoor cultivation. The buds are known to explode in size when grown hydroponically.\n\n 4. Ultra Sonja\nCharacteristics of Ultra Sonja:\n\nUltra Sonja is a sativa-dominant descendant of U.K. Cheese and Tang Tang that inherits an unusual blend of flavor and effects from its parent strains. Like a pairing of wine and cheese, Ultra Sonja combines a sour funky aroma with deep fruity accents in a display of its heritage. Its dense buds, which sometimes express themselves in tones of purple, deliver clear-headed feelings of bliss and tranquility. \n\n 5. Jack Diesel\nCharacteristics of Jack Diesel:\n\nJack Diesel crosses two mainstays in the cannabis world, Jack Herer and NYC Diesel, to produce a pungent mix of floral and diesel aromas. Its woody flavors are intertwined with sweet hints of fruit that bring on potent, long-lasting sativa effects. The uplifting sativa buzz is reminiscent of Haze varieties, generating immediate relaxation followed by an energetic rush that stimulates creativity along with your appetite.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/01/12002445/new-strains-alert-tigers-milk-thai-lights-incredible-bulk-ultra-s.jpg",
            "title": "New Strains Alert: Tiger's Milk, Thai Lights, Incredible Bulk, Ultra Sonja, and Jack Diesel",
            "urlslug": "/news/strains-products/new-strains-alert-tigers-milk-thai-lights-incredible-bulk-ultra-s"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 37.33108108108108
        },
        {
            "name": "Muscular Dystrophy",
            "score": 25.675675675675677
        },
        {
            "name": "ADD/ADHD",
            "score": 6.16554054054054
        },
        {
            "name": "Migraines",
            "score": 5.827702702702703
        },
        {
            "name": "PTSD",
            "score": 3.3783783783783785
        }
    ],
    "description": "<p>Tiger&rsquo;s Milk by Bodhi Seeds is a powerful <a href=\"http://leafly.com/indica\">indica</a>-dominant strain that descends from <a href=\"http://leafly.com/indica/bubba-kush\">Bubba Kush</a> and <a href=\"http://www.leafly.com/hybrid/appalachia\">Appalachia</a>. Initially, Tiger&rsquo;s Milk hits with intense cerebral <a href=\"http://www.leafly.com/explore#!/explore/tags-euphoric/\">euphoria</a>, an experience described by its breeders as being borderline psychedelic. Tapering down to restful <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed/\">relaxation</a> over time, this indica is commonly looked to for its <a href=\"http://www.leafly.com/explore#!/explore/symptoms-pain/\">pain-relieving</a> and <a href=\"http://www.leafly.com/explore#!/explore/tags-sleepy/\">sleepy</a> qualities. Its aroma is a complex mix of <a href=\"http://www.leafly.com/explore#!/explore/flavors-earthy/\">earthy</a> notes, led by hints of <a href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\">sweet</a> <a href=\"http://www.leafly.com/explore#!/explore/flavors-honey\">honey</a> and hashy <a href=\"http://www.leafly.com/explore#!/explore/flavors-spicyherbal\">spice</a>.&nbsp;</p>\n",
    "descriptionPlain": "Tiger&rsquo;s Milk by Bodhi Seeds is a powerful indica-dominant strain that descends from Bubba Kush and Appalachia. Initially, Tiger&rsquo;s Milk hits with intense cerebral euphoria, an experience described by its breeders as being borderline psychedelic. Tapering down to restful relaxation over time, this indica is commonly looked to for its pain-relieving and sleepy qualities. Its aroma is a complex mix of earthy notes, led by hints of sweet honey and hashy spice.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 111.14864864864865
        },
        {
            "name": "Euphoric",
            "score": 87.83783783783784
        },
        {
            "name": "Sleepy",
            "score": 71.0304054054054
        },
        {
            "name": "Tingly",
            "score": 64.10472972972973
        },
        {
            "name": "Giggly",
            "score": 57.939189189189186
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 35.304054054054056
        },
        {
            "name": "Flowery",
            "score": 30.8277027027027
        },
        {
            "name": "Spicy/Herbal",
            "score": 29.47635135135135
        },
        {
            "name": "Pepper",
            "score": 26.013513513513512
        },
        {
            "name": "Pine",
            "score": 25.675675675675677
        }
    ],
    "growInfo": {
        "averageYield": "Medium",
        "difficulty": null,
        "environment": null,
        "floweringDays": 63,
        "growNotes": "",
        "height": "Medium",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1399035,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I have chronic pain every day from fibromyalgia I'm not a big smoker but when I do its due to the fact Im in lot of pain this is one of the few strains that helps take all my pain away but not just mask it like pain medication  can do the smell and taste  is awesome with earthy notes and spice the feeling of having my body back and being able to do things is the best feeling in the world I highly  recommend this to any one who has awful chronic pain headaches  or  inflamation also if first time using this one start of slow and test the waters",
            "username": "AlaskenThunderFAWK"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1533482,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I am so excited to try this strain I have it in front of me and I can't wait to smoke some and find out what it's like!!! ",
            "username": "Dazzy505"
        }
    ],
    "id": 127663,
    "name": "Tiger's Milk",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 38.09121621621622
        },
        {
            "name": "Dry Eyes",
            "score": 31.50337837837838
        },
        {
            "name": "Dizzy",
            "score": 3.8006756756756754
        },
        {
            "name": "Headache",
            "score": 3.125
        },
        {
            "name": "Paranoid",
            "score": 0.33783783783783783
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/bubba-kush",
            "category": "Indica",
            "name": "Bubba Kush",
            "permalink": "https://mobileapi.leafly.com/indica/bubba-kush",
            "slug": "bubba-kush",
            "subtitle": null,
            "symbol": "Bk"
        },
        {
            "applink": "leafly://strain/appalachia",
            "category": "Hybrid",
            "name": "Appalachia",
            "permalink": "https://mobileapi.leafly.com/hybrid/appalachia",
            "slug": "appalachia",
            "subtitle": null,
            "symbol": "App"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/tigers-milk",
    "photoTotalCount": 18,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/indica/tigers-milk/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/indica/tigers-milk/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002538/b/tiger-s-milk__primary_6934.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tiger-s-milk_100x100_db3d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002537/b/tiger-s-milk__primary_e5bc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tiger-s-milk_100x100_6439.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/618766/b/tiger-s-milk__primary_726d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tiger-s-milk_100x100_2bd2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/583797/b/tiger-s-milk__primary_2172.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tiger-s-milk_100x100_034d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/578383/b/tiger-s-milk__primary_4a37.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tiger-s-milk_100x100_fb0e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/578194/b/tiger-s-milk__primary_12e9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tiger-s-milk_100x100_035f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Boulder, CO",
        "Aspen, CO",
        "Elmwood Park, IL",
        "Highland Park, IL",
        "Joliet, IL",
        "Justice, IL",
        "Posen, IL",
        "Romeoville, IL"
    ],
    "rating": 4.64,
    "relatedStrains": [],
    "reviewCount": 70,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "tigers-milk",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.64285714285714/240",
    "subtitle": null,
    "symbol": "Tmk",
    "symptoms": [
        {
            "name": "Pain",
            "score": 38.00675675675676
        },
        {
            "name": "Depression",
            "score": 29.39189189189189
        },
        {
            "name": "Inflammation",
            "score": 27.027027027027028
        },
        {
            "name": "Insomnia",
            "score": 16.554054054054056
        },
        {
            "name": "Stress",
            "score": 12.33108108108108
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
