{"sl_translate":"description,descriptionPlain,category","id":133,"slug":"blueberry","name":"Blueberry","subtitle":null,"symbol":"Bry","category":"Indica","description":"\u003cp\u003eA true A-List cannabis strain. Blueberry\u0026rsquo;s legendary status soared to new heights after claiming the \u003cem\u003eHigh Times\u0026rsquo;\u003c/em\u003e Cannabis Cup 2000 for Best \u003ca href=\"http://www.leafly.com/indica\"\u003eIndica\u003c/a\u003e. The long history of the strain is traced back to the late 1970s when American breeder DJ Short was working with a variety of exotic \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\"\u003elandrace strains\u003c/a\u003e. However, throughout the decades of Blueberry\u0026rsquo;s cultivation the genetics have been passed around, due in large part to DJ Short working with multiple seed banks and breeders. The \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e flavors of fresh \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-blueberry\"\u003eblueberries\u003c/a\u003e combine with \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003erelaxing\u003c/a\u003e effects to produce a long-lasting sense of \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\"\u003eeuphoria\u003c/a\u003e. Many consumers\u0026nbsp;utilize Blueberry to help contend with \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e, while connoisseurs and growers admire the strain for its colorful hues and high \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabinoids-101-what-makes-cannabis-medicine\"\u003eTHC content\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"A true A-List cannabis strain. Blueberry\u0026rsquo;s legendary status soared to new heights after claiming the High Times\u0026rsquo; Cannabis Cup 2000 for Best Indica. The long history of the strain is traced back to the late 1970s when American breeder DJ Short was working with a variety of exotic landrace strains. However, throughout the decades of Blueberry\u0026rsquo;s cultivation the genetics have been passed around, due in large part to DJ Short working with multiple seed banks and breeders. The sweet flavors of fresh blueberries combine with relaxing effects to produce a long-lasting sense of euphoria. Many consumers\u0026nbsp;utilize Blueberry to help contend with pain and stress, while connoisseurs and growers admire the strain for its colorful hues and high THC content.\n\n\u0026nbsp;\n","aka":"blue berry, bluberry, blueberrie","rating":4.3,"highlightedReviews":[{"id":1417662,"username":"fartysmoker","text":"vaped some of this right before I decided to give myself an at-home spa night. I was feeling very relaxed after my bath and putting lotion on my face and rubbing it in felt incredible. I had my eyes closed and I was imagining that I was about 18 years old. I felt so young and beautiful. Then I opened my eyes and I looked like a female Jim Breuer. it was scary and kind of ruined the high. I kept trying to make my eyes more open so I would look better but I couldn\u0027t. I just went to bed","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1640745,"username":"TranquilBuds","text":"Some of that real sticky icky. Easily 5/5 strain ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-60005","title":"8 Amazing Places to Blaze Up in Humboldt County","author":"Ocean Malandra","category":null,"date":"\/Date(1520701248000)\/","text":"For any cannabis aficionado, hearing the words “Humboldt County” can get the goosebumps going. One of the top cannabis producers in the Emerald Triangle—reaching back to the 1960s and 70s—Humboldt is known far and wide as the Napa Valley of weed; the place that produces the best quality outdoor cannabis in the entire country.\nBut while many connoisseurs have sampled its finest wares, Humboldt County has a lot more to offer than its incredible bud; it’s also a natural paradise filled with gorgeous landscapes and stunning views. And now that California has finally gone recreational, exploring Humboldt County—and all it has to offer—has become one of the best cannabis-infused trips in the world.\n\nBursting with wild coastlines, pristine rivers, unique small towns, and towering stands of ancient redwoods, Humboldt County is a truly breathtaking experience.\nBelow, discover some incredible places to light up and enjoy one of California’s greatest gems.\nPatrick’s Point State Park\n(Redwood Coast/Flickr Creative Commons)\nThe dramatic meeting of land and sea that Humboldt County embodies is on full display at Patrick’s Point State Park—a single square mile of lush forest teeters over the vast ocean on rugged rock promontories. Day hikes along the cliff edge offer fantastic views of raw Humboldt coastline, while inside the park a model Yurok village gives you a chance to explore daily indigenous life before European contact.\nCheck out Wedding Rock before you go, where countless couples have tied the knot backed by awe-inspiring panoramas of Agate Beach, where semi-precious stones lie hidden in the golden sands. Spark up a deliciously relaxing and euphoric strain, like Blueberry Muffins from Humboldt Seed Company, to take in this Eden-like paradise.\nThe Trinity River\n(CampPhoto/iStock)\nClear as glass and sparkling green, the living jewel known as the Trinity River winds its way out of the snowcapped Trinity Alps—the highest point on California’s coastal range. Locals flock here in the summertime to soak in high temperatures in this mountainous paradise. An hour inland from Eureka and Arcata, the town of Willow Creek is the center of activity here. Stop by River Song Natural Foods (a great place to stock up on munchies before hitting the river), and check out a handful of white water rafting outfits around the area.\nCamp Kimtu, just outside Willow Creek, fronts multiple swimming holes and riverside camping while the South Fork of Trinity offers a crystalline paradise of natural pools and rocky edges. For something truly mind-blowing, head into the Hoopa Indian Reservation, the largest in the state, and check out Tish Tang. This native run campground and natural beach offers a spectacular backdrop of forest covered mountains at a picture-perfect bend in the shimmering river. End the day by massaging your tired muscles with Wipe Out Salve by Humboldt Marijuana Company before beginning another adventure in the clear waters.\n\nThe Manila Dunes\n(Redwood Coast/Flickr Creative Commons)\nThe narrow spits that separate the tranquil Humboldt Bay from the Pacific Ocean are home to eco-systems bursting with wildflowers. They seem to have been made just for whiling away the better part of a cannabis-infused afternoon.\nMake your way to the lookout point above the Manila community center for a panoramic view of the bay and the rolling redwood hills before meandering through the dunes and, finally, onto the wilderness beach. From here, it’s a short trot over to the Humboldt Coastal Nature Center, a hobbit-hole like structure built right into the side of a massive sand dune that hosts a variety of educational exhibits for public enjoyment.\nThe Lost Coast\n(Redwood Coast/ Flickr Creative Commons)\nAn endless stretch of black sand beaches against a backdrop of rugged, ocean-worn mountains, the Lost Coast is the largest wilderness coastline on the west outside of Alaska. While the breathtaking Lost Coast Trail takes up to five days to hike—weaving up and down the wind swept summits of the Kings Range to isolated beaches—it is also possible to access the pristine coastline from the town of Shelter Cove, where you’ll find the Black Sands Beach trailhead.\nAn incredible day hike is also possible at King’s Peak, which offers dramatic 360° views of the Lost Coast at 4,000 feet. Exploring the old farming communities of the Matolle Valley, a bastion of old school hippies and a center of cannabis fueled counter cultures via the Lost Coast Scenic Drive, makes for slow travel at its best. It boasts several stand-out swimming holes along the Matolle River made more spectacular with fresh fruit dipped in Humboldt Valley Farms’ infused Chocolate Space Sauce.\n\nThe Humboldt Bay\n(shunyufan/iStock)\nThe largest protected body of water between San Francisco Bay and Puget Sound, Humboldt Bay is bookended by two unique towns—the Victorian seaport of Eureka and the hip college town of Arcata. The bay is home to California sea lions, river otters, and other marine mammals as well as an abundance of avian species.\nFrom the Eureka side, you’ll find the mural-peppered waterfront where Old Town reveals several stand-out small businesses worth patronizing. The Works record store, the palatial Eureka Books with its vast selection of local hiking and wildlife guides, and Humboldt Herbals, where you can stock up on natural, local products like Redwood Honey and talk to an herbalist about your medical marijuana regime.\nThe Victorian downtown area gives way to a bay-front promenade lined with benches, making it a wonderful place to spark up Bubba’s Gift—developed by Humboldt Seed Organization—before taking in the views over the marina and the redwood carpeted hills in the background. If you’re feeling adventurous, kayaks and small sailboat rentals are available, while the 1930s-era Madaket Ferry offers daily sunset cocktail cruises which sets out from the Eureka boardwalk daily.\nIn Arcata, known far and wide for its dedication to all things eco-friendly, an innovative wastewater treatment program has transformed a tidal marsh into a bird sanctuary that offers sweeping views out over the Humboldt Bay.\nThe Arcata Community Forest\n(yhelfman/iStock)\nConsidered a “model” for ecological sustainability, Arcata’s community owned forest blankets the hills just behind Humboldt State University, covering nearly 800 acres. Although you won’t find the several thousand-year-old giants here that exist in nearby State and National Parks, you will enjoy the pleasant and well-kept trail system that let you get completely lost in nature just steps from downtown Arcata. Frisbee golfers have set up a world-class course within the community forest, and just below it—in the grassy open space known as Redwood Park—cannabis lovers gather to puff and pass all day long.\n\nGrizzly Creek Redwoods State Park\n(maislam/iStock)\nYou have to leave the tourist track and head up the rural Highway 36 into Humboldt’s mountainous interior in order to reach Grizzly Creek Redwoods State Park. It’s a hidden gem where old growth forest surrounds the sapphire waters of the Van Duzen River. Fill a thermos of Kikoko’s Positivi-Tea (made with Humboldt-grown bud) to lift the spirits as you travel through the woods and rivers.\nThis small but picture-perfect park is the ultimate place to shun reality in exchange for clear summer skies, hot swimming weather, and spectacular star-gazing through the forest canopy. While car-camping is available at the main entrance, there are several nicely clandestine camping sites located in the gorgeous groves just steps from the riverbank.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/08123143/8-amazing-places-to-toke-up-31.jpg","urlslug":"/news/lifestyle/8-amazing-places-to-blaze-up-in-humboldt-county"},{"id":"contentitems-36392","title":"Tips for Growing Blueberry Kush Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1501788970000)\/","text":"Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Blueberry Kush is an Oregon-bred cross between two iconic strains, Blueberry and OG Kush. This indica-dominant variety produces beautiful, dense colas that pack a powerful and sedating high. It inherits a sweet berry smell subdued by earthy herbal notes.\nGrow Techniques: A perfect strain for an indoor hydroponic setup, Blueberry Kush grows short, stocky plants that maximize a grow space. High yields result from the right nutrients and climate. Clear out any vegetation that isn’t in the canopy to promote airflow and direct the growth upward.\nFlowering Time: 8-10 weeks\nYield: Moderate to high\nGrow Difficulty: Difficult\nClimate: Blueberry Kush will take off in a climate-controlled environment. Moisture will cause the buds to mold so keep humidity below 40% when flowering. This strain prefers a temperature between 68 and 80 degrees Fahrenheit.\nIndoor/Outdoor: Grows best indoors in a controlled environment, but can also grow outdoors with a dry fall climate.\nFeeding: Blueberry Kush is a picky strain. OG genetics require heavy feedings of CalMag and nitrogen, but don’t lock out any nutrients. Hydroponic growing can make sure this strain gets what it needs to thrive.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/03120116/blueberry-kush-strain.jpg","urlslug":"/news/growing/how-to-grow-blueberry-kush-marijuana"}],"reviewCount":1814,"flavors":[{"name":"Blueberry","score":57.142947614469207},{"name":"Berry","score":26.96667395922691},{"name":"Sweet","score":23.224928465741279},{"name":"Earthy","score":11.800000575728442},{"name":"Pungent","score":11.171621769443789}],"effects":[{"name":"Relaxed","score":81.426381604324874},{"name":"Happy","score":51.1155026397149},{"name":"Euphoric","score":47.458000610272151},{"name":"Sleepy","score":45.500495126458752},{"name":"Hungry","score":31.623870852596244}],"symptoms":[{"name":"Stress","score":46.271553833487822},{"name":"Pain","score":42.7014617745102},{"name":"Depression","score":28.793575446333477},{"name":"Insomnia","score":28.462761884474329},{"name":"Fatigue","score":20.347193035988784}],"conditions":[{"name":"Anxiety","score":30.243691455614218},{"name":"PTSD","score":15.438460387004659},{"name":"Arthritis","score":15.013500831927598},{"name":"Gastrointestinal Disorder","score":14.020311699377636},{"name":"ADD/ADHD","score":11.607059582136298}],"negatives":[{"name":"Dry Mouth","score":24.475583356842243},{"name":"Dry Eyes","score":20.433005360031782},{"name":"Paranoid","score":6.6865101069127721},{"name":"Dizzy","score":6.1426050560471639},{"name":"Anxious","score":4.235187946549372}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_960d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1006182/b/blueberry__primary_7874.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_6934.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002722/b/blueberry__primary_4459.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_e9f4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002019/b/blueberry__primary_398d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_7cf1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001742/b/blueberry__primary_56a2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_6702.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000057/b/blueberry__primary_aa7a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_436d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/706923/b/blueberry__primary_66a0.jpg"}],"photoTotalCount":453,"popularCities":["Portland, OR","Los Angeles, CA","Denver, CO","Vancouver, BC","Seattle, WA","Toronto, ON","Montréal, QC","Ottawa, ON","Las Vegas, NV","Phoenix, AZ"],"permalink":"https://mobileapi.leafly.com/indica/blueberry","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.29713340683572/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Thai","subtitle":null,"slug":"thai","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/thai","symbol":"Tha","applink":"leafly://strain/thai"},{"name":"Purple Thai","subtitle":null,"slug":"purple-thai","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/purple-thai","symbol":"Pth","applink":"leafly://strain/purple-thai"}],"growInfo":{"difficulty":"Easy","preferredMedium":"Soil","floweringDays":55,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":"Outdoor","growNotes":"\n\tAroma is best brought out when grown outdoors with organic fertilizers\n\tSuitable for sea of green (SOG) method\n\n"}}
{"sl_translate":"description,descriptionPlain,category","id":133,"slug":"blueberry","name":"Blueberry","subtitle":null,"symbol":"Bry","category":"Indica","description":"\u003cp\u003eA true A-List cannabis strain. Blueberry\u0026rsquo;s legendary status soared to new heights after claiming the \u003cem\u003eHigh Times\u0026rsquo;\u003c/em\u003e Cannabis Cup 2000 for Best \u003ca href=\"http://www.leafly.com/indica\"\u003eIndica\u003c/a\u003e. The long history of the strain is traced back to the late 1970s when American breeder DJ Short was working with a variety of exotic \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\"\u003elandrace strains\u003c/a\u003e. However, throughout the decades of Blueberry\u0026rsquo;s cultivation the genetics have been passed around, due in large part to DJ Short working with multiple seed banks and breeders. The \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e flavors of fresh \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-blueberry\"\u003eblueberries\u003c/a\u003e combine with \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003erelaxing\u003c/a\u003e effects to produce a long-lasting sense of \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\"\u003eeuphoria\u003c/a\u003e. Many consumers\u0026nbsp;utilize Blueberry to help contend with \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e, while connoisseurs and growers admire the strain for its colorful hues and high \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabinoids-101-what-makes-cannabis-medicine\"\u003eTHC content\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"A true A-List cannabis strain. Blueberry\u0026rsquo;s legendary status soared to new heights after claiming the High Times\u0026rsquo; Cannabis Cup 2000 for Best Indica. The long history of the strain is traced back to the late 1970s when American breeder DJ Short was working with a variety of exotic landrace strains. However, throughout the decades of Blueberry\u0026rsquo;s cultivation the genetics have been passed around, due in large part to DJ Short working with multiple seed banks and breeders. The sweet flavors of fresh blueberries combine with relaxing effects to produce a long-lasting sense of euphoria. Many consumers\u0026nbsp;utilize Blueberry to help contend with pain and stress, while connoisseurs and growers admire the strain for its colorful hues and high THC content.\n\n\u0026nbsp;\n","aka":"blue berry, bluberry, blueberrie","rating":4.3,"highlightedReviews":[{"id":1417662,"username":"fartysmoker","text":"vaped some of this right before I decided to give myself an at-home spa night. I was feeling very relaxed after my bath and putting lotion on my face and rubbing it in felt incredible. I had my eyes closed and I was imagining that I was about 18 years old. I felt so young and beautiful. Then I opened my eyes and I looked like a female Jim Breuer. it was scary and kind of ruined the high. I kept trying to make my eyes more open so I would look better but I couldn\u0027t. I just went to bed","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1640745,"username":"TranquilBuds","text":"Some of that real sticky icky. Easily 5/5 strain ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-60005","title":"8 Amazing Places to Blaze Up in Humboldt County","author":"Ocean Malandra","category":null,"date":"\/Date(1520701248000)\/","text":"For any cannabis aficionado, hearing the words “Humboldt County” can get the goosebumps going. One of the top cannabis producers in the Emerald Triangle—reaching back to the 1960s and 70s—Humboldt is known far and wide as the Napa Valley of weed; the place that produces the best quality outdoor cannabis in the entire country.\nBut while many connoisseurs have sampled its finest wares, Humboldt County has a lot more to offer than its incredible bud; it’s also a natural paradise filled with gorgeous landscapes and stunning views. And now that California has finally gone recreational, exploring Humboldt County—and all it has to offer—has become one of the best cannabis-infused trips in the world.\n\nBursting with wild coastlines, pristine rivers, unique small towns, and towering stands of ancient redwoods, Humboldt County is a truly breathtaking experience.\nBelow, discover some incredible places to light up and enjoy one of California’s greatest gems.\nPatrick’s Point State Park\n(Redwood Coast/Flickr Creative Commons)\nThe dramatic meeting of land and sea that Humboldt County embodies is on full display at Patrick’s Point State Park—a single square mile of lush forest teeters over the vast ocean on rugged rock promontories. Day hikes along the cliff edge offer fantastic views of raw Humboldt coastline, while inside the park a model Yurok village gives you a chance to explore daily indigenous life before European contact.\nCheck out Wedding Rock before you go, where countless couples have tied the knot backed by awe-inspiring panoramas of Agate Beach, where semi-precious stones lie hidden in the golden sands. Spark up a deliciously relaxing and euphoric strain, like Blueberry Muffins from Humboldt Seed Company, to take in this Eden-like paradise.\nThe Trinity River\n(CampPhoto/iStock)\nClear as glass and sparkling green, the living jewel known as the Trinity River winds its way out of the snowcapped Trinity Alps—the highest point on California’s coastal range. Locals flock here in the summertime to soak in high temperatures in this mountainous paradise. An hour inland from Eureka and Arcata, the town of Willow Creek is the center of activity here. Stop by River Song Natural Foods (a great place to stock up on munchies before hitting the river), and check out a handful of white water rafting outfits around the area.\nCamp Kimtu, just outside Willow Creek, fronts multiple swimming holes and riverside camping while the South Fork of Trinity offers a crystalline paradise of natural pools and rocky edges. For something truly mind-blowing, head into the Hoopa Indian Reservation, the largest in the state, and check out Tish Tang. This native run campground and natural beach offers a spectacular backdrop of forest covered mountains at a picture-perfect bend in the shimmering river. End the day by massaging your tired muscles with Wipe Out Salve by Humboldt Marijuana Company before beginning another adventure in the clear waters.\n\nThe Manila Dunes\n(Redwood Coast/Flickr Creative Commons)\nThe narrow spits that separate the tranquil Humboldt Bay from the Pacific Ocean are home to eco-systems bursting with wildflowers. They seem to have been made just for whiling away the better part of a cannabis-infused afternoon.\nMake your way to the lookout point above the Manila community center for a panoramic view of the bay and the rolling redwood hills before meandering through the dunes and, finally, onto the wilderness beach. From here, it’s a short trot over to the Humboldt Coastal Nature Center, a hobbit-hole like structure built right into the side of a massive sand dune that hosts a variety of educational exhibits for public enjoyment.\nThe Lost Coast\n(Redwood Coast/ Flickr Creative Commons)\nAn endless stretch of black sand beaches against a backdrop of rugged, ocean-worn mountains, the Lost Coast is the largest wilderness coastline on the west outside of Alaska. While the breathtaking Lost Coast Trail takes up to five days to hike—weaving up and down the wind swept summits of the Kings Range to isolated beaches—it is also possible to access the pristine coastline from the town of Shelter Cove, where you’ll find the Black Sands Beach trailhead.\nAn incredible day hike is also possible at King’s Peak, which offers dramatic 360° views of the Lost Coast at 4,000 feet. Exploring the old farming communities of the Matolle Valley, a bastion of old school hippies and a center of cannabis fueled counter cultures via the Lost Coast Scenic Drive, makes for slow travel at its best. It boasts several stand-out swimming holes along the Matolle River made more spectacular with fresh fruit dipped in Humboldt Valley Farms’ infused Chocolate Space Sauce.\n\nThe Humboldt Bay\n(shunyufan/iStock)\nThe largest protected body of water between San Francisco Bay and Puget Sound, Humboldt Bay is bookended by two unique towns—the Victorian seaport of Eureka and the hip college town of Arcata. The bay is home to California sea lions, river otters, and other marine mammals as well as an abundance of avian species.\nFrom the Eureka side, you’ll find the mural-peppered waterfront where Old Town reveals several stand-out small businesses worth patronizing. The Works record store, the palatial Eureka Books with its vast selection of local hiking and wildlife guides, and Humboldt Herbals, where you can stock up on natural, local products like Redwood Honey and talk to an herbalist about your medical marijuana regime.\nThe Victorian downtown area gives way to a bay-front promenade lined with benches, making it a wonderful place to spark up Bubba’s Gift—developed by Humboldt Seed Organization—before taking in the views over the marina and the redwood carpeted hills in the background. If you’re feeling adventurous, kayaks and small sailboat rentals are available, while the 1930s-era Madaket Ferry offers daily sunset cocktail cruises which sets out from the Eureka boardwalk daily.\nIn Arcata, known far and wide for its dedication to all things eco-friendly, an innovative wastewater treatment program has transformed a tidal marsh into a bird sanctuary that offers sweeping views out over the Humboldt Bay.\nThe Arcata Community Forest\n(yhelfman/iStock)\nConsidered a “model” for ecological sustainability, Arcata’s community owned forest blankets the hills just behind Humboldt State University, covering nearly 800 acres. Although you won’t find the several thousand-year-old giants here that exist in nearby State and National Parks, you will enjoy the pleasant and well-kept trail system that let you get completely lost in nature just steps from downtown Arcata. Frisbee golfers have set up a world-class course within the community forest, and just below it—in the grassy open space known as Redwood Park—cannabis lovers gather to puff and pass all day long.\n\nGrizzly Creek Redwoods State Park\n(maislam/iStock)\nYou have to leave the tourist track and head up the rural Highway 36 into Humboldt’s mountainous interior in order to reach Grizzly Creek Redwoods State Park. It’s a hidden gem where old growth forest surrounds the sapphire waters of the Van Duzen River. Fill a thermos of Kikoko’s Positivi-Tea (made with Humboldt-grown bud) to lift the spirits as you travel through the woods and rivers.\nThis small but picture-perfect park is the ultimate place to shun reality in exchange for clear summer skies, hot swimming weather, and spectacular star-gazing through the forest canopy. While car-camping is available at the main entrance, there are several nicely clandestine camping sites located in the gorgeous groves just steps from the riverbank.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/08123143/8-amazing-places-to-toke-up-31.jpg","urlslug":"/news/lifestyle/8-amazing-places-to-blaze-up-in-humboldt-county"},{"id":"contentitems-36392","title":"Tips for Growing Blueberry Kush Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1501788970000)\/","text":"Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Blueberry Kush is an Oregon-bred cross between two iconic strains, Blueberry and OG Kush. This indica-dominant variety produces beautiful, dense colas that pack a powerful and sedating high. It inherits a sweet berry smell subdued by earthy herbal notes.\nGrow Techniques: A perfect strain for an indoor hydroponic setup, Blueberry Kush grows short, stocky plants that maximize a grow space. High yields result from the right nutrients and climate. Clear out any vegetation that isn’t in the canopy to promote airflow and direct the growth upward.\nFlowering Time: 8-10 weeks\nYield: Moderate to high\nGrow Difficulty: Difficult\nClimate: Blueberry Kush will take off in a climate-controlled environment. Moisture will cause the buds to mold so keep humidity below 40% when flowering. This strain prefers a temperature between 68 and 80 degrees Fahrenheit.\nIndoor/Outdoor: Grows best indoors in a controlled environment, but can also grow outdoors with a dry fall climate.\nFeeding: Blueberry Kush is a picky strain. OG genetics require heavy feedings of CalMag and nitrogen, but don’t lock out any nutrients. Hydroponic growing can make sure this strain gets what it needs to thrive.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/03120116/blueberry-kush-strain.jpg","urlslug":"/news/growing/how-to-grow-blueberry-kush-marijuana"}],"reviewCount":1814,"flavors":[{"name":"Blueberry","score":57.142947614469207},{"name":"Berry","score":26.96667395922691},{"name":"Sweet","score":23.224928465741279},{"name":"Earthy","score":11.800000575728442},{"name":"Pungent","score":11.171621769443789}],"effects":[{"name":"Relaxed","score":81.426381604324874},{"name":"Happy","score":51.1155026397149},{"name":"Euphoric","score":47.458000610272151},{"name":"Sleepy","score":45.500495126458752},{"name":"Hungry","score":31.623870852596244}],"symptoms":[{"name":"Stress","score":46.271553833487822},{"name":"Pain","score":42.7014617745102},{"name":"Depression","score":28.793575446333477},{"name":"Insomnia","score":28.462761884474329},{"name":"Fatigue","score":20.347193035988784}],"conditions":[{"name":"Anxiety","score":30.243691455614218},{"name":"PTSD","score":15.438460387004659},{"name":"Arthritis","score":15.013500831927598},{"name":"Gastrointestinal Disorder","score":14.020311699377636},{"name":"ADD/ADHD","score":11.607059582136298}],"negatives":[{"name":"Dry Mouth","score":24.475583356842243},{"name":"Dry Eyes","score":20.433005360031782},{"name":"Paranoid","score":6.6865101069127721},{"name":"Dizzy","score":6.1426050560471639},{"name":"Anxious","score":4.235187946549372}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_960d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1006182/b/blueberry__primary_7874.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_6934.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002722/b/blueberry__primary_4459.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_e9f4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002019/b/blueberry__primary_398d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_7cf1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001742/b/blueberry__primary_56a2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_6702.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000057/b/blueberry__primary_aa7a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_436d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/706923/b/blueberry__primary_66a0.jpg"}],"photoTotalCount":453,"popularCities":["Portland, OR","Los Angeles, CA","Denver, CO","Vancouver, BC","Seattle, WA","Toronto, ON","Montréal, QC","Ottawa, ON","Las Vegas, NV","Phoenix, AZ"],"permalink":"https://mobileapi.leafly.com/indica/blueberry","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.29713340683572/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Thai","subtitle":null,"slug":"thai","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/thai","symbol":"Tha","applink":"leafly://strain/thai"},{"name":"Purple Thai","subtitle":null,"slug":"purple-thai","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/purple-thai","symbol":"Pth","applink":"leafly://strain/purple-thai"}],"growInfo":{"difficulty":"Easy","preferredMedium":"Soil","floweringDays":55,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":"Outdoor","growNotes":"\n\tAroma is best brought out when grown outdoors with organic fertilizers\n\tSuitable for sea of green (SOG) method\n\n"}}
{"sl_translate":"description,descriptionPlain,category","id":133,"slug":"blueberry","name":"Blueberry","subtitle":null,"symbol":"Bry","category":"Indica","description":"\u003cp\u003eA true A-List cannabis strain. Blueberry\u0026rsquo;s legendary status soared to new heights after claiming the \u003cem\u003eHigh Times\u0026rsquo;\u003c/em\u003e Cannabis Cup 2000 for Best \u003ca href=\"http://www.leafly.com/indica\"\u003eIndica\u003c/a\u003e. The long history of the strain is traced back to the late 1970s when American breeder DJ Short was working with a variety of exotic \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\"\u003elandrace strains\u003c/a\u003e. However, throughout the decades of Blueberry\u0026rsquo;s cultivation the genetics have been passed around, due in large part to DJ Short working with multiple seed banks and breeders. The \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e flavors of fresh \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-blueberry\"\u003eblueberries\u003c/a\u003e combine with \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003erelaxing\u003c/a\u003e effects to produce a long-lasting sense of \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\"\u003eeuphoria\u003c/a\u003e. Many consumers\u0026nbsp;utilize Blueberry to help contend with \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e, while connoisseurs and growers admire the strain for its colorful hues and high \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabinoids-101-what-makes-cannabis-medicine\"\u003eTHC content\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"A true A-List cannabis strain. Blueberry\u0026rsquo;s legendary status soared to new heights after claiming the High Times\u0026rsquo; Cannabis Cup 2000 for Best Indica. The long history of the strain is traced back to the late 1970s when American breeder DJ Short was working with a variety of exotic landrace strains. However, throughout the decades of Blueberry\u0026rsquo;s cultivation the genetics have been passed around, due in large part to DJ Short working with multiple seed banks and breeders. The sweet flavors of fresh blueberries combine with relaxing effects to produce a long-lasting sense of euphoria. Many consumers\u0026nbsp;utilize Blueberry to help contend with pain and stress, while connoisseurs and growers admire the strain for its colorful hues and high THC content.\n\n\u0026nbsp;\n","aka":"blue berry, bluberry, blueberrie","rating":4.3,"highlightedReviews":[{"id":1417662,"username":"fartysmoker","text":"vaped some of this right before I decided to give myself an at-home spa night. I was feeling very relaxed after my bath and putting lotion on my face and rubbing it in felt incredible. I had my eyes closed and I was imagining that I was about 18 years old. I felt so young and beautiful. Then I opened my eyes and I looked like a female Jim Breuer. it was scary and kind of ruined the high. I kept trying to make my eyes more open so I would look better but I couldn\u0027t. I just went to bed","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1640745,"username":"TranquilBuds","text":"Some of that real sticky icky. Easily 5/5 strain ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-60005","title":"8 Amazing Places to Blaze Up in Humboldt County","author":"Ocean Malandra","category":null,"date":"\/Date(1520701248000)\/","text":"For any cannabis aficionado, hearing the words “Humboldt County” can get the goosebumps going. One of the top cannabis producers in the Emerald Triangle—reaching back to the 1960s and 70s—Humboldt is known far and wide as the Napa Valley of weed; the place that produces the best quality outdoor cannabis in the entire country.\nBut while many connoisseurs have sampled its finest wares, Humboldt County has a lot more to offer than its incredible bud; it’s also a natural paradise filled with gorgeous landscapes and stunning views. And now that California has finally gone recreational, exploring Humboldt County—and all it has to offer—has become one of the best cannabis-infused trips in the world.\n\nBursting with wild coastlines, pristine rivers, unique small towns, and towering stands of ancient redwoods, Humboldt County is a truly breathtaking experience.\nBelow, discover some incredible places to light up and enjoy one of California’s greatest gems.\nPatrick’s Point State Park\n(Redwood Coast/Flickr Creative Commons)\nThe dramatic meeting of land and sea that Humboldt County embodies is on full display at Patrick’s Point State Park—a single square mile of lush forest teeters over the vast ocean on rugged rock promontories. Day hikes along the cliff edge offer fantastic views of raw Humboldt coastline, while inside the park a model Yurok village gives you a chance to explore daily indigenous life before European contact.\nCheck out Wedding Rock before you go, where countless couples have tied the knot backed by awe-inspiring panoramas of Agate Beach, where semi-precious stones lie hidden in the golden sands. Spark up a deliciously relaxing and euphoric strain, like Blueberry Muffins from Humboldt Seed Company, to take in this Eden-like paradise.\nThe Trinity River\n(CampPhoto/iStock)\nClear as glass and sparkling green, the living jewel known as the Trinity River winds its way out of the snowcapped Trinity Alps—the highest point on California’s coastal range. Locals flock here in the summertime to soak in high temperatures in this mountainous paradise. An hour inland from Eureka and Arcata, the town of Willow Creek is the center of activity here. Stop by River Song Natural Foods (a great place to stock up on munchies before hitting the river), and check out a handful of white water rafting outfits around the area.\nCamp Kimtu, just outside Willow Creek, fronts multiple swimming holes and riverside camping while the South Fork of Trinity offers a crystalline paradise of natural pools and rocky edges. For something truly mind-blowing, head into the Hoopa Indian Reservation, the largest in the state, and check out Tish Tang. This native run campground and natural beach offers a spectacular backdrop of forest covered mountains at a picture-perfect bend in the shimmering river. End the day by massaging your tired muscles with Wipe Out Salve by Humboldt Marijuana Company before beginning another adventure in the clear waters.\n\nThe Manila Dunes\n(Redwood Coast/Flickr Creative Commons)\nThe narrow spits that separate the tranquil Humboldt Bay from the Pacific Ocean are home to eco-systems bursting with wildflowers. They seem to have been made just for whiling away the better part of a cannabis-infused afternoon.\nMake your way to the lookout point above the Manila community center for a panoramic view of the bay and the rolling redwood hills before meandering through the dunes and, finally, onto the wilderness beach. From here, it’s a short trot over to the Humboldt Coastal Nature Center, a hobbit-hole like structure built right into the side of a massive sand dune that hosts a variety of educational exhibits for public enjoyment.\nThe Lost Coast\n(Redwood Coast/ Flickr Creative Commons)\nAn endless stretch of black sand beaches against a backdrop of rugged, ocean-worn mountains, the Lost Coast is the largest wilderness coastline on the west outside of Alaska. While the breathtaking Lost Coast Trail takes up to five days to hike—weaving up and down the wind swept summits of the Kings Range to isolated beaches—it is also possible to access the pristine coastline from the town of Shelter Cove, where you’ll find the Black Sands Beach trailhead.\nAn incredible day hike is also possible at King’s Peak, which offers dramatic 360° views of the Lost Coast at 4,000 feet. Exploring the old farming communities of the Matolle Valley, a bastion of old school hippies and a center of cannabis fueled counter cultures via the Lost Coast Scenic Drive, makes for slow travel at its best. It boasts several stand-out swimming holes along the Matolle River made more spectacular with fresh fruit dipped in Humboldt Valley Farms’ infused Chocolate Space Sauce.\n\nThe Humboldt Bay\n(shunyufan/iStock)\nThe largest protected body of water between San Francisco Bay and Puget Sound, Humboldt Bay is bookended by two unique towns—the Victorian seaport of Eureka and the hip college town of Arcata. The bay is home to California sea lions, river otters, and other marine mammals as well as an abundance of avian species.\nFrom the Eureka side, you’ll find the mural-peppered waterfront where Old Town reveals several stand-out small businesses worth patronizing. The Works record store, the palatial Eureka Books with its vast selection of local hiking and wildlife guides, and Humboldt Herbals, where you can stock up on natural, local products like Redwood Honey and talk to an herbalist about your medical marijuana regime.\nThe Victorian downtown area gives way to a bay-front promenade lined with benches, making it a wonderful place to spark up Bubba’s Gift—developed by Humboldt Seed Organization—before taking in the views over the marina and the redwood carpeted hills in the background. If you’re feeling adventurous, kayaks and small sailboat rentals are available, while the 1930s-era Madaket Ferry offers daily sunset cocktail cruises which sets out from the Eureka boardwalk daily.\nIn Arcata, known far and wide for its dedication to all things eco-friendly, an innovative wastewater treatment program has transformed a tidal marsh into a bird sanctuary that offers sweeping views out over the Humboldt Bay.\nThe Arcata Community Forest\n(yhelfman/iStock)\nConsidered a “model” for ecological sustainability, Arcata’s community owned forest blankets the hills just behind Humboldt State University, covering nearly 800 acres. Although you won’t find the several thousand-year-old giants here that exist in nearby State and National Parks, you will enjoy the pleasant and well-kept trail system that let you get completely lost in nature just steps from downtown Arcata. Frisbee golfers have set up a world-class course within the community forest, and just below it—in the grassy open space known as Redwood Park—cannabis lovers gather to puff and pass all day long.\n\nGrizzly Creek Redwoods State Park\n(maislam/iStock)\nYou have to leave the tourist track and head up the rural Highway 36 into Humboldt’s mountainous interior in order to reach Grizzly Creek Redwoods State Park. It’s a hidden gem where old growth forest surrounds the sapphire waters of the Van Duzen River. Fill a thermos of Kikoko’s Positivi-Tea (made with Humboldt-grown bud) to lift the spirits as you travel through the woods and rivers.\nThis small but picture-perfect park is the ultimate place to shun reality in exchange for clear summer skies, hot swimming weather, and spectacular star-gazing through the forest canopy. While car-camping is available at the main entrance, there are several nicely clandestine camping sites located in the gorgeous groves just steps from the riverbank.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/08123143/8-amazing-places-to-toke-up-31.jpg","urlslug":"/news/lifestyle/8-amazing-places-to-blaze-up-in-humboldt-county"},{"id":"contentitems-36392","title":"Tips for Growing Blueberry Kush Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1501788970000)\/","text":"Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Blueberry Kush is an Oregon-bred cross between two iconic strains, Blueberry and OG Kush. This indica-dominant variety produces beautiful, dense colas that pack a powerful and sedating high. It inherits a sweet berry smell subdued by earthy herbal notes.\nGrow Techniques: A perfect strain for an indoor hydroponic setup, Blueberry Kush grows short, stocky plants that maximize a grow space. High yields result from the right nutrients and climate. Clear out any vegetation that isn’t in the canopy to promote airflow and direct the growth upward.\nFlowering Time: 8-10 weeks\nYield: Moderate to high\nGrow Difficulty: Difficult\nClimate: Blueberry Kush will take off in a climate-controlled environment. Moisture will cause the buds to mold so keep humidity below 40% when flowering. This strain prefers a temperature between 68 and 80 degrees Fahrenheit.\nIndoor/Outdoor: Grows best indoors in a controlled environment, but can also grow outdoors with a dry fall climate.\nFeeding: Blueberry Kush is a picky strain. OG genetics require heavy feedings of CalMag and nitrogen, but don’t lock out any nutrients. Hydroponic growing can make sure this strain gets what it needs to thrive.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/03120116/blueberry-kush-strain.jpg","urlslug":"/news/growing/how-to-grow-blueberry-kush-marijuana"}],"reviewCount":1814,"flavors":[{"name":"Blueberry","score":57.142947614469207},{"name":"Berry","score":26.96667395922691},{"name":"Sweet","score":23.224928465741279},{"name":"Earthy","score":11.800000575728442},{"name":"Pungent","score":11.171621769443789}],"effects":[{"name":"Relaxed","score":81.426381604324874},{"name":"Happy","score":51.1155026397149},{"name":"Euphoric","score":47.458000610272151},{"name":"Sleepy","score":45.500495126458752},{"name":"Hungry","score":31.623870852596244}],"symptoms":[{"name":"Stress","score":46.271553833487822},{"name":"Pain","score":42.7014617745102},{"name":"Depression","score":28.793575446333477},{"name":"Insomnia","score":28.462761884474329},{"name":"Fatigue","score":20.347193035988784}],"conditions":[{"name":"Anxiety","score":30.243691455614218},{"name":"PTSD","score":15.438460387004659},{"name":"Arthritis","score":15.013500831927598},{"name":"Gastrointestinal Disorder","score":14.020311699377636},{"name":"ADD/ADHD","score":11.607059582136298}],"negatives":[{"name":"Dry Mouth","score":24.475583356842243},{"name":"Dry Eyes","score":20.433005360031782},{"name":"Paranoid","score":6.6865101069127721},{"name":"Dizzy","score":6.1426050560471639},{"name":"Anxious","score":4.235187946549372}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_960d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1006182/b/blueberry__primary_7874.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_6934.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002722/b/blueberry__primary_4459.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_e9f4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002019/b/blueberry__primary_398d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_7cf1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001742/b/blueberry__primary_56a2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_6702.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000057/b/blueberry__primary_aa7a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blueberry_100x100_436d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/706923/b/blueberry__primary_66a0.jpg"}],"photoTotalCount":453,"popularCities":["Portland, OR","Los Angeles, CA","Denver, CO","Vancouver, BC","Seattle, WA","Toronto, ON","Montréal, QC","Ottawa, ON","Las Vegas, NV","Phoenix, AZ"],"permalink":"https://mobileapi.leafly.com/indica/blueberry","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.29713340683572/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Thai","subtitle":null,"slug":"thai","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/thai","symbol":"Tha","applink":"leafly://strain/thai"},{"name":"Purple Thai","subtitle":null,"slug":"purple-thai","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/purple-thai","symbol":"Pth","applink":"leafly://strain/purple-thai"}],"growInfo":{"difficulty":"Easy","preferredMedium":"Soil","floweringDays":55,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":"Outdoor","growNotes":"\n\tAroma is best brought out when grown outdoors with organic fertilizers\n\tSuitable for sea of green (SOG) method\n\n"}}
