{
    "aka": "afghooey",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1506976615000)/",
            "id": "contentitems-43694",
            "text": "Dating back to the 18th century, bluegrass sits at the intersection of traditional Scottish, Irish, and English folk music. Settlers brought their ballads, dance music, and fiddles to the Appalachian Mountains in North America, where their individual melodies mixed together to create an uplifting sound that has been passed down from musician to musician for generations.\n\nBluegrass may be a cousin to folk, traditional, and Americana music, but at its heart it exists as one of the most distinct and noteworthy individual genres of our time. It is music that weaves stories and moves the soul—it’s a rich and colorful genre that can excite and invigorate the senses, especially with a little cannabis nearby.\nBelow, explore five bluegrass bands with your favorite pre-roll in hand—preferably on a rocking chair, soaking in the soulful tunes.\nLaws of Gravity by The Infamous Stringdusters\n\nStrain Pairing Recommendation: Tangilope\nThe Infamous Stringdusters’ latest album, Laws of Gravity, wastes no time as it bursts into life with their first track, “Freedom,” instantly immersing listeners in a rich and invigorating sound. The album, released this year, packs a powerful punch that is vibrant, complex and uniquely its own.\nLaws of Gravity manages to encapsulate the traditions of bluegrass while merging it with modern grooves and instrumentation. The bright movements of Jeremy Garrett’s fiddle and Chris Pandolfi’s banjo sing across the soundscape of bass, dobro, and guitar for a symphony that shines with and without the engaging and lively lyrics.\nWhen the lyrics do fade away, listeners enjoy the intricate improvisational jamming that is a hallmark of The Infamous Stringdusters. Laws of Gravity has a life of its own that proves once again why the band continues to be a resounding favorite across the genre’s fanbase.\nThe Muscle Shoals Recordings by The Steeldrivers\n\nStrain Pairing Recommendation: Blueberry Headband\nThe Muscle Shoals Recordings starts with light, happy banjo on the track “Long Way Down,” setting the tone for an album that combines the essence of bluegrass with rich complexity. Gary Nichols’ distinct and powerful voice, often accompanied by beautiful backing vocals, cruises effortlessly across the instrumentation and inspires with its authenticity and depth.\nThe Steeldrivers feature banjo, mandolin, guitar, bass, and fiddle for a full and delightfully classic bluegrass feel. The Muscle Shoals Recordings, produced in 2015, is the band’s fourth album and earned them a Grammy in the Best Bluegrass category.\nFrom the first track to the last, this is a spirited album that uplifts the mind and moves the body with energetic sound.\n\nThief by Keller & The Keels\n\nStrain Pairing Recommendation: Lodi Dodi\nWith a distinctly joyful beat, Thief picks you up and whisks you off into a dance of folky bluegrass with Keller William’s playful vocals leading the way. Williams is joined by Jenny Keel on upright bass and flat picker Larry Keel. Together, the three bring a decidedly full sound to their latest acoustic album.\nKeller & The Keels have never shied away from creative covers, and Thief, released in 2010, is no exception. Unlike their first album, Grass (released in 2006), Thief does not feature any original songs, focusing solely on covers. The album’s title is an ode to this decision.\nBluegrass versions of Amy Winehouse’s “Rehab” and Marcy Playground’s “Sex and Candy” are among the familiar but undeniably fresh covers. The tracks allow the listener to immediately jump in and sing along while still being immersed in new tunes and feelings.\nWilliams’ knack for composing solo music lends expertise to the composition of his trio, and as such, Thief has an intricacy that is impressive for such a small acoustic group.\nFriends of Fall by Crooked Still\n\nStrain Pairing Recommendation: Lemon Drop\nCrooked Still offers a unique bluegrass element that is light, airy, and melodic. Lead singer Aoife O’Donovan’s voice carries across the backdrop of banjo, bass, cello, and fiddle like a shooting star.\nFriends of Fall, released in 2011, brings an ethereal beauty and complexity to the genre of bluegrass. Songs such as “Pretty Bird” will stir emotion, while “It’ll End Too Soon” inspires and invigorates. Often described as ‘progressive bluegrass’ due to innovative acoustics, Crooked Still’s high-energy sound encourages engagement from the first note to the last thanks to its unique instrumentation.\nFriends of Fall is refreshing and wholly uplifting, carrying the spirit of bluegrass as it soars to new and delightful heights.\n\nLove. Ain’t Love  by Yonder Mountain String Band\n\nStrain Pairing Recommendation: Afgooey\nLove. Ain’t Love, released this year, is the latest from Yonder Mountain String Band, encompassing a full thirteen tracks of rich and engaging rhythms that will keep you on your toes.\nFeaturing five band members on banjo, bass, fiddle, guitar, and mandolin, Yonder Mountain String Band also has the distinction of all five members acting as vocalists, which allows them to create beautifully layered and rich harmonies.\nOn the other hand, Love. Ain’t Love does not shy away from fully instrumental tracks, such as “Fall Outta Line,” which showcases the band’s innovation in its tune. This ability to embrace the full merits of their instrumentation has won YMSB fans across various genres, including those in the jam band scene. When listening to Love. Ain’t Love, one can get lost in the music as it paints stories with and without lyrics.\nLove. Ain’t Love provides a playful, energetic, and creative soundscape. The passion and vibrancy in every note of the album act as joyful reminders that Yonder Mountain String Band continues to inspire and be inspired by bluegrass, even 18 years after the release of their first album.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/10/02124702/bluegrass-albums-while-high.jpg",
            "title": "5 Bold Bluegrass Albums to Listen to While High",
            "urlslug": "/news/lifestyle/bluegrass-albums-listen-high"
        },
        {
            "author": "Emily Grosvenor",
            "category": null,
            "date": "/Date(1459224000000)/",
            "id": "contentitems-6025",
            "text": "To make a truly informed cannabis-buying decision, you have to smell the product. And I don’t mean taking a dainty whiff. You’ve got get in there and really inhale, because smelling it — really focusing on the fragrance — may just be the best way to choose your cannabis.\n“Depending on what the scent is, it can make or break a strain for people,” said Tyson Dieter, a manager at the Southwest Portland outlet of Nectar, an Oregon cannabis retailer.\nI’m a home perfumer trained by a world-class nose. Years ago I trained at home using natural perfumer Mandy Aftel’s workbooks, and later I studied with her at her studio in Berkeley, Calif. For me scent is the ultimate in pleasure experiences. On a recent Tuesday morning, I stopped in at Nectar to talk scent and learn about the role it plays in the burgeoning cannabis industry.\nWhat Do Cannabis and Perfumes Have in Common?\nIt turns out perfume and pot have a lot in common.\nBoth products come with outlandish, sometimes arbitrary titles. Burberry Weekend, meet Blackberry Kush. Practically no one buys the product without smelling it first. (Where it’s allowed, that is. In Washington state, pre-purchase smelling for recreational cannabis is against the law.) We don’t talk about them using the same language, although that’s changing as consumers learn more about scent’s connection to the cannabis experience.\n\nAs I stepped through Nectar’s front door, the first thing I noticed was the air, which smelled lightly of sweet herb. The employees — perhaps the happiest service professionals I’ve ever encountered — were all eager to talk to me about their favorite-smelling strains.\nCommercial perfumes are composed of top notes, middle notes (also called heart notes) and base notes, so named based on their relative evaporation rates. A perfume with a top note of essential oil of bergamot (citrus) might be paired with a middle note of lavender oil and a base note of thick, resiny oakmoss. Together they make up the full scent experience of the perfume.\nIn the cannabis world, the language hasn’t yet evolved to describe the plant’s fragrance notes with such specificity. But budtenders and growers are expanding their vocabulary to describe the scent experience. So you may see two main, often contrasting odors: sweet and fruity paired with earthy, like in an Afgooey.\nAt Nectar the jars open dozens of times a day for olfactory sampling. Some strains are more fragrant than others. A Blackberry Kush may not remind anyone of blackberries, but it does have a subtle sweetness to balance the hashy, diesel-fume center it’s known for. GSC (f.k.a Girl Scout Cookies), another potent strain, smells oily and pungent in the middle and slightly sweet on top.\nAll cannabis strains carry their own scent signature, a fact that often surprises cannabis consumers who come to a shop for the first time.\n\n“First-timers generally know about THC content and little else,” Dieter said. “But then they usually stand there smelling all day to find a perfect match.”\nSome strains share some of their scent identity with the world of aromatherapy. An activating hybrid sativa like Orange Crush has much in common with a bitter orange essential oil — one often used by aromatherapists for energizing. In the same vein, the citrus-scented J1, a sativa hybrid, smells like a traditional fougère-style perfume, opening with a citrus note and moving into an herby heart.\nBecause scent is deeply personal, no one really agrees on which strains smell best. A savory, cheesy strain like OG99 might send some running for the hills, but for consumers who like to “smoke savory,” the associated mellow vibe is well worth it.\nOther consumers prefer the so-called “authentic-smelling” pot strains. For them, something like The Perps, which gives off the odor of a grape Jolly Rancher, might feel like spraying your face with Britney Spears’ Curious.\nWhy Consumption Methods Matter When It Comes to Scent Preservation\nWhen it comes to harnessing the scent of cannabis, consumption methods matter.\n\nA cannabis flower’s scent comes directly from its terpenes, volatile aromatic organic compounds found in the oils of all flowers. Terpenes in the cannabis flower evolved to attract pollinators or repel enemies. More than 100 possible terpenes are thought to exist in various strains of the cannabis flower.\nThe unique combination of terpenes in a particular strain produces its aromatic properties and, some believe, is thought to influence the body’s high. To heighten the experience of the terpenes, therefore, consumers should reach for consumption methods involving less combustion. The higher the burn temperature, the more likely the most volatile and aromatic terpenes will combust before being consumed.\nIn other words, to get the full scent experience, vape it, don’t smoke it.\n“When you have a vaping machine, it can hinder the effect of the flavor,” said Myles Hyde, a budtender at Nectar who specializes in medicinal use. For flower, Hyde suggested using a vaporizer in at least the $250 range. “With a lower-quality machine, you may end up smelling some of the machine itself.”\n\nThose who do want to smoke it would be advised to do it indoors, according to Hyde, where the scent lingers, affecting the high.\nOther methods, like using hash oil, produces a concentrated scent experience so aromatic it feels like smelling an aged perfume. Dieter pulled a Dogwalker resin with a smell reminiscent of jasmine concentrate: dirty, floral, even slightly fecal. In this way, fragrance obsessives are much like cheese hounds or any other aficionados who move with passion into a sensual pursuit — as they explore their olfactory world, they become more and more enamored with scents that might repel the layperson.\nEmphasizing Fragrance as Part of the Purchasing Decision\nThe importance of scent is beginning to take on a bigger role in the purchasing decision at some of Portland’s leading retail shops. During a recent visit to Oregon’s Finest, a store tucked into the city’s swanky Pearl District, manager Selena Toomey pulled flower-filled apothecary jars off a shelf for me.\n“Strains sell themselves based on their scent,” Toomey said. “It makes a huge difference in the experience.”\n\nPerfumers are taught to smell coffee beans between samples in order to cleanse their palates. Oregon’s Finest has adapted the practice for the cannabis connoisseur. Toomey invited me to sniff single-origin beans (this is Portland, after all) while passing between strain jars.\nToomey often suggests patients spend up to 10 minutes working the flower in their hands before smoking or vaping it. Doing so, she said, allows you to smell more of the terpenes and enhance the way it tastes when consumed.\n“The terpenoids and flavonoids play a huge part in opening up your receptors to all of the effects of the cannabis,” Toomey explained. “It’s like steaming in a hot shower before you moisturize.”\nScent scientists often talk about the cognitive barriers to talking about our often ignored fifth sense — that we don’t really practice the language needed to really discuss scent.\n\nWhen Toomey talks about scent to her customers, she sometimes avoids scent talk and focuses on taste, which offers a vocabulary more familiar to most consumers. She’ll speak of a strain like Dutch Treat as being like “mint chocolate chip ice cream.”\nToomey has been at Oregon’s Finest since its 2014 opening. She’s seen her customer base grow from curiosity to connoisseurship, even as the shop retains its focus on pot’s medicinal effects.\nShe sells individual terpenes as an additive to other marijuana products for medicinal users. Once you have enough experience to identify specific terpenes by smell alone, you can anticipate the associated high, she said.\n“If I’m in a dispensary, I can tell by the aroma if a strain will work with my body,” Toomey added. “The nose knows.”\nEmily Grosvenor is a writer and perfumer based in Oregon. You can follow her on Twitter.\nImage Source: Sara Dilley",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/03/29195541/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea.jpg",
            "title": "Cannabis Scents and Sensibility: Why Marijuana's Fragrance Is a Feast for the Nose",
            "urlslug": "/news/cannabis-101/scents-and-sensibility-if-fragrance-is-your-bag-cannabis-is-a-fea"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 63.171241050119335
        },
        {
            "name": "Migraines",
            "score": 8.278639618138424
        },
        {
            "name": "Spinal Cord Injury",
            "score": 4.643993635640413
        },
        {
            "name": "Fibromyalgia",
            "score": 4.464996022275258
        },
        {
            "name": "PTSD",
            "score": 3.813643595863166
        }
    ],
    "description": "<p>Afgooey, also known as <a href=\"http://leafly.com/indica/afgoo\">Afgoo</a>, is a potent <a href=\"http://leafly.com/indica\">indica</a> strain that is believed to descend from an <a href=\"http://leafly.com/indica/afghani\">Afghani</a> indica and Maui Haze. Its sativa parent may lend Afgoo some <a href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\">uplifting</a>, <a href=\"http://www.leafly.com/explore#!/explore/tags-creative\">creative</a> qualities, but this strain undoubtedly takes after its indica parent as it primarily delivers <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\">relaxing</a>, <a href=\"http://www.leafly.com/explore#!/explore/tags-sleepy\">sleepy</a> effects alongside its <a href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\">earthy</a> <a href=\"http://www.leafly.com/explore#/!/explore/flavors-pine\">pine</a> flavor. Growers hoping to cultivate Afgoo may have a better chance of success indoors, but this indica can also thrive in Mediterranean climates outdoors.</p>\n",
    "descriptionPlain": "Afgooey, also known as Afgoo, is a potent indica strain that is believed to descend from an Afghani indica and Maui Haze. Its sativa parent may lend Afgoo some uplifting, creative qualities, but this strain undoubtedly takes after its indica parent as it primarily delivers relaxing, sleepy effects alongside its earthy pine flavor. Growers hoping to cultivate Afgoo may have a better chance of success indoors, but this indica can also thrive in Mediterranean climates outdoors.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 79.18655529037392
        },
        {
            "name": "Happy",
            "score": 72.9365552903739
        },
        {
            "name": "Euphoric",
            "score": 70.38086714399364
        },
        {
            "name": "Uplifted",
            "score": 65.54793158313444
        },
        {
            "name": "Creative",
            "score": 61.14260143198091
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 59.53162291169451
        },
        {
            "name": "Pine",
            "score": 57.80131264916468
        },
        {
            "name": "Woody",
            "score": 13.812649164677804
        },
        {
            "name": "Pungent",
            "score": 6.135640413683372
        },
        {
            "name": "Sweet",
            "score": 5.300318217979315
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png",
            "id": 1415998,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I think this is one of my favorite \"mid grade\" indica strains.  No it isn't purple or fruit flavored, in fact, it smells down right piney.  2 TINY meant to be one hitter bowls (tiny temp plastic bong) were more than happy to MELT pain i didn't realize i had until my back cracked in 10 places......but dont be fooled.  Altho my buzz started off talkative enough about 30 mins in....couch lock.  Don't get me wrong, it's not unpleasant, but if you want a pain free lay around the house medicine for stress like i do (even with a seasoned pro) go light on this stuff if you want to get anything done that day.  Had a good buzz for around 90 mins and a well being after.  Opening the door to the mailman tho my eyes would gave me away.  Not enough to hurt just enough to show.  ",
            "username": "panaru"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1599526,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "...Alien.like \n\nstress & depression ...gone, \nleaves somewhat of a  slo-mo effect for a good while\n\nfirst toke left me  paranoid &  seemed to fu**  my soc. skills .all the way up. so dont make plans first go round & youll b fine\n\nbag and nose appeal falls short but-\n\nan all around great strain for awkward folk like myslf\n\nAlien.....Out",
            "username": "6lack-alien"
        }
    ],
    "id": 1682,
    "name": "Afgooey",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 64.65791567223548
        },
        {
            "name": "Dry Eyes",
            "score": 5.842283214001592
        },
        {
            "name": "Anxious",
            "score": 2.5009944311853616
        },
        {
            "name": "Paranoid",
            "score": 1.9689737470167064
        },
        {
            "name": "Dizzy",
            "score": 1.2529832935560858
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/afghani",
            "category": "Indica",
            "name": "Afghani",
            "permalink": "https://mobileapi.leafly.com/indica/afghani",
            "slug": "afghani",
            "subtitle": null,
            "symbol": "Afg"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/afgooey",
    "photoTotalCount": 91,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/indica/afgooey/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/indica/afgooey/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/628531/b/afgooey__primary_cc6c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/afgooey_100x100_9cd9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/622796/b/afghooey__primary_344b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/afghooey_100x100_0795.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/560018/b/afgooey__primary_ef67.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/afgooey_100x100_4e36.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/545613/b/afgooey__primary_534e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/afgooey_100x100_0422.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/518475/b/afgooey__primary_2aa7.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/afgooey_100x100_05e1.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/504250/b/afghooey__primary_a685.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/afghooey_100x100_acf8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Denver, CO",
        "Salem, OR",
        "Seattle, WA",
        "Springfield, OR",
        "Astoria, OR",
        "Eugene, OR",
        "Oregon City, OR",
        "Spokane, WA",
        "Talent, OR"
    ],
    "rating": 4.2,
    "relatedStrains": [],
    "reviewCount": 328,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "afgooey",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.20121951219512/240",
    "subtitle": null,
    "symbol": "Af",
    "symptoms": [
        {
            "name": "Pain",
            "score": 72.69789180588702
        },
        {
            "name": "Stress",
            "score": 66.92521877486078
        },
        {
            "name": "Depression",
            "score": 60.06861575178998
        },
        {
            "name": "Insomnia",
            "score": 16.26392203659507
        },
        {
            "name": "Muscle Spasms",
            "score": 10.361972951471756
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
