{"sl_translate":"description,descriptionPlain,category","id":173296,"slug":"ultraviolet-og","name":"UltraViolet OG","subtitle":null,"symbol":"Uv","category":"Indica","description":"\u003cp\u003eFrom Archive Seeds, UltraViolet OG is an 80% indica strain bred by crossing \u003ca href=\"https://www.leafly.com/indica/face-off-og\"\u003eFace Off OG\u003c/a\u003e with Purple Indica from the Pacific Northwest. With this genetic combination, the breeders hoped to improve the yield and flowering time while still maintaining a deep purple coloration, and UltraViolet OG achieved just that. This powerful indica strain delivers dreamy, sleepy euphoria that gives your eyelids some heaviness at night while giving your mood a burst of positivity.\u003c/p\u003e\n","descriptionPlain":"From Archive Seeds, UltraViolet OG is an 80% indica strain bred by crossing Face Off OG with Purple Indica from the Pacific Northwest. With this genetic combination, the breeders hoped to improve the yield and flowering time while still maintaining a deep purple coloration, and UltraViolet OG achieved just that. This powerful indica strain delivers dreamy, sleepy euphoria that gives your eyelids some heaviness at night while giving your mood a burst of positivity.\n","aka":"Ultraviolet OG Kush, OG Ultraviolet","rating":4.67,"highlightedReviews":[{"id":1330246,"username":"MistaFista","text":"Got me high as shit!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1575579,"username":"Dyermaker","text":"I like this strain but not as an Indica. \n\nI had an extremely stressful morning on top of being sick so I dropped by my local shop to grab something that would help me rest and recuperate. After vaping it with my volcano I did feel a relief of some symptoms. Mostly uplifted but not at all sleepy or as deeply relaxed as I wanted.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-46728","title":"5 Exceptional R\u0026B Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1509477174000)\/","text":"Rhythm and Blues is a rich genre with roots planted firmly in the black American community. It is a genre synonymous with emotion—music that feeds the soul and tells stories of pain and love. Born in the 1940s, R\u0026B has evolved over the decades to mean different things during different times while covering other genres such as gospel, funk, hip hop, and soul.\n\nDiverse as it is, there is a rich plethora of R\u0026B to explore and appreciate. While the genre may encompass many elements, R\u0026B will always be known for radiating feeling and heart. As R\u0026B artist Kenny “Babyface” Edmonds says, “R\u0026B is the one thing that has influenced every kind of music.” Pack a bowl and turn up these five powerful R\u0026B albums to electrify your next smoke session.\nWoman by Jill Scott\n\nStrain Pairing Recommendation: Ultraviolet OG\nJill Scott’s album Woman marks her fifth and latest release. The album showcases Scott’s powerful and hypnotic voice against irresistibly catchy beats. Don’t bother fighting it—Woman pulls you in and captures the imagination and spirit with songs such as “Run Run Run,” which hit with so much energy that it feels like Scott in the same room as you, singing her heart out, while the band plays with joyful fervor behind her.\n\nNew Amerykah Part Two: Return of the Ankh by Erykah Badu\n\nStrain Pairing Recommendation: Everlast\nNew Amerykah Part Two has an uplifting, whimsical feel, with tracks such as “Incense” featuring wistful vocals and gentle rhythms. Erykah Badu’s voice, at once both strong and soothing, is a delight to luxuriate in, and it takes center stage against a backdrop of steady and well-rounded instrumentation. Released in 2010, the album encompasses Badu’s neo-soul flavors, with elements of funk, hip hop, and electronic mixed in. All in all, it is a truly heartfelt album, with a vibe that will have you in your feels from the first to the last note.\nLet Love Rule by Ledisi\n\nStrain Pairing Recommendation: Black Diamond\nLedisi’s uplifting voice is captivating on her 2017 album, Let Love Rule. Ledisi takes the listener on a journey through various sounds and themes, with influences of hip hop and soul woven throughout. Let Love Rule is a work of poignancy, incorporating important social issues like the Black Lives Matter movement. Her song “Shot Down” addresses police brutality against black Americans with lyrics like “Shot down on display in the middle of the story / She was shot down in the park in the middle of the day,” and “The System says we matter, but the black lives only / Matter certain days.” Ledisi combines these raw, real lyrics with her powerful, soulful voice, and exquisite instrumentals make it all sound effortless—though it is anything but.\n\nFunk This by Chaka Khan\n\nStrain Pairing Recommendation: Mother of Berries\nLegendary “Queen of Funk” singer/songwriter and talented drummer Chaka Khan has been producing music for five decades, incorporating funk, jazz, and soul influences. Funk This, released in 2007, is Khan’s most modern album that exemplifies her unique sound and style. The album features funky R\u0026B beats, full instrumentation, and Khan’s signature vocals ripe with feeling and presence. From high-energy tracks such as “Disrespectful” to soulful ballads such as “Angel,” Funk This is an immersive album that demonstrates why Khan is called Queen.\nThe Miseducation of Lauryn Hill by Ms. Lauryn Hill\n\nStrain Pairing Recommendation: Punky Lion\nLauryn Hill’s first solo album, released in 1998, gained wide spread acclaim and went on to break records. The Miseducation of Lauryn Hill is a hard-hitting and expertly assembled album featuring Lauryn Hill’s unique mix of beauty and boldness. With elements of rap, reggae, hip hop, and soul, Hill fluctuates effortlessly between commanding lyrical composition and light, effervescent singing—both of which pull the listener in and captivate. Paired with engaging and expertly composed instrumentation, The Miseducation of Lauryn Hill is a uniquely personal album, where one can truly feel a part of Hill’s being in every track and in every line.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/10/31103330/rb-albums.jpg","urlslug":"/news/lifestyle/great-rb-albums-to-listen-to-while-high"},{"id":"contentitems-3313","title":"New Strains Alert: Honey Bananas, Sin Valley OG, Jimi Hendrix, LA Chocolat, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1438444800000)\/","text":"Check out the cannabis strains recently added to the Leafly database! While they might be new to our strain Explorer, many of them have been circulating the market for a while now. If you\u0027ve come across some of them before, write a strain review!\n \n   1. Honey Bananas\n\nHoney Bananas from Elemental Seeds is a heavy-handed hybrid strain bred from Strawberry Banana and Honey Boo Boo. This cannabis strain earns its name with a resinous coat as sticky as honey and an unmistakable banana aroma. She leans heavily toward the indica side of the family, providing weighty full-body effects coupled with an invigorating buzz of cerebral euphoria.\n\n \n   2. Papa\u0027s OG\n\nCultivated in Glendale, Arizona exclusively by Arizona Organix, Papa’s OG is an indica cannabis strain that provides positive and uplifting cerebral effects in unique combination with the classic indica full-body relaxation. Consumers find it to be functional and social while still remaining true to its indica roots. A descendant of Skywalker OG and OG Kush, Papa’s OG inherits a sweet and earthy grape aroma and potent medicinal effects suitable for patients treating pain, insomnia, and stress disorders.\n\n \n   3. Sin Valley OG\n\nSin Valley OG is a 60/40 indica-dominant cannabis strain bred by Sin City Seeds, who crossed SFV OG with a Blue Power indica. The resulting hybrid boasts high yields and well-structured buds with an earthy and sour lemon aroma. Beginning with a crushing blast of cerebral euphoria, Sin Valley OG brings an edge to your appetite while coercing muscles into serene relaxation.\n\n \n   4. LA Chocolat\n\nLA Chocolate, bred by DNA Genetics, is a 60/40 indica-dominant strain parented by their cherished LA Confidential indica and Chocolope sativa. This power-couple collectively passes on the best of their qualities: thick resin production, heavy yields, and a sweet, earthy aroma of chocolate and coffee. Its soothing physical effects sink through the body, keeping you relaxed while kindling the appetite.\n\n \n   5. UltraViolet OG\n\nFrom Archive Seeds, UltraViolet OG is an 80% indica strain bred by crossing Face Off OG with Purple Indica from the Pacific Northwest. With this genetic combination, the breeders hoped to improve the yield and flowering time while still maintaining a deep purple coloration, and UltraViolet OG achieved just that. This powerful indica strain delivers dreamy, sleepy euphoria that grants your eyelids some heaviness at night while giving your mood a burst of positivity.\n \n\n   6. Jimi Hendrix\n\nThere are many genetic combinations that fall under the name Jimi Hendrix, but this southern Oregon hybrid descends from Jack Herer, Headband, and Black Cherry Soda. Led by its sativa genetics, Jimi Hendrix delivers a cerebrally focused jolt of euphoric energy that helps feed creativity and focus in low doses. In a show of its diverse terpene profile, Jimi Hendrix has a complex aroma that spans flavors from earthy pine to sweet lemon and citrus. \n\n \n   7. RudeBoi OG\n\nBred by Archive Seeds, RudeBoi OG is an indica-dominant hybrid cannabis strain that brings together genetics from two OG Kush phenotypes, Irene OG and a backcrossed Face Off OG. The hashy kush aroma typically found in OG varieties comes out strong in this hybrid, providing a flavorful introduction with a refreshing finish. RudeBoi OG produces potently sublime, relaxing effects that envelopes both mind and body.\n\n \nCheck out our other new strains recently added to the Leafly Explorer, or catch up on last week\u0027s recently added strains!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/08/12002157/new-strains-alert-honey-bananas-sin-valley-og-jimi-hendrix-la-cho.jpg","urlslug":"/news/strains-products/new-strains-alert-honey-bananas-sin-valley-og-jimi-hendrix-la-cho"}],"reviewCount":27,"flavors":[{"name":"Flowery","score":7.4074074074074066},{"name":"Berry","score":5.5555555555555554},{"name":"Earthy","score":5.5555555555555554},{"name":"Sweet","score":4.62962962962963},{"name":"Pungent","score":4.62962962962963}],"effects":[{"name":"Uplifted","score":109.25925925925927},{"name":"Creative","score":102.77777777777777},{"name":"Relaxed","score":64.81481481481481},{"name":"Tingly","score":56.481481481481481},{"name":"Aroused","score":53.7037037037037}],"symptoms":[{"name":"Stress","score":108.33333333333333},{"name":"Pain","score":58.333333333333329},{"name":"Depression","score":56.481481481481481},{"name":"Nausea","score":53.7037037037037},{"name":"Lack of Appetite","score":52.777777777777779}],"conditions":[{"name":"Anxiety","score":58.333333333333329},{"name":"PTSD","score":53.7037037037037},{"name":"ADD/ADHD","score":3.7037037037037033},{"name":"Migraines","score":3.7037037037037033},{"name":"Bipolar Disorder","score":2.7777777777777777}],"negatives":[{"name":"Dry Mouth","score":53.7037037037037},{"name":"Dizzy","score":3.7037037037037033},{"name":"Dry Eyes","score":1.8518518518518516},{"name":"Paranoid","score":0.92592592592592582}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ultraviolet-og_100x100_e164.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000519/b/ultraviolet-og__primary_e8c8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ultraviolet-og_100x100_b409.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/586205/b/ultraviolet-og__primary_b44f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ultraviolet-og_100x100_8d8f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/519503/b/ultraviolet-og__primary_a7f4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ultraviolet-og_100x100_6481.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/412468/b/ultraviolet-og__primary_d827.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/ultraviolet-og_100x100_8e59.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/373461/b/ultraviolet-og__primary_d353.jpg"}],"photoTotalCount":5,"popularCities":["San Francisco, CA","Chandler, AZ","Daly City, CA","Lynnwood, WA","South San Francisco, CA","Walla Walla, WA"],"permalink":"https://mobileapi.leafly.com/indica/ultraviolet-og","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.66666666666667/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Face Off OG","subtitle":null,"slug":"face-off-og","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/face-off-og","symbol":"Fac","applink":"leafly://strain/face-off-og"},{"name":"North American Indica","subtitle":null,"slug":"north-american","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/north-american","symbol":"Nam","applink":"leafly://strain/north-american"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":65,"outdoorFinish":null,"height":null,"averageYield":"Medium","environment":null,"growNotes":""}}
