{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1466976600000)/",
            "id": "contentitems-2993",
            "text": "The most highly anticipated stretch of summer is here: Shark Week. It's a seven day-long marathon where we gather around our televisions to gawk, mouth agape with terror, at the aquatic beasts staring back at use with their dead eyes and rows of razor-sharp teeth. To more adequately prepare you for a week-long bout with the only sea creature to ever kill Samuel L. Jackson, here are a few strains that will have you saying, “We need a bigger boat\" (or bowl).\n  Great White Shark\nThe Great White Shark is the mob boss of the deep blue sea. Having survived for millions of years on the flesh of others, this creature doesn’t only have a taste for blood, it lives for it. If you manage to get your hands on its ravenous strain counterpart, take note of its fruity odor and dense coating of crystals. Indulge in this strain's pleasant olfactory and visual stimuli, because it will likely be your last, right before Great White Shark takes a bite right out of your dome-piece.\n  Shark Shock\nWhen I think of Shock Shark, I think of some electrified abomination with gleaming bone saws for teeth and a devil-may-care attitude. This particular strain is more stunning than shocking, leaning toward full indica genetics that stink of skunks devoured by this carnivorous lightning rod floating just below the water’s placid surface.\n  OG Shark\nOG Shark makes more sense than people give it credit for. Ocean Grown Shark is the only kind of shark I’ve seen. So, knowing OG Shark began in Canada makes this cartilaginous predator slightly more polite, but it will still bite you right in the face. Canadian or not, this shark only knows mind-altering ferocity.\n  CBD Shark\nCBD Shark, the only CBD strain to make the shark list, is like the squeaky rubber shark toy you might play with in the bath, except it weights two thousand pounds. While it may be less intimidating by way of its supplementary anti-inflammatory and anti-anxiety effects, this 80/20 indica will straight bite your legs off, making leaving the couch or bed or floor slightly more difficult. But don’t even sweat it — you'll be so lit on CBD Shark you’ll barely notice your missed appendages.\n  Shark Bite\nShark Bite is one of Leafly’s more literal shark strains. This strain is a cross of Great White Shark and Face Off OG, which is a suitable combination for this week-long television holiday dedicated to ocean predators that have the ability to remove body parts from unsuspecting victims.\n  Shark Attack\nShark Attack is a beautiful indica-dominant cross with rather conventional genetics. Crossing Super Skunk and White Widow, one hit of this strain will have you hearing John William’s Jaws score. Every dark corridor or unlit room become a vast, inky ocean full of razor-sharp teeth. This munchie-inducing strain will have you thanking your fridge manufacturer for the tiny interior light. (Just kidding, your fridge is full of sharks, too.)\nShark Week may only happen one week a year, but you can find potent strains that will take a bite out of your anxiety, depression, chronic pain, and laziness any time at Leafly — just check our Strain Explorer for options, or take a peek at some of our recommendations for strong cannabis strains.\n.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001315/6-shark-themed-cannabis-strains-that-pack-a-powerful-bite.jpg",
            "title": "6 Shark-Themed Cannabis Strains That Pack a Powerful Bite",
            "urlslug": "/news/strains-products/6-shark-themed-cannabis-strains-that-pack-a-powerful-bite"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1457121600000)/",
            "id": "contentitems-3381",
            "text": "We just added these seven strains to the strain Explorer, and this week's additions feature some potent indicas and newer spins on older genetics. Find out where they're available by clicking the links below, and don't forget to leave a review once you've had a chance to try them!\n \n   1. Purple Widow\n\nPurple Widow from De Sjamaan Seeds crosses White Widow with the renowned Dutch outdoor strain Purple Power, resulting in a large, sturdy plant that produces fat, resin-covered purple flowers. The aroma ranges from incense to fruit with floral overtones, and the taste from light berry to citrusy. Effects are generally described as combining a strong indica body high with a racy, cerebral sativa feel. Originally bred in the Netherlands in 2007, Purple Widow is not recommended for indoor growing and can reach over 10 feet in height outdoors.\n\n \n   2. Shark Attack\n\nA 70/30 indica-dominant hybrid from Dinafem Seeds, Shark Attack is a cross of Super Skunk and White Widow. Though it produces relatively modest levels of THC (12-16%) and significant amounts of CBD, the high is powerfully relaxing and long lasting, and can offer relief from aches and pain. Shark Attack produces a very strong odor of earthy hash with floral and lemon undertones, and tastes much like it smells. Because it is compact, easy to grow, and high yielding, as well as being suitable for indoor, outdoor, or greenhouse cultivation, Shark Attack is fast becoming one of the more popular hybrids available in feminized seed form.\n\n \n   3. Purple Headband\n\nPurple Headband is a 50/50 hybrid strain that combines the famous Headband with an unknown “purple” hybrid, resulting in dense pink and purple flowers covered in greenish trichomes. It often produces a strong fruity aroma with just a hint of gasoline, and a similar flavor with undertones of pine. The high has been likened to that of Headband: uplifting yet relaxing with a warm, fuzzy pressure that gradually creeps from your temples across your forehead.\n\n \n   4. Salmon River OG\n\nSalmon River OG is an indica-dominant strain from Oregon breeders Dynasty Genetics, who combined a Pre-98 Bubba Kush clone with a carefully selected Blue Heron male, creating a potent and easy-to-grow plant that finishes flowering in 7-8 weeks. The Salmon River OG may provide excellent pain relief and a heavy indica buzz; it is recommended that novice users take care not to overindulge. Dynasty has noted three main phenotypes in this cross, all with a similar terpene profile: a strong berry scent, underlined with hints of chocolate, coffee, lemon, and gasoline, and a similar taste when vaporized or smoked.\n\n \n   5. Medicine Woman\n\nMedicine Woman is a 60/40 sativa-dominant hybrid strain from renowned Oregon medical cannabis grower David Verstoppen. Aiming to help treat the symptoms of his wife’s fibromyalgia, Dave crossed Purple Urkle Dynamite, and Medicine Man to create this potent hybrid. Measured at over 23% THC, it relaxes muscles and provides powerful pain relief along with an energetic, clear-headed high. The aroma of Medicine Woman is sweet and skunky, and it tastes of sour citrus and diesel fuel.\n\n \n   6. Snow Ryder\n\nSnow Ryder is an indica-dominant auto-flowering strain available only in feminized seed form from Sensi Seeds. Unlike many auto-flowering strains, Snow Ryder is not a dwarf, so these sturdy plants can grow as tall as four feet while still featuring short internodal spacing. It produces tight, resinous buds covered in sparkly trichomes that have a sweet-spicy, earthy, citrus flavor. The effect of these flowers is described as a deep body stone accompanied by a breezy head high.\n\n \n   7. Dutchberry\n\nDutchberry is a 60/40 sativa-dominant hybrid strain from Artizen Cannabis in Lacey, WA. Combining Dutch Treat and DJ Short’s Blueberry, this hybrid is loaded with citrus and berry flavors that taste as good as it smells. With a chemical profile that falls around 27% THC and 8% CBD, Dutchberry has one of the highest cannabinoid contents available in the marketplace today. The high CBD content helps modify the extreme THC content to produce a happy, giggly high perfect for unwinding after a long day at work./p>\n\n \nBrowse through other new strains that were added recently to the Leafly Explorer or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/03/12002333/new-strains-alert-purple-widow-medicine-woman-shark-attack-purple.jpg",
            "title": "New Strains Alert: Purple Widow, Medicine Woman, Shark Attack, Purple Headband, and More",
            "urlslug": "/news/strains-products/new-strains-alert-purple-widow-medicine-woman-shark-attack-purple"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 1.7857142857142856
        },
        {
            "name": "Arthritis",
            "score": 1.7857142857142856
        },
        {
            "name": "Spinal Cord Injury",
            "score": 1.7857142857142856
        }
    ],
    "description": "<p>A 70/30 indica-dominant hybrid from <a href=\"https://www.dinafem.org/en/\">Dinafem Seeds</a>, Shark Attack is a cross of <a href=\"https://www.leafly.com/indica/super-skunk\">Super Skunk</a> and <a href=\"https://www.leafly.com/hybrid/white-widow\">White Widow</a>. Though it produces relatively modest levels of THC (12-16%) and significant amounts of <a href=\"https://www.leafly.com/news/cannabis-101/whats-the-deal-with-these-high-cbd-strains\">CBD</a>, the high is powerfully relaxing and long lasting, and can offer relief from aches and pain. Shark Attack produces a very strong odor of earthy hash with floral and lemon undertones, and tastes much like it smells. Because it is compact, easy to grow, and high yielding, as well as being suitable for indoor, outdoor, or greenhouse cultivation, Shark Attack is fast becoming one of the more popular hybrids available in feminized seed form. &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>\n",
    "descriptionPlain": "A 70/30 indica-dominant hybrid from Dinafem Seeds, Shark Attack is a cross of Super Skunk and White Widow. Though it produces relatively modest levels of THC (12-16%) and significant amounts of CBD, the high is powerfully relaxing and long lasting, and can offer relief from aches and pain. Shark Attack produces a very strong odor of earthy hash with floral and lemon undertones, and tastes much like it smells. Because it is compact, easy to grow, and high yielding, as well as being suitable for indoor, outdoor, or greenhouse cultivation, Shark Attack is fast becoming one of the more popular hybrids available in feminized seed form. &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;\n",
    "effects": [
        {
            "name": "Happy",
            "score": 32.14285714285714
        },
        {
            "name": "Focused",
            "score": 30.357142857142858
        },
        {
            "name": "Hungry",
            "score": 30.357142857142858
        },
        {
            "name": "Aroused",
            "score": 28.57142857142857
        },
        {
            "name": "Creative",
            "score": 26.785714285714285
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 5.357142857142857
        },
        {
            "name": "Spicy/Herbal",
            "score": 3.571428571428571
        },
        {
            "name": "Pine",
            "score": 3.571428571428571
        },
        {
            "name": "Pungent",
            "score": 1.7857142857142856
        },
        {
            "name": "Skunk",
            "score": 1.7857142857142856
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1414348,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I am someone who is new to marijuana and found most strains I had tried thus far to be way too strong for me. I went to my local dispensary and talked it over with my bud tender and they suggested I try Shark Attack. I wanted to wait a few times to get a good feel for it before writing a review and I can say it has been consistent across the board. This gives a really fantastic body high and a nice \" in the clouds\" floaty kind of feeling. This made my back pain and headache go away and just really put me in an extremely deep relaxed place, it calms the mind. My boyfriend is also loving this strain and we will be stocking up on more ASAP",
            "username": "Tiffanyd8385"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1414350,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Some nice euphoria to start later turns into force field euphoria after a harsh first hit, also beginning to feel a bit sleepy, very good chronic pain relief even helping knee a bit, my body is fully relaxed from head to toe, felt tingly near the end",
            "username": "bc7110"
        }
    ],
    "id": 213521,
    "name": "Shark Attack",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 32.14285714285714
        },
        {
            "name": "Dry Eyes",
            "score": 30.357142857142858
        },
        {
            "name": "Headache",
            "score": 25
        },
        {
            "name": "Anxious",
            "score": 25
        },
        {
            "name": "Paranoid",
            "score": 3.571428571428571
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/super-skunk",
            "category": "Indica",
            "name": "Super Skunk",
            "permalink": "https://mobileapi.leafly.com/indica/super-skunk",
            "slug": "super-skunk",
            "subtitle": null,
            "symbol": "Ssk"
        },
        {
            "applink": "leafly://strain/white-widow",
            "category": "Hybrid",
            "name": "White Widow",
            "permalink": "https://mobileapi.leafly.com/hybrid/white-widow",
            "slug": "white-widow",
            "subtitle": null,
            "symbol": "Ww"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/shark-attack",
    "photoTotalCount": 1,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/459802/b/shark-attack__primary_f491.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/shark-attack_100x100_80a0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Bellingham, WA",
        "Custer, WA",
        "Lynden, WA",
        "Redmond, WA",
        "Seattle, WA",
        "Spokane, WA"
    ],
    "rating": 4.2,
    "relatedStrains": [],
    "reviewCount": 10,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "shark-attack",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.2/240",
    "subtitle": null,
    "symbol": "Sak",
    "symptoms": [
        {
            "name": "Pain",
            "score": 5.357142857142857
        },
        {
            "name": "Stress",
            "score": 5.357142857142857
        },
        {
            "name": "Insomnia",
            "score": 3.571428571428571
        },
        {
            "name": "Cramps",
            "score": 1.7857142857142856
        },
        {
            "name": "Headaches",
            "score": 1.7857142857142856
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
