{"sl_translate":"description,descriptionPlain,category","id":212720,"slug":"purple-bud","name":"Purple Bud","subtitle":null,"symbol":"Pub","category":"Indica","description":"\u003cp\u003eFrom Sensi Seeds comes the purple-blossomed indica Purple Bud, appropriately named for its bright hues of lavender. A descendant of \u003ca href=\"http://leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e indicas, this colorful plant offers large harvests of sparkling buds that carry the sweet and piney aroma of sandalwood. A distant sativa relative from \u003ca href=\"https://www.leafly.com/sativa/jamaican\"\u003eJamaica\u003c/a\u003e gives this strain a little added height and cerebral invigoration, but Purple Bud\u0026rsquo;s effects generally fall heavy on both mind and body. After crossing the Afghani indicas with a Jamaican sativa, Sensi Seeds added genetics from a Dutch \u003ca href=\"https://www.leafly.com/indica/hindu-kush\"\u003eHindu Kush\u003c/a\u003e and a California \u003ca href=\"https://www.leafly.com/indica/purple-kush\"\u003ePurple Kush\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"From Sensi Seeds comes the purple-blossomed indica Purple Bud, appropriately named for its bright hues of lavender. A descendant of Afghani indicas, this colorful plant offers large harvests of sparkling buds that carry the sweet and piney aroma of sandalwood. A distant sativa relative from Jamaica gives this strain a little added height and cerebral invigoration, but Purple Bud\u0026rsquo;s effects generally fall heavy on both mind and body. After crossing the Afghani indicas with a Jamaican sativa, Sensi Seeds added genetics from a Dutch Hindu Kush and a California Purple Kush.\n","aka":"PurpleBud","rating":4.22,"highlightedReviews":[{"id":1334588,"username":"feustelme","text":"Good smoking experience, the effect is very uplifting and euphoric then turns to a more body stone effect. This strain is very productive as well and easy to grow. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1608961,"username":"levi6577","text":"Originally picked this up to deal with my daily headaches, and while it did not help me in that area, it did take my mind off of it enough to help me sleep. A little of this and I got drowsy and wanted my bed, but a little more and I started thinking deeply about human consciousness. Pretty good bud nonetheless","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-39132","title":"5 Reggae Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1503703122000)\/","text":"Born in 1960s Jamaica, reggae was an evolution of its predecessors: ska and rocksteady. The genre quickly took on a life of its own and eventually made its way to the United States, where it became a staple of 1960s culture. It also carved a special niche in the cannabis world, since reggae’s penchant for political lyrics did not shy away from the topic of legalization.\n\nIt’s a genre that is powerful in both its unique sound and inherently political roots. It is music that uplifts the spirit and rallies the heart. The era of reggae produced a plethora of iconic artists such as Bob Marley, Bunny Wailer, Peter Tosh, The Abyssinians, and Toots \u0026 The Maytals—the latter of whom actually coined the term ‘reggae’ with the 1968 single, “Do The Reggay.”\nTo better understand and appreciate the genre, pack a pipe, grab your friends, and explore the soulful reggae music below—each album we suggest is an ideal match for the right cannabis strain.\nStony Hill by Damian Marley\n\nStrain Pairing Recommendation: King’s Bread\nYoungest son of the legendary Bob Marley, Damian Marley continues his father’s legacy in reggae with his own fresh sound. Stony Hill is Marley’s newest album—released in July of this year, it combines modern electronic elements with classic reggae beats. Stony Hill feels like the next modern step in a continuously growing genre that refuses to lose its heart along the way.\nIn true reggae style, Marley’s lyrics do not shy away from telling honest and human stories. From wondering what the future will bring on one track, while impeccable backup vocals chime “believe in your dreams” on another, the album explores the depth of human character.\nThis 18-track album also features the song “Medication” featuring Marley’s brother and guest artist, Stephen Marley. The song is an ode to Marley’s love of “Mary Jane” and the medicinal power of cannabis. You’ll be singing along to the lyrics, “And I say to myself, what a wonderful herb.”\n\nSevana EP by Sevana\n\nStrain Pairing Recommendation: Purple Bud\nHailing from Kingston, Jamaica, Sevana burst onto the scene last year with her first EP album, where she delivers stunning, expert vocals and impactful reggae beats. The album begins with the softer ballad “Carry You” before launching into the groovy “Bit Too Shy,” which sets the tone for the rest of the collection.\nThe EP’s music will get you moving to the rhythm, while Sevana’s energetic and heartfelt vocals delight across the soundscape with perfect control and beautiful clarity. Sevana captures the heart of reggae in her music, vocals, and lyrics for a complete immersion in classic reggae via a modern recording artist. Sevana’s debut album proves she’s an artist to watch and gives us high hopes of more great albums to come.\nEqual Rights by Peter Tosh\n\nStrain Pairing Recommendation: Jah Kush\nAlong with Bob Marley and Bunny Wailer, Peter Tosh got his start as part of The Wailers. Afterwards, he went on to become his own successful solo artist and produced many iconic albums, including Equal Rights in 1977.\nEqual Rights opens with the familiar song, “Get Up, Stand Up,” performed with Tosh’s unique style and sound. The album contains classics such as “Downpressor Man” and “Stepping Razor,” and features Tosh’s punctuated and mellow vocals accompanied by melodies that are rich, vibrant, and smooth.\nAs a whole, Equal Rights is an iconic reggae album that encapsulates the heart and soul of reggae as it was at the time of its initial emergence onto the popular scene. For this reason, it will always reign as a powerful memento of reggae’s roots.\n\nAfrican Holocaust by Steel Pulse\n\nStrain Pairing Recommendation: Malawi\nReleased in 2004, African Holocaust is the latest in a long line of albums produced by Steel Pulse. Though over a decade old, it remains relevant today both musically as well as lyrically, touching on topics such as global warming, corruption in government and religion, and the ramifications of slavery.\nFormed in 1975 in Birmingham, England, Steel Pulse has had a somewhat rotating cast of players over the years, but always with lead singer David Hinds at the forefront holding down vocals and rhythm guitar.\nAfrican Holocaust is no exception, with Hinds’s fierce voice leading the upbeat reggae melodies that encourage dance and reflection all at once. It is this combination of poignant lyrics and stunningly composed music full of drums and horns that makes African Holocaust such a noteworthy album.\nRebirth by Jimmy Cliff\n\nStrain Pairing Recommendation: Lamb’s Bread\nRebirth was released in 2012 as part of what Jimmy Cliff said was “a rebirth of my career at this time.” It was the first album Cliff had released in eight years, and went on to win a Grammy for Best Reggae Album. Cliff has been producing reggae music since the 1960s and is one of the few original artists who still produces new music today while touring or appearing at festivals (such as Lockn’ in 2015).\nRebirth manages to encapsulate Cliff’s classic reggae feel while shining anew with crisp, fresh, updated sounds. The 13-track album features new, original music as well as some covers—all of it exceedingly lively, joyful, and brimming with energy.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/25110707/best-reggae-albums-header.jpg","urlslug":"/news/lifestyle/reggae-albums-listen-high"},{"id":"contentitems-3349","title":"New Strains Alert: Moondance, Venus OG, The Doctor, Shangri-La, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1456522800000)\/","text":"These strains were just added to the Leafly database and they\u0027re in some need of some user love. Have you chanced upon any of these varieties in your strain quests? Let us know by leaving a review. We\u0027ve also included links to help you find out whether or not that strain is being offered at a location near you, so get shopping!\n \n   1. Venus OG\n\nAnother member of the “planetary series,” Venus OG is a hybrid strain bearing OG Kush heritage, although its specific parent strains are disputed. Each glistening trichome carries a resemblance to the bright planet this strain is named after, coating its conic buds in a galactic blanket of white crystals. A fresh pine aroma mixed with sour notes of lemon draws you in, and next comes the heavy euphoria to take away your sense of gravity and lift you to a happy, relaxed place.\n\nClick here for a full list of locations currently carrying Venus OG\n \n   2. Moondance\n\nMoondance is a sativa-dominant strain that offers a CBD content as high as 11%. With an average THC level of just 4%, consumers will notice only minimal cerebral, euphoric sensations. Candied grape aromas turn to spicy pepper, fresh mint, and sharp pine flavors on the exhale. Stress, body aches, and painful inflammation wither away while the mind is left agile and clear, making this strain an excellent daytime choice for patients and those needing to stay active. Inheriting genetics from Super Silver Haze, Neville’s Haze, and an unknown CBD-rich parent, Moondance is a variation of the better-known MediHaze sativa.\n\nClick here for a full list of locations currently carrying Moondance\n \n   3. Purple Bud\n\nFrom Sensi Seeds comes the purple-blossomed indica Purple Bud, appropriately named for its bright hues of lavender. A descendant of Afghani indicas, this colorful plant offers large harvests of sparkling buds that carry the sweet and piney aroma of sandalwood. A distant sativa relative from Jamaica gives this strain a little added height and cerebral invigoration, but Purple Bud’s effects generally fall heavy on both mind and body. After crossing the Afghani indicas with a Jamaican sativa, Sensi Seeds added genetics from a Dutch Hindu Kush and a California Purple Kush.\n\n \n   4. Shangri-La\n\nTaking its name from the mythical valley utopia, the Shangri-La hybrid is sure to bring you to your own internal paradise. This 60/40 sativa-dominant strain takes you to a peaceful mindset where happiness and relaxation are no strangers. Patients might also choose this strain as an uplifting escape from nausea, stress, and pain. Skunky and sweet in flavor, Shangri-La boasts a garden of different aromas from ripe grape and berry to tropical mango and citrus. Bred by JinxProof Genetics and propagated by TGA Genetics, Shangri-La crosses parent strains Fudo Myo-o and 9 Pound Hammer.\n\nClick here for a full list of locations currently carrying Shangri-La\n \n   5. Sweet Jane\n\nSweet Jane is a sweet-flavored sativa strain that provides an uplifting burst of cerebral energy ideal for daytime use. A selected cut of the famous Island Sweet Skunk, Sweet Jane carries an intense fruity aroma with notes of grapefruit, lemon, and mangos. Colorful calyxes spiral from the buds, woven in fiery hairs and powdered in a sugary coat of crystal resin. With an average THC content of 20% and a subtle CBD profile, Sweet Jane delivers nuanced effects perfect for both relaxing and getting things done.\n\nClick here for a full list of locations currently carrying Sweet Jane\n \n   6. The Doctor\n\nBred by Green House Seeds, The Doctor is an indica-dominant strain designed to treat a myriad of unpleasant symptoms such as pain, nausea, appetite loss, and insomnia. Its name also comes in tribute to the motorcycle racer Valentino Rossi, also called “The Doctor.” Heavy sedating effects act fast, leaving you feeling pacified and calm. Earthy flavors soured by skunky, fruity notes arrive on the inhale, making their exit with the taste of hashy spice. Great White Shark, Super Skunk, and an unnamed South Indian parent lend The Doctor its genetic blueprint.\n\n \n   7. Purple Goat\n\nPurple Goat is a hybrid cross between Trainwreck and Blueberry Skunk, created by Oregon OMMP growers in the early 2010s. With a mostly sativa growth pattern, Purple Goat produces dense indica buds of a dark purple hue with a rich palate of sweet grass and spicy herbs. An early flowerer, Purple Goat will finish its maturation cycle by the end of September outdoors. When consumed, Purple Goat has an earthy taste with blueberry overtones and provides a feeling of deep relaxation.\n\nClick here for a full list of locations currently carrying Purple Goat\n \nBrowse through other new strains that were added recently to the Leafly Explorer or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/12002247/new-strains-alert-moondance-venus-og-the-doctor-shangri-la-and-mo.png","urlslug":"/news/strains-products/new-strains-alert-moondance-venus-og-the-doctor-shangri-la-and-mo"}],"reviewCount":18,"flavors":[{"name":"Earthy","score":55.735930735930737},{"name":"Lavender","score":19.588744588744586},{"name":"Sweet","score":16.017316017316016},{"name":"Pine","score":12.878787878787879},{"name":"Pepper","score":10.497835497835498}],"effects":[{"name":"Relaxed","score":90.367965367965368},{"name":"Sleepy","score":68.614718614718612},{"name":"Happy","score":19.805194805194805},{"name":"Euphoric","score":17.424242424242422},{"name":"Focused","score":12.662337662337663}],"symptoms":[{"name":"Insomnia","score":51.19047619047619},{"name":"Stress","score":19.372294372294373},{"name":"Pain","score":14.826839826839825},{"name":"Depression","score":10.281385281385282},{"name":"Lack of Appetite","score":10.281385281385282}],"conditions":[{"name":"Anxiety","score":14.826839826839825},{"name":"PTSD","score":4.5454545454545459},{"name":"Arthritis","score":1.1904761904761905},{"name":"Migraines","score":1.1904761904761905},{"name":"Spinal Cord Injury","score":1.1904761904761905}],"negatives":[{"name":"Dry Mouth","score":67.20779220779221},{"name":"Dry Eyes","score":18.398268398268396},{"name":"Dizzy","score":6.9264069264069263}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_4c62.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/640980/b/purple-bud__primary_c279.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_8554.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/624434/b/purple-bud__primary_f9d2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_60a6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/611728/b/purple-bud__primary_76f9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_d413.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/523355/b/purple-bud__primary_e887.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_3837.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/523403/b/purple-bud__primary_7747.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_8879.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503571/b/purple-bud__primary_90e1.jpg"}],"photoTotalCount":14,"popularCities":["Fort Collins, CO","King City, OR"],"permalink":"https://mobileapi.leafly.com/indica/purple-bud","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.22222222222222/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Jamaican","subtitle":null,"slug":"jamaican","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jamaican","symbol":"Jam","applink":"leafly://strain/jamaican"},{"name":"Hindu Skunk","subtitle":null,"slug":"hindu-skunk","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/hindu-skunk","symbol":"Hsk","applink":"leafly://strain/hindu-skunk"},{"name":"Purple Kush","subtitle":null,"slug":"purple-kush","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/purple-kush","symbol":"Pk","applink":"leafly://strain/purple-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":58,"outdoorFinish":null,"height":"Short","averageYield":"High","environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":212720,"slug":"purple-bud","name":"Purple Bud","subtitle":null,"symbol":"Pub","category":"Indica","description":"\u003cp\u003eFrom Sensi Seeds comes the purple-blossomed indica Purple Bud, appropriately named for its bright hues of lavender. A descendant of \u003ca href=\"http://leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e indicas, this colorful plant offers large harvests of sparkling buds that carry the sweet and piney aroma of sandalwood. A distant sativa relative from \u003ca href=\"https://www.leafly.com/sativa/jamaican\"\u003eJamaica\u003c/a\u003e gives this strain a little added height and cerebral invigoration, but Purple Bud\u0026rsquo;s effects generally fall heavy on both mind and body. After crossing the Afghani indicas with a Jamaican sativa, Sensi Seeds added genetics from a Dutch \u003ca href=\"https://www.leafly.com/indica/hindu-kush\"\u003eHindu Kush\u003c/a\u003e and a California \u003ca href=\"https://www.leafly.com/indica/purple-kush\"\u003ePurple Kush\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"From Sensi Seeds comes the purple-blossomed indica Purple Bud, appropriately named for its bright hues of lavender. A descendant of Afghani indicas, this colorful plant offers large harvests of sparkling buds that carry the sweet and piney aroma of sandalwood. A distant sativa relative from Jamaica gives this strain a little added height and cerebral invigoration, but Purple Bud\u0026rsquo;s effects generally fall heavy on both mind and body. After crossing the Afghani indicas with a Jamaican sativa, Sensi Seeds added genetics from a Dutch Hindu Kush and a California Purple Kush.\n","aka":"PurpleBud","rating":4.22,"highlightedReviews":[{"id":1334588,"username":"feustelme","text":"Good smoking experience, the effect is very uplifting and euphoric then turns to a more body stone effect. This strain is very productive as well and easy to grow. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1608961,"username":"levi6577","text":"Originally picked this up to deal with my daily headaches, and while it did not help me in that area, it did take my mind off of it enough to help me sleep. A little of this and I got drowsy and wanted my bed, but a little more and I started thinking deeply about human consciousness. Pretty good bud nonetheless","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-39132","title":"5 Reggae Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1503703122000)\/","text":"Born in 1960s Jamaica, reggae was an evolution of its predecessors: ska and rocksteady. The genre quickly took on a life of its own and eventually made its way to the United States, where it became a staple of 1960s culture. It also carved a special niche in the cannabis world, since reggae’s penchant for political lyrics did not shy away from the topic of legalization.\n\nIt’s a genre that is powerful in both its unique sound and inherently political roots. It is music that uplifts the spirit and rallies the heart. The era of reggae produced a plethora of iconic artists such as Bob Marley, Bunny Wailer, Peter Tosh, The Abyssinians, and Toots \u0026 The Maytals—the latter of whom actually coined the term ‘reggae’ with the 1968 single, “Do The Reggay.”\nTo better understand and appreciate the genre, pack a pipe, grab your friends, and explore the soulful reggae music below—each album we suggest is an ideal match for the right cannabis strain.\nStony Hill by Damian Marley\n\nStrain Pairing Recommendation: King’s Bread\nYoungest son of the legendary Bob Marley, Damian Marley continues his father’s legacy in reggae with his own fresh sound. Stony Hill is Marley’s newest album—released in July of this year, it combines modern electronic elements with classic reggae beats. Stony Hill feels like the next modern step in a continuously growing genre that refuses to lose its heart along the way.\nIn true reggae style, Marley’s lyrics do not shy away from telling honest and human stories. From wondering what the future will bring on one track, while impeccable backup vocals chime “believe in your dreams” on another, the album explores the depth of human character.\nThis 18-track album also features the song “Medication” featuring Marley’s brother and guest artist, Stephen Marley. The song is an ode to Marley’s love of “Mary Jane” and the medicinal power of cannabis. You’ll be singing along to the lyrics, “And I say to myself, what a wonderful herb.”\n\nSevana EP by Sevana\n\nStrain Pairing Recommendation: Purple Bud\nHailing from Kingston, Jamaica, Sevana burst onto the scene last year with her first EP album, where she delivers stunning, expert vocals and impactful reggae beats. The album begins with the softer ballad “Carry You” before launching into the groovy “Bit Too Shy,” which sets the tone for the rest of the collection.\nThe EP’s music will get you moving to the rhythm, while Sevana’s energetic and heartfelt vocals delight across the soundscape with perfect control and beautiful clarity. Sevana captures the heart of reggae in her music, vocals, and lyrics for a complete immersion in classic reggae via a modern recording artist. Sevana’s debut album proves she’s an artist to watch and gives us high hopes of more great albums to come.\nEqual Rights by Peter Tosh\n\nStrain Pairing Recommendation: Jah Kush\nAlong with Bob Marley and Bunny Wailer, Peter Tosh got his start as part of The Wailers. Afterwards, he went on to become his own successful solo artist and produced many iconic albums, including Equal Rights in 1977.\nEqual Rights opens with the familiar song, “Get Up, Stand Up,” performed with Tosh’s unique style and sound. The album contains classics such as “Downpressor Man” and “Stepping Razor,” and features Tosh’s punctuated and mellow vocals accompanied by melodies that are rich, vibrant, and smooth.\nAs a whole, Equal Rights is an iconic reggae album that encapsulates the heart and soul of reggae as it was at the time of its initial emergence onto the popular scene. For this reason, it will always reign as a powerful memento of reggae’s roots.\n\nAfrican Holocaust by Steel Pulse\n\nStrain Pairing Recommendation: Malawi\nReleased in 2004, African Holocaust is the latest in a long line of albums produced by Steel Pulse. Though over a decade old, it remains relevant today both musically as well as lyrically, touching on topics such as global warming, corruption in government and religion, and the ramifications of slavery.\nFormed in 1975 in Birmingham, England, Steel Pulse has had a somewhat rotating cast of players over the years, but always with lead singer David Hinds at the forefront holding down vocals and rhythm guitar.\nAfrican Holocaust is no exception, with Hinds’s fierce voice leading the upbeat reggae melodies that encourage dance and reflection all at once. It is this combination of poignant lyrics and stunningly composed music full of drums and horns that makes African Holocaust such a noteworthy album.\nRebirth by Jimmy Cliff\n\nStrain Pairing Recommendation: Lamb’s Bread\nRebirth was released in 2012 as part of what Jimmy Cliff said was “a rebirth of my career at this time.” It was the first album Cliff had released in eight years, and went on to win a Grammy for Best Reggae Album. Cliff has been producing reggae music since the 1960s and is one of the few original artists who still produces new music today while touring or appearing at festivals (such as Lockn’ in 2015).\nRebirth manages to encapsulate Cliff’s classic reggae feel while shining anew with crisp, fresh, updated sounds. The 13-track album features new, original music as well as some covers—all of it exceedingly lively, joyful, and brimming with energy.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/25110707/best-reggae-albums-header.jpg","urlslug":"/news/lifestyle/reggae-albums-listen-high"},{"id":"contentitems-3349","title":"New Strains Alert: Moondance, Venus OG, The Doctor, Shangri-La, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1456522800000)\/","text":"These strains were just added to the Leafly database and they\u0027re in some need of some user love. Have you chanced upon any of these varieties in your strain quests? Let us know by leaving a review. We\u0027ve also included links to help you find out whether or not that strain is being offered at a location near you, so get shopping!\n \n   1. Venus OG\n\nAnother member of the “planetary series,” Venus OG is a hybrid strain bearing OG Kush heritage, although its specific parent strains are disputed. Each glistening trichome carries a resemblance to the bright planet this strain is named after, coating its conic buds in a galactic blanket of white crystals. A fresh pine aroma mixed with sour notes of lemon draws you in, and next comes the heavy euphoria to take away your sense of gravity and lift you to a happy, relaxed place.\n\nClick here for a full list of locations currently carrying Venus OG\n \n   2. Moondance\n\nMoondance is a sativa-dominant strain that offers a CBD content as high as 11%. With an average THC level of just 4%, consumers will notice only minimal cerebral, euphoric sensations. Candied grape aromas turn to spicy pepper, fresh mint, and sharp pine flavors on the exhale. Stress, body aches, and painful inflammation wither away while the mind is left agile and clear, making this strain an excellent daytime choice for patients and those needing to stay active. Inheriting genetics from Super Silver Haze, Neville’s Haze, and an unknown CBD-rich parent, Moondance is a variation of the better-known MediHaze sativa.\n\nClick here for a full list of locations currently carrying Moondance\n \n   3. Purple Bud\n\nFrom Sensi Seeds comes the purple-blossomed indica Purple Bud, appropriately named for its bright hues of lavender. A descendant of Afghani indicas, this colorful plant offers large harvests of sparkling buds that carry the sweet and piney aroma of sandalwood. A distant sativa relative from Jamaica gives this strain a little added height and cerebral invigoration, but Purple Bud’s effects generally fall heavy on both mind and body. After crossing the Afghani indicas with a Jamaican sativa, Sensi Seeds added genetics from a Dutch Hindu Kush and a California Purple Kush.\n\n \n   4. Shangri-La\n\nTaking its name from the mythical valley utopia, the Shangri-La hybrid is sure to bring you to your own internal paradise. This 60/40 sativa-dominant strain takes you to a peaceful mindset where happiness and relaxation are no strangers. Patients might also choose this strain as an uplifting escape from nausea, stress, and pain. Skunky and sweet in flavor, Shangri-La boasts a garden of different aromas from ripe grape and berry to tropical mango and citrus. Bred by JinxProof Genetics and propagated by TGA Genetics, Shangri-La crosses parent strains Fudo Myo-o and 9 Pound Hammer.\n\nClick here for a full list of locations currently carrying Shangri-La\n \n   5. Sweet Jane\n\nSweet Jane is a sweet-flavored sativa strain that provides an uplifting burst of cerebral energy ideal for daytime use. A selected cut of the famous Island Sweet Skunk, Sweet Jane carries an intense fruity aroma with notes of grapefruit, lemon, and mangos. Colorful calyxes spiral from the buds, woven in fiery hairs and powdered in a sugary coat of crystal resin. With an average THC content of 20% and a subtle CBD profile, Sweet Jane delivers nuanced effects perfect for both relaxing and getting things done.\n\nClick here for a full list of locations currently carrying Sweet Jane\n \n   6. The Doctor\n\nBred by Green House Seeds, The Doctor is an indica-dominant strain designed to treat a myriad of unpleasant symptoms such as pain, nausea, appetite loss, and insomnia. Its name also comes in tribute to the motorcycle racer Valentino Rossi, also called “The Doctor.” Heavy sedating effects act fast, leaving you feeling pacified and calm. Earthy flavors soured by skunky, fruity notes arrive on the inhale, making their exit with the taste of hashy spice. Great White Shark, Super Skunk, and an unnamed South Indian parent lend The Doctor its genetic blueprint.\n\n \n   7. Purple Goat\n\nPurple Goat is a hybrid cross between Trainwreck and Blueberry Skunk, created by Oregon OMMP growers in the early 2010s. With a mostly sativa growth pattern, Purple Goat produces dense indica buds of a dark purple hue with a rich palate of sweet grass and spicy herbs. An early flowerer, Purple Goat will finish its maturation cycle by the end of September outdoors. When consumed, Purple Goat has an earthy taste with blueberry overtones and provides a feeling of deep relaxation.\n\nClick here for a full list of locations currently carrying Purple Goat\n \nBrowse through other new strains that were added recently to the Leafly Explorer or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/12002247/new-strains-alert-moondance-venus-og-the-doctor-shangri-la-and-mo.png","urlslug":"/news/strains-products/new-strains-alert-moondance-venus-og-the-doctor-shangri-la-and-mo"}],"reviewCount":18,"flavors":[{"name":"Earthy","score":55.735930735930737},{"name":"Lavender","score":19.588744588744586},{"name":"Sweet","score":16.017316017316016},{"name":"Pine","score":12.878787878787879},{"name":"Pepper","score":10.497835497835498}],"effects":[{"name":"Relaxed","score":90.367965367965368},{"name":"Sleepy","score":68.614718614718612},{"name":"Happy","score":19.805194805194805},{"name":"Euphoric","score":17.424242424242422},{"name":"Focused","score":12.662337662337663}],"symptoms":[{"name":"Insomnia","score":51.19047619047619},{"name":"Stress","score":19.372294372294373},{"name":"Pain","score":14.826839826839825},{"name":"Depression","score":10.281385281385282},{"name":"Lack of Appetite","score":10.281385281385282}],"conditions":[{"name":"Anxiety","score":14.826839826839825},{"name":"PTSD","score":4.5454545454545459},{"name":"Arthritis","score":1.1904761904761905},{"name":"Migraines","score":1.1904761904761905},{"name":"Spinal Cord Injury","score":1.1904761904761905}],"negatives":[{"name":"Dry Mouth","score":67.20779220779221},{"name":"Dry Eyes","score":18.398268398268396},{"name":"Dizzy","score":6.9264069264069263}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_4c62.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/640980/b/purple-bud__primary_c279.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_8554.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/624434/b/purple-bud__primary_f9d2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_60a6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/611728/b/purple-bud__primary_76f9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_d413.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/523355/b/purple-bud__primary_e887.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_3837.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/523403/b/purple-bud__primary_7747.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_8879.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503571/b/purple-bud__primary_90e1.jpg"}],"photoTotalCount":14,"popularCities":["Fort Collins, CO","King City, OR"],"permalink":"https://mobileapi.leafly.com/indica/purple-bud","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.22222222222222/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Jamaican","subtitle":null,"slug":"jamaican","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jamaican","symbol":"Jam","applink":"leafly://strain/jamaican"},{"name":"Hindu Skunk","subtitle":null,"slug":"hindu-skunk","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/hindu-skunk","symbol":"Hsk","applink":"leafly://strain/hindu-skunk"},{"name":"Purple Kush","subtitle":null,"slug":"purple-kush","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/purple-kush","symbol":"Pk","applink":"leafly://strain/purple-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":58,"outdoorFinish":null,"height":"Short","averageYield":"High","environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":212720,"slug":"purple-bud","name":"Purple Bud","subtitle":null,"symbol":"Pub","category":"Indica","description":"\u003cp\u003eFrom Sensi Seeds comes the purple-blossomed indica Purple Bud, appropriately named for its bright hues of lavender. A descendant of \u003ca href=\"http://leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e indicas, this colorful plant offers large harvests of sparkling buds that carry the sweet and piney aroma of sandalwood. A distant sativa relative from \u003ca href=\"https://www.leafly.com/sativa/jamaican\"\u003eJamaica\u003c/a\u003e gives this strain a little added height and cerebral invigoration, but Purple Bud\u0026rsquo;s effects generally fall heavy on both mind and body. After crossing the Afghani indicas with a Jamaican sativa, Sensi Seeds added genetics from a Dutch \u003ca href=\"https://www.leafly.com/indica/hindu-kush\"\u003eHindu Kush\u003c/a\u003e and a California \u003ca href=\"https://www.leafly.com/indica/purple-kush\"\u003ePurple Kush\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"From Sensi Seeds comes the purple-blossomed indica Purple Bud, appropriately named for its bright hues of lavender. A descendant of Afghani indicas, this colorful plant offers large harvests of sparkling buds that carry the sweet and piney aroma of sandalwood. A distant sativa relative from Jamaica gives this strain a little added height and cerebral invigoration, but Purple Bud\u0026rsquo;s effects generally fall heavy on both mind and body. After crossing the Afghani indicas with a Jamaican sativa, Sensi Seeds added genetics from a Dutch Hindu Kush and a California Purple Kush.\n","aka":"PurpleBud","rating":4.22,"highlightedReviews":[{"id":1334588,"username":"feustelme","text":"Good smoking experience, the effect is very uplifting and euphoric then turns to a more body stone effect. This strain is very productive as well and easy to grow. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1608961,"username":"levi6577","text":"Originally picked this up to deal with my daily headaches, and while it did not help me in that area, it did take my mind off of it enough to help me sleep. A little of this and I got drowsy and wanted my bed, but a little more and I started thinking deeply about human consciousness. Pretty good bud nonetheless","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-39132","title":"5 Reggae Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1503703122000)\/","text":"Born in 1960s Jamaica, reggae was an evolution of its predecessors: ska and rocksteady. The genre quickly took on a life of its own and eventually made its way to the United States, where it became a staple of 1960s culture. It also carved a special niche in the cannabis world, since reggae’s penchant for political lyrics did not shy away from the topic of legalization.\n\nIt’s a genre that is powerful in both its unique sound and inherently political roots. It is music that uplifts the spirit and rallies the heart. The era of reggae produced a plethora of iconic artists such as Bob Marley, Bunny Wailer, Peter Tosh, The Abyssinians, and Toots \u0026 The Maytals—the latter of whom actually coined the term ‘reggae’ with the 1968 single, “Do The Reggay.”\nTo better understand and appreciate the genre, pack a pipe, grab your friends, and explore the soulful reggae music below—each album we suggest is an ideal match for the right cannabis strain.\nStony Hill by Damian Marley\n\nStrain Pairing Recommendation: King’s Bread\nYoungest son of the legendary Bob Marley, Damian Marley continues his father’s legacy in reggae with his own fresh sound. Stony Hill is Marley’s newest album—released in July of this year, it combines modern electronic elements with classic reggae beats. Stony Hill feels like the next modern step in a continuously growing genre that refuses to lose its heart along the way.\nIn true reggae style, Marley’s lyrics do not shy away from telling honest and human stories. From wondering what the future will bring on one track, while impeccable backup vocals chime “believe in your dreams” on another, the album explores the depth of human character.\nThis 18-track album also features the song “Medication” featuring Marley’s brother and guest artist, Stephen Marley. The song is an ode to Marley’s love of “Mary Jane” and the medicinal power of cannabis. You’ll be singing along to the lyrics, “And I say to myself, what a wonderful herb.”\n\nSevana EP by Sevana\n\nStrain Pairing Recommendation: Purple Bud\nHailing from Kingston, Jamaica, Sevana burst onto the scene last year with her first EP album, where she delivers stunning, expert vocals and impactful reggae beats. The album begins with the softer ballad “Carry You” before launching into the groovy “Bit Too Shy,” which sets the tone for the rest of the collection.\nThe EP’s music will get you moving to the rhythm, while Sevana’s energetic and heartfelt vocals delight across the soundscape with perfect control and beautiful clarity. Sevana captures the heart of reggae in her music, vocals, and lyrics for a complete immersion in classic reggae via a modern recording artist. Sevana’s debut album proves she’s an artist to watch and gives us high hopes of more great albums to come.\nEqual Rights by Peter Tosh\n\nStrain Pairing Recommendation: Jah Kush\nAlong with Bob Marley and Bunny Wailer, Peter Tosh got his start as part of The Wailers. Afterwards, he went on to become his own successful solo artist and produced many iconic albums, including Equal Rights in 1977.\nEqual Rights opens with the familiar song, “Get Up, Stand Up,” performed with Tosh’s unique style and sound. The album contains classics such as “Downpressor Man” and “Stepping Razor,” and features Tosh’s punctuated and mellow vocals accompanied by melodies that are rich, vibrant, and smooth.\nAs a whole, Equal Rights is an iconic reggae album that encapsulates the heart and soul of reggae as it was at the time of its initial emergence onto the popular scene. For this reason, it will always reign as a powerful memento of reggae’s roots.\n\nAfrican Holocaust by Steel Pulse\n\nStrain Pairing Recommendation: Malawi\nReleased in 2004, African Holocaust is the latest in a long line of albums produced by Steel Pulse. Though over a decade old, it remains relevant today both musically as well as lyrically, touching on topics such as global warming, corruption in government and religion, and the ramifications of slavery.\nFormed in 1975 in Birmingham, England, Steel Pulse has had a somewhat rotating cast of players over the years, but always with lead singer David Hinds at the forefront holding down vocals and rhythm guitar.\nAfrican Holocaust is no exception, with Hinds’s fierce voice leading the upbeat reggae melodies that encourage dance and reflection all at once. It is this combination of poignant lyrics and stunningly composed music full of drums and horns that makes African Holocaust such a noteworthy album.\nRebirth by Jimmy Cliff\n\nStrain Pairing Recommendation: Lamb’s Bread\nRebirth was released in 2012 as part of what Jimmy Cliff said was “a rebirth of my career at this time.” It was the first album Cliff had released in eight years, and went on to win a Grammy for Best Reggae Album. Cliff has been producing reggae music since the 1960s and is one of the few original artists who still produces new music today while touring or appearing at festivals (such as Lockn’ in 2015).\nRebirth manages to encapsulate Cliff’s classic reggae feel while shining anew with crisp, fresh, updated sounds. The 13-track album features new, original music as well as some covers—all of it exceedingly lively, joyful, and brimming with energy.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/25110707/best-reggae-albums-header.jpg","urlslug":"/news/lifestyle/reggae-albums-listen-high"},{"id":"contentitems-3349","title":"New Strains Alert: Moondance, Venus OG, The Doctor, Shangri-La, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1456522800000)\/","text":"These strains were just added to the Leafly database and they\u0027re in some need of some user love. Have you chanced upon any of these varieties in your strain quests? Let us know by leaving a review. We\u0027ve also included links to help you find out whether or not that strain is being offered at a location near you, so get shopping!\n \n   1. Venus OG\n\nAnother member of the “planetary series,” Venus OG is a hybrid strain bearing OG Kush heritage, although its specific parent strains are disputed. Each glistening trichome carries a resemblance to the bright planet this strain is named after, coating its conic buds in a galactic blanket of white crystals. A fresh pine aroma mixed with sour notes of lemon draws you in, and next comes the heavy euphoria to take away your sense of gravity and lift you to a happy, relaxed place.\n\nClick here for a full list of locations currently carrying Venus OG\n \n   2. Moondance\n\nMoondance is a sativa-dominant strain that offers a CBD content as high as 11%. With an average THC level of just 4%, consumers will notice only minimal cerebral, euphoric sensations. Candied grape aromas turn to spicy pepper, fresh mint, and sharp pine flavors on the exhale. Stress, body aches, and painful inflammation wither away while the mind is left agile and clear, making this strain an excellent daytime choice for patients and those needing to stay active. Inheriting genetics from Super Silver Haze, Neville’s Haze, and an unknown CBD-rich parent, Moondance is a variation of the better-known MediHaze sativa.\n\nClick here for a full list of locations currently carrying Moondance\n \n   3. Purple Bud\n\nFrom Sensi Seeds comes the purple-blossomed indica Purple Bud, appropriately named for its bright hues of lavender. A descendant of Afghani indicas, this colorful plant offers large harvests of sparkling buds that carry the sweet and piney aroma of sandalwood. A distant sativa relative from Jamaica gives this strain a little added height and cerebral invigoration, but Purple Bud’s effects generally fall heavy on both mind and body. After crossing the Afghani indicas with a Jamaican sativa, Sensi Seeds added genetics from a Dutch Hindu Kush and a California Purple Kush.\n\n \n   4. Shangri-La\n\nTaking its name from the mythical valley utopia, the Shangri-La hybrid is sure to bring you to your own internal paradise. This 60/40 sativa-dominant strain takes you to a peaceful mindset where happiness and relaxation are no strangers. Patients might also choose this strain as an uplifting escape from nausea, stress, and pain. Skunky and sweet in flavor, Shangri-La boasts a garden of different aromas from ripe grape and berry to tropical mango and citrus. Bred by JinxProof Genetics and propagated by TGA Genetics, Shangri-La crosses parent strains Fudo Myo-o and 9 Pound Hammer.\n\nClick here for a full list of locations currently carrying Shangri-La\n \n   5. Sweet Jane\n\nSweet Jane is a sweet-flavored sativa strain that provides an uplifting burst of cerebral energy ideal for daytime use. A selected cut of the famous Island Sweet Skunk, Sweet Jane carries an intense fruity aroma with notes of grapefruit, lemon, and mangos. Colorful calyxes spiral from the buds, woven in fiery hairs and powdered in a sugary coat of crystal resin. With an average THC content of 20% and a subtle CBD profile, Sweet Jane delivers nuanced effects perfect for both relaxing and getting things done.\n\nClick here for a full list of locations currently carrying Sweet Jane\n \n   6. The Doctor\n\nBred by Green House Seeds, The Doctor is an indica-dominant strain designed to treat a myriad of unpleasant symptoms such as pain, nausea, appetite loss, and insomnia. Its name also comes in tribute to the motorcycle racer Valentino Rossi, also called “The Doctor.” Heavy sedating effects act fast, leaving you feeling pacified and calm. Earthy flavors soured by skunky, fruity notes arrive on the inhale, making their exit with the taste of hashy spice. Great White Shark, Super Skunk, and an unnamed South Indian parent lend The Doctor its genetic blueprint.\n\n \n   7. Purple Goat\n\nPurple Goat is a hybrid cross between Trainwreck and Blueberry Skunk, created by Oregon OMMP growers in the early 2010s. With a mostly sativa growth pattern, Purple Goat produces dense indica buds of a dark purple hue with a rich palate of sweet grass and spicy herbs. An early flowerer, Purple Goat will finish its maturation cycle by the end of September outdoors. When consumed, Purple Goat has an earthy taste with blueberry overtones and provides a feeling of deep relaxation.\n\nClick here for a full list of locations currently carrying Purple Goat\n \nBrowse through other new strains that were added recently to the Leafly Explorer or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/12002247/new-strains-alert-moondance-venus-og-the-doctor-shangri-la-and-mo.png","urlslug":"/news/strains-products/new-strains-alert-moondance-venus-og-the-doctor-shangri-la-and-mo"}],"reviewCount":18,"flavors":[{"name":"Earthy","score":55.735930735930737},{"name":"Lavender","score":19.588744588744586},{"name":"Sweet","score":16.017316017316016},{"name":"Pine","score":12.878787878787879},{"name":"Pepper","score":10.497835497835498}],"effects":[{"name":"Relaxed","score":90.367965367965368},{"name":"Sleepy","score":68.614718614718612},{"name":"Happy","score":19.805194805194805},{"name":"Euphoric","score":17.424242424242422},{"name":"Focused","score":12.662337662337663}],"symptoms":[{"name":"Insomnia","score":51.19047619047619},{"name":"Stress","score":19.372294372294373},{"name":"Pain","score":14.826839826839825},{"name":"Depression","score":10.281385281385282},{"name":"Lack of Appetite","score":10.281385281385282}],"conditions":[{"name":"Anxiety","score":14.826839826839825},{"name":"PTSD","score":4.5454545454545459},{"name":"Arthritis","score":1.1904761904761905},{"name":"Migraines","score":1.1904761904761905},{"name":"Spinal Cord Injury","score":1.1904761904761905}],"negatives":[{"name":"Dry Mouth","score":67.20779220779221},{"name":"Dry Eyes","score":18.398268398268396},{"name":"Dizzy","score":6.9264069264069263}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_4c62.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/640980/b/purple-bud__primary_c279.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_8554.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/624434/b/purple-bud__primary_f9d2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_60a6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/611728/b/purple-bud__primary_76f9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_d413.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/523355/b/purple-bud__primary_e887.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_3837.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/523403/b/purple-bud__primary_7747.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_8879.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503571/b/purple-bud__primary_90e1.jpg"}],"photoTotalCount":14,"popularCities":["Fort Collins, CO","King City, OR"],"permalink":"https://mobileapi.leafly.com/indica/purple-bud","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.22222222222222/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Jamaican","subtitle":null,"slug":"jamaican","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jamaican","symbol":"Jam","applink":"leafly://strain/jamaican"},{"name":"Hindu Skunk","subtitle":null,"slug":"hindu-skunk","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/hindu-skunk","symbol":"Hsk","applink":"leafly://strain/hindu-skunk"},{"name":"Purple Kush","subtitle":null,"slug":"purple-kush","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/purple-kush","symbol":"Pk","applink":"leafly://strain/purple-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":58,"outdoorFinish":null,"height":"Short","averageYield":"High","environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":212720,"slug":"purple-bud","name":"Purple Bud","subtitle":null,"symbol":"Pub","category":"Indica","description":"\u003cp\u003eFrom Sensi Seeds comes the purple-blossomed indica Purple Bud, appropriately named for its bright hues of lavender. A descendant of \u003ca href=\"http://leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e indicas, this colorful plant offers large harvests of sparkling buds that carry the sweet and piney aroma of sandalwood. A distant sativa relative from \u003ca href=\"https://www.leafly.com/sativa/jamaican\"\u003eJamaica\u003c/a\u003e gives this strain a little added height and cerebral invigoration, but Purple Bud\u0026rsquo;s effects generally fall heavy on both mind and body. After crossing the Afghani indicas with a Jamaican sativa, Sensi Seeds added genetics from a Dutch \u003ca href=\"https://www.leafly.com/indica/hindu-kush\"\u003eHindu Kush\u003c/a\u003e and a California \u003ca href=\"https://www.leafly.com/indica/purple-kush\"\u003ePurple Kush\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"From Sensi Seeds comes the purple-blossomed indica Purple Bud, appropriately named for its bright hues of lavender. A descendant of Afghani indicas, this colorful plant offers large harvests of sparkling buds that carry the sweet and piney aroma of sandalwood. A distant sativa relative from Jamaica gives this strain a little added height and cerebral invigoration, but Purple Bud\u0026rsquo;s effects generally fall heavy on both mind and body. After crossing the Afghani indicas with a Jamaican sativa, Sensi Seeds added genetics from a Dutch Hindu Kush and a California Purple Kush.\n","aka":"PurpleBud","rating":4.22,"highlightedReviews":[{"id":1334588,"username":"feustelme","text":"Good smoking experience, the effect is very uplifting and euphoric then turns to a more body stone effect. This strain is very productive as well and easy to grow. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1608961,"username":"levi6577","text":"Originally picked this up to deal with my daily headaches, and while it did not help me in that area, it did take my mind off of it enough to help me sleep. A little of this and I got drowsy and wanted my bed, but a little more and I started thinking deeply about human consciousness. Pretty good bud nonetheless","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-39132","title":"5 Reggae Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1503703122000)\/","text":"Born in 1960s Jamaica, reggae was an evolution of its predecessors: ska and rocksteady. The genre quickly took on a life of its own and eventually made its way to the United States, where it became a staple of 1960s culture. It also carved a special niche in the cannabis world, since reggae’s penchant for political lyrics did not shy away from the topic of legalization.\n\nIt’s a genre that is powerful in both its unique sound and inherently political roots. It is music that uplifts the spirit and rallies the heart. The era of reggae produced a plethora of iconic artists such as Bob Marley, Bunny Wailer, Peter Tosh, The Abyssinians, and Toots \u0026 The Maytals—the latter of whom actually coined the term ‘reggae’ with the 1968 single, “Do The Reggay.”\nTo better understand and appreciate the genre, pack a pipe, grab your friends, and explore the soulful reggae music below—each album we suggest is an ideal match for the right cannabis strain.\nStony Hill by Damian Marley\n\nStrain Pairing Recommendation: King’s Bread\nYoungest son of the legendary Bob Marley, Damian Marley continues his father’s legacy in reggae with his own fresh sound. Stony Hill is Marley’s newest album—released in July of this year, it combines modern electronic elements with classic reggae beats. Stony Hill feels like the next modern step in a continuously growing genre that refuses to lose its heart along the way.\nIn true reggae style, Marley’s lyrics do not shy away from telling honest and human stories. From wondering what the future will bring on one track, while impeccable backup vocals chime “believe in your dreams” on another, the album explores the depth of human character.\nThis 18-track album also features the song “Medication” featuring Marley’s brother and guest artist, Stephen Marley. The song is an ode to Marley’s love of “Mary Jane” and the medicinal power of cannabis. You’ll be singing along to the lyrics, “And I say to myself, what a wonderful herb.”\n\nSevana EP by Sevana\n\nStrain Pairing Recommendation: Purple Bud\nHailing from Kingston, Jamaica, Sevana burst onto the scene last year with her first EP album, where she delivers stunning, expert vocals and impactful reggae beats. The album begins with the softer ballad “Carry You” before launching into the groovy “Bit Too Shy,” which sets the tone for the rest of the collection.\nThe EP’s music will get you moving to the rhythm, while Sevana’s energetic and heartfelt vocals delight across the soundscape with perfect control and beautiful clarity. Sevana captures the heart of reggae in her music, vocals, and lyrics for a complete immersion in classic reggae via a modern recording artist. Sevana’s debut album proves she’s an artist to watch and gives us high hopes of more great albums to come.\nEqual Rights by Peter Tosh\n\nStrain Pairing Recommendation: Jah Kush\nAlong with Bob Marley and Bunny Wailer, Peter Tosh got his start as part of The Wailers. Afterwards, he went on to become his own successful solo artist and produced many iconic albums, including Equal Rights in 1977.\nEqual Rights opens with the familiar song, “Get Up, Stand Up,” performed with Tosh’s unique style and sound. The album contains classics such as “Downpressor Man” and “Stepping Razor,” and features Tosh’s punctuated and mellow vocals accompanied by melodies that are rich, vibrant, and smooth.\nAs a whole, Equal Rights is an iconic reggae album that encapsulates the heart and soul of reggae as it was at the time of its initial emergence onto the popular scene. For this reason, it will always reign as a powerful memento of reggae’s roots.\n\nAfrican Holocaust by Steel Pulse\n\nStrain Pairing Recommendation: Malawi\nReleased in 2004, African Holocaust is the latest in a long line of albums produced by Steel Pulse. Though over a decade old, it remains relevant today both musically as well as lyrically, touching on topics such as global warming, corruption in government and religion, and the ramifications of slavery.\nFormed in 1975 in Birmingham, England, Steel Pulse has had a somewhat rotating cast of players over the years, but always with lead singer David Hinds at the forefront holding down vocals and rhythm guitar.\nAfrican Holocaust is no exception, with Hinds’s fierce voice leading the upbeat reggae melodies that encourage dance and reflection all at once. It is this combination of poignant lyrics and stunningly composed music full of drums and horns that makes African Holocaust such a noteworthy album.\nRebirth by Jimmy Cliff\n\nStrain Pairing Recommendation: Lamb’s Bread\nRebirth was released in 2012 as part of what Jimmy Cliff said was “a rebirth of my career at this time.” It was the first album Cliff had released in eight years, and went on to win a Grammy for Best Reggae Album. Cliff has been producing reggae music since the 1960s and is one of the few original artists who still produces new music today while touring or appearing at festivals (such as Lockn’ in 2015).\nRebirth manages to encapsulate Cliff’s classic reggae feel while shining anew with crisp, fresh, updated sounds. The 13-track album features new, original music as well as some covers—all of it exceedingly lively, joyful, and brimming with energy.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/25110707/best-reggae-albums-header.jpg","urlslug":"/news/lifestyle/reggae-albums-listen-high"},{"id":"contentitems-3349","title":"New Strains Alert: Moondance, Venus OG, The Doctor, Shangri-La, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1456522800000)\/","text":"These strains were just added to the Leafly database and they\u0027re in some need of some user love. Have you chanced upon any of these varieties in your strain quests? Let us know by leaving a review. We\u0027ve also included links to help you find out whether or not that strain is being offered at a location near you, so get shopping!\n \n   1. Venus OG\n\nAnother member of the “planetary series,” Venus OG is a hybrid strain bearing OG Kush heritage, although its specific parent strains are disputed. Each glistening trichome carries a resemblance to the bright planet this strain is named after, coating its conic buds in a galactic blanket of white crystals. A fresh pine aroma mixed with sour notes of lemon draws you in, and next comes the heavy euphoria to take away your sense of gravity and lift you to a happy, relaxed place.\n\nClick here for a full list of locations currently carrying Venus OG\n \n   2. Moondance\n\nMoondance is a sativa-dominant strain that offers a CBD content as high as 11%. With an average THC level of just 4%, consumers will notice only minimal cerebral, euphoric sensations. Candied grape aromas turn to spicy pepper, fresh mint, and sharp pine flavors on the exhale. Stress, body aches, and painful inflammation wither away while the mind is left agile and clear, making this strain an excellent daytime choice for patients and those needing to stay active. Inheriting genetics from Super Silver Haze, Neville’s Haze, and an unknown CBD-rich parent, Moondance is a variation of the better-known MediHaze sativa.\n\nClick here for a full list of locations currently carrying Moondance\n \n   3. Purple Bud\n\nFrom Sensi Seeds comes the purple-blossomed indica Purple Bud, appropriately named for its bright hues of lavender. A descendant of Afghani indicas, this colorful plant offers large harvests of sparkling buds that carry the sweet and piney aroma of sandalwood. A distant sativa relative from Jamaica gives this strain a little added height and cerebral invigoration, but Purple Bud’s effects generally fall heavy on both mind and body. After crossing the Afghani indicas with a Jamaican sativa, Sensi Seeds added genetics from a Dutch Hindu Kush and a California Purple Kush.\n\n \n   4. Shangri-La\n\nTaking its name from the mythical valley utopia, the Shangri-La hybrid is sure to bring you to your own internal paradise. This 60/40 sativa-dominant strain takes you to a peaceful mindset where happiness and relaxation are no strangers. Patients might also choose this strain as an uplifting escape from nausea, stress, and pain. Skunky and sweet in flavor, Shangri-La boasts a garden of different aromas from ripe grape and berry to tropical mango and citrus. Bred by JinxProof Genetics and propagated by TGA Genetics, Shangri-La crosses parent strains Fudo Myo-o and 9 Pound Hammer.\n\nClick here for a full list of locations currently carrying Shangri-La\n \n   5. Sweet Jane\n\nSweet Jane is a sweet-flavored sativa strain that provides an uplifting burst of cerebral energy ideal for daytime use. A selected cut of the famous Island Sweet Skunk, Sweet Jane carries an intense fruity aroma with notes of grapefruit, lemon, and mangos. Colorful calyxes spiral from the buds, woven in fiery hairs and powdered in a sugary coat of crystal resin. With an average THC content of 20% and a subtle CBD profile, Sweet Jane delivers nuanced effects perfect for both relaxing and getting things done.\n\nClick here for a full list of locations currently carrying Sweet Jane\n \n   6. The Doctor\n\nBred by Green House Seeds, The Doctor is an indica-dominant strain designed to treat a myriad of unpleasant symptoms such as pain, nausea, appetite loss, and insomnia. Its name also comes in tribute to the motorcycle racer Valentino Rossi, also called “The Doctor.” Heavy sedating effects act fast, leaving you feeling pacified and calm. Earthy flavors soured by skunky, fruity notes arrive on the inhale, making their exit with the taste of hashy spice. Great White Shark, Super Skunk, and an unnamed South Indian parent lend The Doctor its genetic blueprint.\n\n \n   7. Purple Goat\n\nPurple Goat is a hybrid cross between Trainwreck and Blueberry Skunk, created by Oregon OMMP growers in the early 2010s. With a mostly sativa growth pattern, Purple Goat produces dense indica buds of a dark purple hue with a rich palate of sweet grass and spicy herbs. An early flowerer, Purple Goat will finish its maturation cycle by the end of September outdoors. When consumed, Purple Goat has an earthy taste with blueberry overtones and provides a feeling of deep relaxation.\n\nClick here for a full list of locations currently carrying Purple Goat\n \nBrowse through other new strains that were added recently to the Leafly Explorer or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/12002247/new-strains-alert-moondance-venus-og-the-doctor-shangri-la-and-mo.png","urlslug":"/news/strains-products/new-strains-alert-moondance-venus-og-the-doctor-shangri-la-and-mo"}],"reviewCount":18,"flavors":[{"name":"Earthy","score":55.735930735930737},{"name":"Lavender","score":19.588744588744586},{"name":"Sweet","score":16.017316017316016},{"name":"Pine","score":12.878787878787879},{"name":"Pepper","score":10.497835497835498}],"effects":[{"name":"Relaxed","score":90.367965367965368},{"name":"Sleepy","score":68.614718614718612},{"name":"Happy","score":19.805194805194805},{"name":"Euphoric","score":17.424242424242422},{"name":"Focused","score":12.662337662337663}],"symptoms":[{"name":"Insomnia","score":51.19047619047619},{"name":"Stress","score":19.372294372294373},{"name":"Pain","score":14.826839826839825},{"name":"Depression","score":10.281385281385282},{"name":"Lack of Appetite","score":10.281385281385282}],"conditions":[{"name":"Anxiety","score":14.826839826839825},{"name":"PTSD","score":4.5454545454545459},{"name":"Arthritis","score":1.1904761904761905},{"name":"Migraines","score":1.1904761904761905},{"name":"Spinal Cord Injury","score":1.1904761904761905}],"negatives":[{"name":"Dry Mouth","score":67.20779220779221},{"name":"Dry Eyes","score":18.398268398268396},{"name":"Dizzy","score":6.9264069264069263}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_4c62.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/640980/b/purple-bud__primary_c279.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_8554.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/624434/b/purple-bud__primary_f9d2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_60a6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/611728/b/purple-bud__primary_76f9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_d413.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/523355/b/purple-bud__primary_e887.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_3837.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/523403/b/purple-bud__primary_7747.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-bud_100x100_8879.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503571/b/purple-bud__primary_90e1.jpg"}],"photoTotalCount":14,"popularCities":["Fort Collins, CO","King City, OR"],"permalink":"https://mobileapi.leafly.com/indica/purple-bud","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.22222222222222/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Jamaican","subtitle":null,"slug":"jamaican","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jamaican","symbol":"Jam","applink":"leafly://strain/jamaican"},{"name":"Hindu Skunk","subtitle":null,"slug":"hindu-skunk","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/hindu-skunk","symbol":"Hsk","applink":"leafly://strain/hindu-skunk"},{"name":"Purple Kush","subtitle":null,"slug":"purple-kush","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/purple-kush","symbol":"Pk","applink":"leafly://strain/purple-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":58,"outdoorFinish":null,"height":"Short","averageYield":"High","environment":null,"growNotes":""}}
