{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1515718797000)/",
            "id": "contentitems-54561",
            "text": "I’m not clairvoyant and I don’t have a crystal ball, so ultimately I can’t predict which strains growers will decide to grow in 2018. But recently I’ve come across some amazing genetics that I’m pretty excited about. These are the five strains I’ll be on the hunt for in 2018. Keep an eye out for these up-and-coming genetics, as some might make an appearance on your local dispensary menu. Others, however, may never make it beyond their exclusive Cannabis Cup showing, perhaps too good to share.\n1. White Tahoe Cookies\nWhite Tahoe Cookies bred by Kush4Breakfast and grown by Royal Tree Gardens. (Julia Sumpter/Leafly)\nAlready available up and down the West Coast and beyond thanks to some of the most respected farms, White Tahoe Cookies–bred by Kush4Breakfast– is a complex hybrid that combines genetics from The White, Tahoe OG, and GSC. I appreciate all three of these strains individually, and the combination makes for an intriguing trifecta of citrus, skunk, and musky pine aromas. The flowers express a thick frosting of trichomes thanks to The White’s genetic influence. Its soaring euphoria and deep relaxation can be attributed to its Tahoe OG lineage, while the Cookies component adds a unique doughiness to the sweet, earthy terpene profile.\n2. Mimosa\n\n\n\n\n\n Some more 🔥🔥🔥 #Mimosa grown and pheno hunted by @partytimegenetics #Clementine x #PurplePunchF2 #SymbioticGenetics #Budologist420 x #_TheVillage\nA post shared by @ symbioticgenetics on Dec 30, 2017 at 9:05pm PST\n\n\n\nMimosa might be the best new strain I’ve come across recently. Bred by Symbiotic Genetics, Mimosa is a hybrid of Clementine  and Purple Punch. This strain presents itself with several exotic and fruity phenotypes. The Clementine influence brings a heavy orange citrus note that is true to its Tangie lineage, and the Purple Punch lends some sweet berry flavoring and, in some cases, a hint of color to Mimosa’s buds. A beautiful bud with shimmering trichomes that sparkle in the sunlight, Mimosa looks as good as she smells. A great strain for hash makers, I’d be hard pressed to pass up any solventless hash that features Mimosa’s terpene profile.\n\n3. The Vision\nArchive dropped their New Dosidos Line of genetics at The Emerald Cup this year. This series of genetics was bred from their renowned strain, Dosidos (also spelled “Dos-Si-Dos”) and crossed with an amazing selection of different genetics from their stable. There were a few hybrids that really stood out to me: their Valley Vixen (SFV OG x Dosidos), their High Five (Tahoe OG x Dosidos), and The Vision (Lemon G x Dosidos). By the time I made it to their booth on day one of the cup, they had already sold out of The Vision which tells me a lot of other growers shared my excitement at the potential of these genetics.\nThe Vision specifically caught my attention because of its parent strain Lemon G, a hard-to-find strain native to Ohio. Lemon G has a strong lemony, sour terpene profile. It’s prized for its uplifting effects that are known to bring on fits of uncontrollable laughter and good times. Add in the deeply relaxing effects and pungent, spiced flavors of Dosidos and you can start to see The Vision. I haven’t had a chance to taste any of the New Dosidos Line, but knowing the quality, potency, and complexity of Archive breeding projects, I’m sure we’ll see these genetics bubble up on more dispensary menus soon.\n4. Tina\nTina bred by Exotic Genetix. (Trevor Hennings/Leafly)\nExotic Genetix is one of my favorite breeders, and Tina is one of their newest creations. Tina is a heavy-hitting, award-winning indica with an exceptionally frosty appearance. I’m excited to taste this strain because I know the Exotic team always puts a lot of passion behind their breeding projects and their internal quality standards to make sure that they are only releasing the best genetics. According to Mike of Exotic Genetix:\n\n“She’s colorful, potent, high in THC, and smells like jet fuel. If you’re going for a Kush, this is the mother of all Kushes. All the hard work paid off because we won Best Indica with Tina at the 2017 High Times SoCal Harvest Cup.”\n\n\n5. 999\n\n\n\n\n\n 2017 December .. Emerald Cup is here! Come find me or hit me up for this limited release from Karma Genetics 🌟  #Karmagenetics #Karmasquad #999 #JoshD #OGKushStory @karmagenetics @thekarmasquad @nwblacklab @prodigy_og_ @trichome_he8d @thekushcritic @420kushkush @kushfamilygenetix @theebubbakush @killdrama @breal @joel_og_glass @terraformgenetics @calikushfarms\nA post shared by  JoshD. (@therealogkushstory) on Dec 9, 2017 at 10:41am PST\n\n\n\nThe man behind “The Real OG Kush Story,” JoshD, teamed up with Karma Genetics for a limited release of this new strain, called 999. It’s the compelling blend of genetics that attracted me to this hybrid. Labeled as a Tahoe x TK x Biker cross, I assume this is a kushy cross of Tahoe OG, Triangle Kush, and Karma’s Biker Kush, but I wasn’t able to confirm the specifics with JoshD. All three of these kushes hold pungent, sharp pine flavors with other dank, earthy notes. If the 999 meets JoshD’s standards, then I’m excited. His genetics have never steered me wrong in the past, and I’m looking forward to tracking this strain down.\nThese are just a few of the latest and greatest genetics that have piqued my interest lately, but there are plenty more on the horizon. Breeders are continuously hard at work, pushing boundaries, and innovating cannabis further in 2018. What strains are you most excited for? Are they listed and easy to find on Leafly yet? If not, share your enthusiasm and email our Strain Research department: strains-(at)-leafly.com",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/11151319/up-and-coming-cannabis-strains-tina2.jpg",
            "title": "5 Cannabis Strains You Should Be Excited About in 2018",
            "urlslug": "/news/strains-products/cannabis-strains-to-try-in-2018"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "ADD/ADHD",
            "score": 40
        },
        {
            "name": "Anxiety",
            "score": 40
        },
        {
            "name": "PMS",
            "score": 40
        },
        {
            "name": "Bipolar Disorder",
            "score": 40
        }
    ],
    "description": "<p>999 is a strain collaboration between Josh D (breeder of <a href=\"https://www.leafly.com/hybrid/og-kush\">OG Kush</a>) and the illustrious Karma Genetics. This potent mashup of <a href=\"https://www.leafly.com/hybrid/tahoe-og\">Tahoe OG Kush</a>, <a href=\"https://www.leafly.com/indica/triangle-kush\">Triangle Kush</a>, and <a href=\"https://www.leafly.com/indica/biker-kush\">Biker Kush</a> hones in on the best attributes of Kush genetics while enhancing the overall complexity of flavor. 999 has a chunky OG structure and hits like a champ. When it comes to aroma, 999 blasts traditional, yet amplified, notes of pine, citrus, funky earth, and gas.&nbsp;&nbsp;</p>\n",
    "descriptionPlain": "999 is a strain collaboration between Josh D (breeder of OG Kush) and the illustrious Karma Genetics. This potent mashup of Tahoe OG Kush, Triangle Kush, and Biker Kush hones in on the best attributes of Kush genetics while enhancing the overall complexity of flavor. 999 has a chunky OG structure and hits like a champ. When it comes to aroma, 999 blasts traditional, yet amplified, notes of pine, citrus, funky earth, and gas.&nbsp;&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 60
        },
        {
            "name": "Uplifted",
            "score": 40
        },
        {
            "name": "Creative",
            "score": 40
        },
        {
            "name": "Euphoric",
            "score": 40
        },
        {
            "name": "Focused",
            "score": 40
        }
    ],
    "flavors": [
        {
            "name": "Diesel",
            "score": 40
        },
        {
            "name": "Sweet",
            "score": 40
        },
        {
            "name": "Pungent",
            "score": 40
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1629452,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Great taste immediately on inhale...smells and burns like a typical kush strain when you break some of it up and roll a J... not the best kush strain out there but has a garden variety high that will keep you happy and relaxed for hours..  def a night time at the right time strain",
            "username": "shumz420"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png",
            "id": 1634673,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "ADD/ADHD person's best friend",
            "username": "runtorock34"
        }
    ],
    "id": 501052,
    "name": "999",
    "negatives": [],
    "parents": [
        {
            "applink": "leafly://strain/tahoe-og",
            "category": "Hybrid",
            "name": "Tahoe OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/tahoe-og",
            "slug": "tahoe-og",
            "subtitle": null,
            "symbol": "Tok"
        },
        {
            "applink": "leafly://strain/triangle-kush",
            "category": "Indica",
            "name": "Triangle Kush",
            "permalink": "https://mobileapi.leafly.com/indica/triangle-kush",
            "slug": "triangle-kush",
            "subtitle": null,
            "symbol": "Trk"
        },
        {
            "applink": "leafly://strain/biker-kush",
            "category": "Indica",
            "name": "Biker Kush",
            "permalink": "https://mobileapi.leafly.com/indica/biker-kush",
            "slug": "biker-kush",
            "subtitle": null,
            "symbol": "Bkk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/999",
    "photoTotalCount": 0,
    "photos": [],
    "popularCities": [
        "Vancouver, BC",
        "Brampton, ON",
        "Calgary, AB",
        "Edmonton, AB",
        "Mississauga, ON",
        "Montréal, QC",
        "Ottawa, ON",
        "Surrey, BC",
        "Toronto, ON",
        "Winnipeg, MB"
    ],
    "rating": 4.5,
    "relatedStrains": [],
    "reviewCount": 2,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "999",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.5/240",
    "subtitle": null,
    "symbol": "999",
    "symptoms": [
        {
            "name": "Depression",
            "score": 40
        },
        {
            "name": "Stress",
            "score": 40
        },
        {
            "name": "Spasticity",
            "score": 40
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
