{
    "aka": "Primus OG",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1448038800000)/",
            "id": "contentitems-3371",
            "text": "New strains have just been added to Leafly's strain database and they need your reviews! As things cool down outside, snuggle up with Bubba's Gift or Cherry Grapefruit to get your full-body relaxation on. Motivate yourself to think creatively with Cambodian Haze, Strawberry Amnesia, or Sour LSD. And, of course, celebrate the announcement of Primus' winter tour with none other than the Primus indica. These strains are just what you'll need to get through the holidays, so figure out which ones are available near you by checking out the links below!\n \n   1. Primus\n\nPrimus, also called Primus OG, is a complex indica strain that combines Arcata, Trainwreck, and 303 OG. Each parent strain passes on something special to Primus: Arcata with its creative activation, Trainwreck with its long-lasting euphoria, and 303 OG with its sour fruit flavors. This trifecta of duration, fragrance, and quality of high makes for a potent hybrid cherished by patients and recreational consumers alike. For those using cannabis medicinally, consider choosing Primus for evening management of depression, anxiety, appetite loss, or pain relief.\n\nFind out which locations are currently carrying Primus\n \n   2. Sour LSD\n\nSour LSD is a balanced hybrid strain that brings the best of its parent strains: the sour, funky aroma of Sour Bubble and the trippy head space provided by the hybrid LSD. Elevating the senses to new heights, Sour LSD is a great companion strain for enjoying the outdoors or creative activities. This BOG Seeds creation is a nostalgic throwback for all fans of Barney's Farm's original LSD, as it carries similar active sativa-like traits only with a little more body relaxation.\n\nFind out which locations are currently carrying Sour LSD\n \n   3. Strawberry Amnesia\n\nA powerful and uplifting flower from Dinafem Seeds, Strawberry Amnesia is a strain made in sativa heaven. Bred from Strawberry Cough and Amnesia, this strain delivers the familiar sweet strawberry and earthy flavors of its parents. Having the typical energizing and euphoric effects of a sativa, Strawberry Amnesia also induces the calming body high from its distant indica relatives. The dark green buds of Strawberry Amnesia are very dense and heavily coated in resin, so this potent sativa should be handled with caution.\n\n \n   4. Bubba's Gift\n\nDeveloped by Humboldt Seed Organization, Bubba’s Gift is a strain unlike any other. Despite being almost purely indica, this cross between Bubba Kush and God’s Gift produces functional and uplifting effects with a mild body high. Given its strong indica genetics, this sweet, fruity strain is surprisingly well-suited for daytime creative activities. Bubba’s Gift will flower in 6 weeks and can be grown indoors and outdoors.\n\nFind out which locations are currently carrying Bubba's Gift\n \n   5. Cherry Grapefruit\n\nCherry Grapefruit by Kera Seeds is a super fruity sativa-dominant hybrid that brings out the best qualities of parent strains Cherry and Grapefruit. The effects position themselves with gentle full-body relaxation and a nice head-buzz that would be best for anyone needing muscle relief and mood elevation. This easy-to-grow strain will flower in 9 weeks and is suitable for growing both indoors or outdoors.\n\n \n   6. Cambodian Haze\n\nReeferman Seeds created the vibrant Cambodian Haze sativa by crossing a Cambodian landrace strain with Purple Haze. This South East Asian spin on the classic Purple Haze will deliver a strong euphoric experience without exacerbating paranoia. Known to be extremely sticky in texture and sweet in flavor, Cambodian Haze is the perfect sativa for staying productive without being up all night. Flowering in 11 to 12 weeks, this strain is best suited for indoor and greenhouse grows for an experienced grower.\n\n \n   7. Grandpa Larry OG\n\nAn instant classic from top tier genetics, Grandpa Larry OG is the next elite OG strain. Granddaddy Purple and Larry OG were crossed to create this indica that behaves more like a hybrid. With clear, creative thoughts paired with a subtle relaxing effect, this strain can relieve pain without locking you to the couch. Taking after Granddaddy Purple in growth, these dense dark green and purple buds are covered in trichomes and orange hairs.\n\nFind out which locations are currently carrying Grandpa Larry OG\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12002318/new-strains-alert-primus-sour-lsd-strawberry-amnesia-bubbas-gift.png",
            "title": "New Strains Alert: Primus, Sour LSD, Strawberry Amnesia, Bubba's Gift, and More",
            "urlslug": "/news/strains-products/new-strains-alert-primus-sour-lsd-strawberry-amnesia-bubbas-gift"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 15.1201084850833
        },
        {
            "name": "ADD/ADHD",
            "score": 8.824099186361876
        },
        {
            "name": "Arthritis",
            "score": 6.57690817512592
        },
        {
            "name": "Bipolar Disorder",
            "score": 6.57690817512592
        },
        {
            "name": "PTSD",
            "score": 6.538163502518403
        }
    ],
    "description": "<p>Primus, also called Primus OG, is a complex indica strain that combines Arcata, <a href=\"https://www.leafly.com/hybrid/trainwreck\">Trainwreck</a>, and <a href=\"https://www.leafly.com/hybrid/303-og\">303 OG</a>. Each parent strain passes on something special to Primus: Arcata with its creative activation, Trainwreck with its long-lasting euphoria, and 303 OG with its sour fruit flavors. This trifecta of duration, fragrance, and quality of high makes for a potent hybrid cherished by patients and recreational consumers alike.</p>\n",
    "descriptionPlain": "Primus, also called Primus OG, is a complex indica strain that combines Arcata, Trainwreck, and 303 OG. Each parent strain passes on something special to Primus: Arcata with its creative activation, Trainwreck with its long-lasting euphoria, and 303 OG with its sour fruit flavors. This trifecta of duration, fragrance, and quality of high makes for a potent hybrid cherished by patients and recreational consumers alike.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 108.65620560506264
        },
        {
            "name": "Euphoric",
            "score": 93.4973524473718
        },
        {
            "name": "Happy",
            "score": 69.30776184941236
        },
        {
            "name": "Sleepy",
            "score": 44.12372465452666
        },
        {
            "name": "Uplifted",
            "score": 21.096474234792716
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 75.81040940204055
        },
        {
            "name": "Skunk",
            "score": 40.75293813767273
        },
        {
            "name": "Diesel",
            "score": 35.619269017176805
        },
        {
            "name": "Earthy",
            "score": 8.262301433552887
        },
        {
            "name": "Citrus",
            "score": 6.857807051530415
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1385748,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I am in love with this weed. I've been smoking it all day. I was smoking white widow the past 2 weeks and honestly, this stuff tops it! \nHere is my experience with it, read if you're curious about the smoking of this fine strain. \nYou feel happy immediately, the high takes a few moments to really kick in though. The high is amazing. My face is tingling and my entire body feels a strong pulsing and massaging feeling. It's somewhat hard to concentrate and it makes your thoughts kinda cloudy. I feel more passionate for my girlfriend and just feel great. This is an amazing high. As someone with bad anxiety, this weed has calmed me and hasn't given me a panic attack.\nTry this stuff, it's incredible",
            "username": "Feels64"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png",
            "id": 1627349,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "First off, let me just say that this strain STINKS like skunk mixed with diesel which made me nauseous that I wanted to pass out! That's when you know you have GOOD weed. Personally I am not a fan of this kind of smell, but that's my opinion. Flavor was pretty smooth with subtleties of sweetness yet that diesel taste too. Boy, did this strain hit me like a train. All I remember is going to bed and melting completely into my bed. Got 10+ hours of sleep. This is what you want for a bed time strain!",
            "username": "Chemical George"
        }
    ],
    "id": 188465,
    "name": "Primus",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 13.71561410306083
        },
        {
            "name": "Dry Eyes",
            "score": 11.429678419217359
        },
        {
            "name": "Anxious",
            "score": 2.005036807438977
        },
        {
            "name": "Dizzy",
            "score": 0.2808988764044944
        },
        {
            "name": "Paranoid",
            "score": 0.2808988764044944
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/trainwreck",
            "category": "Hybrid",
            "name": "Trainwreck",
            "permalink": "https://mobileapi.leafly.com/hybrid/trainwreck",
            "slug": "trainwreck",
            "subtitle": null,
            "symbol": "Tw"
        },
        {
            "applink": "leafly://strain/303-og",
            "category": "Indica",
            "name": "303 OG",
            "permalink": "https://mobileapi.leafly.com/indica/303-og",
            "slug": "303-og",
            "subtitle": null,
            "symbol": "303"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/primus",
    "photoTotalCount": 5,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/514542/b/primus__primary_4527.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/primus_100x100_8cba.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509902/b/primus__primary_4b6f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/primus_100x100_51cb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509411/b/primus__primary_377a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/primus_100x100_37c9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/470864/b/primus__primary_d938.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/primus_100x100_da49.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/413136/b/primus__primary_6907.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/primus_100x100_58aa.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Spokane, WA",
        "Bellingham, WA",
        "Las Vegas, NV",
        "Vancouver, WA",
        "Everett, WA",
        "Boulder, CO",
        "Denver, CO",
        "Shoreline, WA",
        "Tacoma, WA"
    ],
    "rating": 4.65,
    "relatedStrains": [],
    "reviewCount": 95,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "primus",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.65263157894737/240",
    "subtitle": null,
    "symbol": "Pri",
    "symptoms": [
        {
            "name": "Stress",
            "score": 15.681906237892289
        },
        {
            "name": "Pain",
            "score": 15.401007361487796
        },
        {
            "name": "Lack of Appetite",
            "score": 10.586981790003875
        },
        {
            "name": "Insomnia",
            "score": 9.705540488182875
        },
        {
            "name": "Depression",
            "score": 7.099961255327392
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
