{"sl_translate":"description,descriptionPlain,category","id":1088,"slug":"berry-white","name":"Berry White","subtitle":null,"symbol":"Bw","category":"Indica","description":"\u003cp\u003eBerry White is a hybrid strain that is the offspring of parents of near-celebrity status in the cannabis world: \u003ca href=\"http://www.leafly.com/hybrid/blueberry\"\u003eBlueberry\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/white-widow\"\u003eWhite Widow\u003c/a\u003e. Berry is famous in its own right for its even, balanced effects that offer relaxation from stress and anxiety along with a sense of euphoria. This strain is perfect for inspiring an upbeat mood and may lead to conversation and creative pursuits. This plant\u0026rsquo;s flowers have a light sour berry and pine smell and a fresh taste similar to their scent. They generally have a strong blue coloring contrasted by orange hairs.\u003c/p\u003e\n","descriptionPlain":"Berry White is a hybrid strain that is the offspring of parents of near-celebrity status in the cannabis world: Blueberry and White Widow. Berry is famous in its own right for its even, balanced effects that offer relaxation from stress and anxiety along with a sense of euphoria. This strain is perfect for inspiring an upbeat mood and may lead to conversation and creative pursuits. This plant\u0026rsquo;s flowers have a light sour berry and pine smell and a fresh taste similar to their scent. They generally have a strong blue coloring contrasted by orange hairs.\n","aka":"Barry White, White Berry, Whiteberry, Blue Widow","rating":4.42,"highlightedReviews":[{"id":1413174,"username":"u420","text":"I\u0027ve tried a number of strains recently, trying to find one that can control pain and nausea without causing anxiety or paranoia. I think I\u0027ve found the right combo in Berry White. The Blueberry and White Widow parents are legendary in their own right, but this phenotype is amazing. I\u0027ve seen it said that this is a sativa dominant strain, but I have to disagree. The tightly packed buds appear sativa, with a light green color and orange hairs. However, the effects are heavy hitting in both sativa and indica qualities. For me, the sativa and indica effects hit simultaneously after about three minutes, with a creative, lifted feeling but also a warm body pull and relaxation from the indica side. The peak lasts about an hour and slowly tapers off for the next 2-3 hours. Although this isn\u0027t a couch-lock strain, I wouldn\u0027t medicate with it if I needed to do anything important in the next few hours, especially requiring concentration. Thoughts flow freely with this strain. Although not necessarily a nighttime med, it can be used as such as it is very relaxing, but doesn\u0027t force your eyes closed, glued to the couch like some strains. Good for pain and relaxing mind and muscle. Although not the best for nausea, it\u0027s not bad. Medium munchie factor. This strain would be good for pain, anxiety, stress, nausea, etc. Although it shouldn\u0027t make someone act the fool, it\u0027s not particularly functional meds. I highly recommend this strain if lightly engaging out of the house or chilling at home. Probably my current favorite. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1640888,"username":"GcX","text":"What a great strain. Perfect for chillen out by yourself. There is nothing better than piggin out on chips and playing xbox with some friends while completely stoned on a strong indica. I have tendonitis in my shoulders and this strong indica relieved almost all the pain entirely. Super sweet smelling and tasting, please try this strain. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-33797","title":"Best Cannabis Strains for Sparking Creativity","author":"Bailey Rahn","category":null,"date":"\/Date(1499899938000)\/","text":"Cannabis has long been a companion for creative minds. It has a way of expanding the imagination, enabling access to new thoughts, concepts, and ideas. For many of us, cannabis adds color to our world and allows us to appreciate small nuances that are normally filtered out by our busy brains.\nNot all strains are created equal, thanks to differences in their terpene and cannabinoid profiles. Sure, some artists couldn’t care less what strains they keep stocked alongside pens and brushes, but others swear by specific strains and rely on them for stimulating creative thought.\nThis list features strains that Leafly reviewers rate as highly creative, so consider giving them a try if you’re looking to kindle inspiration.\n\nKali Mist\n\nSometimes the only thing separating you from reaching creative flow is a lack of energy. Kali Mist, a bright and euphoric sativa strain, shakes your imagination awake and imbues it with colorful stimulation that inspires as well as motivates.\n\n“If you want to delve into some new and interesting concepts – if what you’re after is refreshing uplifting bouts of fluid confident creativity and clarity of thought, Kali Mist is where it’s at.” –KennedyBash\n\nJack Herer\n\nWith a sharp pine aroma that promotes an alert, focused mindset, Jack Herer is famous for good reason. Its mellow, even-keel high leaves the mind flexible and with room to stretch creative muscles.\n\n“Astounding creativity off this stuff, first time being high has made me feel smarter.” – itsdeliciouschi\n\n\nChemdawg\n\nChemdawg is a potent hybrid best reserved for the seasoned consumer looking to turbo boost creativity. Its high can be dizzying and cumbersome, but if you’re seeking strong euphoria that jars the senses and summons new pathways of thought, Chemdawg might be the powerhouse hybrid you’ve been waiting for.\n\n“I had many thoughts rush through my head and it was a little overwhelming but once I settled into the high it was very creative, imaginative and invigorating.” – Indaking\n\nPurple Haze\n\nA strain that seems to turn up saturation and definition like an HD movie, Purple Haze unlocks the highest potential of your senses. Lending energy and positivity to the mind, this sativa knocks down bad moods, lethargy, and anything else standing in the way between you and your next artistic project.\n\n“Good for the creative types who love to have a toke with their brush strokes or good for the student looking to cram for the exam.” – Schmo\n\nLSD\n\nNamed for its trippy, awe-inspiring high, LSD is a hybrid strain that’ll spin and twist your imagination, wringing out all of the creativity inside. Use this strain to cast a new light on conscious thought while it illuminates concepts and ideas hiding in your mind’s depths.\n\n“This strain is THE BEST when it comes to coming up with creative ideas. If you’re having creative block or writers block, I recommend this strain a lot.” – GinoMidnight\n\n\nBerry White\n\nThough most people associate sativa strains with creativity, some minds require pacifying before engaging in art or other creative escapes. Overactive minds–especially those afflicted by anxiety or PTSD–can benefit from the slow pace of Berry White’s effects. Artists experiencing debilitating pain or inflammation may also find that this indica’s soothing physical effects take their mind off the aches, allowing full immersion in the task at hand.\n\n“Berry White leaves me relaxed and helps me forget my chronic back pain. I am always given creative insights when I am about an hour into the high.” – TechDesigner\n\nTangie\n\nTangie is a sativa strain that offers many gifts: long-lasting euphoria, a sweet citrus flavor almost indiscernible from ripe tangerines, and a creative kick that expands thought. Its meditative, patient, and focusing high is perfect for settling deep into a long project, especially one that might otherwise feel long and tedious.\n\n“I felt sufficiently high, but very much in the circumstance of what was going on around me. This is a state of mind where I can be very creative, aware, and at peace all at the same time.” – Brian\n\n\nJillybean \n\nA beautiful plant that blooms with sparkling trichomes and colorful hues, Jillybean shares her vibrancy through bright, blissful euphoria. This hybrid helps you shed stress and bad moods, leaving you free to navigate your imagination without burden.\n\n“Jillybean is a nice hybrid that melts away inhibitions, creative blocks and allows for true relaxation. Like a vacation in a flower, this bud will have layers of high energy sativa that helped keep my house clean but also slowly bring on some of the best sleep I’ve had in years.” –jeahisaidit\n\nTo find more creative strains, explore others in Leafly’s strain database by clicking here.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/12150057/strains-for-sparking-creativity.jpg","urlslug":"/news/strains-products/best-cannabis-strains-for-creativity"},{"id":"contentitems-37507","title":"Tips for Growing Berry White Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1503607009000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Berry White is a cross between the well-known strains White Widow and Blueberry. Combining these famous strains produced a flavorful, resinous, well-balanced hybrid with effects that pull from both sides of the indica-sativa spectrum, leaving the consumer feeling relaxed while still engaged by conversation and activity.\nGrow Techniques: A relatively easy strain to manage, Berry White has a good plant structure, which means less need for pruning. Hydroponic growing helps promote resin production, while soil lends to the flavor profile. Train the plant and remove lower foliage to increase the yield.\nFlowering Time: 7-8 weeks\nYield: High\nGrow Difficulty: Easy\nClimate: Berry White likes a warmer climate at night to reach its full potential. The plant handles mold well, making it a good candidate for variable humidity. Ideal temperature for Berry White ranges between 70 and 80 degrees Fahrenheit.\nIndoor/Outdoor: Berry White will produce well indoors or out. Growing in soils outdoors can help develop a stronger blueberry aroma.\nFeeding: Moderate feeding should keep this hybrid strain happy.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/24154705/berry-white-strain.jpg","urlslug":"/news/growing/how-to-grow-berry-white-marijuana"}],"reviewCount":925,"flavors":[{"name":"Berry","score":37.956206993359572},{"name":"Sweet","score":32.072927230329384},{"name":"Blueberry","score":28.544449027999796},{"name":"Earthy","score":12.344135245439841},{"name":"Flowery","score":11.519692099669413}],"effects":[{"name":"Relaxed","score":82.5504525306},{"name":"Happy","score":62.576249353050258},{"name":"Euphoric","score":51.675695315797412},{"name":"Uplifted","score":43.657624648832808},{"name":"Sleepy","score":35.164774040270352}],"symptoms":[{"name":"Stress","score":40.564727440790968},{"name":"Depression","score":29.473788747753584},{"name":"Pain","score":28.74015729234107},{"name":"Insomnia","score":25.776459050707494},{"name":"Headaches","score":10.918673404493031}],"conditions":[{"name":"Anxiety","score":34.757553794706382},{"name":"PTSD","score":13.739971085405005},{"name":"Hypertension","score":8.1204128637480881},{"name":"Migraines","score":7.4049007755757614},{"name":"ADD/ADHD","score":7.1552402451438191}],"negatives":[{"name":"Dry Mouth","score":26.085156728945726},{"name":"Dry Eyes","score":19.900412710962907},{"name":"Paranoid","score":7.1283834755190405},{"name":"Dizzy","score":6.1276166849053979},{"name":"Headache","score":1.8043213377870213}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berry-white_100x100_ff4e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002947/b/berry-white__primary_3f89.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berry-white_100x100_d7ae.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000775/b/berry-white__primary_05d4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berry-white_100x100_fa45.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648590/b/berry-white__primary_599a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berry-white_100x100_0cd3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/634894/b/berry-white__primary_dcc1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berry-white_100x100_95d3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/626156/b/berry-white__primary_4c0c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berry-white_100x100_ef80.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/625834/b/berry-white__primary_70d3.jpg"}],"photoTotalCount":306,"popularCities":["Los Angeles, CA","Seattle, WA","Portland, OR","Everett, WA","San Francisco, CA","Spokane, WA","China","Eugene, OR","Oakland, CA","Phoenix, AZ"],"permalink":"https://mobileapi.leafly.com/indica/berry-white","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.42054054054054/240","testGraph":"https://leafly.s3.amazonaws.com/strains/testing/F57Sr1IFS3u0EDcJ5zHL_berry-white.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"},{"name":"White Widow","subtitle":null,"slug":"white-widow","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/white-widow","symbol":"Ww","applink":"leafly://strain/white-widow"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":59,"outdoorFinish":"Early October","height":"Medium","averageYield":"High","environment":null,"growNotes":""}}
