{
    "aka": "UBC Chemo, Kemo",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1478649921000)/",
            "id": "contentitems-10880",
            "text": "Since the presidential nominations of Hillary Clinton and Donald Trump, record numbers of people have been searching Google for “How to Move to Canada.” The grass may be greener on the other side, whether we’re talking about Prime Minister Justin Trudeau or Canada-grown bud. So for those of you seeking democracy to the North, allow us to point you to a few memorable cannabis varieties with Canadian roots for you to enjoy after your grand escape.\n\n   OG Shark\nA strain so potent, it’ll make you forget all the woes you left back home. OG Shark is a powerful hybrid strain that knocks out stress, depression, headaches, and many other symptoms the 2016 election may have left you with. True to its OG roots, this hybrid reeks of lemony fuel with hints of forest pine that’ll keep you coming back to the bowl for more.\n   Nuken\nNuken is an indica strain that strikes a balance between relaxation and invigoration, giving your body escape from pain and tension while the mind soars with upbeat euphoria. Weaving together genetics from the widely cherished parent strains Shishkaberry and God Bud, Nuken was destined for success. Herbal, woody aromas come together to create an organic flavor profile that brings the mind a little closer to nature and the peace it provides. We know you need it.\n\n   Black Tuna\nThis BC native mixes old school indica genetics from Herijuana and the Jamaican sativa Lamb’s Bread to build a unique hybrid named for its original packaging: sealed tuna cans. The days of Black Tuna’s secretive marketing may be no more, but Black Tuna lives on, offering powerfully sedating effects that can help you hibernate until the 2020 election.\n   Island Sweet Skunk\nIsland Sweet Skunk is a sativa strain from Vancouver Island that offers sweet-tasting freedom from stress and anxiety alongside its creative effects. Sour skunky notes intermix with tropical orange and grapefruit to create an intricate composition of flavors that no doubt helped bring this strain fame and prosperity far beyond the borders in which it first grew.\n\n   Chemo\nAs the story goes, Chemo was developed in Canada in the early 1970s at the University of British Columbia to treat the side effects of chemotherapy. Maintained by Canadian cannabis breeders Jordan of the Isles, Chemo remains an indica staple, showing itself off with a woody, earthy aroma. Its effects sink deep in the body, relaxing muscles while simultaneously backhanding nausea, insomnia, and appetite loss.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/11/08154134/canada-strains.jpg",
            "title": "Moving to Canada Post-Election? Try These Canadian Strains When You Get There",
            "urlslug": "/news/strains-products/canada-cannabis-strains-post-election"
        },
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1467399600000)/",
            "id": "contentitems-3065",
            "text": " \nDid you know that many beloved cannabis strains hail from the United States' northern neighbors? In honor of Canada Day and the promising strides the country has made towards nationwide legalization, here are 11 strains with Canadian roots. Pick one up and raise a joint to celebrate the friendly Canucks up north!\n \n  Manitoba Poison\nThe Manitoba province is located at the longitudinal center of Canada, so it's only fitting that Manitoba Poison is a 50/50 hybrid (though you'll likely feel the heavy indica properties pretty quickly).\n  Sweet Tooth\nAn oldie but a goodie, Sweet Tooth won 1st Place in the 2001 High Times Cannabis Cup.\n  Mendocino Purps\nMendocino Purps, or simply \"The Purps,\" is one of a few living legends that made this list. Handed off as a clone-only cut, this plant was stabilized by BC Bud Depot and has since made its way around the world. \n  Chemo\nChemo, or UBC Chemo, is named for the university where the strain was allegedly created and for its supplementary effects on patients going through chemotherapy. This strain is an international treasure with origins that reach back to the 1970s.\n  M-39\nThe clever astronomical designation of M-39 speaks to the Northern Light #5 portion of this cross. \n  God Bud\nGod Bud is some of the finest around. This incredible indica-dominant strain lives in the pantheon of cannabis deities, but like many of the old gods, this strain is the primogenitor to many other floral demigods like Blue God and Grape God.\n  DJ Short Blueberry\nDJ Short is one of the principal breeders in the cannabis industry. With cuts like Juicy Fruit and Flo, he's left a lasting mark on the cannabis industry with exotic genetic crosses cultivated through a life of world travel and reverence for this resinous flower. DJ Short Blueberry is known as THE west coast Blueberry phenotype.\n  Blue Dynamite\nBlue Dynamite was featured as one of the top 10 strains of 2007 in High Times magazine. \n  Island Sweet Skunk\nBred by Federation Seed Company in Canada, this beautiful blend of strong landrace genetics offers a smoke that is stimulating and versatile. Known for creating considerable amounts of tertiary CBD, Island Sweet Skunk invigorates the user while still offering anti-inflammatory and analgesic effects.\n  Lowryder\nLowryder is a squat and resilient plant that is ideal for outdoor grows in less than pleasant climates, making it a seasoned fit for Canadians seeking a plant that could grow and hide in plain sight while weathering a rugged season. \n  Romulan\nRomulan is a space-age indica sent to Earth to expand our mind. And with Canada's savvy immigration policy, it's no wonder this heady smoker stopped there first.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001518/cannabis-strains-with-canadian-roots.jpg",
            "title": "11 Cannabis Strains with Canadian Roots",
            "urlslug": "/news/strains-products/cannabis-strains-with-canadian-roots"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 47.86979659533767
        },
        {
            "name": "PMS",
            "score": 21.54993029905268
        },
        {
            "name": "PTSD",
            "score": 21.040782685674163
        },
        {
            "name": "Arthritis",
            "score": 19.014749127466242
        },
        {
            "name": "ADD/ADHD",
            "score": 12.068566399055731
        }
    ],
    "description": "<p>Rumor has it that Chemo&rsquo;s beginnings stretch back to the 1970s in Canada where this heavy <a href=\"http://leafly.com/indica\">indica</a> was allegedly developed to treat the side effects of chemotherapy. Another name for this strain is &ldquo;UBC Chemo&rdquo; in reference to the university in which Chemo is said to have been conceived. Chemo&rsquo;s genetics is carried on by Jordan of the Islands, whose rendition is best known for its subtle <a href=\"http://www.leafly.com/explore#!/explore/flavors-woody\">woody</a> aroma and potent medicinal effects perfect for patients treating <a href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\">nausea</a>, <a href=\"http://www.leafly.com/explore#!/explore/symptoms-lack-of-appetite\">appetite loss</a>, <a href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\">pain</a>, and <a href=\"http://www.leafly.com/explore#!/explore/symptoms-insomnia\">sleeplessness</a>.&nbsp;</p>\n",
    "descriptionPlain": "Rumor has it that Chemo&rsquo;s beginnings stretch back to the 1970s in Canada where this heavy indica was allegedly developed to treat the side effects of chemotherapy. Another name for this strain is &ldquo;UBC Chemo&rdquo; in reference to the university in which Chemo is said to have been conceived. Chemo&rsquo;s genetics is carried on by Jordan of the Islands, whose rendition is best known for its subtle woody aroma and potent medicinal effects perfect for patients treating nausea, appetite loss, pain, and sleeplessness.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 93.96883299246008
        },
        {
            "name": "Sleepy",
            "score": 86.71878974734679
        },
        {
            "name": "Tingly",
            "score": 44.929128890788284
        },
        {
            "name": "Hungry",
            "score": 44.26976810443949
        },
        {
            "name": "Happy",
            "score": 43.5043295989906
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 29.721094457502776
        },
        {
            "name": "Pungent",
            "score": 18.36391017226818
        },
        {
            "name": "Sage",
            "score": 12.17120994739359
        },
        {
            "name": "Sweet",
            "score": 11.357184285234592
        },
        {
            "name": "Woody",
            "score": 7.96791212592977
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": "Indoor",
        "floweringDays": 53,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1417279,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "One of my favorites, if not my favorite strain I have acquired over the years. Chemo shows you no mercy, so this strain is definitely not for the inexperienced. To start, the buds themselves were covered in crystals and trichomes, and, excuse me for my wording, but honestly had the cutest orange curly hairs I've ever seen on a bud. It was beautiful. It also smoked great. It had a very earthy and woody taste to it, with a hint of nuttiness, and sometimes even chocolate. The high left me feeling completely at ease. I was really creative, and able to still function and let my creative energies going. I was able to sketch and work on a few sewing pattern I had, but it kept me locked in my seat. After a while, the creativeness fades into a nice, relaxing body high that washed away my pain and left me wanting food and a nap. Not for the beginners, and definitely not one to use before work, but this strain is a powerhouse for those with chronic pain lack of appetite.",
            "username": "Allie17"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1628410,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/3/240",
            "text": "Not great if you have anxiety and depression, I'be been smoking this for the past few days and my depression is good, but the anxiety is quiet high",
            "username": "TheGanjaGenie"
        }
    ],
    "id": 94639,
    "name": "Chemo",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 28.047508572707756
        },
        {
            "name": "Dry Eyes",
            "score": 24.341402362709484
        },
        {
            "name": "Dizzy",
            "score": 19.672074849659634
        },
        {
            "name": "Headache",
            "score": 13.336665750887796
        },
        {
            "name": "Paranoid",
            "score": 8.518142596945367
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/indica/chemo",
    "photoTotalCount": 29,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645198/b/chemo__primary_7072.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chemo_100x100_0077.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/623917/b/chemo__primary_adfb.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chemo_100x100_28f6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/579562/b/chemo__primary_73e9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chemo_100x100_7030.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/579404/b/chemo__primary_460d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chemo_100x100_df58.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/549747/b/chemo__primary_9625.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chemo_100x100_41f2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/543484/b/chemo__primary_2250.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/chemo_100x100_af92.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Vancouver, BC",
        "Calgary, AB",
        "Montréal, QC",
        "Toronto, ON",
        "Edmonton, AB",
        "Winnipeg, MB",
        "Mississauga, ON",
        "Ottawa, ON",
        "Victoria, BC",
        "Brampton, ON"
    ],
    "rating": 4.4,
    "relatedStrains": [],
    "reviewCount": 219,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "chemo",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.3972602739726/240",
    "subtitle": null,
    "symbol": "Chm",
    "symptoms": [
        {
            "name": "Stress",
            "score": 44.21571171281174
        },
        {
            "name": "Insomnia",
            "score": 37.98091109822238
        },
        {
            "name": "Pain",
            "score": 37.120333343508655
        },
        {
            "name": "Lack of Appetite",
            "score": 25.09933656908534
        },
        {
            "name": "Depression",
            "score": 24.94365416119743
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
