{
    "aka": "jedi og, jedi og kush",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1451246400000)/",
            "id": "contentitems-3591",
            "text": "Looking back at 2015, I can’t help but play a nostalgic montage in my head of all the strains that came and went over the year. Legal markets are becoming saturated with choices, so much so that it’s impossible to determine 2015’s best cream of the crop. Instead, we took a look at the fastest growing strain trends based on Leafly reviews and determined which varieties made the biggest splash last year.\nDispensaries and rec shops, you better keep your eye out for these rising stars in 2016! You’ll definitely want them blessing your shelves.\n \n\n \n#1. GG4 (f.k.a Gorilla Glue #4)\n \nGG4 (f.k.a Gorilla Glue #4) blew it out of the water this year with an astounding 906% increase in user ratings and reviews. That kind of growth is pretty mind-blowing, but if you’ve tried Gorilla Glue, it starts to make sense.\nEven through a sealed container, I could pick up every intricacy of its aroma: earthy pine soured by loud notes of skunky diesel. Trying to pry the buds apart, I can see how this champ got its name; the resin oozing from these trichomes might as well be heavy-duty adhesive. In describing the effects, I can say it no better than this Leafly reviewer who wrote, “I needed a seatbelt for reality.” Me too, dude.\n \n#2. Critical Kush\n \nHeir to the Critical Mass throne is Critical Kush, an indica strain that saw a staggering 407% increase in user engagement this year. By crossing Critical Mass with the West Coast favorite OG Kush, it’s no surprise that Critical Kush is taking off in the U.S. A subtle citrusy lemon OG aroma adds a layer of interest to Critical Mass’ muted hashy and earthy flavors, and its moderate CBD content complements its THC-rich profile for beautifully relaxing effects that one Leafly user compares to a slow massage.\n \n#3. Candyland\n \nCandyland grew almost 380% this year, making it the fastest growing sativa among Leafly users in 2015. The first thing most people note about this strain is its strikingly sweet flavor, a quality that’s earned this strain her name. Its twisting hues of blue, purple, white, and green are also something to write home about, as well as its dueling effects that balance gracefully between relaxing and uplifting. Candyland has been called “a work of art” by Leafly users, while another claimed it was “By far one of the best strains I had of 2015.” Apparently everyone else agrees.\n \n#4. ACDC\n \nNext up is ACDC, a high-CBD hybrid that grew 356% this year. I believe it. A lot of high-CBD strains I’ve tried have a grassy, hay-like aroma and a scraggly appearance, but ACDC is a refreshingly beautiful anomaly. Sweet, zesty lemon notes burst from its crystal-coated buds in an impressively fragrant introduction to its relaxing, clear-headed effects. Reviewers rave over its ability to chase off pain and anxiety without cerebral euphoria or mental cloudiness, which can make all the difference in many medical patients’ lives.\n \n#5. Bubblegum Kush\n \nStep aside, Bubble Gum. Your Kush-infused offspring is taking center stage with a yearly growth rate of 284%. Maintaining a sweet floral and bubble gum aroma, this hybrid gets its enhanced resin production from its hash monster of its second parent, Hindu Kush. It may anchor your body with a physical heaviness, but many reviewers claim this strain still leaves the mind agile and motivated.\n \n#6. Sunset Sherbet\n \nOnce upon a time, you’d see its parent GSC (f.k.a Girl Scout Cookies) on this list, so it comes as no surprise that the offspring Sunset Sherbert is dominating the market with a year-over-year growth rate of nearly 276%. As one reviewer wrote, Sunset Sherbert “smells as if heaven cracked open its Mason jars and said ‘enjoy.’” Yes, it’s that good.\n \n#7. Tangie\n \nClimbing 236% in ratings and reviews this year, the Tangie sativa is a flavor masterpiece. Its aroma spans the entire citrus spectrum with fruity notes of orange, lemon, lime, and grapefruit. Even if this strain didn’t have its amazingly uplifting and upbeat effects, I bet you’d still buy this strain for its flavor alone.\n \n#8. Jedi Kush\n \nEither Star Wars fans spent the entirety of 2015 enjoying Jedi Kush in anticipation of the new sequel or it really is that good, because this indica grew 235% among Leafly visitors. It hits with the force of a Jedi master, delivering heavy-handed euphoria that’ll launch you to a galaxy far, far away.\n \n#9. Animal Cookies\n \nAlso called Animal Crackers, this powerhouse hybrid hiked 224% in 2015. This one’s known to reach impressively high THC heights and provide stupefying effects that can knock out even the most seasoned veteran. As one Leafly reviewer poetically describes it, Animal Cookies is a “soothing, nap-time, I-wish-I-had-money-for-pizza, loving-my-1,000-thread-count-sheets strain.”\n \n#10. OG #18\n \nWith an annual growth rate of 210%, OG #18 (AKA Private Reserve) gained quite a bit of momentum this year. This supreme OG Kush phenotype has snagged numerous awards for its potency, and fans of OG genetics will appreciate how this hybrid captures and enhances the most cherished qualities of OG Kush: its pungent diesel, lemon, and pine flavors; a thick and sticky coat of resin; high-flying euphoria; and pain-relieving anesthetic effects that patients gush over.\nDispensaries, you might want to update your Leafly listing menus to include these trending strains. Don’t have a Leafly listing? We can fix that!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12002930/top-trending-cannabis-strains-of-2015.jpg",
            "title": "The Top Trending Cannabis Strains of 2015",
            "urlslug": "/news/strains-products/top-trending-cannabis-strains-of-2015"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1450378800000)/",
            "id": "contentitems-3003",
            "text": "The long-awaited Star Wars sequel The Force Awakens is here, which means it's time to load a bowl in celebration — and what better strains to pair it with than those with names like Skywalker, Ewok, and Jedi Kush? You'll notice that most of these strains are heavy indicas, so be sure to bring some snacks and comfy blankets to the new release or when you marathon episodes IV, V, and VI in anticipation of the latest chapter.\n \n \nDeemed \"the ultimate power in the universe,\" this Death Star indica isn't altogether unlike the moon-like superweapon of the Galactic Empire. A cross between Sensi Star and Sour Diesel, it delivers a blast of potent euphoria that annihilates stress and tension like the helpless planet of Alderaan, letting you ease into heavy full-body relaxation.\n \n \nThe Master Jedi indica is not meant for padawans — the crushing force of this sedating strains is meant only for those who have trained long and hard under the guidance of a true master. Ushering in tingly full-body sensations that bring peace to both mind and body, this strain is intended for those looking to attain the patience, tolerance, and receptivity required of the Jedi Order.\n \n \nLike the Endor natives this strain was named after, Ewok is a lighthearted and cheery option that evokes curiosity and creativity. These fuzzy little nugs are just what you need the next time you throw on Return of the Jedi to revisit the furry bears of the Forest Moon.\n \n \nDun, dun, dun, dun, dun-dun, dun, dun-dun! Darth Vader may be missing from The Force Awakens, but you can still honor his memory by indulging in the heavy-handed Darth Vader OG. As if commanded by the Sith Lord himself, this indica will leave you unable to resist sinking deeply into the couch while relaxing bliss invades the mind.\n \n \nLike the Rebel Alliance pilot himself, Skywalker OG will fly you across the galaxies with soaring euphoria. Perhaps the relaxing effects of this hybrid will provide you with all the patience you need to become a Jedi master, but don't underestimate its power — overdo this one and you'll find yourself too comfy to save the world from intergalactic tyranny.\n \n \nThe green, fuzzy buds of Yoda OG may not impart quite as much wisdom as its Jedi namesake, but it just might make you hungry enough to steal Luke Skywalker's dinner. This long-lasting indica is a perfect companion for a night of Star Wars marathons, but be careful with the force of this indica: too much and you'll be snoring before the opening lore finishes scrolling up your screen.\n \n \nThe Jedi Kush indica is meant to encourage the principles of Jedi Code through a peaceful and harmonious mindset. Harness the pacifying effects this indica has to offer and let it help you achieve a higher understanding and sympathy towards life of all forms.\nHungry for more Star Wars strains? Get a head start on 2016's May the Fourth holiday with these celebratory options!\n\nImage Source: JD Hancock via Flickr Creative Commons",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12001333/7-star-wars-strains-to-prepare-you-for-the-force-awakens.jpg",
            "title": "7 Star Wars Strains to Prepare You for ‘The Force Awakens’",
            "urlslug": "/news/strains-products/7-star-wars-strains-to-prepare-you-for-the-force-awakens"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Arthritis",
            "score": 32.794689782267426
        },
        {
            "name": "Crohn's Disease",
            "score": 27.37526448706573
        },
        {
            "name": "Anxiety",
            "score": 18.449252610743294
        },
        {
            "name": "Migraines",
            "score": 10.002730189065593
        },
        {
            "name": "PTSD",
            "score": 7.7946897822674215
        }
    ],
    "description": "<p>Cali Connection&rsquo;s Jedi Kush brings together the forces of <a href=\"http://www.leafly.com/indica/death-star\">Death Star</a> and <a href=\"https://www.leafly.com/indica/sfv-og-kush\">SFV OG&nbsp;Kush</a>, an <a href=\"http://leafly.com/indica\">indica</a> alliance that will awaken both mind and body. Jedi Kush&rsquo;s timid aroma isn&rsquo;t fully realized until a bud is cracked open, releasing a complex fusion of sour <a href=\"http://www.leafly.com/explore#!/explore/flavors-skunk\">skunk</a> and tangy <a href=\"http://www.leafly.com/explore#!/explore/flavors-diesel\">diesel</a>. Dreamy <a href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\">euphoria</a> blankets the mind, a sensation that builds over time into bolting cerebral <a href=\"http://www.leafly.com/explore#!/explore/tags-energetic\">energy</a> that&rsquo;s unexpected from our indicas. This lethargy-free strain is a great way for patients to get a powerful dose of <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabinoids-101-what-makes-cannabis-medicine\">cannabinoids</a> during the day while treating ailments like <a href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\">pain</a>, <a href=\"http://www.leafly.com/explore#!/explore/conditions-ptsd\">PTSD</a>, <a href=\"http://www.leafly.com/explore#!/explore/symptoms-depression\">depression</a>, <a href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\">stress</a>, <a href=\"http://www.leafly.com/explore#!/explore/symptoms-headaches\">headaches</a>, and <a href=\"http://www.leafly.com/explore#!/explore/symptoms-lack-of-appetite\">appetite loss</a>. Jedi plants&nbsp;show resilience in outdoor gardens but also thrive indoors with a flowering time of 8 to 9 weeks.</p>\n",
    "descriptionPlain": "Cali Connection&rsquo;s Jedi Kush brings together the forces of Death Star and SFV OG&nbsp;Kush, an indica alliance that will awaken both mind and body. Jedi Kush&rsquo;s timid aroma isn&rsquo;t fully realized until a bud is cracked open, releasing a complex fusion of sour skunk and tangy diesel. Dreamy euphoria blankets the mind, a sensation that builds over time into bolting cerebral energy that&rsquo;s unexpected from our indicas. This lethargy-free strain is a great way for patients to get a powerful dose of cannabinoids during the day while treating ailments like pain, PTSD, depression, stress, headaches, and appetite loss. Jedi plants&nbsp;show resilience in outdoor gardens but also thrive indoors with a flowering time of 8 to 9 weeks.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 116.71558255409188
        },
        {
            "name": "Sleepy",
            "score": 73.51716606374991
        },
        {
            "name": "Hungry",
            "score": 65.05357996041225
        },
        {
            "name": "Euphoric",
            "score": 58.01822401201284
        },
        {
            "name": "Happy",
            "score": 58.01822401201284
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 41.5927240461402
        },
        {
            "name": "Pungent",
            "score": 34.06593406593406
        },
        {
            "name": "Diesel",
            "score": 30.252201214934132
        },
        {
            "name": "Woody",
            "score": 30.06791345300662
        },
        {
            "name": "Skunk",
            "score": 28.37860896867108
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 60,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1417631,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This is my go to medicine. I have huge problems with appetite problems, sleeping issues, stomach issues, and body pain. This strain knocks all of that out, even with high tolerance levels. Very strong strain, it's a Hybrid from DeathStar and SVF OG (both Indica's) great to smoke, eat a meal, and lay down for a great nights sleep. Also, is great for lost libido. It is HEAVY with smoke, this will make you cough, take small hits.",
            "username": "PamPoovey"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1626806,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Solid Indica. Vape a little before bed and its off to dream land for me. Perfect for insomnia",
            "username": "livingthedream42069"
        }
    ],
    "id": 76847,
    "name": "Jedi Kush",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 96.19309262166405
        },
        {
            "name": "Dry Eyes",
            "score": 38.9000750801993
        },
        {
            "name": "Headache",
            "score": 30.168589174800353
        },
        {
            "name": "Dizzy",
            "score": 4.231793051668828
        },
        {
            "name": "Paranoid",
            "score": 1.4384683639342024
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/death-star",
            "category": "Indica",
            "name": "Death Star",
            "permalink": "https://mobileapi.leafly.com/indica/death-star",
            "slug": "death-star",
            "subtitle": null,
            "symbol": "Ds"
        },
        {
            "applink": "leafly://strain/sfv-og-kush",
            "category": "Indica",
            "name": "SFV OG Kush",
            "permalink": "https://mobileapi.leafly.com/indica/sfv-og-kush",
            "slug": "sfv-og-kush",
            "subtitle": null,
            "symbol": "Sfk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/jedi-kush",
    "photoTotalCount": 52,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/indica/jedi-kush/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/indica/jedi-kush/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/598028/b/jedi-kush__primary_190c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/jedi-kush_100x100_529e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/540660/b/jedi-kush__primary_613c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/jedi-kush_100x100_8f1d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/486414/b/jedi-kush__primary_ca90.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/jedi-kush_100x100_cbc5.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/464351/b/jedi-kush__primary_ef40.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/jedi-kush_100x100_fda0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/464053/b/jedi-kush__primary_fbc3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/jedi-kush_100x100_50ca.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/448059/b/jedi-kush__primary_4da8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/jedi-kush_100x100_e7b7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Detroit, MI",
        "Los Angeles, CA",
        "Portland, OR",
        "Chicago, IL",
        "Ann Arbor, MI",
        "Auburn, WA",
        "Collinsville, IL",
        "Dayton, WA",
        "Edmonds, WA"
    ],
    "rating": 4.51,
    "relatedStrains": [],
    "reviewCount": 286,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "jedi-kush",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.51398601398601/240",
    "subtitle": null,
    "symbol": "Jed",
    "symptoms": [
        {
            "name": "Pain",
            "score": 19.03453689167975
        },
        {
            "name": "Stress",
            "score": 18.616476691010853
        },
        {
            "name": "Depression",
            "score": 17.295747730530337
        },
        {
            "name": "Headaches",
            "score": 14.000750801993037
        },
        {
            "name": "Insomnia",
            "score": 11.42413487133984
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
