{
    "aka": "Presidential Kush, Presidential OG Kush, Prezidential OG, Prezidential Kush",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1512081671000)/",
            "id": "contentitems-50073",
            "text": "This fall, Leafly set out on a quest to find the very best cannabis in Washington state, and we came back with ten standout strains from talented growers on both sides of the Cascade Mountains.\nUsing a point-based method that rates cannabis by its aroma, flavor, appearance, cure, and overall experience, each of these strains received a 1-to-100 score (which you can read more about here). In this feature, we take a look at some of the best THC-dominant strains in Washington, but stay tuned for more product ratings in Washington and beyond.\nThese 10 strains—and their growers—each offered something unique among the sea of cannabis available throughout the state of Washington.\n(Click to enlarge)\nAll strains evaluated in this round have a THC-dominant cannabinoid profile, meaning its THC-to-CBD ratio is at least 5:1. Presidential Kush, which weighed in at just over 17% THC, demonstrates that quality is not measured by this one chemical alone. A diverse and compelling terpene profile—which the curing process can make or break—is often the key to a consumer’s heart, as terpenes augment the overall experience.\n(Click to enlarge)\nOur tasting panel draws experience from all corners of the industry, from budtending to cultivation. Avid curiosity and deep appreciation of cannabis products forms our common foundation, from which extends our individual preferences and experiences.\n#1 | Middlefork by Royal Tree Gardens\n\nPrice: $15-17.00/gram\nThe unanimous favorite among our three tasters was Royal Tree’s Middlefork, a true Washington native born just outside the city of Bellingham. Perfected over years from Dutch Treat parent genetics, it’s no surprise that its aroma and flavor stole our hearts: Effervescent citrus and fresh-cut pine linger on the exhale in an impressive translation of aroma to flavor. Middlefork is ruggedly attractive, growing fuzzy buds that are absolutely packed with sticky, enticing trichomes. Meanwhile, its effects are commanding in strength, bolting all three of us to our seats in stunned satisfaction.\nFind Middlefork Nearby\nFrom the Tasting Notebook:\n“Very attractive scent of sweet candied citrus fizz…I am definitely stoned.” –Will\n“Kind of tastes like vanilla chai mixed with orange spice creamsicle. After a few hits from the vaporizer, my eyes fell into crescents, and I was hopelessly glued to the couch in a state of bliss.” –Bailey\n#2 | Sherbet by Gabriel\n\nPrice: $45/eighth\nGabriel’s Sherbet weighed in as our panel’s second place flower, tying with Middlefork in its overall score but falling just inches short after calculating each panelist’s individual scoring. With Sherbet, we couldn’t help but obsess over the knotting of purple, blue, and green hues underneath the thick coat of trichomes and fiery orange hairs. Its aroma mimics that of a berry pie, from buttery crust to its fruity center, creating a unique bouquet that isn’t often captured by a single cannabis bud. Considering its price-to-quality ratio, Sherbet by Gabriel is among the best value on this list (plus, it’s pesticide-free).\nFind Gabriel Sherbet Nearby\nFrom the Tasting Notebook:\n“Beautiful bud with highly expressive features. Provides a heady, happy buzz with relaxing physical effects.” –Jeremiah\n“Its color is variated and intricate with a dessert-like aroma of sugary dough, sweet berry, and deep grape.” –Bailey \n#3 | Presidential Kush by Fifty Fold\n\nPrice: $50/eighth\nPresidential Kush by Fifty Fold is beauty in a bag, showing off a thick layer of frosty trichomes against its dark, cosmic purple coloration. The buds bloom with perfect conic uniformity, like a Christmas tree covered in luminescent white bulbs. Its aroma is full and nuanced, expressing sweet and sour notes of fruit and berry, but these delicate fragrances are lost with heat. Though its exceptional aroma and appearance tied its overall score up with our two frontrunners, Presidential Kush’s muted earthy flavor left some room for improvement.\nFind Presidential Kush Nearby\nFrom the Tasting Notebook:\n“Very complex and enticing smell of funky dankness and sweet sugary notes that keep me coming back to this bud. This was easily one of my favorite flowers in the whole lot.” –Will\n“Beautiful frosted buds with uniform shape, but the flavor left much to be desired after its wonderful aroma.” –Jeremiah\n#4 | Alien Dawg by NEBULA\n\nPrice: $48/eighth\nNebula Gardens is known for its bulky, resinous buds—and Alien Dawg is no exception thanks to its enormous, bulbous buds that build up off of each other to create an otherworldly mass of trichome-covered foliage. Gassy diesel aromas evaporate off the monolithic buds, intermixing with notes of pine and tangy fruit. This aroma translates well to flavor that carries hints of sweet earth, sandalwood, and herbs. The diversity of flavors and aromas combined with its commanding cerebral high made Alien Dawg a standout strain, especially among our tasters with a penchant for funky, gassy strains. It’s also pesticide-free.\nFind Alien Dawg Nearby\nFrom the Tasting Notebook:\n“Sweet and sour aroma with overripe tree fruit and fresh soil. Its effects are cerebrally stimulating without feeling too top-heavy.” –Bailey\n“It has the pungent funkiness of many other strains, but with a bright and peppery sweetness at the center.” –Jeremiah\n#5 | Lemonder by Seattle’s Private Reserve\n\nPrice: $45/eighth\nLemonder by Seattle’s Private Reserve leaves an immediate impression with an aroma that smells like fresh-squeezed lemons and flowering herbs. The soft lime-green buds crack open easily, filling the nose with a diversity of funky, floral, and citrus aromas inherited from its parent genetics: Lavender, OG Kush, and Super Lemon Haze. Its intricate but fragile flavor profile collapses with heat, delivering fleeting hints of candied lemon. This flavor is refreshing but subdued compared to its impeccable lemon astringent aroma. Anyone with a sweet tooth for lemon-loaded strains should not walk, but run to the nearest dispensary stocking Lemonder.\nFind Lemonder Nearby\nFrom the Tasting Notebook:\n“This is the best aroma I have smelled so far. Lemon, cream, spice, and a middle savory note that mellows the lemon in a weird way.” –Jeremiah\n“Very healthy-looking lime green coloration and incredible lemon astringent aroma. It’s easy to focus in the stillness of its pleasant effects.” –Bailey\n#6 | GG4 by North Coast Growers\n\nPrice: $50-63.00/eighth\nSticky, euphoric, and reeking of sour fuel, GG4 (formerly known as GG4 (f.k.a Gorilla Glue #4)) is easy to pick out of a crowd. This particular rendition from North Coast Growers was a polarizing force among our tasters, but the consensus brought this strain to #6 on our list. The close shave of the trim and subtlety of aroma and flavor were, for some, a miss. But others favored the trim and aroma, admiring its poignant odor of gas and pine. Hints of sweet white tea and aged sour cheese hit the palate on the exhale, a divisive but unique flavor that lacked somewhat in strength.\nFind GG4 Nearby\nFrom the Tasting Notebook:\n“Its flavor is sharp pine with a hint of parmesan funk. Really deep and complex earthy notes that finish sweet with a tingle of citrus.” –Will\n“This one has a deep herbal and pine aroma with a light skunky gas note. The onset of effects is jarring and intense—deeply euphoric and trippy.” –Bailey\n#7 | Jet Fuel by Sweet As!\n\nPrice: $36/eighth\nThis take on Jet Fuel by Sweet As! is decidedly one of the best values when its quality-to-price ratio is considered. The strain has immediate bag appeal, showing off fuzzy, healthy green buds under a coat of gluey resin. Sweet and earthy aromas fill the nose, hinting at a spice rack of different terpenes. Jet Fuel scored well across the board, proving to be an all-around solid choice for those seeking a potent strain with a moderate offering of fragrances and flavors.\nFind Jet Fuel Nearby\nFrom the Tasting Notebook:\n“It has a sweet, skunky zest with a funky sour aroma that opens up with bright intensity. When smoked, it tastes like turpentine.” –Bailey\n“Sweet, fresh, earthy aroma with subtle hints of spice and licorice when ground up. Effects are thought-provoking with cerebral energy out the gate.” –Will\n#8 | GG4 by From the Soil\n\nPrice: $50/eighth\nFrom the Soil’s GG4 (formerly known as GG4 (f.k.a Gorilla Glue #4)) is yet another solid take on the sticky, stinky favorite. The aroma of this strain was somewhat muted in the jar, but when ground up, the strain shares its fragrant secret in full: stinging fuel, sharp pine, and a whisper of sweet lemon. Its exhaled flavor is dampened by heat, giving rise to vague earthy flavors with a slight tinge of mint best preserved by a vaporizer. The effects rest neatly in the head, singing away stress and tension with warm euphoria.\nFrom the Tasting Notebook:\n“Buds offer little on the nose until broken up, but once cracked open, there’s a pleasant, funky aroma. Its swampy, earthy flavor sticks to the tongue but fades away pretty quickly.” –Jeremiah\n“Smells earthy, woody, and muted as a nug. When cracked open, it exposes a loud fuel/gas scent reminiscent of Kush. Smells fantastic when ground up!” –Will \nFind GG4 Nearby\n\n#9 | Golden Ticket by Khush Kush\n\nPrice: $50-65/eighth\nGolden Ticket from Khush Kush offers an alluring but subtle harmony of sweet flavors that dance lightly across the palate, charming you with notes of tropical fruit, lemon spearmint, and fresh pine. Its aroma carries similar traits, but with dialed-up citrus and orange blossom notes. The flower itself is a beautiful twisting of green, purple, and fire-orange hairs hiding under a brilliant coat of trichomes. A few minor flaws in the buds and a somewhat faint flavor profile knocked a few points off this strain’s score, but it’s definitely a catch for low-temp vaping.\nFind Golden Ticket Nearby\nFrom the Tasting Notebook:\n“Aroma is sweet, floral and sort of tropical. Ground up, it gets even sweeter, like a sour green apple or overripe pineapple. Flavor falls off a little compared to the smell, but is still sweet and tropical.” –Will\n“It has a sharp lemon-lime aroma with sweet pine and herbs, and a light, summery lime flavor.” –Bailey \n#10 | MK Ultra by Virginia Co.\n\nPrice: $50-65/eighth\nMK Ultra from Virginia Co. is a gorgeous flower that expresses itself with weaving hues of dark and light green under glittering trichomes. The aroma is complex but not super pungent. Where it catches your attention is in its unusual scent that can only be described as a compost bin full of overripe fruit and cheese rind. Its flavor releases a spicy, peppery essence with a touch of sweet flower. As for effects, the onset is immediate and intoxicating, favoring those with a stubborn tolerance to THC.\nFind MK Ultra Nearby\nFrom the Tasting Notebook:\n“Great bud structure with resinous knots that show off the flower’s unique shape. Peppery hashy taste that’s smooth on the inhale; some slight harshness on the exhale.” –Bailey\n“Aroma is pungent and smells a bit like rotten earth, skunk, and some lemon. The flavor is much more mellow than the smell: earthy, floral, and a touch of funk.” –Jeremiah",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/29155113/gabriel-sherbet-macro.jpg",
            "title": "The Top THC-Dominant Strains of Washington State in Fall 2017",
            "urlslug": "/news/strains-products/best-thc-strains-washington-state-fall-2017"
        },
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1511894705000)/",
            "id": "contentitems-49877",
            "text": "As we explored recently with our list of 9 Most Overhyped Cannabis Strains, a few of the best-known cannabis varieties on the market are a little overrated. Correspondingly, it’s no surprise that there are some underrated cannabis strains out there, too.\n\nThe following represent 11 varieties of cannabis that we think get less love than they deserve, based on Leafly review data, regional availability, and the personal experiences of our cannabis expert team. This is far from an exhaustive list—with thousands of strains available in the world, it’s virtually impossible to give all of them the attention we wish we could. Nevertheless, take the following as just a few recommendations of lesser-known types you should keep an eye out for—who knows? You just might find your new favorite strain among them.\nTahoe OG Kush\nStrain type: Hybrid\nParent strains: OG Kush, SFV OG Kush\nWhy it’s underrated: “Tahoe OG isn’t underrated in the traditional sense of the word. In fact, most people I know who’ve come across this select OG Kush phenotype will share their excitement for the pungent, piney sweetness and the strain’s dynamic mix of deep relaxation and profound euphoria. However, when I think of the OG family tree, the Tahoe cut doesn’t seem to get quite the same notoriety that some of its relatives. The SFV, Larry, and Fire OGs manage to capture a lot of the buzz, while other cuts, like the Ghost and WiFi OGs, have somewhat cult followings. This leaves room for Tahoe OG to stand on its own, which is OK by me. I love its dank, complex aroma and the sedating effects, so the less hype there is for Tahoe OG, the more of this delicious strain is available for me!” —Will Hyde\n\nLodi Dodi\nStrain type: Hybrid\nParent strains: Undisclosed\nWhy it’s underrated: “This strain is a mainstay in the Pacific Northwest, but still flies beneath the radar outside the region. Sativa-dominant in effect, this unknown cultivar has been propagated throughout the Evergreen State for decades. Lodi Dodi’s airy physical lightness and uplifting mental buzz allow the consumer to metaphorically levitate two inches above their problems and their pain. I personally enjoy working out after consuming this strain for its stimulating aura and a mental haze that allows me to fade into my headphones and run forever. It’s equally satisfying on the dancefloor or in the bedroom, as long as you mind your dosage. Lodi Dodi came to party—it don’t cause trouble or bother nobody.” —Jeremiah Wilhelm\nChocolope Kush\nStrain type: Hybrid\nParent strains:  Chocolope, Kosher Kush\nWhy it’s underrated: “This is, weirdly, one of the lowest-rated strains on Leafly (yep, a four-star rating is on the low end—Leafly reviewers give most cannabis pretty high marks), but riddle me this: How can a marriage of superstars like Chocolope and Kosher Kush possibly be bad? Those parent strains are two of our all-time faves (in fact, both landed on our Top 100 Strains list) and given that the apple rarely falls far from the tree, this super-low rating for Chocolate Kush is undeserved.” —Brett Konen\n\nDancehall\nStrain type: Hybrid\nParent strains: Juanita La Lagrimosa, Kalijah\nWhy it’s underrated: “Dancehall is an exceptional CBD-dominant strain that doesn’t get much recognition by comparison to CBD hallmarks like Harlequin, ACDC, Charlotte’s Web, and Cannatonic. With a near 21:1 CBD:THC ratio, Dancehall delivers soothing, easygoing effects with just enough sativa-dominant influence to elevate mood, which makes it a constant companion for consumers who like to stay level and clearheaded while enjoying cannabis. The terpene profile also offers deeper, skunkier notes than the usual grassy, hay-like aroma CBD strains are known for. Whether you’re enjoying it for what it is, or blending with your THC-dominant strains, Dancehall adds something special and drastically underappreciate to any joint or bowl.” —Jeremiah Wilhelm\nBay Dream\nStrain type: Sativa\nParent strains: Blue Dream, Bay 11\nWhy it’s underrated: “Bay Dream is an uplifting strain with sharp citrus notes and subtle earthiness. It seems to be overlooked because of its polarizing parent strain, Blue Dream, but in combination with the sweet, skunky flavors and focused headspace of Bay 11 the mix is a pleasant surprise. I appreciate that Bay Dream trades some of Blue Dream’s fruit notes for a deeper, more poignant Kush-like palate of flavors. So, if you’re in the ‘Blue Dream is overrated’ crowd, don’t shy away from Bay Dream—you might be amazed by how much this strain expresses its individuality.” —Will Hyde\n\nSour Urkle\nStrain type: Hybrid\nParent strains: Sour Diesel, Purple Urkle\nWhy it’s underrated: “Sour Urkle is the potent union of pungent, polar opposites. Created from Sour Diesel and Purple Urkle, this funky and surprisingly affordable bud packs the best of both strains into one frosty package. This strain emits an odd floral and chemical aroma that is contrasted against a latent but tangible sweetness brought forth by the fruitiness of Purple Urkle. This flavor profile can be challenging for some, but the effects are undeniably heady while draping the body in a soothing, mellow aura.” —Jeremiah Wilhelm\nPresidential Kush\nStrain type: Indica\nParent strains: Bubble Gum, OG Kush\nWhy it’s underrated: “Easily one of the more picturesque strains I’ve come across, Presidential Kush (also known as Presidential OG) expresses itself with deep green and purple hues. A thick blanket of trichomes adds another dimension to the strain’s aesthetic, but PK is so much more than just a pretty flower. It’s a potent, complex, and flavorful experience that only takes a puff or two before you feel the comforting weight of deep relaxation wash over you. The piney, diesel flavors make it hard to put down, and I still find myself embarking on epic journeys just to track down this beautiful bud. In my opinion, genetics this compelling should be easier to find and should be garnering more attention in the cannabis community, so for that reason, I’d like to encourage more growers to add this strain to their stable, and if you find it at your local dispensary as a consumer, definitely do not overlook it!” —Will Hyde\n\nDurban Poison\nStrain type: Sativa\nParent strains: African\nWhy it’s underrated: “Landrace strains, including Durban Poison, are hard to find and often faked. As such, many people have had a less-enjoyable-than-average experience with a strain they believed, mistakenly, to be the landrace advertised on the packaging. Durban Poison is a fantastic pure sativa that many people, including myself, loved at first smoke, so if Durban Poison didn’t wow you the first time around, give it another chance—that first batch might have been something else that was merely masquerading as this iconic strain.” —Brett Konen\nApple Jack\nStrain type: Hybrid\nParent strains: Jack Herer, White Widow\nWhy it’s underrated: “Apple Jack hasn’t gained much in the way of ratings on Leafly, but that doesn’t mean it’s a dud. It blends two well-known cuts together (Jack Herer x White Widow) to create something greater than the sum of its parts. Apple Jack’s initially clear-headed high relieves stress while elevating the mind and encouraging creativity. The happy effects and accessible THC concentration make it a friendly flower for consumers of all potency levels. And even though its flavor doesn’t always live up the name, Apple Jack’s sweet, earthy terpene profile still offers satisfying flavors alongside a productive buzz.” —Jeremiah Wilhelm\n\nPlushberry\nStrain type: Indica\nParent strains: Black Cherry Soda, Space Queen\nWhy it’s underrated: “Plushberry is an incredible strain that’s underrated simply because it hasn’t appeared to travel beyond the Pacific Northwest. Wrapped in beautiful lavender foliage, it smells like sweet wildflowers and mixed berries, and if you have the chance to try it while you’re in the area, Plushberry is a strain you won’t soon forget.” —Bailey Rahn\nSkunk No. 1\nStrain type: Hybrid\nParent strains: Afghani, Acapulco Gold, Colombian Gold\nWhy it’s underrated: “Even if you don’t love the flavor of the flower itself, you’ve got to respect a strain that’s given us so many of our favorites on the market—I’m talking Green Crack, Island Sweet Skunk, Amnesia, Pineapple Chunk, UK Cheese, and so many more. Skunk No. 1 is a true original among cannabis strains, and while its skunky flavor is an acquired taste, you’re smoking a piece of history with Skunk No. 1—so respect your elders.” —Brett Konen",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/28103218/most-underrated-cannabis-strains.jpg",
            "title": "11 Unsung Cannabis Strains Worth Discovering",
            "urlslug": "/news/strains-products/11-underrated-marijuana-strains"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Fibromyalgia",
            "score": 27.490154644126406
        },
        {
            "name": "Anxiety",
            "score": 15.942272596292383
        },
        {
            "name": "PTSD",
            "score": 7.357602535779463
        },
        {
            "name": "ADD/ADHD",
            "score": 6.704447219287292
        },
        {
            "name": "Migraines",
            "score": 6.538757083853617
        }
    ],
    "description": "<p>Presidential OG (also called Presidential Kush) by Royal Queen Seeds is an <a href=\"http://leafly.com/indica\">indica</a> cross between <a href=\"http://www.leafly.com/hybrid/bubble-gum\">Bubble Gum</a> and <a href=\"http://leafly.com/hybrid/og-kush\">OG Kush</a>&nbsp;that&nbsp;definitely knows how to get your attention with its intense <a href=\"http://www.leafly.com/explore#!/explore/flavors-citrus\">citrus</a>-<a href=\"http://www.leafly.com/explore#!/explore/flavors-pine\">pine</a> smell. As far as taste goes,&nbsp;it maintains the pine flavor and heads into more <a href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\">earthy</a> terrain. Almost purely indica, this strain hits hard and fast with a <a href=\"http://www.leafly.com/explore#!/explore/tags-sleepy\">sedative</a>&nbsp;effect that make this a popular choice for those dealing with <a href=\"http://www.leafly.com/explore#!/explore/symptoms-insomnia\">insomnia</a> or <a href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\">stress</a>.&nbsp;</p>\n",
    "descriptionPlain": "Presidential OG (also called Presidential Kush) by Royal Queen Seeds is an indica cross between Bubble Gum and OG Kush&nbsp;that&nbsp;definitely knows how to get your attention with its intense citrus-pine smell. As far as taste goes,&nbsp;it maintains the pine flavor and heads into more earthy terrain. Almost purely indica, this strain hits hard and fast with a sedative&nbsp;effect that make this a popular choice for those dealing with insomnia or stress.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 119.70992219767554
        },
        {
            "name": "Sleepy",
            "score": 82.05023532801845
        },
        {
            "name": "Euphoric",
            "score": 40.61089232542503
        },
        {
            "name": "Hungry",
            "score": 37.868600518682165
        },
        {
            "name": "Uplifted",
            "score": 36.98011718374796
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 16.63865142637595
        },
        {
            "name": "Pungent",
            "score": 9.264239746422053
        },
        {
            "name": "Pine",
            "score": 8.4886178080876
        },
        {
            "name": "Citrus",
            "score": 8.402170780904811
        },
        {
            "name": "Woody",
            "score": 7.052636634329075
        }
    ],
    "growInfo": {
        "averageYield": "Medium",
        "difficulty": null,
        "environment": null,
        "floweringDays": 60,
        "growNotes": "\n\tPrefers a dry climate\n\n",
        "height": "Short",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1413941,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Only 2-3 vapes at bedtime, and my insomnia, restless leg syndrome, and tinnitus all goes away. Sleeping better than I have in years now.",
            "username": "mtsmylie"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1605664,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Really good for night time use if you’re sleepy be sure to have something to drink tho . The effects kick in kick after smoking this strain ",
            "username": "asapmarky14"
        }
    ],
    "id": 40175,
    "name": "Presidential OG",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 41.38651426375949
        },
        {
            "name": "Dry Eyes",
            "score": 31.024877533378156
        },
        {
            "name": "Headache",
            "score": 3.4218614926520026
        },
        {
            "name": "Dizzy",
            "score": 3.352223609643646
        },
        {
            "name": "Paranoid",
            "score": 2.281240995101335
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/bubble-gum",
            "category": "Hybrid",
            "name": "Bubble Gum",
            "permalink": "https://mobileapi.leafly.com/hybrid/bubble-gum",
            "slug": "bubble-gum",
            "subtitle": null,
            "symbol": "Bg"
        },
        {
            "applink": "leafly://strain/og-kush",
            "category": "Hybrid",
            "name": "OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/og-kush",
            "slug": "og-kush",
            "subtitle": null,
            "symbol": "Ogk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/presidential-og",
    "photoTotalCount": 57,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002395/b/presidential-og__primary_77b2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/presidential-og_100x100_6b8f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000486/b/presidential-og__primary_64b0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/presidential-og_100x100_0987.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639606/b/presidential-og__primary_a063.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/presidential-og_100x100_58a3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/604811/b/presidential-og__primary_6aa6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/presidential-og_100x100_de50.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/604876/b/presidential-og__primary_860a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/presidential-og_100x100_904f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/588080/b/presidential-og__primary_7d6b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/presidential-og_100x100_7f59.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Los Angeles, CA",
        "Seattle, WA",
        "Detroit, MI",
        "Spokane, WA",
        "Denver, CO",
        "San Francisco, CA",
        "Anaheim, CA",
        "Ann Arbor, MI",
        "Fremont, CA",
        "Hayward, CA"
    ],
    "rating": 4.47,
    "relatedStrains": [],
    "reviewCount": 317,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "presidential-og",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.47318611987382/240",
    "subtitle": null,
    "symbol": "Prs",
    "symptoms": [
        {
            "name": "Pain",
            "score": 43.78061665546057
        },
        {
            "name": "Stress",
            "score": 24.27480549418884
        },
        {
            "name": "Insomnia",
            "score": 18.754202286043608
        },
        {
            "name": "Depression",
            "score": 13.173566420132552
        },
        {
            "name": "Headaches",
            "score": 9.917395062914226
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
