{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1470524400000)/",
            "id": "contentitems-3033",
            "text": "Before the heat dies down and the sunsets start to shorten, it’s time to make the most out of your summer. And just as rosé is the perfect summer sipper, these 10 strains might as well have been bred expressly for summer fun with friends, whether out in the sun or under the stars.\nFrom sweet, citrusy sativas to sticky, sunset-hued hybrids, don’t miss a single one of the following cannabis strains this season.\n\nSchrom | Sativa\n \nAroma and flavor | Lemon-limey as a soda pop with extra squeezes of fresh-sliced citrus.\nExperience | Frequently tricky to hunt down, this 70% sativa delivers a breezy, buoyant, clear-headed elevation that’s completely worth the search. An axiom frequently uttered around the Leafly office: “Schrom is bomb.”\nWhat you need it for | Chilling on the back patio with your favorite people.\nIntake | Bong, with an ice pinch.\nGolden Pineapple | Hybrid\n \nAroma and flavor | Pineapple upside-down cake, fresh out of the oven, two inches from your nose. Somewhere nearby, a fruit basket overflows with papayas, ripe bananas, and mangoes.\nExperience | Gp is liquid sunshine, in the form of unadulterated happiness. You’ll want to dance, hum, and hug someone.\nWhat you need it for | Your friend’s backyard barbecue; pair it with a couple of teriyaki kebabs.\nIntake | Vaporizer that supports dry herb.\nRed-Headed Stranger | Sativa\n \nAroma and flavor | Subtly spicy, tangy and herbal.\nExperience | Zippy, jazzy, energetic.\nWhat you need it for | Day hike motivation. The view from the top of that mountain is going to look better than ever.\nIntake | Pipe, tincture, or baked into an edible.\nSunset Sherbet | Hybrid\n \nAroma and flavor | Sweetness underscores berry flavors on the inhale, then jumps out to steal the whole show on the exhale.\nExperience | GSC (f.k.a Girl Scout Cookies) may be legendary, but Sunset Sherbet is its heir apparent. The hybrid builds on Gsc’s all-star ancestry (grandparents: Cherry Pie, OG Kush, and Durban Poison), and weaves in a few indica-dominant characteristics all its own.\nWhat you need it for | A sandy beach at – you guessed it – sunset.\nIntake | Joint.\nIngrid | Indica\n \nAroma and flavor | Sweet, skunky, earthy.\nExperience | Not all indicas are made for summer, but Ingrid is the free-wheeling hippie kid who got cool in college, came home over summer vacation, and knocked everyone’s socks off. Side effects include a desire to snuggle up in a hammock and smile around at everyone and everything.\nWhat you need it for | Your next lakeside campout; break out a jar once you’ve settled by the campfire for the evening.\nIntake | Pipe.\nTangie | Sativa\n \nAroma and flavor | A tangerine dream come true. If aromas could drip citrus juice, this one would.\nExperience | Slow and shy to come on at first, Tg’s high tends to hit as soon as you look the other way. It’s a tingly rush of cool, creative energy, and you’re going to want to get up and do stuff.\nWhat you need it for | You know how you’ve been meaning to tackle that art project? Get on it.\nIntake | Concentrate; a li’l dab’ll do ya for the afternoon.\nSuper Silver Haze | Sativa\n \nAroma and flavor | Earthy with hints of pine, like gardening in an evergreen forest.\nExperience | With numerous coveted first-place awards, Ss is one of the most decorated strains out there, and its energetic, euphoric high is among the most classic. It’s a solid strain year-round, but its effects shine brightest from July through September.\nWhat you need it for | Your Labor Day backpacking trip.\nIntake | Pre-roll; no need to get fancy.\nJillybean | Hybrid\n \nAroma and flavor | Orange candy meets a creamsicle in a fruity, delicious flavor-splosion.\nExperience | Chatty and cheerful for hours on end.\nWhat you need it for | Sitting on your front porch (preferably on a porch swing) with a glass of iced tea in one hand.\nIntake | Time-to-time tokes off your concentrate pen.\nMercury OG | Indica\n \nAroma and flavor | Mer expresses a complex array of gorgeous floral characteristics; you’ll have a hard time taking your nose out of the jar long enough to load a bowl.\nExperience | Get ready to relax, breathe easy, and relish a deeply pleasurable body high.\nWhat you need it for | Your family vacation.\nIntake | Bong or dab rig – go for a big hit.\nPurple Trainwreck | Hybrid\n \nAroma and flavor | Think fragrant California wine grapes, freshly picked and about to be pressed.\nExperience | This bold yet balanced hybrid heightens everything you love about summer. There’s also a good chance it’ll bring on a bout of the giggles.\nWhat you need it for | An outdoor concert or afternoon of beach volleyball.\nIntake | Shatter, wax, or a classic joint.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/08/12001430/best-summer-cannabis-strains-2016.jpg",
            "title": "The 10 Cannabis Strains You Must Try This Summer",
            "urlslug": "/news/strains-products/best-summer-cannabis-strains-august-2016"
        },
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1465142400000)/",
            "id": "contentitems-3073",
            "text": "The fortitude demonstrated by cancer patients and survivors is truly remarkable. With numerous reviewers on Leafly using cannabis to combat the effects of various types of cancer, chemotherapy, and related medications, we’re constantly inspired by the positivity, bravery and determination that shines through their stories.\nWe honor these individuals by sharing a small sampling of the strains that have helped cancer patients deal with the physical, emotional, and psychological effects of their condition as they fight toward joining the ranks of hundreds of thousands of cancer survivors across the nation and around the world.\n\n AK-48\n“AK-48 has helped me in so many ways with respect to my cancer. My appetite has resumed as normal, I sleep GREAT, less depression, moments of bliss, less pain and increased level of hope for survival. It is, without a doubt, my personal favorite.” –Good-juju\n Ingrid\n“The first strain I tried for chemotherapy-induced nausea, vomiting and lack of appetite. After first use I went from nearly heaving at the thought of any food to craving – and eating – Mexican food (peppers and all).” –gobby\n ACDC\n“No brain fog, no paranoia, and doesn’t make me want to eat all of the things. I am in remission from cancer and this helps with remaining painful side effects.” –kamina\n Harlequin\n“This is, by far, one of my favorite medicinal strains…there is a complimentary THC content and effect that I find helpful as opposed to purely CBD strains. Mix it with some Sour Diesel (not enough to kill the CBD effects), vape away, and it’s my ‘morning coffee’ when on chemo.” –bravo2kilo\n Blueberry Kush\n“Every time I get this strain, I specifically save it for my friend with cancer. She says it’s her favorite for the pain.” –HebiMidori\n\n Flo\n“My left breast was diagnosed a couple months ago with breast cancer. Flo has me feeling better than I have in the two months…my body is relaxed. I did not realize how much tension I have been holding. The future looks better and easier at the moment. Wow.” –dataqueen11\n Mr. Nice\n“Using this for my back pain and for my golden retriever who has cancer. Works great for both of us!” –dyeager105\n Jack the Ripper\n“Absolutely fantastic sativa! One of the best strains I’ve had in the past 10 years. The high THC content will knock your socks off and the high lasts for 3-4 hours solid. I have brain cancer so I deal with different health issues…and this strain works extremely well controlling pain, nausea, and vertigo.” –jfu5129\n Blueberry\n“Super relaxing, pain relieving, joyful, floaty. I am a cancer survivor, have fibro, serious anxiety, and advanced degenerative disc disease and 17 herniated discs in my spine paired with scoliosis, and I feel like a carefree kid.” –DabaDharma\n \n Chemo\n“My mom is going through chemotherapy…She suffers from extreme appetite loss, nausea and abdominal discomfort from the chemotherapy. She says this strain is incredible for nausea, probably the best she has ever used and induced a great appetite for her instantly. I haven’t seen her in that much relief regarding nausea in ages.” –rachels95\n Black Jack\n“This strain has been like a little miracle in my life. Cancer treatment related pain keeps me from sleeping most nights. I literally was pain free for the entire evening allowing me to finally sleep for the first time in weeks. I’m grateful for Black Jack!!!” –karmagirl\n Sour Diesel\n“I love this strain a lot. I find myself in my own little creative world, giggling, always forgetting what I was doing then remembering…zoning out to music by Soundgarden (“Black Hole Sun”)…I always smoke with my dad because he gets real funny when he’s medicated. He has cancer so it’s better seeing him happy then depressed and in pain. Speaking of, I think he is lost in the kitchen wondering about which entrée he should devour next. I’m gonna go stop him before he eats us out of house and home, or most likely, I will end up eating a tub of ice cream along side him.” –Thecode007",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001531/celebrate-cancer-survivors-day-with-real-patients-go-to-strains.jpg",
            "title": "These Cancer Survivors Share Their Preferred Cannabis Strains",
            "urlslug": "/news/strains-products/celebrate-cancer-survivors-day-with-real-patients-go-to-strains"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Spinal Cord Injury",
            "score": 56.03942652329749
        },
        {
            "name": "Anxiety",
            "score": 28.028673835125446
        },
        {
            "name": "Migraines",
            "score": 13.046594982078853
        },
        {
            "name": "PTSD",
            "score": 12.885304659498207
        },
        {
            "name": "Arthritis",
            "score": 7.329749103942652
        }
    ],
    "description": "<p>Ingrid is a lesser-known indica, but it&rsquo;s growing in popularity as consumers begin to discover this gem of a strain. This plant can be grown indoors or out, but produces higher yield indoors with flowers appearing around 5 to 7 weeks. The buds are dense, tightly bound flowers with very little loose greenery. Perhaps most striking are the flowers&rsquo; nearly neon green color. The neon buds emit a skunky aroma and induce a typical indica-strong body effect.</p>\n",
    "descriptionPlain": "Ingrid is a lesser-known indica, but it&rsquo;s growing in popularity as consumers begin to discover this gem of a strain. This plant can be grown indoors or out, but produces higher yield indoors with flowers appearing around 5 to 7 weeks. The buds are dense, tightly bound flowers with very little loose greenery. Perhaps most striking are the flowers&rsquo; nearly neon green color. The neon buds emit a skunky aroma and induce a typical indica-strong body effect.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 146.0752688172043
        },
        {
            "name": "Happy",
            "score": 79.9641577060932
        },
        {
            "name": "Euphoric",
            "score": 75.53763440860214
        },
        {
            "name": "Sleepy",
            "score": 74.9820788530466
        },
        {
            "name": "Hungry",
            "score": 67.07885304659499
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 64.01433691756273
        },
        {
            "name": "Lavender",
            "score": 50.32258064516129
        },
        {
            "name": "Skunk",
            "score": 24.641577060931898
        },
        {
            "name": "Cheese",
            "score": 24.31899641577061
        },
        {
            "name": "Pungent",
            "score": 20.215053763440856
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1397671,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "The first strain i tried for chemotherapy-induced nausea, vomiting and lack of appetite.\r\n\r\nAfter first use i went from nearly heaving at the thought of any food to craving - and eating - Mexican food (peppers and all).\r\n\r\nTherefore i think this strain is God.\r\n\r\n",
            "username": "gobby"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1579770,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Instant head high and completely relaxed with no paranoia. ",
            "username": "CJ101"
        }
    ],
    "id": 350,
    "name": "Ingrid",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 66.11111111111111
        },
        {
            "name": "Dizzy",
            "score": 56.03942652329749
        },
        {
            "name": "Anxious",
            "score": 50
        },
        {
            "name": "Dry Eyes",
            "score": 3.225806451612903
        },
        {
            "name": "Paranoid",
            "score": 0.4838709677419355
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/uk-cheese",
            "category": "Hybrid",
            "name": "UK Cheese",
            "permalink": "https://mobileapi.leafly.com/hybrid/uk-cheese",
            "slug": "uk-cheese",
            "subtitle": null,
            "symbol": "Uk"
        },
        {
            "applink": "leafly://strain/hash-plant",
            "category": "Indica",
            "name": "Hash Plant",
            "permalink": "https://mobileapi.leafly.com/indica/hash-plant",
            "slug": "hash-plant",
            "subtitle": null,
            "symbol": "Hp"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/ingrid",
    "photoTotalCount": 15,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/523161/b/ingrid__primary_5dda.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ingrid_100x100_7261.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/520906/b/ingrid__primary_538e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ingrid_100x100_33eb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/395531/b/ingrid__primary_0051.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ingrid_100x100_9b5e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/383625/b/ingrid__primary_b922.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ingrid_100x100_4bbc.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/330191/b/ingrid__primary_9930.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ingrid_100x100_c660.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/309963/b/ingrid__primary_9b6a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/ingrid_100x100_ba80.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Las Vegas, NV",
        "Los Angeles, CA",
        "Denver, CO",
        "San Jose, CA",
        "Aurora, CO",
        "Pueblo, CO",
        "San Francisco, CA",
        "Sparks, NV",
        "Vallejo, CA"
    ],
    "rating": 4.33,
    "relatedStrains": [],
    "reviewCount": 126,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "ingrid",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.33333333333333/240",
    "subtitle": null,
    "symbol": "Ing",
    "symptoms": [
        {
            "name": "Pain",
            "score": 86.32616487455196
        },
        {
            "name": "Stress",
            "score": 68.85304659498209
        },
        {
            "name": "Depression",
            "score": 20.215053763440856
        },
        {
            "name": "Inflammation",
            "score": 18.763440860215052
        },
        {
            "name": "Insomnia",
            "score": 14.74910394265233
        }
    ],
    "testGraph": "https://leafly.s3.amazonaws.com/strains/testing/GqTQwuQCReecSmXBZSSO_ingrid.png",
    "videoUrl": null,
    "weakDescription": false
}
