{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1465740000000)/",
            "id": "contentitems-3135",
            "text": "It’s important to celebrate our heroes. Real or imaginary, these men and women help us define our ideal selves. Sometimes these heroes are imbued with superhuman abilities, like the power of flight or telepathy, but much of the time, the attributes that make a superhero are inherently human. Heroes are characters that stand up for the weak and defenseless. They go beyond the call to raise up their fellow man. Heroes are not indestructible, but simply willing to give more of themselves without the need of thanks or admiration.\nYes, heroes are among us and within us, and on this day devoted to Superman, the Übermensch, I’ve curated a shortlist of strains that will imbue you with superhuman sensations that will hopefully enable you to do something heroic…or at least conquer the villainous forces of laziness and depression. Up, up, and away!\n \nAllen Wrench\n \n“This strain is pow!!! Gets you a super uplifting high with a great taste and smooth smoke not very harsh at all even when the bowl is almost ass and still tastes good and the smell is unbelievable super earthy citrus and could smell it from across my house, great strain won’t regret.” – sillbillybro\n \nMaui\n \n“Beautiful strain came on subtle and took over my whole body for a wonderful ride. I have permanent nerve damage due to an IED this stuff makes me feel like superman.” – Dungy51\n \nKryptonite\n\n“Yup. So that’s what Superman feels like when he is flying. I got a top shelf, frosty, extra strength dose of this stuff. I hit in a vape… Pure, tasty and then BOOM! This stuff is no joke. . .tread lightly.” – Rhobert\n \nSuperman OG\n \n“Faster than a speeding bowl-hit, more powerful than locomotive, it’s Superman OG! This wax is dank. Be sure to get it while it lasts at Delta-9 Association in San Jose.” – tgigrass\n \nIncredible Hulk\n \n“Very tasty, high energy strain. Perfect morning smoke to get your day started and the creative juices flowing, but smoke any more than a bowl and it hits you like a train with an incredibly strong cerebral high. Oh, and have some snacks ready because this shit is guaranteed to give you some extreme munchies.” – absentia882\n \nChemdawg\n \n“8/10: I like this one a lot. She’s very much like an OG Kush but more leaning on the lighter side in terms of effects. She’s not gonna get ya stoned out ya brains, but what she does offer you is a nice full body high and the ability to eat 1,467,279 cheeseburgers and fries. So smile, relax, and just know everything’s gonna be just fine J” – beelzebub\n \nCinderella 99\n \n“‘I am, I am, I am Superman, and I can do anything’… are not just lyrics from the R.E.M. song, but that’s how you will feel after smoking Cinderella 99. I felt like Superman flying over Market Street in San Francisco. It was an uplifting feeling. When I came back down to earth, I got wobbly legs and a pretty bad case of paranoia, all the people on the sidewalk with their shopping bags, the street performers were making me feel dizzy. That lasted maybe five minutes, then I felt like that first time you got baked, I mean really high. Time slows down, and you feel like everyone in the world knows you’re high. Fun times. I highly recommend for absolutely eliminating anxiety, stress, and aches and pains, just don’t overdo it. Go easy with this one.” – blackhawks15\n \nWhile these strains might not make you leap over a building in a single bound, shoot lasers out of your eyes, or tear a phone book in half, they should pack a physical stimulation that encourages a sense of wellbeing that traverses the sativa/hybrid/indica continuum. Each strain is suited for a series of semi-heroic deeds that may include making a cape out of bed sheets or other household objects, jumping on a trampoline while wearing said cape, and donning a fist-forward flying motion while walking/running anywhere. Go forth, do good, and live on!\n“I’m not a prophet or a stone aged man, just a mortal with potential of a superman. I’m living on.” – David Bowie",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001722/heroes-among-us-7-cannabis-strains-that-make-you-feel-like-superm.jpg",
            "title": "Heroes Among Us: 7 Cannabis Strains That Make You Feel Like Superman",
            "urlslug": "/news/strains-products/heroes-among-us-7-cannabis-strains-that-make-you-feel-like-superm"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1431100800000)/",
            "id": "contentitems-3401",
            "text": "New strains are in, and they're in sore need of user reviews! You can find out where to get them by navigating to their strain pages and checking the \"Availability\" tab. Or, if you've tried them already, share your thoughts in a review. \nThere are more new varieties waiting in the Leafly Explorer, so don't forget to check those out, too!\n \n  1. Sour Poison\n\nSour Poison is a sativa-dominant hybrid of Sour Diesel and Durban Poison genetics. The sweet, earthy aroma invites you to get closer, while the interplay of pine, berry, and diesel flavors of Sour Poison bring an energetic and uplifting rush that motivates the mind. The euphoric effects of Sour Poison settle into relaxing laziness as the buzz tapers.\n\n \n  2. The Sister\n\nThe Sister is an 80/20 indica-dominant strain that is said to be a rare “sister” cut of Chemdawg. Although led by indica genetics, The Sister provides uplifting, clear-headed euphoria that leaves the mind awake and nimble for creative endeavors while also kick-starting the appetite. Like her sister, this strain takes on a sweet citrus and sour diesel aroma.\n\n \n  3. Royal Haze\n\nRoyal Haze (or Royale Haze) by Dinafem Seeds is a mostly sativa strain bred from Skunk, Haze, and Northern Lights genetics. Taking after her Haze parent, this sativa inherits a spicy citrus flavor and buzzing, energetic effects that keep you alert and productive throughout the day. Outdoor growers will appreciate her flexibility and resilience even when the temperature drops, although her 10-11 week flowering cycle demands a bit of patience.\nAn autoflowering rendition of Royal Haze was bred by Royal Queen Seeds, who mixed Amnesia Haze, Skunk, and a ruderalis strain. Its effects are similarly energizing and cerebral.\n\n \n  4. Wreckage\n\nWreckage, bred by TH Seeds, is a sativa-dominant cross between Trainwreck and SAGE that provides an energetic, happy escape from stress, fatigue, and bad moods. Combining flavor profiles from both parents, Wreckage takes on a fresh menthol and herbal sandalwood aroma.\n\n \n  5. Mazar Kush\n\nMazar Kush is an indica-dominant hybrid cross between Afghani and Mazar I Sharif, two age-old indica strains originating from the Afghanistan-Pakistan region. This strain delivers powerfully relaxing effects to both body and mind, making it a good choice for late night use or for after-work unwinding.\n\n \n  6. Cherry Durban Poison\n\nCherry Durban Poison is a hybrid strain that brings a unique cherry flavor profile to the high-energy qualities of Durban Poison. True to its sativa roots, Cherry Durban Poison delivers a rush of cerebral euphoria that lifts the mood without clouding the mind.\n\n \n  7. White Kryptonite\n\nWhite Kryptonite is an indica-dominant strain that descends from Kryptonite and White Widow. The powerful euphoria dealt by White Kryptonite borders on hypnotic and trance-like at times, making this strain a good choice for meditative, introspective evenings.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/05/12002359/new-strains-alert-sour-durban-the-sister-wreckage-royal-haze-and.png",
            "title": "New Strains Alert: Sour Poison, The Sister, Wreckage, Royal Haze, and More",
            "urlslug": "/news/strains-products/new-strains-alert-sour-durban-the-sister-wreckage-royal-haze-and"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "PTSD",
            "score": 43.85227634511302
        },
        {
            "name": "Anxiety",
            "score": 34.350525310410696
        },
        {
            "name": "Arthritis",
            "score": 20.859598853868196
        },
        {
            "name": "Migraines",
            "score": 7.776185928048392
        },
        {
            "name": "Bipolar Disorder",
            "score": 3.4224769181789236
        }
    ],
    "description": "<p>A mysterious clone-only hybrid, Kryptonite is rumored to be a cross between <a href=\"https://www.leafly.com/hybrid/mendocino-purps\">Mendocino&nbsp;Purps</a> and <a href=\"https://www.leafly.com/hybrid/killer-queen\">Killer Queen</a> created by breeders at the Bay Area&rsquo;s famed Oaksterdam University. Known to produce THC levels up to of 25%, this indica-dominant strain is a good choice for those seeking to treat serious pain without the extreme sleepiness associated with some pure indicas. Kryptonite features a musty tropical fruit smell and a sweet, sugary flavor reminiscent of <a href=\"http://www.leafly.com/hybrid/cinderella-99\">Cinderella 99</a>, one of the parent strains to Killer Queen.&nbsp;</p>\n",
    "descriptionPlain": "A mysterious clone-only hybrid, Kryptonite is rumored to be a cross between Mendocino&nbsp;Purps and Killer Queen created by breeders at the Bay Area&rsquo;s famed Oaksterdam University. Known to produce THC levels up to of 25%, this indica-dominant strain is a good choice for those seeking to treat serious pain without the extreme sleepiness associated with some pure indicas. Kryptonite features a musty tropical fruit smell and a sweet, sugary flavor reminiscent of Cinderella 99, one of the parent strains to Killer Queen.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 115.88825214899714
        },
        {
            "name": "Happy",
            "score": 90.81821076090418
        },
        {
            "name": "Euphoric",
            "score": 61.41037886023559
        },
        {
            "name": "Tingly",
            "score": 54.119707099649794
        },
        {
            "name": "Uplifted",
            "score": 53.92072588347659
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 51.77172874880611
        },
        {
            "name": "Earthy",
            "score": 28.13435211716014
        },
        {
            "name": "Pine",
            "score": 24.35370900986947
        },
        {
            "name": "Citrus",
            "score": 23.279210442534225
        },
        {
            "name": "Pungent",
            "score": 22.435530085959886
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kZ3iwRmPT5O6arIA05kqrPWjazc=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2fdZCCCxYREQnXfPfK6mXSTpqotAY%3d%2f120x120%2fhttps%253A%252F%252Fs3.amazonaws.com%252Fleafly%252Fbin%252FGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1399064,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Far and away THE BEST strain ever for sex. Extremely similar head space and tactile sensations to LSD. Amplifies your sense of touch exponentially making it perfect for sex, massages, spas, etc. Immense feelings of empathetic connectivity allows allows you to enjoy giving as much as receiving - which, is no small benefit!\n\nAbsolutely ZERO anxiety in any situation. Capable...with juuuust the right amount of clarity to stay comfortable and confident. Super easy to let your mind wander into spacy places - again, all like LSD.\n\nIt does have a strong cozy, sedating, and lazy effect so may not be the best for early in the day, parties, or slower movies. Best paired with a low key, minimal effort-based activity that accentuates your sense of touch. Take a bath, get a massage, lie on the beach, sex, etc...and I promise you'll have one of the best high experiences of your life.",
            "username": "weazal"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1635069,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I like the taste. It's also very smooth. Very relaxing and carefree. ",
            "username": "16king"
        }
    ],
    "id": 170,
    "name": "Kryptonite",
    "negatives": [
        {
            "name": "Dizzy",
            "score": 21.361031518624642
        },
        {
            "name": "Dry Mouth",
            "score": 16.698503661254378
        },
        {
            "name": "Dry Eyes",
            "score": 8.277618592804838
        },
        {
            "name": "Paranoid",
            "score": 0.8595988538681949
        },
        {
            "name": "Headache",
            "score": 0.5730659025787965
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/mendocino-purps",
            "category": "Hybrid",
            "name": "Mendocino Purps",
            "permalink": "https://mobileapi.leafly.com/hybrid/mendocino-purps",
            "slug": "mendocino-purps",
            "subtitle": null,
            "symbol": "Mp"
        },
        {
            "applink": "leafly://strain/killer-queen",
            "category": "Hybrid",
            "name": "Killer Queen",
            "permalink": "https://mobileapi.leafly.com/hybrid/killer-queen",
            "slug": "killer-queen",
            "subtitle": null,
            "symbol": "Kq"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/kryptonite",
    "photoTotalCount": 100,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002694/b/kryptonite__primary_be19.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/kryptonite_100x100_08d2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002121/b/kryptonite__primary_8c8f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/kryptonite_100x100_eff8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/634286/b/kryptonite__primary_0477.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/kryptonite_100x100_4544.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/631086/b/kryptonite__primary_4aeb.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/kryptonite_100x100_6d58.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/600248/b/kryptonite__primary_eb9f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/kryptonite_100x100_a5c2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/595629/b/kryptonite__primary_7239.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/kryptonite_100x100_e7ec.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Los Angeles, CA",
        "China",
        "San Francisco, CA",
        "Fremont, CA",
        "Hayward, CA",
        "Oakland, CA",
        "Santa Cruz, CA",
        "San Jose, CA",
        "Anaheim, CA",
        "Berkeley, CA"
    ],
    "rating": 4.27,
    "relatedStrains": [],
    "reviewCount": 279,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "kryptonite",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.27240143369176/240",
    "subtitle": null,
    "symbol": "Kry",
    "symptoms": [
        {
            "name": "Pain",
            "score": 74.99522445081183
        },
        {
            "name": "Stress",
            "score": 73.07704552690227
        },
        {
            "name": "Depression",
            "score": 69.13721744667303
        },
        {
            "name": "Insomnia",
            "score": 53.56255969436485
        },
        {
            "name": "Fatigue",
            "score": 41.93409742120344
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
