{"sl_translate":"description,descriptionPlain,category","id":143503,"slug":"dr-funk","name":"Dr. Funk","subtitle":null,"symbol":"Drf","category":"Indica","description":"\u003cp\u003eDr. Funk is a mostly \u003ca href=\"http://www.leafly.com/explore/category-indica\"\u003eindica\u003c/a\u003e strain that balances genetics from \u003ca href=\"http://www.leafly.com/indica/blueberry\"\u003eBlueberry\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/indica/bubba-kush\"\u003eBubba Kush\u003c/a\u003e. You can taste this strain\u0026rsquo;s lineage as flavors of \u003ca href=\"http://www.leafly.com/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore/flavors-berry\"\u003eberry\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore/flavors-earthy\"\u003eearthy\u003c/a\u003e sharpness activate on the exhale. Its tight, compact buds and orange hair-like pistils are obscured under a thick dusting of crystal \u003ca href=\"http://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\"\u003etrichomes\u003c/a\u003e, which hint at Dr. Funk\u0026rsquo;s potency.\u003c/p\u003e\n","descriptionPlain":"Dr. Funk is a mostly indica strain that balances genetics from Blueberry and Bubba Kush. You can taste this strain\u0026rsquo;s lineage as flavors of sweet berry and earthy sharpness activate on the exhale. Its tight, compact buds and orange hair-like pistils are obscured under a thick dusting of crystal trichomes, which hint at Dr. Funk\u0026rsquo;s potency.\n","aka":"Dr Funk, Doctor Funk, Sweet Funk","rating":4.5,"highlightedReviews":[{"id":1384795,"username":"Camels78","text":"I wanted to find a strain that \"ticked\" all the boxes of what I wanted from a strain.  I\u0027d never tried this before yesterday and it was a wonderful experience.  It hit hard at first, got my coughing out of the way and then just hours of enjoyment.  Smelled like stanky-lemons but man my Gf and I just laughed and laughed.  Like rolling around on the floor laughing at each other and how high we were.  Then we showered and the Arousal part of this strain got the best of us and it was dirty and playful.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1567124,"username":"LunarPhantom","text":"I was having quite a bit of a problem looking for a strain that didn\u0027t induce paranoia. I have high anxiety, so I knew I had to find the perfect indica strain.\n\nAnd let me tell you, I found the right damn strain.\n\nThere isn\u0027t that much of a head high. However, the effect on your body is amazing. You feel a bit numb, as if you\u0027re floating on a cloud. I have the time of my life cooking and playing video games with this strain. This feeling lasts me about 3 hours. At the end of the night? It\u0027ll be the best sleep you\u0027ll ever have.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3373","title":"New Strains Alert: Professor Chaos, Ice Queen, Sour Urkle, Cheese Candy, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1425661200000)\/","text":"This week\u0027s new strains are in, Professor Chaos is here to bring destruction to your pain, and those needing a lesson in relaxation may consult Dr. Funk. You novelty-seekers are probably wondering what Pineapple Dog Shit is all about — it\u0027s likely the only strain on this list with a more unusual flavor combination than Cheese Candy.\nWe\u0027re pleased to inform our friends in Oregon that many of these strains are available right out your back door in Portland (be sure to say hello to the good folks of Oregon House of Herbs for us!). As for the rest of you non-Oregon folks, check the \"Availability\" tab on their strain pages to see if any of these varieties are offered in your area.\n \n   1. Professor Chaos\nCharacteristics of Professor Chaos:\n\nProfessor Chaos is what you get when you combine the malevolent forces of Mad Scientist and Jack the Ripper, two strains that balance energy with merciless painkilling properties. This 65/35 sativa-dominant hybrid from TGA Genetics has a sour, spicy aroma that introduces its clear-headed effects perfect for patients needing a potent medicine without sacrificing productivity. Its buds form knobby, finger-like calyxes covered in a snow-like layer of crystal trichomes in a show of Professor Chaos’ supervillain strength.\n\n \n   2. Dr. Funk\nCharacteristics of Dr. Funk:\n\nDr. Funk is a mostly indica strain that balances genetics from Blueberry and Bubba Kush. You can taste this strain’s lineage as flavors of sweet berry and earthy sharpness activate on the exhale. Its tight, compact buds and orange hair-like pistils are obscured under a thick dusting of crystal trichomes, which hint at Dr. Funk’s potency.\n\nAvailable at Oregon House of Herbs\n \n   3. Ice Queen\nCharacteristics of Ice Queen:\n\nIce Queen is a hybrid strain that crosses White Widow and Cinderella 99 in a sativa-heavy blend fit for royalty. Its light, loose buds are powdered with frost-like resin that blankets the buds like fresh snowfall. One whiff of Ice Queen fills your nose with a sweet bouquet of lavenderrose aromas accented by subtle pepper notes. Another variety of Ice Queen was once bred by No Mercy Seeds, who combined Master Ice and Valley Queen; however, you may find this rendition harder to come by in today’s market.\n\nAvailable at Oregon House of Herbs\n \n   4. Paris XXX\nCharacteristics of Paris XXX:\n\nParis XXX is an extension of the Paris OG family that has placed in multiple Cannabis Cup competitions. This indica variety combines Headband OG, Chemdawg, and OG Kush genetics, creating a crisp, piney, and woody flavor on inhale. The fast-acting effects provide a balance of cerebral stimulation and full-body relaxation. Paris XXX is known to increase your appetite while also sparking creativity.\n\n \n   5. Pineapple Dog Shit\nCharacteristics of Pineapple Dog Shit:\n\nPineapple Dog Shit is a hybrid strain that may not sound appetizing, but its elite parentage of Pineapple Punch and Chemdawg 4 is enough to draw connoisseurs of old school genetics. Its name is derived from its sour, tar-like aroma that could arguably be compared to canine byproduct, but one look at this hybrid’s knobby, dense, crystal-covered buds may convince you to push past its unconventional aroma. For those of you less interested in the novelty of Pineapple Dog Shit, we reassure you that the taste is a more pleasant blend of sweet tropical and citrus flavors.\n\nAvailable at Oregon House of Herbs\n \n   6. Sour Urkle\nCharacteristics of Sour Urkle:\n\nSour Urkle is a hybrid cannabis strain that unites Sour Diesel and Purple Urkle, whose opposing sativa and indica genetics meet in a balanced and flavorful fusion. Hints of berry fight through the dominant skunky diesel smell of Sour Urkle, creating a complex aroma that will have you fighting your friends for the first taste. Its dense, rounded buds are caked in crystal-tipped trichomes that try their best to hide Sour Urkle’s deep purple coloration to no avail.\n\nAvailable at Oregon House of Herbs\n \n   7. Cheese Candy\nCharacteristics of Cheese Candy:\n\nCheese Candy by Delicious Seeds is the hybrid lovechild of Cheese and Caramelo, a combination of parent strains that results in an unusual fusion of sweet candy and sharp cheese flavors. The sweet and sour aroma is accented by flowery, fruity flavors which usher in Cheese Candy’s deeply relaxing characteristics. Its long, slender buds are wrapped in fiery orange hairs that stand in vibrant contrast to this hybrid’s sage green hues.\n\nAvailable at Oregon House of Herbs","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/03/12002322/new-strains-alert-professor-chaos-ice-queen-sour-urkle-cheese-can.png","urlslug":"/news/strains-products/new-strains-alert-professor-chaos-ice-queen-sour-urkle-cheese-can"}],"reviewCount":42,"flavors":[{"name":"Berry","score":2.1739130434782608},{"name":"Blueberry","score":2.1739130434782608},{"name":"Earthy","score":1.6304347826086956},{"name":"Cheese","score":1.6304347826086956},{"name":"Sweet","score":1.0869565217391304}],"effects":[{"name":"Relaxed","score":32.065217391304344},{"name":"Happy","score":30.434782608695652},{"name":"Tingly","score":28.260869565217391},{"name":"Aroused","score":27.717391304347828},{"name":"Sleepy","score":27.717391304347828}],"symptoms":[{"name":"Stress","score":4.3478260869565215},{"name":"Insomnia","score":3.2608695652173911},{"name":"Pain","score":2.7173913043478262},{"name":"Depression","score":1.6304347826086956},{"name":"Headaches","score":1.6304347826086956}],"conditions":[{"name":"Anxiety","score":3.2608695652173911},{"name":"ADD/ADHD","score":1.0869565217391304},{"name":"Arthritis","score":1.0869565217391304},{"name":"Fibromyalgia","score":1.0869565217391304},{"name":"Hypertension","score":1.0869565217391304}],"negatives":[{"name":"Dry Mouth","score":27.717391304347828},{"name":"Dry Eyes","score":25.543478260869566},{"name":"Headache","score":25}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dr--funk_100x100_8e3a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/460117/b/dr--funk__primary_735d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dr--funk_100x100_2447.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/447987/b/dr--funk__primary_80bd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dr--funk_100x100_1768.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/414413/b/dr--funk__primary_8a61.jpg"}],"photoTotalCount":3,"popularCities":["Portland, OR","Brookings, OR","Des Moines, WA","Newport, OR"],"permalink":"https://mobileapi.leafly.com/indica/dr-funk","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.5/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Blueberry","subtitle":null,"slug":"blueberry","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/blueberry","symbol":"Bry","applink":"leafly://strain/blueberry"},{"name":"Bubba Kush","subtitle":null,"slug":"bubba-kush","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/bubba-kush","symbol":"Bk","applink":"leafly://strain/bubba-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
