{
    "aka": "deathstar, deathstar",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1500678718000)/",
            "id": "contentitems-34642",
            "text": "Welcome to The High Score, where we explore the creative, immersive intersections of cannabis and gaming through reviews, product pairings, and more. Check out more installments of The High Score series here.\n\nWho could forget the feeling of tearing back wrapping paper to reveal the box of the legendary Nintendo 64? Children foamed at the mouth with rabid euphoria, an emotion few of us have been able to replicate in our adult lives. At this very moment, my Nintendo 64 remains plugged in alongside the Nintendo Switch, Xbox One, and Playstation 4. My love for this console is undying, especially as an adult who regularly enjoys reverting to a childlike state with the help of cannabis.\nI know I’m not alone when I say that N64 games are some of the best to return to as a stoned adult. Sure, the graphics make everything and everyone look a bit polygonal, and yes, the controller’s design still puts you at risk for carpal tunnel. But many of the games released are some of the best of all time (in my humble and completely biased opinion). So grab your pipe, your favorite strain, and your dusty old N64 (…or a simulator) and let’s get gaming.\nThe Legend of Zelda: Majora’s Mask\n\nStrain Pairing: Aliens on Moonshine – because that’s who/what I suspect designed this game to begin with. Its disorienting euphoria is also a perfect companion for this game’s strange, strange world.\nIt’s weird, it’s dark, it’s creepy, and it’s absolutely the most captivating N64 game to play while high. The Legend of Zelda: Majora’s Mask will make you feel like you’re in an alien’s nightmare with creatures and characters that look like they came from the deepest depths of some deranged imagination. And as you look up into the sky to find an evil, grinning, wide-eyed moon slowly descending to crush the entirety of mankind, you might wonder how you ever got through this game as a child without a calming indica strain.\nPokémon Snap\n\nStrain Pairing: Cheese – Get it? You’re a photographer, so. (…Eh, I’ll see myself out.)\nNow for something a little more lighthearted. Return to the world of Todd Snap, a photographer commissioned by Professor Oak, to go out and take photos of Pokémon doing adorable, whimsical things. Smoke up and try your best not to dissolve into a puddle of smiles and “dawww’s” as you bonk Charmander in the head with an apple or make Snorlax do the truffle-shuffle to the sound of your PokéFlute.\nThe Legend of Zelda: Ocarina of Time\n\nStrain Pairing: Timewreck – which basically sums up the musical-based time travel of this game; plus, the stimulating euphoric effects will have you immersed for hours.\nYes, another Zelda game. I know. But both Legend of Zelda games released on N64 were utter masterpieces. For me, Ocarina of Time demonstrates the tallest heights of creativity in gaming, from character design to music to plot to atmosphere. With a soundtrack so enchanting it’s been performed several times by symphonies around the world, this game’s story revolves around the power and mystery of song. Its characters range from darkly disturbing to endearingly hilarious, and they’ll lead you through Hyrulian lore so imaginative, leaving it will feel a lot like waking up from a dream.\nMario Party\n \nStrain Pairing: Death Star – because guess what, you’re fighting to the death to become what Toad calls the “Superstar.” This indica will help slow time down, for better or for worse. You decide.\nOh, I remember the days when us third-graders would order a pizza and have ourselves a little Mario Party. Things haven’t changed much (other than adding a dab rig to the table), and even though there are now nine sequels to the game that started it all in 1998, I’m still forever loyal to the original. It’s simple and nostalgic, and who doesn’t love a little friendly* competition with friends?\n*Disclaimer: this game can actually get vicious, so play at your own risk.\nMario Kart 64\n\nStrain Pairing: Jet Fuel – this hybrid enhances performance through its focusing effects, and you can pretend it makes you zoom faster, too.\nWhether or not you liked video games growing up, you probably remember some kid from your childhood forcing you to play Mario Kart 64 with him/her. And admit it, you had fun. Adding a layer of strategy through an artillery of shells, slippery bananas, and lightning bolts that shrink your enemies, Mario Kart 64 is much more than just a racing game. (Diddy Kong Racing and Star Wars Episode I: Racer were also great and you should play them, too.)\nGoldeneye 007\n\nStrain Pairing: AK-47 – because I think I remember guns being in this game (duh), and AK-47 is a magnificent hybrid strain that’ll ground you solidly in the couch while zoning in focus.\nFirst-person shooters existed long before Goldeneye 007, but this game definitely provided many with their first experience in the genre. Whether you’re a skilled marksman or a hot mess spewing aimless bullets (me), Goldeneye 007 offered a playground of tactics from guns to grenades to landmines.\nBanjo-Kazooie \nStrain Pairing: Transformer – a sharp cerebral strain perfect for gaming, Transformer also makes sense thematically when Banjo is given the option to transform into a walrus, a pumpkin, and, for some reason, a washing machine.\nBanjo-Kazooie’s a puzzle platformer that is easy enough to enjoy while stoney baloney, and it arguably stands the test of time. You’re a shirtless bear who keeps a loudmouthed, cynical bird stuffed in his backpack. That’s Kazooie, and she’ll emerge now and then to poop out combat eggs or verbally accost other characters. The levels are sensibly designed and manageable in size, meaning you won’t be wandering anywhere long enough to forget where you’re going or what you’re doing.\nSuper Mario 64\n\nStrain Pairing: Skywalker – Lose yourself to your couch with this heavy indica strain as you fly around the Mushroom Kingdom skies with your little winged cap.\nThe first game ever released for the Nintendo 64, Super Mario 64 is immortalized by nostalgia. For us kids who grew up exclusively with side-scrolling Mario games, walking into this 3D world felt a lot like the first time I tried cannabis: a new dimension opened, colors became brighter, and ohh snap, I can also fly. Super Mario 64 may feel a bit aged after Super Mario Sunshine and Super Mario Galaxy, but there will always be a timelessness to this game as the first of its kind.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/21103111/nintento-64-1.jpg",
            "title": "The High Score: The Best Nintendo 64 Games to Revisit as a Stoned Adult",
            "urlslug": "/news/lifestyle/best-n64-video-games-to-play-high"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1498320011000)/",
            "id": "contentitems-32138",
            "text": "Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Death Star is a clone-only strain that has been around since the early 2000s. This indica-dominant hybrid strain, which is a potent combination of Sensi Star and Sour Diesel, offers sedating effects while retaining the Sour Diesel flavor. A popular strain in the Midwest and on the East Coast, Death Star’s THC content consistently pushes past 20%.\nGrow Techniques: Death Star tends to hit its highest THC levels when grown in soil with organic nutrients. Grow indoors and patiently train the plant, as the Sour Diesel sativa qualities will make Death Star take off. This strain is suitable for the SCROG (screen of green) method, as the buds grow dense and small.\nFlowering Time: 9 weeks\nYield: Moderate\nGrow Difficulty: Moderate\nClimate: Grows best between 68-80 degrees Fahrenheit. Keep moisture and humidity low.\nIndoor/Outdoor: Death Star grows best indoors or in a greenhouse, as its dense nugs are susceptible to rot from excessive moisture.\nFeeding: Death Star prefers light feeding. Get the soil healthy and strong before planting by adding worm castings, chicken manure, perlite, and watering with compost tea.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/23161426/death-star-cannabis.jpg",
            "title": "Tips for Growing Death Star Cannabis",
            "urlslug": "/news/growing/how-to-grow-death-star-marijuana"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 44.53135859583019
        },
        {
            "name": "PTSD",
            "score": 13.627947752392922
        },
        {
            "name": "ADD/ADHD",
            "score": 9.877211315686443
        },
        {
            "name": "Arthritis",
            "score": 9.306794321193918
        },
        {
            "name": "Bipolar Disorder",
            "score": 6.5082486159338435
        }
    ],
    "description": "<p><span style=\"line-height: 20.7999992370605px;\">Death Star is the potent cross of&nbsp;</span><a href=\"http://www.leafly.com/indica/sensi-star\" style=\"line-height: 20.7999992370605px;\"><span class=\"s1\">Sensi Star</span></a><span style=\"line-height: 20.7999992370605px;\">&nbsp;and&nbsp;</span><span class=\"s1\" style=\"line-height: 20.7999992370605px;\"><a href=\"http://www.leafly.com/sativa/sour-diesel\">Sour Diesel</a>&nbsp;and&nbsp;</span><span style=\"line-height: 20.7999992370605px;\">has the shared sativa and indica effects of its parents. It&nbsp;has a mixed taste that combines sweet, skunk, and fuel aromas into a very potent fragrance that isn&rsquo;t easy to hide. This strain may not have the ability to destroy planets, but it does have quite the powerful buzz. Effects can be slow to onset, but once they do, Death Star takes away all cares and replaces them with a state of relaxed euphoria. Great for daytime or nighttime use, this Ohio native now has fans throughout the galaxy.</span></p>\n",
    "descriptionPlain": "Death Star is the potent cross of&nbsp;Sensi Star&nbsp;and&nbsp;Sour Diesel&nbsp;and&nbsp;has the shared sativa and indica effects of its parents. It&nbsp;has a mixed taste that combines sweet, skunk, and fuel aromas into a very potent fragrance that isn&rsquo;t easy to hide. This strain may not have the ability to destroy planets, but it does have quite the powerful buzz. Effects can be slow to onset, but once they do, Death Star takes away all cares and replaces them with a state of relaxed euphoria. Great for daytime or nighttime use, this Ohio native now has fans throughout the galaxy.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 92.34970655743186
        },
        {
            "name": "Happy",
            "score": 56.265443803112845
        },
        {
            "name": "Euphoric",
            "score": 55.61575255546723
        },
        {
            "name": "Sleepy",
            "score": 52.17298498996166
        },
        {
            "name": "Hungry",
            "score": 35.12829705843675
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 30.298914204767566
        },
        {
            "name": "Diesel",
            "score": 24.046369758778646
        },
        {
            "name": "Pungent",
            "score": 21.329681177075148
        },
        {
            "name": "Sweet",
            "score": 13.046299582677118
        },
        {
            "name": "Skunk",
            "score": 12.238153546809635
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": "Easy",
        "environment": null,
        "floweringDays": 61,
        "growNotes": "\n\tPrefers moderate amounts of fertilizer\n\tMay express fruity or diesel-smelling phenotypes\n\tTrains well as a multi-branched plant or with sea of green (SOG) operations\n\tAverage yield falls between 25-30 grams per plant\n\n",
        "height": "Short",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1418573,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "After i smoked this I felt a great disturbance in the Force, as if millions of neurons suddenly cried out in terror and were suddenly silenced. I fear something terrible has happened.",
            "username": "skoodge"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1642609,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "great for pain and sleep. kinda smells and tastes like grapes? ",
            "username": "glassy.gabby"
        }
    ],
    "id": 1501,
    "name": "Death Star",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 37.50890884109417
        },
        {
            "name": "Dry Eyes",
            "score": 28.033140813895827
        },
        {
            "name": "Paranoid",
            "score": 9.596578135316019
        },
        {
            "name": "Dizzy",
            "score": 6.5464893430542235
        },
        {
            "name": "Anxious",
            "score": 6.11167866782967
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/sour-diesel",
            "category": "Sativa",
            "name": "Sour Diesel",
            "permalink": "https://mobileapi.leafly.com/sativa/sour-diesel",
            "slug": "sour-diesel",
            "subtitle": null,
            "symbol": "Sd"
        },
        {
            "applink": "leafly://strain/sensi-star",
            "category": "Indica",
            "name": "Sensi Star",
            "permalink": "https://mobileapi.leafly.com/indica/sensi-star",
            "slug": "sensi-star",
            "subtitle": null,
            "symbol": "Sen"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/death-star",
    "photoTotalCount": 220,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/indica/death-star/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/indica/death-star/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003390/b/death-star__primary_6439.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/death-star_100x100_44cc.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/650186/b/death-star__primary_058c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/death-star_100x100_ada8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645738/b/death-star__primary_ef76.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/death-star_100x100_da71.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/642962/b/death-star__primary_f5d3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/death-star_100x100_6560.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/638961/b/death-star__primary_4037.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/death-star_100x100_491e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/614827/b/death-star__primary_0c4e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/death-star_100x100_4350.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Denver, CO",
        "Toronto, ON",
        "Portland, OR",
        "Montréal, QC",
        "Calgary, AB",
        "Vancouver, BC",
        "Bellingham, WA",
        "Detroit, MI",
        "Edmonton, AB"
    ],
    "rating": 4.54,
    "relatedStrains": [],
    "reviewCount": 1103,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "death-star",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.5403445149592/240",
    "subtitle": null,
    "symbol": "Ds",
    "symptoms": [
        {
            "name": "Stress",
            "score": 39.99422621626205
        },
        {
            "name": "Depression",
            "score": 32.65141805957981
        },
        {
            "name": "Insomnia",
            "score": 32.154805930840254
        },
        {
            "name": "Pain",
            "score": 24.234300758876564
        },
        {
            "name": "Nausea",
            "score": 16.031408004004238
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
