{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Zoe Wilder",
            "category": null,
            "date": "/Date(1504733187000)/",
            "id": "contentitems-40571",
            "text": "Back in February, Portugal. The Man (PTM) keyboardist Kyle O’Quin made a sophisticated splash into the Oregon cannabis industry by combining classical piano with craft cannabis in a rare performance at the historical Harry McCormick House in Portland.\n\nPart of the Live at HiFi concert series that’s hosted acts such as Stephen Malkmus of Pavement and China Forbes of Pink Martini, this particular evening was dubbed Higher Education. The purpose was to create an environment where, according to O’Quin, “Artists can share their love of their art, whether it be music or painting or writing, using our collective understanding of cannabis as the platform for a cross-disciplinary examination.”\n\nThe world-class pianist, inspired by Leonard Bernstein’s The Unanswered Question lecture series, impressed the intimate crowd with his command of the keys, knowledge of music history, and keen sense of humor while pounding out sweet melodies by Beethoven, Chopin, and Debussy, under the influence and alongside his adorable dog, Boo Boo. The evening was a precursor to the release of a custom pre-roll blend designed to pair with PTM’s single “Feel It Still” off the new album Woodstock.\nEnamored of PTM’s recent music and cannabis collaborations, Leafly spoke with Kyle O’Quin about Woodstock and weed.\n \n\nLeafly: While no one seems to know the origin of the name Portugal. The Man, I’m told there’s a chance cannabis had something to do with its creation. Is that true?\nKyle O’Quin: I can most definitely assure you the band name wasn’t a result of a smoke session. It was just an alter ego, honestly. It’s always freeing as an artist to have an alter ego. We were never … just one person, but a band. So, a country is a group of people that have one voice in the world. That’s the period. He’s just a dude we made up. We wanted you to know that he is, in fact, the man.\nWhat’s PTM’s relationship with cannabis?\nOh, I’d say our relationship is nothing short of healthy. No alternative facts here.\n\nDo you toke during jam sessions or before a performance?\nWe used to. Well, a few of us [did], especially me and our drummer Jason … John and Zach didn’t smoke as much back then. This is actually the reason why we still don’t smoke to this day before we play.\nA long time ago, I did what I do best, I got Jason nice and ripped before the show. During the breakdown in a song, he just forgot what song we were performing. It was dead silence. Maybe because I was stoned too, but it was so fucking quiet for what seemed like the longest five seconds ever. Jason looked over at Zach like:\n“What are we doing?”\n“It’s the break.”\n“Ooohhh…”\n“Count us back in, J.”\n“OK.”\n[pause]\n“Wait, which song?”\nAnd, this is my favorite part—he clicks off one, two, three, four. Then, we all came back in playing. Jason just kept clicking on five, six, seven, eight. We laugh about it now, but I can trace our not smoking onstage to that night exactly.\nKyle O’Quin performs during Higher Education at The Harry McCormick House in Portland. (Courtesy of Mirifoto)\nWhile cannabis can spur creativity, it’s not always best for getting shit done.\nI think people have a common misconception about creativity and drug use when it comes to songwriting: Anyone who’s really creative doesn’t need drugs to be creative. But [cannabis] can be a great tool, as opposed to a crutch.\nIt gives me endurance sometimes, a few extra hours I didn’t think I had in me at the end of the day. It helps you put on the blinders and focus in on something better while being able to zone other things out, which is fucking great if you’re sitting in your room alone playing piano or mumbling a melody into a phone at 2 a.m. with an acoustic guitar.\n\n\nBut it’s a different story when you’re playing live. We do a lot of jamming and for that to work, we have to take the blinders off and be even more aware of what everyone else is doing. We all have to be in the same mindstate on stage. We like to set up as close as possible. We’re kind of one unit working together, not a five-part machine. That’s actually the best explanation I can give for the difference in our smoking habits on stage versus off stage.\nAre you a fan of eating your cannabis?\nI actually make pretty fucking good cookies, not gonna lie. I use off the shelf chocolate chip Ghirardelli brand cookies and people always say that the cookies are delicious, not just that they get you high, which is always a plus.\nNot sure if it’s true, or a rumor I once heard, so maybe someone can back this up: Before I put my herb in the butter, I put it in a little foil envelope and cook it in the oven for about five minutes on 250 degrees. Just before it changes color or at the first sight of it, I pull it out.\n\nAh, yes, decarboxylation.\nI was told it’s supposed to make them more potent by activating the cannabis. I’m not sure, but I’ve been doing it for years and getting pretty high.\nEdibles are a toss-up for me. Now [with cannabis legal] they’re better regulated than the good ol’ fashioned homemade cookies. It used to always be, “I can’t feel it” or “I can’t fucking move.” I never liked that inconsistency.\nWhat was it like to be in the studio with Mike D of Beastie Boys fame for the making of your album Woodstock?\nIt was such an eye-opening experience for us. We wouldn’t be a band if wasn’t for the Beastie Boys, so it’s pretty personal because we grew up on that shit, literally. Getting insight into their creative process … it’s just so spontaneous. Write about what’s happening right now. What we did today! Drinking beers in the Pavilion’s parking lot. Put it in the lyrics! We’re like, “What?!?”\nAnd then, you realize that’s totally what made them the Beastie Boys. It’s this ‘capture the moment’ vibe that so prominent in hip hop and it’s just not even there anymore when it comes to rock music. Mike really inspired us to make sure we made something reflective of everything we’re all seeing around us every day, to always be willing to try something new, and to dive into the deep end when we do.\nCare to share another story involving cannabis or Mike D?\nThis producer John Goodmanson produced Iron Flag for Wu-Tang [and once told me], “Do not smoke Wu-Tang’s weed!” Not sure if it was laced or what the deal was. Anyways, Mike said he learned that the hard way. I remember him saying he was at John Lennon and Yoko’s apartment in New York where his famous white piano is located, and he got way too high, fell asleep on their couch, and woke up embarrassed. I don’t remember if Wu-Tang was there and if it was their weed, but I’d like to think it was.\nPTM and HiFi Farms at Serra in Portland with the “Feel It Still” pre-roll.\n“Feel It Still” is a super catchy tune. On 4/20, you announced a custom blended pre-roll designed to pair with that song. Tell us about it.\nHonestly, as a band, we’ve never smoked more weed. Why the fuck not make your own blend? Both of the strains we used are hybrids, but honestly both lean toward the sativa side to me. “Feel It Still” is a summer song. The strain can’t weigh you down like a heavy indica high. It’s got to be a light, uplifting, fun, outdoor vibey, summer, fucking ‘fun in the sun’ weed. Not to mention the [nod to our album] in using Headband: For those who haven’t smoked it, it kind of hits you right in the middle of the forehead and you can feel it a little by your temples. It feels like you’re wearing a headband. There’s not much closer of a reference we could make to Woodstock [cough] than Headband.\n\nIt was one of the coolest experiences watching you match classical musicians with different strains. Will you recount a few for our readers?\n\nThe concept was based off Leonard Bernstein’s explanation of music through language in his lectures on The Unanswered Question where it seemed easier to talk about something complicated using something we all know about. He compared music to Chomsky’s analysis of language and it sparked something, this idea of cross discipline.\nClassical music always seems stuffy, so I thought it would be fun to wear jeans and a t-shirt, smoke weed, cuss, and talk about classical music only in terms of cannabis. For example, Rachmaninoff Prelude Op. 3 No. 2 was paired with Critical Mass, which has a 1:1 ratio of THC to CBD. The way THC and CBD activate each other is reflective of the dynamics in the piece being either as loud as you can play or as soft as you can play. The louder or softer you play, the more the dynamics play off each other.\nSince [Critical Mass] is a 1:1 ratio, it’s not as high in THC [as other strains], which is what I love about it. It’s a very restrained high. When you hear recordings of Rachmaninoff play his own music, it’s always more restrained than anyone else plays it. This restrained quality being at the heart of his music couldn’t be more in common with the restrained high Critical Mass offers. [And] still, he is heavy as fuck and this [strain] is no doubt an indica.\nI recall some fun Beethoven comparisons, too…\nI played Beethoven’s Pathetique Sonata (1799), arguably the first romantic piece of music, and paired it with Blue Dream—an award-winning hybrid to show how Beethoven was the ultimate hybrid composer. He blended the Classical era into the Romantic like a fucking badass.\nThe next concert will include a Beethoven cello and piano Sonata where the cello player will be “playing the indica strain” because the cello is the same range as the voice and is very in touch with the body. I’ll be “playing the sativa strain” on the piano (the cerebral high tinkly shit) and together we’ll be a hybrid, et cetera, et cetera, et cetera…\n\nI know it’s important for PTM to raise awareness for reasonable drug policy. Are you involved in any other initiatives to meet this goal?\nFirst, I smoke weed every single day. Then, there are other things: At that classical concert, we donated the money to a local organization called My Voice Music that helps younger kids write and record their own music as a way of dealing with mental issues … it’s important to show that cannabis can help fund art programs for our communities and youth.\nWe addressed a bunch of social issues in our video for “Feel It Still” and part of the toolkit was a link to Drug Policy Alliance, a reputable organization fighting the War on Drugs. It’s odd that there’s an opiate epidemic that’s killing insane amounts of people and yet, federally speaking cannabis is such a threat on paper … hmmm.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/09/06140424/portugal-the-man-1.jpg",
            "title": "The Spark: Portugal. The Man’s Kyle O’Quin on Creativity and Pairing Beethoven With Blue Dream",
            "urlslug": "/news/lifestyle/portugal-the-man-kyle-o-quin-marijuana"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1463850000000)/",
            "id": "contentitems-3023",
            "text": "Fibromyalgia is a difficult condition to live with, but as we’ve learned from Leafly reviewers, cannabis can offer respite. It makes sense when you look at some of the symptoms fibro sufferers face:\n\nJoint pain\nFatigue\nDepression and anxiety\nTenderness and generalized pain\nInsomnia\nInability to focus\n\n\nThere isn’t a lot of research on cannabis as a treatment for fibromyalgia, but clinical studies using synthesized THC for symptom management shows promising results. Still, there’s plenty of anecdotal evidence in Leafly’s strain reviews alone to show that cannabis is certainly providing much needed relief to many of those willing to experiment. These 10 strains, according to our user-submitted strain data, seem to be doing the trick.\nKeep in mind, relief is not limited to these strains alone. There a lot – and we mean a lot – of strains that can treat pain, fight fatigue, reduce depression and anxiety, sharpen focus, and crush insomnia. Consider trying other high-CBD strains, or cannabis in various other forms like edibles, topicals, or ingestible oils. Everyone’s body is different, so the key is to try different strains and products to see what works best for you.\n\n \nBlue Dream\n \nGiven the sheer volume of strain reviews available for Blue Dream, it’s no wonder that we found so many positive reports associated with this sativa-dominant hybrid from fibro patients. However, that’s not a reason to discount the therapeutic potential of this coveted berry-flavored flower; Blue Dream is known to exhibit high levels of the relaxing terpene myrcene as well as CBG, a cannabinoid known to reduce inflammation and fight insomnia. Not only that, Blue Dream delicately lifts the mood to new heights, letting you forget about the aches and worries that were keeping you down.\n“Blue Dream is my go-to strain for my everyday fibromyalgia pain and muscle spasm medicine, it is gentle enough to use [every] day and throughout the day. It is a nice hybrid, with the muscle spasm easing effects of [an] indica, and the euphoric, headache easing effects of a sativa without anxiety effects. I use it when I wake up to get moving, and even use it to help me sleep.” – craig_DC\n \nHarlequin\n \nWith the painkilling power of THC and CBD combined, this sativa is the perfect way to start your day. If you’re sensitive to THC, you’re in luck: Harlequin’s high-CBD content helps curb the psychoactive and anxious side effects of THC, letting you go about your day without that dizzying euphoria that some unaccustomed users find distracting or unpleasant.\n“I take three puffs and get a wonderful body high that takes my pain away. It’s not that I don’t notice it anymore…it feels like it’s gone. It makes me SO happy to not feel my pain. Note that I have fibromyalgia and degenerative disc in my lower back, to for me to not be feeling my pain seems like somewhat of a miracle.” – chasmyn\n \nCannatonic\n \nIn further testament to the power of high-CBD strains, Cannatonic is the third most celebrated strain from Leafly users with fibromyalgia. It’s only mildly psychoactive due to its CBD dominance, making it an excellent choice for new users. However, even veterans will appreciate this hybrid’s ability to crush pain, anxiety, muscle spasms, and a myriad of other symptoms.\n“I am taking this for Fibromyalgia. This has been the most helpful strain I have found in clearing my mind. Less mind clutter leads to more mental and physical energy.” – bearcubb\n \nCritical Mass\n \nCritical Mass is a heavy indica strain whose tingly full-body effects radiate throughout the body, swiftly bowling down pain and stress. This strain sometimes expresses itself with enhanced levels of CBD for even better pain relief. Also preferred for treating depression, insomnia, and muscle spasms, Critical Mass is definitely a strain you’ll want in your medicine cabinet.\n“My body felt nice and relaxed for the first time in [I don’t know] how long and for sure helped me sleep. Helped with my TMJ too! If you have fibromyalgia issues like I do it’s definitely one to try!” –IrisLight\n \nTahoe OG\n \nThis is the strain you’ll need for when your fibromyalgia symptoms are keeping you up at night. Tranquilizing and dreamy, Tahoe OG is an indica-dominant strain that leads muscles into blissful relaxation, melting the pain and tension out of them.\n“This will give the pain killing effects need for heavy pain, as well as give a sedative effect, so one can go to sleep. [It’s] one of the top ten strains I use for my condition.” – savagec3\n \nGranddaddy Purple\n \nGuiding you into relief with a sweet berry and grape flavor, Granddaddy Purple is a classic indica strain with potent painkilling properties. Like Blue Dream, GDP boasts high levels of myrcene and CBG to help relax muscles and control pain. Not only does this sweet-tasting indica treat physical symptoms, its pacifying euphoria loosens the grip of stress, anxiety, and depression to help you stay positive.\n“I finally decided to roll a joint of this and some Tahoe OG, and now I’m free of cramps, muscle spasms, shooting pain, nausea, anxiety, etc…It’s rare that I find a strain that will completely help with medical problems, but also help me be happy, become more creative, and stay awake.” – GanjaGoddess410\n \nGSC (f.k.a Girl Scout Cookies)\n \nCoveted for its potency, flavor, and quality of effect, it’s no wonder that fibro patients also found something to love about this award-winning hybrid. GSC (f.k.a Girl Scout Cookies) is known to have a high THC content, so if you’re new to cannabis or sensitive to THC, be sure to dose low and slow with this hybrid powerhouse.\n“I bought this strain for pain relief and it worked quite well. I suffer from fibro & arthritis and after smoking this for the first time, it seemed to work as well as some pain pills.” – TONYROSEITTI\n \nBlueberry\n \nIndicas are wonderful pain relievers, but it isn’t often you find one with a flavor as strong and sweet as Blueberry. Named for its unmistakable ripe berry aroma, this indica delivers a nuanced effects that mellows everything from physical pain to emotional anguish caused by fibromyalgia.\n“Was in so much body pain today due to fibromyalgia, so I picked up Blueberry wax this afternoon…can safely say this is the best strain for body and migraine pain I’ve tried so far. I melted into my bed, very dreamy effect.” – cholladay\n \nBubba Kush\n \nThe symptoms of fibromyalgia are multifaceted, but thankfully, so are the effects of Bubba Kush. Muscles relax. Eyelids heavy. The mind goes from a running pace to walking. Bubba Kush bestows its gift of relief alongside a sweet, earthy coffee aroma with subtle woody notes that will keep you coming back for more even after your symptoms subside.\n“Helps me sleep great which is godsend for severe fibromyalgia…working great for my awful bee stinging feeling nerve pain!” – Anonymous\n \nHeadband\n \nNamed for its hugging cerebral sensations some refer to as the “halo effect,” Headband is a favorite for those suffering from headaches. But that’s not the only type of relief this fragrant hybrid has to offer. Headband’s rich terpene profile gives rise to a spectrum of benefits, including stress reduction, mood enhancement, a feeling of wakefulness and focus, and muscle relaxation.\n“It’s a great strain, knocked out my knee pain that is causing a fibromyalgia flare up. It’s definitely is easing the flare up as well and the migraine associated with it.” – Paraleash",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/05/12001409/best-cannabis-strains-for-fibromyalgia.png",
            "title": "Best Cannabis Strains for Fibromyalgia",
            "urlslug": "/news/strains-products/best-cannabis-strains-for-fibromyalgia"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 29.64694575421605
        },
        {
            "name": "Bipolar Disorder",
            "score": 17.836036064738117
        },
        {
            "name": "PTSD",
            "score": 13.970174376619514
        },
        {
            "name": "Migraines",
            "score": 10.294539314387663
        },
        {
            "name": "Arthritis",
            "score": 9.603059555668834
        }
    ],
    "description": "<p>Critical Mass is a combination of <a href=\"https://www.leafly.com/indica/afghani\">Afghani</a> and <a href=\"https://www.leafly.com/hybrid/skunk-1\">Skunk #1</a> that originated from the breeder Mr. Nice Seed Bank. With a large &quot;critical mass&quot; of production, branches tend to snap from the weight of these dense buds. Flowering time is approximately 6-8 weeks, with a heavy leaf to flower ratio. However, due to the large production of flowering, this strain is susceptible to mold which can be reduced by growing indoors to reduce humidity. THC levels of this strain may reach 19-22%.</p>\n",
    "descriptionPlain": "Critical Mass is a combination of Afghani and Skunk #1 that originated from the breeder Mr. Nice Seed Bank. With a large &quot;critical mass&quot; of production, branches tend to snap from the weight of these dense buds. Flowering time is approximately 6-8 weeks, with a heavy leaf to flower ratio. However, due to the large production of flowering, this strain is susceptible to mold which can be reduced by growing indoors to reduce humidity. THC levels of this strain may reach 19-22%.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 97.8829488976679
        },
        {
            "name": "Happy",
            "score": 57.914781657533666
        },
        {
            "name": "Sleepy",
            "score": 53.682272418333966
        },
        {
            "name": "Euphoric",
            "score": 47.40386453421689
        },
        {
            "name": "Hungry",
            "score": 38.66405951318975
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 42.14853871968055
        },
        {
            "name": "Woody",
            "score": 36.95971921328746
        },
        {
            "name": "Sweet",
            "score": 33.01314727496708
        },
        {
            "name": "Pungent",
            "score": 16.99959644874899
        },
        {
            "name": "Spicy/Herbal",
            "score": 16.73569517012871
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": "Easy",
        "environment": null,
        "floweringDays": 56,
        "growNotes": "",
        "height": "Medium",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1417917,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I currently have a brain tumor and this was recommended to help as it had a high cbd and wasn't too high of a thc for me being new to the game( and obviously unwell)  I also currently have been suffering from a horrible speech impediment that sounded like a female Forest Gump/stroke patient and I had had that problem from the tumor. I took two small hits off this strain and for four hours my completely normal speech came back!!!!! My leg arm and face numbness and tingling disappeared. I felt happy ( even though they just told me I've got a frigging brain tumor this  morning ) I got to talk to my daughter for her birthday in my normal voice and not scare her which made her so happy because she thought I was all better and at least healing! And it gave me hope!!!! I was not super high- I felt pleasant, functional, energetic, and ready to fight this fight for my family and I! Honestly- I could be a poster child for marijuana- if you hear my voice not on the weed and immediately following one or two hits!?!? Night and day!!!!! It was a miracle! That's what it can do for my nerve tissue in my brain then I don't doubt it's helping my tumor as well! God I didn't wait for the doctors to get their crap together they are still working on making phone calls.... I'm sure they will catch up to me at some point... Eye roll. Maybe by the time they actually get surgery scheduled I won't have much left 😜\n",
            "username": "yagamax"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/-Y0rXr5MuLTa88YG_QFaZjghyvA=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2f0Mn5z7ArSWlmGP0SmgdUX7TRyCE%3d%2f120x120%2fhttps%253A%252F%252Fddd33q3967xhi.cloudfront.net%252Fnfq-08rk4unU_wfoDJnK5Pts1ps%253D%252F120x120%252Fhttps%25253A%25252F%25252Fs3.amazonaws.com%25252Fleafly%25252Fbin%25252FjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1639314,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "And on the 7th Day GOD made “ CRITICAL MASS “ !!!!!!!!!\nStandard Farms came through with what I have to put in my TOP FIVE!!!!!!\nThe last 30+ years has been hard....sure other have it worse so I deal best I can but with suck GIFTS like CRITICAL MASS, BLUEBERRY, BLUEBERRY SPACE CAKE! GORILLA GLUE#4 and the list goes on....and yes DONT for get the Sativas n Hybrids, but be careful as some can be HEADY n if your gift is to be pain free, relaxed n hungry..then BUY CRITICAL MASS!!!\n\nAs you can see by my reviews I prefer INDICAS, but that is for medicinal reasons....so let’s doscuss them.\nI have friends who have dibilitaling migraines, I have severe back pain I’m bed ridden 4 of 7 days...others have RA eating at there joints.....when you live like this..you need help for some quality of life.Relief of pain will get rid of another dozen side effects to that go with PAIN.\nYpu dnt need me to tell ya them...if your like me...your living em.\nI was at Woodstock and remember strains like Northern Lights, Panama Red, Acapulco Gold....so to find something like CRITICAL MASS...again THIS Is a DOUBLE PANTRY STOCK!!!\nWhat does that mean.....\nI NEVER HAVE LESS THAN FOUR OF THESE CARTRIDGES ON HAND!!!! \n\nCritical Mass is the MORPHINE of marijuana WIThout the side effects, addiction.\nI waited awhile to find this, but when I did there was NO hesitation to grab 10cartridges.....they have kept me spasm free for the past three nights, alllowing me to eat, sleep..it ALL comes together....CRITICAL MASS has taken me from the fetal,position in pain and 10hits later I can go in ,y studio and sit down n play some blues.\nThis strain is more than just for pain....this strain seems to look for what’s ailing you and makes you feel better.\n\nI just have one question....why are you still sitting here?\nGO find this and buy at least 5 cartridges!!!...btw u WILL B BACK!!!! \n\nbe careful to much of this with couch lock ya.....but for me...if I’m couch locked...I’m Pain free...then IM ON HAPPY SOB!!!\n\nPlease get yourself some CRITICAL MASS.......you’ll have it in your pantry!!!\nfeel better,, Peace\n\nVoodoo Idol",
            "username": "VoodooIdol"
        }
    ],
    "id": 4500,
    "name": "Critical Mass",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 51.78677626269062
        },
        {
            "name": "Dry Eyes",
            "score": 46.8007943587783
        },
        {
            "name": "Dizzy",
            "score": 25.87493628138142
        },
        {
            "name": "Anxious",
            "score": 12.731909222208063
        },
        {
            "name": "Paranoid",
            "score": 11.460722781530096
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/afghani",
            "category": "Indica",
            "name": "Afghani",
            "permalink": "https://mobileapi.leafly.com/indica/afghani",
            "slug": "afghani",
            "subtitle": null,
            "symbol": "Afg"
        },
        {
            "applink": "leafly://strain/skunk-1",
            "category": "Hybrid",
            "name": "Skunk No. 1",
            "permalink": "https://mobileapi.leafly.com/hybrid/skunk-1",
            "slug": "skunk-1",
            "subtitle": null,
            "symbol": "Sk1"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/critical-mass",
    "photoTotalCount": 155,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/672751/b/critical-mass__primary_232d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/critical-mass_100x100_6bb8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/656141/b/critical-mass__primary_f450.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/critical-mass_100x100_777d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/621259/b/critical-mass__primary_2140.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/critical-mass_100x100_8e25.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/618380/b/critical-mass__primary_f55d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/critical-mass_100x100_ff4a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/591499/b/critical-mass__primary_c23c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/critical-mass_100x100_3ba7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/584142/b/critical-mass__primary_f31d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/critical-mass_100x100_276e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Seattle, WA",
        "Denver, CO",
        "Eugene, OR",
        "Toronto, ON",
        "Calgary, AB",
        "Edmonton, AB",
        "Bend, OR",
        "Ottawa, ON",
        "Beaverton, OR"
    ],
    "rating": 4.24,
    "relatedStrains": [],
    "reviewCount": 697,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "critical-mass",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.24246771879483/240",
    "subtitle": null,
    "symbol": "Cm",
    "symptoms": [
        {
            "name": "Stress",
            "score": 62.13069750647806
        },
        {
            "name": "Pain",
            "score": 53.037652393696106
        },
        {
            "name": "Depression",
            "score": 47.76971560256574
        },
        {
            "name": "Insomnia",
            "score": 37.484601333843074
        },
        {
            "name": "Inflammation",
            "score": 30.941628435495517
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
