{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Dante Jordan",
            "category": null,
            "date": "/Date(1504357217000)/",
            "id": "contentitems-40272",
            "text": "Vegas sucks. You know it; I know it; everyone knows it. Vegas is a booze-soaked money grab that if you’ve done once, you’ve done a million times. Yet every time the season rolls around, we all find ourselves booking that room at The Cosmopolitan (best beds of all time) as if we expect it to be different this time around.\nSpoiler alert: This time around it will be different. Because there’s legal weed to be had. Now that Nevada has legalized recreational cannabis use for adults 21 and up, switch your cocktails for cannabinoids and learn how to actually have fun in this city.\nStep one: Hit a dispensary. There are many. I was able to check out two solid ones during my recent visit:\n\nThe Apothecary Shoppe. Product suggestions: Big Smooth (flower), Las Vegas Haze (pre-roll), Chocolate Chip Cookies (edibles).\nEssence Vegas. Product suggestions: Power Plant (pre-roll), Travel Joint (pre-roll), Cadillac Purple (flower).\n\nStep two: Find a place to consume. I’d strongly advise against smoking in your hotel room (unless you’re staying in one of these ones). Of course, public consumption remains illegal, so I’d also strongly advise against that too. However, I will say that there may or may not be a staircase behind Mandalay Bay that no one EVER walks by or through. I will also say that it may OR MAY NOT be the most perfect spot in all of Vegas to enjoy the flowers of your labor. But, you know, that’s only if it exists, which it may or may not.\nStep three: Indulge in one of the following activities. In no particular order, we give you the best things to do as a high cannabis tourist in Las Vegas.\nEat at Nacho Daddy\nIf you do nothing else, make sure to eat at Nacho Daddy. My boy Sutton put me on game and it was the greatest decision I made that whole weekend. $15 won’t get you much in Vegas, but at Nacho Daddy it gets you a big-ass plate of filet mignon (cause I’m fancy like that) nachos that’ll have you feeling like maybe calories aren’t such a bad thing.\nWander Old Vegas and Fremont Street\n(Jacek_Sopotnicki/iStock)\nUp until this last trip, I’d never been to the famous “Old Vegas” that I’d heard so much about. Oh boy is it an experience. It’s the only place I’ve ever been where, within a 437-step distance, you can see a near-naked man dressed as a baby, followed by two white dudes with dreads battle rapping, followed by a bum dropping a deuce by the sunglasses kiosk like the world is his oyster. If you’re planning to a trip to Las Vegas, do yourself a favor, and take a trip downtown for the most Bruh, I’m Way Too High For This Shit experience that the city has to offer.\nWalk the Vegas Strip\nObviously, right? If you touch Vegas and don’t wander aimlessly down the Strip (and then realize it’s actually a lot longer than it looks and now you’re so far from your hotel that you need to catch a Lyft back because your thighs are on fire), then did you really touch Vegas?\nGet high and go on a walk down this street and you’ll find ample bright lights, photo opportunities, and enough street entertainment to keep you busy all night long. Plus there’s hella trash food for you to stop and grab, which is all my happiness requires.\nBacchanal Buffet at Caesars Palace\n(Cybernesco/iStock)\nSpeaking of food, eat at a buffet. Every hotel has one, but if you want the best one? Bacchanal Buffet in Caesars Palace is the answer, my pals.\nThe bad news is that it’ll cost you 50 whole entire dollars, but the good news is they have lobster eggs Benedict and mac and cheese AT THE SAME DAMN TIME. And chicken and waffles. And an entire dessert station. They have it all. Get high, hit BB, and don’t stop eating until you feel $50 of satisfaction in your stomach. I saw a guy take off his shoes and get comfortable because he was full, but hadn’t recouped his money in food yet. Be like that American hero.\nPool Party\nEncore reigns supreme, but honestly, each pool party or beach club offers the same experience: overpriced drinks that never hit because the sun is killing your buzz, and pools of water that are probably half chlorine and half gonorrhea.\nBut hey, at least whatever DJ they booked is playing an excessive amount of UNTZ UNTZ UNTZ, right? RIGHT?! Wrong, but the reason these make the list is because they’re excellent for getting high and people-watching. Trust me.\nDrais Nightclub\n(gruizza/iStock)\nThis is the one club that I’ll absolutely swear by in Vegas. So many artists have residencies here that on any given night you might catch Trey Songz or somebody in concert for the lowest Vegas price possible ($40 for women, $70 for men). I saw Tory Lanez there, and he put on one of the best live shows I’ve ever seen. A friend of mine saw Jeezy there. Last time, I was supposed to go see T.I. but ended up getting too high and passing out. Shout out to Cadillac Purple.\nSee a Show\nVegas shows will hit you for a grip, but in all fairness, so will everything else. At least with these you get some kind of worthwhile return on investment, in the form of a live performance and new experience.\nI’ve only seen the Jabbawockeez and the Blue Man Group, but I can promise you that both of these shows are worth the high, ESPECIALLY the Blue Man Group. They don’t talk, they just make noise and do physical humor. Perfect stoner activity.\nGo Skydiving\n(Rene_Keller/iStock)\nEver gotten super-stoned, then dropped out of a plane with another man strapped to your back? I have. It’s fun as hell too. Vegas offers multiple skydiving spots on the Strip, but the real deal is Skydive Las Vegas, which is about 20–30 minutes from the Strip. According to the company, they’ll take you higher than any other skydiving spot out there … and getting higher is what we’re all about.\nBellagio Water Show\nThe Fountains of Bellagio are pretty cool to see, especially at night. It’s the perfect thing to settle in and stare at indefinitely after you hit a pre-roll or vape pen. It’s also one of the only things in Vegas that’ll leave you like, “Wow, fam, that was mad beautiful and touching.” Mainly because you’ll be so high that everything gets you in your feelings.\nGamble and Ruin Your Life\n(Sezeryadigar/iStock)\nIt’s a monster that you run and run and run from, but eventually it’ll catch you. And once it does, say goodbye to any budget you thought you had. It’s so easy to be walking through a casino lobby and accidentally end up in front of the War table with a stack of $5 chips and a mind full of, “Someone has to win; why not me?” It’s even easier to walk away from that table six minutes later with 200 less dollars than you had. Being high won’t ease the pain of losing money on some dumb shit, but it WILL make it a lot easier for you to say, “Fuck it. At least those nachos were fire.”",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/09/01161530/las-vegas-7.jpg",
            "title": "10 Best Things to Do in Las Vegas While You’re High",
            "urlslug": "/news/lifestyle/best-things-to-do-in-las-vegas-while-high"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Fibromyalgia",
            "score": 43.4
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 42.8
        },
        {
            "name": "Anxiety",
            "score": 32.6
        },
        {
            "name": "Arthritis",
            "score": 26.2
        },
        {
            "name": "PMS",
            "score": 23.6
        }
    ],
    "description": "<p>Cadillac Purple is a heavy indica strain that is popular among users seeking true body relaxation and pain relief without the spacey cerebral effects common to more sativa-heavy hybrids. Depending on tolerance, this strain can be a bit of a &ldquo;creeper,&rdquo; but when its effects do hit, they tend to be calming, body-soothing, and may lead to some restful sleep. Buds are deep greens with plenty of purple, making for some very pretty flowers. The aroma, too, is pleasant &ndash; mild and like a sweet perfume.</p>\n",
    "descriptionPlain": "Cadillac Purple is a heavy indica strain that is popular among users seeking true body relaxation and pain relief without the spacey cerebral effects common to more sativa-heavy hybrids. Depending on tolerance, this strain can be a bit of a &ldquo;creeper,&rdquo; but when its effects do hit, they tend to be calming, body-soothing, and may lead to some restful sleep. Buds are deep greens with plenty of purple, making for some very pretty flowers. The aroma, too, is pleasant &ndash; mild and like a sweet perfume.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 138.2
        },
        {
            "name": "Sleepy",
            "score": 103.4
        },
        {
            "name": "Happy",
            "score": 81.2
        },
        {
            "name": "Euphoric",
            "score": 53
        },
        {
            "name": "Tingly",
            "score": 35.2
        }
    ],
    "flavors": [
        {
            "name": "Grape",
            "score": 31
        },
        {
            "name": "Berry",
            "score": 28.2
        },
        {
            "name": "Earthy",
            "score": 25.6
        },
        {
            "name": "Woody",
            "score": 23
        },
        {
            "name": "Pungent",
            "score": 22.4
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1416528,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Tried some Purple Cadillac wax from Elemental Wellness in SJC.  Pretty good medicine for PTSD, Anxiety, and Pain.  No complaints about the smooth taste.  It does seem to be a bit of a creeper, and I wound up probably taking one hit too many due to my impatience, but that's okay.  It's part of the learning curve.  When it took effect it was very relaxing, relieved most of my anxiety, did a good job on pain, and I had zero paranoia.  Avoiding paranoia is a big issue for me, and this is one of the few that I've tried without boosting CBD by mixing it with a bit of Harlequin, or another high CBD strain.  CDB and THC mix is best for PTSD, but this stuff comes pretty darn close all by itself.  It works for PTSD.  If you have that issue, you might want to consider trying this strain.",
            "username": "BigAlDin"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1642688,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I love this strain so much! I have trouble sleeping (insomnia) and every time I smoke a bowl, it relaxes me and I knock out and sleep like a baby. You don't need to smoke more then a bowl because it's a creeper, once it hits you within 30 mins you will be glued to your bed & pillow and people that have problem sleeping I definitely recommend this strain because I get 7 hours of sleep every night and I also wake up refreshed the next morning.",
            "username": "Herrober1"
        }
    ],
    "id": 12526,
    "name": "Cadillac Purple",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 79
        },
        {
            "name": "Dry Eyes",
            "score": 28.8
        },
        {
            "name": "Paranoid",
            "score": 2.2
        },
        {
            "name": "Dizzy",
            "score": 1.4
        },
        {
            "name": "Anxious",
            "score": 1.4
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/blackberry-kush",
            "category": "Indica",
            "name": "Blackberry Kush",
            "permalink": "https://mobileapi.leafly.com/indica/blackberry-kush",
            "slug": "blackberry-kush",
            "subtitle": null,
            "symbol": "Bbk"
        },
        {
            "applink": "leafly://strain/the-black",
            "category": "Indica",
            "name": "The Black",
            "permalink": "https://mobileapi.leafly.com/indica/the-black",
            "slug": "the-black",
            "subtitle": null,
            "symbol": "Blc"
        },
        {
            "applink": "leafly://strain/purple-urkle",
            "category": "Indica",
            "name": "Purple Urkle",
            "permalink": "https://mobileapi.leafly.com/indica/purple-urkle",
            "slug": "purple-urkle",
            "subtitle": null,
            "symbol": "Pu"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/cadillac-purple",
    "photoTotalCount": 46,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005435/b/cadillac-purple__primary_45cc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cadillac-purple_100x100_1af1.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/673451/b/cadillac-purple__primary_e2f1.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cadillac-purple_100x100_30d9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/610959/b/cadillac-purple__primary_e55e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cadillac-purple_100x100_ea7f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/610315/b/cadillac-purple__primary_3897.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cadillac-purple_100x100_0bfe.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/595407/b/cadillac-purple__primary_3011.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cadillac-purple_100x100_e2f7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/592047/b/cadillac-purple__primary_6de5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cadillac-purple_100x100_eb6f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Las Vegas, NV",
        "Spokane, WA",
        "Tucson, AZ",
        "Eugene, OR",
        "Phoenix, AZ",
        "Portland, OR",
        "Carson City, NV",
        "Los Angeles, CA",
        "Milwaukie, OR",
        "Mohave Valley, AZ"
    ],
    "rating": 4.21,
    "relatedStrains": [],
    "reviewCount": 133,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "cadillac-purple",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.21052631578947/240",
    "subtitle": null,
    "symbol": "Cad",
    "symptoms": [
        {
            "name": "Pain",
            "score": 63
        },
        {
            "name": "Insomnia",
            "score": 57.8
        },
        {
            "name": "Inflammation",
            "score": 48.6
        },
        {
            "name": "Muscle Spasms",
            "score": 47
        },
        {
            "name": "Stress",
            "score": 41.8
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
