{"sl_translate":"description,descriptionPlain,category","id":2094,"slug":"power-kush","name":"Power Kush","subtitle":null,"symbol":"Pow","category":"Indica","description":"\u003cp\u003eA popular cannabis strain in Amsterdam, the buds of Power Kush have an abundance of resin with white and orange hairs. The aroma is likened to a sweet skunk smell with a light touch of strawberry and orange. The effects are both cerebral and physical with a THC content up to 16% and a CBD of 0.18%. Flowering time is 7-8 weeks.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"A popular cannabis strain in Amsterdam, the buds of Power Kush have an abundance of resin with white and orange hairs. The aroma is likened to a sweet skunk smell with a light touch of strawberry and orange. The effects are both cerebral and physical with a THC content up to 16% and a CBD of 0.18%. Flowering time is 7-8 weeks.\u0026nbsp;\n","aka":null,"rating":3.97,"highlightedReviews":[{"id":1385194,"username":"CH33SE","text":"If you are a medical patient or a recreational user that utilizes Cannabis for it\u0027s medical benefits, Power Kush is very much, VERY MUCH, like taking a Soma 350 mg tablet. This is a great strain if you suffer from muscle (back) spasms, need a good night sleep but dislike taking pills to fall asleep, had a stressful day and just want to go home, sit in your chair, blaze, then pass out, this girl will do it. Power Kush is in a class of her own. Nothing like OG, Master Kush, or Purple Kush, not even Bubba. I dislike taking pills prescribed by doctors, and now can cross Soma off my list!!! Very cool! Glad this country is finally recognizing the benefits of Cannabis! I wasn\u0027t a stoner, I didn\u0027t smoke until I sustained an injury! Just incredible that a plant can produce the same effects as a medication that in my eyes is poison sold by a drug dealer at your local pharmacy. Works great for muscle spasms. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1586429,"username":"jimmyinspazzz","text":"Power Kush is a decent strain.  Tastes like coffee and berries with a dirty aftertaste (that was enjoyed, much like patchouli).  A little bit of burn in back of nose and upper throat area on the exhale at times.  The buds were small to medium sized lighter green than the usual hue with pretty orange hairs woven throughout.  Most of the buds were small breaking up into joint material which I personally have come to favor.  The buzz def had a warm body wave that settles into moderate pain relief. Leans more toward the hybrid middle ground which did not appeal to me so much.  Great for some moderate pain relief where there is still a need to concentrate or get things done.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2983","title":"5 Indica Cannabis Strains for Sativa Fans","author":"Bailey Rahn","category":null,"date":"\/Date(1447261200000)\/","text":"While picking up some new strains at the dispensary yesterday, my budtender began by asking, “Are you looking for an indica or a sativa?” Her question is a reflection of how most people think about strains: sativas are for staying active and indicas are for relaxing. Sometimes, however, strains can surprise us and exhibit traits that we wouldn’t normally associate with their indica or sativa types.\n\nCannabis strains are more variable than one might think. Their nuanced effects often transcend the basic indica-sativa classification system and are influenced by a number of other factors:\n\nYour personal physiology and brain chemistry\nYour mood and energy level\nHow the strain was grown and which genetic traits that particular plant expressed (cannabis nerds, see this primer on genotypes and phenotypes)\nDelivery method and dose\nExpectation of effects\nAccuracy of strain labeling\n\nWith that caveat in mind, we analyzed our user-submitted strain reviews to find five indica strains that can defy their sedating stereotypes and offer more uplifting effects commonly associated with sativa varieties. Granted, I wouldn’t expect a hyperactive burst of energy from these strains, but sativa fans can certainly appreciate the creative, focused, and social cerebral effects these five have to offer.\n\n1. Purple Chemdawg\n \nChemdawg is known for its jolt of cerebral energy, but what happens when you crossbreed it with Purple Kush? According to Leafly reviewers, that invigorating buzz remains intact but is balanced by calming body sensations that keep you relaxed while your mind takes flight.\n\n“Incredibly unique strain. I’ve never felt so stuck but completely awake and alert.”\n2. Somango\n \nThough mostly indica, Somango has several qualities that any sativa fan can appreciate: focus, creativity, and a tropical flavor profile rarely found in indica varieties. Its Jack Herer parent is partially responsible for that extra cerebral kick, and Somango can also express high levels of CBD which lends to this strain’s clear-headed effects. Somango is a great companion strain for anyone needing to keep their mind sharp while pushing out pain, inflammation, or muscle spasms.\n\n“Keeps me creative, focused and full of ideas for activities like drawing, compose music, etc.”\n3. Alien Dawg\n \nAs with most strains, the reported effects of Alien Dawg range from “I can totally function on this” to “I am plastered to a couch in space.” Keeping the dose moderate is the best way to bring out the balance in this strain as it gives rise to concentrated creativity and positive moods. You’ll also find its cerebral-focused effects are most easily harnessed earlier in the day, while you still have energy for this indica to build off of.\n\n“Works well for anxiety but by no means was I a couch potato on it. I got energetic from it was able to get my stuff done.”\n\n“It is one of the few ‘sativa’ indicas in that is produces noticeable head effects while still having similar body loads of an indica.”\n4. Candy Cane\n \nFor those of you looking for a creative boost without jarring cerebral activity, Christmas has come early. Candy Cane is the indica you want, offering sweet mango and citrus flavors alongside uplifting euphoria that keeps the mind agile. This strain relaxes the body without robbing you of your faculties, so staying social and productive generally isn’t a problem.\n\n“The high is euphoric and uplifting. Makes me a little creative and energy high versus the couch effect.”\n\n“A great body high but keeps your mind racing. Overall a wonderful indica strain for sativa lovers!”\n5. Power Kush\n \nThey don’t call it Power Kush for nothin’. This strain does pack a euphoric punch, but there’s general consensus among Leafly reviewers that Power Kush won’t leave you glued to the couch. The cerebral effects aren’t as racy as your typical sativa; instead, they provide a calm mindset that allows you to stay focused and engaged, so long as you dose somewhat modestly.\n\n“I am relaxed but not couch-locked. I can still focus and task very well. This one will be an after-I-get-home-from-work strain…something to address the pain but not get me ready for bed yet.”\n\n“This is a great strain for depression. I should get couch lock but I don’t.”","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12001256/5-indica-cannabis-strains-for-sativa-fans.jpg","urlslug":"/news/strains-products/5-indica-cannabis-strains-for-sativa-fans"},{"id":"contentitems-2973","title":"24 Strains to Prepare You for the Game of Thrones Season 4 Premiere","author":"Rebecca Kelley","category":null,"date":"\/Date(1396641600000)\/","text":"We’re big fans of Game of Thrones here at Leafly and the crew is super stoked for the season 4 debut this Sunday on HBO. If you’re planning on hosting a viewing party to kick off the premiere of one of the best shows on television, why not pick up some of these Game of Thrones-themed strains to properly celebrate?\nHere are 24 strains (some standing solo, some paired together) we feel tie in with the Game of Thrones universe perfectly (spoilers below if you aren’t caught up to season 4 by now). Yes, 24. That’s how much we love both our strains and this show. Even though All Men Must Die, their memories will live on thanks to this list of green.\n1. Mad Dawg \n\nThis earthy hybrid is in honor of Mad King Aerys II Targaryen, the kooky ruler who started this whole mess in the first place. Dude, all you had to do was not murder a bunch of people and threaten to burn down King’s Landing and we wouldn’t even have a Game of Thrones battle royale waging. If only he had a little stash of Mad Dawg to keep him feeling euphoric and relaxed.\n2. 3 Kings\n\nThe hybrid 3 Kings strain may be a fusion of Headband, Sour Diesel, and OG Kush, but it also signifies the three kings currently left standing in Game of Thrones at the start of season 4: Joffrey Lannister (aka The Worst Person Ever), Stannis Baratheon (aka “Stannis the Mannis,” self-proclaimed King of the Andals), and Balon Greyjoy (aka World’s Not-Greatest Dad), king of the Iron Islands. Maybe this pungent strain will clear some of the crazy out of their sinuses.\n3. Permafrost\n\nBecause, as House Stark constantly reminds us, “Winter is coming,” so you might as well hunker down and wait for it to arrive with some piney Permafrost.\nSpeaking of House Stark…\n4. Northern Lights\n\nThe North remembers, and though their numbers are dwindling and the Starks are constantly having George R. R. Martin take a never-ending dump on them, there are still a few scrappy surviving members who have a glimmer of hope shining, however dimly at the moment. Northern Lights is good for combating stress, and I’m guessing the Starks are feeling a little overwhelmed right about now.\n5. Lions Gate\n\nThis royal purple indica is in honor of the proud and wealthy Lannisters, who happen to use a lion as their sigil. The Lannisters appear to be sitting pretty right now – they rule the Seven Kingdoms, Jamie’s been returned (mostly intact), Tywin’s only been moderately cranky – but we’ll see if their good luck streak will continue in season 4. They’ll need the focus that the Lions Gate strain brings.\n6. Richie Rich + Power Kush \n\nSpeaking of Tywin Lannister, if you combine the hybrid Richie Rich with the indica Power Kush, you’ll have a father who loves to play the game more than he loves his own family. I bet he’s sneering in every family portrait that’s been commissioned – it’s the ye olde equivalent of blinking in photos.\n7. Killer Queen + Sour Power \n\nSticking with the Lannisters, let’s shift gears to Cersei, former queen of Westeros and current queen of the “Who farted?” face. A Killer Queen willing to do whatever it takes to get as close to the Iron Throne as possible, this icy blonde beauty has felt her power go a little sour once she realized that her turd of a son can’t be controlled. Talk about a disappointed parent. She really takes after her father, doesn’t she?\n8. Little Devil + Abusive OG\n\nUgh, Joffrey is the worst. We can’t think of a better pairing for the little pissant than the hybrid Little Devil and the indica Abusive OG. If ever King Joffrey’s horrible ways feel a little too heavy for your tastes, just remember that he got b-slapped by the best character ever:\n\nSpeaking of which…\n9. Royal Dwarf \n\nTyrion Lannister is rumored to be one of the characters George R. R. Martin’s wife made him promise he would never kill off. I think every Game of Thrones fan can agree – even though he’s a Lannister, he’s still a Royal Dwarf and one of the best characters on the show.\nAnother favorite character?\n10. Jane Doe + Odyssey \n\nFierce little Arya Stark has seen many of her family members fall victim to the Game of Thrones and now she’s out for blood. This pint-sized warrior in the making has abandoned her identity and gone all Jane Doe in an attempt to take out the people on her shit list. How will her revenge Odyssey pan out?\n11. Critical Mass\n\nSticking with the Starks, we’ve never had a drastic shift in character sympathy than for poor Sansa. Sure, she was a naive, stuck-up teenager in season 1, but she’s had most of her family murdered, been held prisoner, and was nearly forced to marry a psychopath Lannister before being forced to marry another Lannister. Tyrion’s been kind to her so far but honestly, how much more suffering do you have in store for Sansa, George R. R. Martin? She seems to be at Critical Mass right now and could use a little of the happy effects this indica brings.\nKnow who else is feeling a little blue?\n12. Blue Bastard \n\nOh, Jon Snow. The bastard son of Ned Stark has been on his own Odyssey but he can’t seem to make up his mind as to what he wants (maybe he really does know “nuthing”). Is it revenge for the Starks? Does he want to protect the Night’s Watch or defect from them? Or maybe he wants to catch a glimpse of another Ogre with Ygritte (although “Jon Snuhhhh” isn’t exactly in her good graces right now). It’s been a depressing journey for him thus far – good thing Blue Bastard is good for relieving depression.\n13. White Zombie + Snow Monster\n\nWe’ve already seen a few of the horrors that lie north of the Wall, including a White Zombie who looked like a frigid Iggy Pop. Can Jon Snow protect the Seven Kingdoms from the Snow Monsters that are advancing?\n14. Super Sour Widow \n\nPoor Catelyn Stark. Even though she could never love the bastard Jon Snow, she still didn’t deserve to have her entire family either murdered or scattered across the Seven Kingdoms. Talk about a Super Sour Widow.\nAnd to make matters worse…\n15. Red Haze \n\nThat Red Wedding was effed up, yo. Like seriously. After watching that episode, you probably felt as amped up as the effects the sativa Red Haze can bring (and you were likely in a Red Haze of your own once “The Rains of Castamere” started playing).\n16. Blackwater + Green Haze\n\nAnother iconic moment in Game of Thrones, this event was less heart-breaking than the Red Wedding and more awe-inspiring. The Battle of the Blackwater has been the biggest battle in the War of the Five Kings so far. Tyrion’s use of wildfire put Stannis’ army in a Green Haze and protected King’s Landing from being overrun. By combining the indica Blackwater and the sativa Green Haze, you’re creating quite the explosive hybrid strain yourself.\n17. Cherry Bomb\n\nCherry Bomb continue to deliver (both literally and figuratively), or will her influence over him go up in flames?\n \n18. Anesthesia\n\nA little something both Jaime Lannister and Theon Greyjoy could have used throughout season 3, amirite guys? The indica Anesthesia is widely used for pain management, making it an appropriate option for these two whipping boys.\n19. Lifesaver\n\nJaime owes you one, Brienne of Tarth. Why not have him pick up this euphoric hybrid Lifesaver strain while you two bathe and reminisce about the time you both faced off against a friggin’ grizzly bear?\n20. Brains Damage\n\nWhat better way to celebrate the possibly brain-damaged but entertainingly verbose Hodor with this Hodor, I mean hybrid strain that brings sleepiness, Hodor, and Hodor Hodor.\n21. Bordello\n\nAny Game of Thrones viewer is all-too familiar with the show’s numerous “sexposition” scenes that occur in a brothel or during sex scenes to spruce up an otherwise boring plot advancement. Take a taste of the hybrid Bordello whenever a sexposition scene pops up and you’ll feel so relaxed, you’ll forget how shamelessly (and entertainingly) gratuitous these parts actually are.\n22. True OG \n\nWho will end up winning the Game of Thrones? Who do you feel is the rightful ruler of the Seven Kingdoms? Partake in this relaxing indica while you ponder who you feel the “True OG” should be.\nWill it be…\n23. Dream Queen + Triple Diesel\n\nMany Game of Thrones fans are rooting for their “Dream Queen,” Daenerys Targaryen, who’s using her Triple Diesel dragons to kick ass, free slaves, and chew bubblegum (and she’s all out of bubblegum).\nAnd finally…\n24. F*cking Incredible\n\nWhich is exactly what this show is. Happy watching!\nImage credits: mad king, House Lannister","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12001238/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie.jpg","urlslug":"/news/strains-products/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie"}],"reviewCount":100,"flavors":[{"name":"Berry","score":100.59055118110236},{"name":"Nutty","score":100.19685039370079},{"name":"Coffee","score":100.19685039370079},{"name":"Sweet","score":11.48293963254593},{"name":"Earthy","score":10.301837270341206}],"effects":[{"name":"Relaxed","score":41.994750656167973},{"name":"Sleepy","score":23.162729658792649},{"name":"Uplifted","score":21.194225721784775},{"name":"Euphoric","score":16.207349081364828},{"name":"Happy","score":15.419947506561678}],"symptoms":[{"name":"Stress","score":23.753280839895012},{"name":"Pain","score":15.026246719160104},{"name":"Depression","score":12.27034120734908},{"name":"Insomnia","score":12.27034120734908},{"name":"Muscle Spasms","score":11.48293963254593}],"conditions":[{"name":"Anxiety","score":5.31496062992126},{"name":"ADD/ADHD","score":1.7716535433070866},{"name":"Fibromyalgia","score":1.5748031496062991},{"name":"Arthritis","score":1.1811023622047243},{"name":"Migraines","score":1.1811023622047243}],"negatives":[{"name":"Dry Mouth","score":14.041994750656167},{"name":"Paranoid","score":9.31758530183727},{"name":"Dry Eyes","score":3.5433070866141732},{"name":"Dizzy","score":2.1653543307086616},{"name":"Headache","score":0.78740157480314954}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_414d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/641771/b/power-kush__primary_34f6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_203a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636075/b/power-kush__primary_e7f3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_b217.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/588086/b/power-kush__primary_97c7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_1e1d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/520462/b/power-kush__primary_1ed9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_f9f2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/514797/b/power-kush__primary_967f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_c12c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/512274/b/power-kush__primary_c0ab.jpg"}],"photoTotalCount":46,"popularCities":["Portland, OR","Eugene, OR","Seattle, WA","Ann Arbor, MI","Bellingham, WA","Bend, OR","Bremerton, WA","Burlington, WA","Denver, CO","Hillsboro, OR"],"permalink":"https://mobileapi.leafly.com/indica/power-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3.97/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":2094,"slug":"power-kush","name":"Power Kush","subtitle":null,"symbol":"Pow","category":"Indica","description":"\u003cp\u003eA popular cannabis strain in Amsterdam, the buds of Power Kush have an abundance of resin with white and orange hairs. The aroma is likened to a sweet skunk smell with a light touch of strawberry and orange. The effects are both cerebral and physical with a THC content up to 16% and a CBD of 0.18%. Flowering time is 7-8 weeks.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"A popular cannabis strain in Amsterdam, the buds of Power Kush have an abundance of resin with white and orange hairs. The aroma is likened to a sweet skunk smell with a light touch of strawberry and orange. The effects are both cerebral and physical with a THC content up to 16% and a CBD of 0.18%. Flowering time is 7-8 weeks.\u0026nbsp;\n","aka":null,"rating":3.97,"highlightedReviews":[{"id":1385194,"username":"CH33SE","text":"If you are a medical patient or a recreational user that utilizes Cannabis for it\u0027s medical benefits, Power Kush is very much, VERY MUCH, like taking a Soma 350 mg tablet. This is a great strain if you suffer from muscle (back) spasms, need a good night sleep but dislike taking pills to fall asleep, had a stressful day and just want to go home, sit in your chair, blaze, then pass out, this girl will do it. Power Kush is in a class of her own. Nothing like OG, Master Kush, or Purple Kush, not even Bubba. I dislike taking pills prescribed by doctors, and now can cross Soma off my list!!! Very cool! Glad this country is finally recognizing the benefits of Cannabis! I wasn\u0027t a stoner, I didn\u0027t smoke until I sustained an injury! Just incredible that a plant can produce the same effects as a medication that in my eyes is poison sold by a drug dealer at your local pharmacy. Works great for muscle spasms. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1586429,"username":"jimmyinspazzz","text":"Power Kush is a decent strain.  Tastes like coffee and berries with a dirty aftertaste (that was enjoyed, much like patchouli).  A little bit of burn in back of nose and upper throat area on the exhale at times.  The buds were small to medium sized lighter green than the usual hue with pretty orange hairs woven throughout.  Most of the buds were small breaking up into joint material which I personally have come to favor.  The buzz def had a warm body wave that settles into moderate pain relief. Leans more toward the hybrid middle ground which did not appeal to me so much.  Great for some moderate pain relief where there is still a need to concentrate or get things done.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2983","title":"5 Indica Cannabis Strains for Sativa Fans","author":"Bailey Rahn","category":null,"date":"\/Date(1447261200000)\/","text":"While picking up some new strains at the dispensary yesterday, my budtender began by asking, “Are you looking for an indica or a sativa?” Her question is a reflection of how most people think about strains: sativas are for staying active and indicas are for relaxing. Sometimes, however, strains can surprise us and exhibit traits that we wouldn’t normally associate with their indica or sativa types.\n\nCannabis strains are more variable than one might think. Their nuanced effects often transcend the basic indica-sativa classification system and are influenced by a number of other factors:\n\nYour personal physiology and brain chemistry\nYour mood and energy level\nHow the strain was grown and which genetic traits that particular plant expressed (cannabis nerds, see this primer on genotypes and phenotypes)\nDelivery method and dose\nExpectation of effects\nAccuracy of strain labeling\n\nWith that caveat in mind, we analyzed our user-submitted strain reviews to find five indica strains that can defy their sedating stereotypes and offer more uplifting effects commonly associated with sativa varieties. Granted, I wouldn’t expect a hyperactive burst of energy from these strains, but sativa fans can certainly appreciate the creative, focused, and social cerebral effects these five have to offer.\n\n1. Purple Chemdawg\n \nChemdawg is known for its jolt of cerebral energy, but what happens when you crossbreed it with Purple Kush? According to Leafly reviewers, that invigorating buzz remains intact but is balanced by calming body sensations that keep you relaxed while your mind takes flight.\n\n“Incredibly unique strain. I’ve never felt so stuck but completely awake and alert.”\n2. Somango\n \nThough mostly indica, Somango has several qualities that any sativa fan can appreciate: focus, creativity, and a tropical flavor profile rarely found in indica varieties. Its Jack Herer parent is partially responsible for that extra cerebral kick, and Somango can also express high levels of CBD which lends to this strain’s clear-headed effects. Somango is a great companion strain for anyone needing to keep their mind sharp while pushing out pain, inflammation, or muscle spasms.\n\n“Keeps me creative, focused and full of ideas for activities like drawing, compose music, etc.”\n3. Alien Dawg\n \nAs with most strains, the reported effects of Alien Dawg range from “I can totally function on this” to “I am plastered to a couch in space.” Keeping the dose moderate is the best way to bring out the balance in this strain as it gives rise to concentrated creativity and positive moods. You’ll also find its cerebral-focused effects are most easily harnessed earlier in the day, while you still have energy for this indica to build off of.\n\n“Works well for anxiety but by no means was I a couch potato on it. I got energetic from it was able to get my stuff done.”\n\n“It is one of the few ‘sativa’ indicas in that is produces noticeable head effects while still having similar body loads of an indica.”\n4. Candy Cane\n \nFor those of you looking for a creative boost without jarring cerebral activity, Christmas has come early. Candy Cane is the indica you want, offering sweet mango and citrus flavors alongside uplifting euphoria that keeps the mind agile. This strain relaxes the body without robbing you of your faculties, so staying social and productive generally isn’t a problem.\n\n“The high is euphoric and uplifting. Makes me a little creative and energy high versus the couch effect.”\n\n“A great body high but keeps your mind racing. Overall a wonderful indica strain for sativa lovers!”\n5. Power Kush\n \nThey don’t call it Power Kush for nothin’. This strain does pack a euphoric punch, but there’s general consensus among Leafly reviewers that Power Kush won’t leave you glued to the couch. The cerebral effects aren’t as racy as your typical sativa; instead, they provide a calm mindset that allows you to stay focused and engaged, so long as you dose somewhat modestly.\n\n“I am relaxed but not couch-locked. I can still focus and task very well. This one will be an after-I-get-home-from-work strain…something to address the pain but not get me ready for bed yet.”\n\n“This is a great strain for depression. I should get couch lock but I don’t.”","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12001256/5-indica-cannabis-strains-for-sativa-fans.jpg","urlslug":"/news/strains-products/5-indica-cannabis-strains-for-sativa-fans"},{"id":"contentitems-2973","title":"24 Strains to Prepare You for the Game of Thrones Season 4 Premiere","author":"Rebecca Kelley","category":null,"date":"\/Date(1396641600000)\/","text":"We’re big fans of Game of Thrones here at Leafly and the crew is super stoked for the season 4 debut this Sunday on HBO. If you’re planning on hosting a viewing party to kick off the premiere of one of the best shows on television, why not pick up some of these Game of Thrones-themed strains to properly celebrate?\nHere are 24 strains (some standing solo, some paired together) we feel tie in with the Game of Thrones universe perfectly (spoilers below if you aren’t caught up to season 4 by now). Yes, 24. That’s how much we love both our strains and this show. Even though All Men Must Die, their memories will live on thanks to this list of green.\n1. Mad Dawg \n\nThis earthy hybrid is in honor of Mad King Aerys II Targaryen, the kooky ruler who started this whole mess in the first place. Dude, all you had to do was not murder a bunch of people and threaten to burn down King’s Landing and we wouldn’t even have a Game of Thrones battle royale waging. If only he had a little stash of Mad Dawg to keep him feeling euphoric and relaxed.\n2. 3 Kings\n\nThe hybrid 3 Kings strain may be a fusion of Headband, Sour Diesel, and OG Kush, but it also signifies the three kings currently left standing in Game of Thrones at the start of season 4: Joffrey Lannister (aka The Worst Person Ever), Stannis Baratheon (aka “Stannis the Mannis,” self-proclaimed King of the Andals), and Balon Greyjoy (aka World’s Not-Greatest Dad), king of the Iron Islands. Maybe this pungent strain will clear some of the crazy out of their sinuses.\n3. Permafrost\n\nBecause, as House Stark constantly reminds us, “Winter is coming,” so you might as well hunker down and wait for it to arrive with some piney Permafrost.\nSpeaking of House Stark…\n4. Northern Lights\n\nThe North remembers, and though their numbers are dwindling and the Starks are constantly having George R. R. Martin take a never-ending dump on them, there are still a few scrappy surviving members who have a glimmer of hope shining, however dimly at the moment. Northern Lights is good for combating stress, and I’m guessing the Starks are feeling a little overwhelmed right about now.\n5. Lions Gate\n\nThis royal purple indica is in honor of the proud and wealthy Lannisters, who happen to use a lion as their sigil. The Lannisters appear to be sitting pretty right now – they rule the Seven Kingdoms, Jamie’s been returned (mostly intact), Tywin’s only been moderately cranky – but we’ll see if their good luck streak will continue in season 4. They’ll need the focus that the Lions Gate strain brings.\n6. Richie Rich + Power Kush \n\nSpeaking of Tywin Lannister, if you combine the hybrid Richie Rich with the indica Power Kush, you’ll have a father who loves to play the game more than he loves his own family. I bet he’s sneering in every family portrait that’s been commissioned – it’s the ye olde equivalent of blinking in photos.\n7. Killer Queen + Sour Power \n\nSticking with the Lannisters, let’s shift gears to Cersei, former queen of Westeros and current queen of the “Who farted?” face. A Killer Queen willing to do whatever it takes to get as close to the Iron Throne as possible, this icy blonde beauty has felt her power go a little sour once she realized that her turd of a son can’t be controlled. Talk about a disappointed parent. She really takes after her father, doesn’t she?\n8. Little Devil + Abusive OG\n\nUgh, Joffrey is the worst. We can’t think of a better pairing for the little pissant than the hybrid Little Devil and the indica Abusive OG. If ever King Joffrey’s horrible ways feel a little too heavy for your tastes, just remember that he got b-slapped by the best character ever:\n\nSpeaking of which…\n9. Royal Dwarf \n\nTyrion Lannister is rumored to be one of the characters George R. R. Martin’s wife made him promise he would never kill off. I think every Game of Thrones fan can agree – even though he’s a Lannister, he’s still a Royal Dwarf and one of the best characters on the show.\nAnother favorite character?\n10. Jane Doe + Odyssey \n\nFierce little Arya Stark has seen many of her family members fall victim to the Game of Thrones and now she’s out for blood. This pint-sized warrior in the making has abandoned her identity and gone all Jane Doe in an attempt to take out the people on her shit list. How will her revenge Odyssey pan out?\n11. Critical Mass\n\nSticking with the Starks, we’ve never had a drastic shift in character sympathy than for poor Sansa. Sure, she was a naive, stuck-up teenager in season 1, but she’s had most of her family murdered, been held prisoner, and was nearly forced to marry a psychopath Lannister before being forced to marry another Lannister. Tyrion’s been kind to her so far but honestly, how much more suffering do you have in store for Sansa, George R. R. Martin? She seems to be at Critical Mass right now and could use a little of the happy effects this indica brings.\nKnow who else is feeling a little blue?\n12. Blue Bastard \n\nOh, Jon Snow. The bastard son of Ned Stark has been on his own Odyssey but he can’t seem to make up his mind as to what he wants (maybe he really does know “nuthing”). Is it revenge for the Starks? Does he want to protect the Night’s Watch or defect from them? Or maybe he wants to catch a glimpse of another Ogre with Ygritte (although “Jon Snuhhhh” isn’t exactly in her good graces right now). It’s been a depressing journey for him thus far – good thing Blue Bastard is good for relieving depression.\n13. White Zombie + Snow Monster\n\nWe’ve already seen a few of the horrors that lie north of the Wall, including a White Zombie who looked like a frigid Iggy Pop. Can Jon Snow protect the Seven Kingdoms from the Snow Monsters that are advancing?\n14. Super Sour Widow \n\nPoor Catelyn Stark. Even though she could never love the bastard Jon Snow, she still didn’t deserve to have her entire family either murdered or scattered across the Seven Kingdoms. Talk about a Super Sour Widow.\nAnd to make matters worse…\n15. Red Haze \n\nThat Red Wedding was effed up, yo. Like seriously. After watching that episode, you probably felt as amped up as the effects the sativa Red Haze can bring (and you were likely in a Red Haze of your own once “The Rains of Castamere” started playing).\n16. Blackwater + Green Haze\n\nAnother iconic moment in Game of Thrones, this event was less heart-breaking than the Red Wedding and more awe-inspiring. The Battle of the Blackwater has been the biggest battle in the War of the Five Kings so far. Tyrion’s use of wildfire put Stannis’ army in a Green Haze and protected King’s Landing from being overrun. By combining the indica Blackwater and the sativa Green Haze, you’re creating quite the explosive hybrid strain yourself.\n17. Cherry Bomb\n\nCherry Bomb continue to deliver (both literally and figuratively), or will her influence over him go up in flames?\n \n18. Anesthesia\n\nA little something both Jaime Lannister and Theon Greyjoy could have used throughout season 3, amirite guys? The indica Anesthesia is widely used for pain management, making it an appropriate option for these two whipping boys.\n19. Lifesaver\n\nJaime owes you one, Brienne of Tarth. Why not have him pick up this euphoric hybrid Lifesaver strain while you two bathe and reminisce about the time you both faced off against a friggin’ grizzly bear?\n20. Brains Damage\n\nWhat better way to celebrate the possibly brain-damaged but entertainingly verbose Hodor with this Hodor, I mean hybrid strain that brings sleepiness, Hodor, and Hodor Hodor.\n21. Bordello\n\nAny Game of Thrones viewer is all-too familiar with the show’s numerous “sexposition” scenes that occur in a brothel or during sex scenes to spruce up an otherwise boring plot advancement. Take a taste of the hybrid Bordello whenever a sexposition scene pops up and you’ll feel so relaxed, you’ll forget how shamelessly (and entertainingly) gratuitous these parts actually are.\n22. True OG \n\nWho will end up winning the Game of Thrones? Who do you feel is the rightful ruler of the Seven Kingdoms? Partake in this relaxing indica while you ponder who you feel the “True OG” should be.\nWill it be…\n23. Dream Queen + Triple Diesel\n\nMany Game of Thrones fans are rooting for their “Dream Queen,” Daenerys Targaryen, who’s using her Triple Diesel dragons to kick ass, free slaves, and chew bubblegum (and she’s all out of bubblegum).\nAnd finally…\n24. F*cking Incredible\n\nWhich is exactly what this show is. Happy watching!\nImage credits: mad king, House Lannister","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12001238/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie.jpg","urlslug":"/news/strains-products/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie"}],"reviewCount":100,"flavors":[{"name":"Berry","score":100.59055118110236},{"name":"Nutty","score":100.19685039370079},{"name":"Coffee","score":100.19685039370079},{"name":"Sweet","score":11.48293963254593},{"name":"Earthy","score":10.301837270341206}],"effects":[{"name":"Relaxed","score":41.994750656167973},{"name":"Sleepy","score":23.162729658792649},{"name":"Uplifted","score":21.194225721784775},{"name":"Euphoric","score":16.207349081364828},{"name":"Happy","score":15.419947506561678}],"symptoms":[{"name":"Stress","score":23.753280839895012},{"name":"Pain","score":15.026246719160104},{"name":"Depression","score":12.27034120734908},{"name":"Insomnia","score":12.27034120734908},{"name":"Muscle Spasms","score":11.48293963254593}],"conditions":[{"name":"Anxiety","score":5.31496062992126},{"name":"ADD/ADHD","score":1.7716535433070866},{"name":"Fibromyalgia","score":1.5748031496062991},{"name":"Arthritis","score":1.1811023622047243},{"name":"Migraines","score":1.1811023622047243}],"negatives":[{"name":"Dry Mouth","score":14.041994750656167},{"name":"Paranoid","score":9.31758530183727},{"name":"Dry Eyes","score":3.5433070866141732},{"name":"Dizzy","score":2.1653543307086616},{"name":"Headache","score":0.78740157480314954}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_414d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/641771/b/power-kush__primary_34f6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_203a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636075/b/power-kush__primary_e7f3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_b217.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/588086/b/power-kush__primary_97c7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_1e1d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/520462/b/power-kush__primary_1ed9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_f9f2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/514797/b/power-kush__primary_967f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_c12c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/512274/b/power-kush__primary_c0ab.jpg"}],"photoTotalCount":46,"popularCities":["Portland, OR","Eugene, OR","Seattle, WA","Ann Arbor, MI","Bellingham, WA","Bend, OR","Bremerton, WA","Burlington, WA","Denver, CO","Hillsboro, OR"],"permalink":"https://mobileapi.leafly.com/indica/power-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3.97/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":2094,"slug":"power-kush","name":"Power Kush","subtitle":null,"symbol":"Pow","category":"Indica","description":"\u003cp\u003eA popular cannabis strain in Amsterdam, the buds of Power Kush have an abundance of resin with white and orange hairs. The aroma is likened to a sweet skunk smell with a light touch of strawberry and orange. The effects are both cerebral and physical with a THC content up to 16% and a CBD of 0.18%. Flowering time is 7-8 weeks.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"A popular cannabis strain in Amsterdam, the buds of Power Kush have an abundance of resin with white and orange hairs. The aroma is likened to a sweet skunk smell with a light touch of strawberry and orange. The effects are both cerebral and physical with a THC content up to 16% and a CBD of 0.18%. Flowering time is 7-8 weeks.\u0026nbsp;\n","aka":null,"rating":3.97,"highlightedReviews":[{"id":1385194,"username":"CH33SE","text":"If you are a medical patient or a recreational user that utilizes Cannabis for it\u0027s medical benefits, Power Kush is very much, VERY MUCH, like taking a Soma 350 mg tablet. This is a great strain if you suffer from muscle (back) spasms, need a good night sleep but dislike taking pills to fall asleep, had a stressful day and just want to go home, sit in your chair, blaze, then pass out, this girl will do it. Power Kush is in a class of her own. Nothing like OG, Master Kush, or Purple Kush, not even Bubba. I dislike taking pills prescribed by doctors, and now can cross Soma off my list!!! Very cool! Glad this country is finally recognizing the benefits of Cannabis! I wasn\u0027t a stoner, I didn\u0027t smoke until I sustained an injury! Just incredible that a plant can produce the same effects as a medication that in my eyes is poison sold by a drug dealer at your local pharmacy. Works great for muscle spasms. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1586429,"username":"jimmyinspazzz","text":"Power Kush is a decent strain.  Tastes like coffee and berries with a dirty aftertaste (that was enjoyed, much like patchouli).  A little bit of burn in back of nose and upper throat area on the exhale at times.  The buds were small to medium sized lighter green than the usual hue with pretty orange hairs woven throughout.  Most of the buds were small breaking up into joint material which I personally have come to favor.  The buzz def had a warm body wave that settles into moderate pain relief. Leans more toward the hybrid middle ground which did not appeal to me so much.  Great for some moderate pain relief where there is still a need to concentrate or get things done.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2983","title":"5 Indica Cannabis Strains for Sativa Fans","author":"Bailey Rahn","category":null,"date":"\/Date(1447261200000)\/","text":"While picking up some new strains at the dispensary yesterday, my budtender began by asking, “Are you looking for an indica or a sativa?” Her question is a reflection of how most people think about strains: sativas are for staying active and indicas are for relaxing. Sometimes, however, strains can surprise us and exhibit traits that we wouldn’t normally associate with their indica or sativa types.\n\nCannabis strains are more variable than one might think. Their nuanced effects often transcend the basic indica-sativa classification system and are influenced by a number of other factors:\n\nYour personal physiology and brain chemistry\nYour mood and energy level\nHow the strain was grown and which genetic traits that particular plant expressed (cannabis nerds, see this primer on genotypes and phenotypes)\nDelivery method and dose\nExpectation of effects\nAccuracy of strain labeling\n\nWith that caveat in mind, we analyzed our user-submitted strain reviews to find five indica strains that can defy their sedating stereotypes and offer more uplifting effects commonly associated with sativa varieties. Granted, I wouldn’t expect a hyperactive burst of energy from these strains, but sativa fans can certainly appreciate the creative, focused, and social cerebral effects these five have to offer.\n\n1. Purple Chemdawg\n \nChemdawg is known for its jolt of cerebral energy, but what happens when you crossbreed it with Purple Kush? According to Leafly reviewers, that invigorating buzz remains intact but is balanced by calming body sensations that keep you relaxed while your mind takes flight.\n\n“Incredibly unique strain. I’ve never felt so stuck but completely awake and alert.”\n2. Somango\n \nThough mostly indica, Somango has several qualities that any sativa fan can appreciate: focus, creativity, and a tropical flavor profile rarely found in indica varieties. Its Jack Herer parent is partially responsible for that extra cerebral kick, and Somango can also express high levels of CBD which lends to this strain’s clear-headed effects. Somango is a great companion strain for anyone needing to keep their mind sharp while pushing out pain, inflammation, or muscle spasms.\n\n“Keeps me creative, focused and full of ideas for activities like drawing, compose music, etc.”\n3. Alien Dawg\n \nAs with most strains, the reported effects of Alien Dawg range from “I can totally function on this” to “I am plastered to a couch in space.” Keeping the dose moderate is the best way to bring out the balance in this strain as it gives rise to concentrated creativity and positive moods. You’ll also find its cerebral-focused effects are most easily harnessed earlier in the day, while you still have energy for this indica to build off of.\n\n“Works well for anxiety but by no means was I a couch potato on it. I got energetic from it was able to get my stuff done.”\n\n“It is one of the few ‘sativa’ indicas in that is produces noticeable head effects while still having similar body loads of an indica.”\n4. Candy Cane\n \nFor those of you looking for a creative boost without jarring cerebral activity, Christmas has come early. Candy Cane is the indica you want, offering sweet mango and citrus flavors alongside uplifting euphoria that keeps the mind agile. This strain relaxes the body without robbing you of your faculties, so staying social and productive generally isn’t a problem.\n\n“The high is euphoric and uplifting. Makes me a little creative and energy high versus the couch effect.”\n\n“A great body high but keeps your mind racing. Overall a wonderful indica strain for sativa lovers!”\n5. Power Kush\n \nThey don’t call it Power Kush for nothin’. This strain does pack a euphoric punch, but there’s general consensus among Leafly reviewers that Power Kush won’t leave you glued to the couch. The cerebral effects aren’t as racy as your typical sativa; instead, they provide a calm mindset that allows you to stay focused and engaged, so long as you dose somewhat modestly.\n\n“I am relaxed but not couch-locked. I can still focus and task very well. This one will be an after-I-get-home-from-work strain…something to address the pain but not get me ready for bed yet.”\n\n“This is a great strain for depression. I should get couch lock but I don’t.”","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12001256/5-indica-cannabis-strains-for-sativa-fans.jpg","urlslug":"/news/strains-products/5-indica-cannabis-strains-for-sativa-fans"},{"id":"contentitems-2973","title":"24 Strains to Prepare You for the Game of Thrones Season 4 Premiere","author":"Rebecca Kelley","category":null,"date":"\/Date(1396641600000)\/","text":"We’re big fans of Game of Thrones here at Leafly and the crew is super stoked for the season 4 debut this Sunday on HBO. If you’re planning on hosting a viewing party to kick off the premiere of one of the best shows on television, why not pick up some of these Game of Thrones-themed strains to properly celebrate?\nHere are 24 strains (some standing solo, some paired together) we feel tie in with the Game of Thrones universe perfectly (spoilers below if you aren’t caught up to season 4 by now). Yes, 24. That’s how much we love both our strains and this show. Even though All Men Must Die, their memories will live on thanks to this list of green.\n1. Mad Dawg \n\nThis earthy hybrid is in honor of Mad King Aerys II Targaryen, the kooky ruler who started this whole mess in the first place. Dude, all you had to do was not murder a bunch of people and threaten to burn down King’s Landing and we wouldn’t even have a Game of Thrones battle royale waging. If only he had a little stash of Mad Dawg to keep him feeling euphoric and relaxed.\n2. 3 Kings\n\nThe hybrid 3 Kings strain may be a fusion of Headband, Sour Diesel, and OG Kush, but it also signifies the three kings currently left standing in Game of Thrones at the start of season 4: Joffrey Lannister (aka The Worst Person Ever), Stannis Baratheon (aka “Stannis the Mannis,” self-proclaimed King of the Andals), and Balon Greyjoy (aka World’s Not-Greatest Dad), king of the Iron Islands. Maybe this pungent strain will clear some of the crazy out of their sinuses.\n3. Permafrost\n\nBecause, as House Stark constantly reminds us, “Winter is coming,” so you might as well hunker down and wait for it to arrive with some piney Permafrost.\nSpeaking of House Stark…\n4. Northern Lights\n\nThe North remembers, and though their numbers are dwindling and the Starks are constantly having George R. R. Martin take a never-ending dump on them, there are still a few scrappy surviving members who have a glimmer of hope shining, however dimly at the moment. Northern Lights is good for combating stress, and I’m guessing the Starks are feeling a little overwhelmed right about now.\n5. Lions Gate\n\nThis royal purple indica is in honor of the proud and wealthy Lannisters, who happen to use a lion as their sigil. The Lannisters appear to be sitting pretty right now – they rule the Seven Kingdoms, Jamie’s been returned (mostly intact), Tywin’s only been moderately cranky – but we’ll see if their good luck streak will continue in season 4. They’ll need the focus that the Lions Gate strain brings.\n6. Richie Rich + Power Kush \n\nSpeaking of Tywin Lannister, if you combine the hybrid Richie Rich with the indica Power Kush, you’ll have a father who loves to play the game more than he loves his own family. I bet he’s sneering in every family portrait that’s been commissioned – it’s the ye olde equivalent of blinking in photos.\n7. Killer Queen + Sour Power \n\nSticking with the Lannisters, let’s shift gears to Cersei, former queen of Westeros and current queen of the “Who farted?” face. A Killer Queen willing to do whatever it takes to get as close to the Iron Throne as possible, this icy blonde beauty has felt her power go a little sour once she realized that her turd of a son can’t be controlled. Talk about a disappointed parent. She really takes after her father, doesn’t she?\n8. Little Devil + Abusive OG\n\nUgh, Joffrey is the worst. We can’t think of a better pairing for the little pissant than the hybrid Little Devil and the indica Abusive OG. If ever King Joffrey’s horrible ways feel a little too heavy for your tastes, just remember that he got b-slapped by the best character ever:\n\nSpeaking of which…\n9. Royal Dwarf \n\nTyrion Lannister is rumored to be one of the characters George R. R. Martin’s wife made him promise he would never kill off. I think every Game of Thrones fan can agree – even though he’s a Lannister, he’s still a Royal Dwarf and one of the best characters on the show.\nAnother favorite character?\n10. Jane Doe + Odyssey \n\nFierce little Arya Stark has seen many of her family members fall victim to the Game of Thrones and now she’s out for blood. This pint-sized warrior in the making has abandoned her identity and gone all Jane Doe in an attempt to take out the people on her shit list. How will her revenge Odyssey pan out?\n11. Critical Mass\n\nSticking with the Starks, we’ve never had a drastic shift in character sympathy than for poor Sansa. Sure, she was a naive, stuck-up teenager in season 1, but she’s had most of her family murdered, been held prisoner, and was nearly forced to marry a psychopath Lannister before being forced to marry another Lannister. Tyrion’s been kind to her so far but honestly, how much more suffering do you have in store for Sansa, George R. R. Martin? She seems to be at Critical Mass right now and could use a little of the happy effects this indica brings.\nKnow who else is feeling a little blue?\n12. Blue Bastard \n\nOh, Jon Snow. The bastard son of Ned Stark has been on his own Odyssey but he can’t seem to make up his mind as to what he wants (maybe he really does know “nuthing”). Is it revenge for the Starks? Does he want to protect the Night’s Watch or defect from them? Or maybe he wants to catch a glimpse of another Ogre with Ygritte (although “Jon Snuhhhh” isn’t exactly in her good graces right now). It’s been a depressing journey for him thus far – good thing Blue Bastard is good for relieving depression.\n13. White Zombie + Snow Monster\n\nWe’ve already seen a few of the horrors that lie north of the Wall, including a White Zombie who looked like a frigid Iggy Pop. Can Jon Snow protect the Seven Kingdoms from the Snow Monsters that are advancing?\n14. Super Sour Widow \n\nPoor Catelyn Stark. Even though she could never love the bastard Jon Snow, she still didn’t deserve to have her entire family either murdered or scattered across the Seven Kingdoms. Talk about a Super Sour Widow.\nAnd to make matters worse…\n15. Red Haze \n\nThat Red Wedding was effed up, yo. Like seriously. After watching that episode, you probably felt as amped up as the effects the sativa Red Haze can bring (and you were likely in a Red Haze of your own once “The Rains of Castamere” started playing).\n16. Blackwater + Green Haze\n\nAnother iconic moment in Game of Thrones, this event was less heart-breaking than the Red Wedding and more awe-inspiring. The Battle of the Blackwater has been the biggest battle in the War of the Five Kings so far. Tyrion’s use of wildfire put Stannis’ army in a Green Haze and protected King’s Landing from being overrun. By combining the indica Blackwater and the sativa Green Haze, you’re creating quite the explosive hybrid strain yourself.\n17. Cherry Bomb\n\nCherry Bomb continue to deliver (both literally and figuratively), or will her influence over him go up in flames?\n \n18. Anesthesia\n\nA little something both Jaime Lannister and Theon Greyjoy could have used throughout season 3, amirite guys? The indica Anesthesia is widely used for pain management, making it an appropriate option for these two whipping boys.\n19. Lifesaver\n\nJaime owes you one, Brienne of Tarth. Why not have him pick up this euphoric hybrid Lifesaver strain while you two bathe and reminisce about the time you both faced off against a friggin’ grizzly bear?\n20. Brains Damage\n\nWhat better way to celebrate the possibly brain-damaged but entertainingly verbose Hodor with this Hodor, I mean hybrid strain that brings sleepiness, Hodor, and Hodor Hodor.\n21. Bordello\n\nAny Game of Thrones viewer is all-too familiar with the show’s numerous “sexposition” scenes that occur in a brothel or during sex scenes to spruce up an otherwise boring plot advancement. Take a taste of the hybrid Bordello whenever a sexposition scene pops up and you’ll feel so relaxed, you’ll forget how shamelessly (and entertainingly) gratuitous these parts actually are.\n22. True OG \n\nWho will end up winning the Game of Thrones? Who do you feel is the rightful ruler of the Seven Kingdoms? Partake in this relaxing indica while you ponder who you feel the “True OG” should be.\nWill it be…\n23. Dream Queen + Triple Diesel\n\nMany Game of Thrones fans are rooting for their “Dream Queen,” Daenerys Targaryen, who’s using her Triple Diesel dragons to kick ass, free slaves, and chew bubblegum (and she’s all out of bubblegum).\nAnd finally…\n24. F*cking Incredible\n\nWhich is exactly what this show is. Happy watching!\nImage credits: mad king, House Lannister","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12001238/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie.jpg","urlslug":"/news/strains-products/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie"}],"reviewCount":100,"flavors":[{"name":"Berry","score":100.59055118110236},{"name":"Nutty","score":100.19685039370079},{"name":"Coffee","score":100.19685039370079},{"name":"Sweet","score":11.48293963254593},{"name":"Earthy","score":10.301837270341206}],"effects":[{"name":"Relaxed","score":41.994750656167973},{"name":"Sleepy","score":23.162729658792649},{"name":"Uplifted","score":21.194225721784775},{"name":"Euphoric","score":16.207349081364828},{"name":"Happy","score":15.419947506561678}],"symptoms":[{"name":"Stress","score":23.753280839895012},{"name":"Pain","score":15.026246719160104},{"name":"Depression","score":12.27034120734908},{"name":"Insomnia","score":12.27034120734908},{"name":"Muscle Spasms","score":11.48293963254593}],"conditions":[{"name":"Anxiety","score":5.31496062992126},{"name":"ADD/ADHD","score":1.7716535433070866},{"name":"Fibromyalgia","score":1.5748031496062991},{"name":"Arthritis","score":1.1811023622047243},{"name":"Migraines","score":1.1811023622047243}],"negatives":[{"name":"Dry Mouth","score":14.041994750656167},{"name":"Paranoid","score":9.31758530183727},{"name":"Dry Eyes","score":3.5433070866141732},{"name":"Dizzy","score":2.1653543307086616},{"name":"Headache","score":0.78740157480314954}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_414d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/641771/b/power-kush__primary_34f6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_203a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636075/b/power-kush__primary_e7f3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_b217.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/588086/b/power-kush__primary_97c7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_1e1d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/520462/b/power-kush__primary_1ed9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_f9f2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/514797/b/power-kush__primary_967f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-kush_100x100_c12c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/512274/b/power-kush__primary_c0ab.jpg"}],"photoTotalCount":46,"popularCities":["Portland, OR","Eugene, OR","Seattle, WA","Ann Arbor, MI","Bellingham, WA","Bend, OR","Bremerton, WA","Burlington, WA","Denver, CO","Hillsboro, OR"],"permalink":"https://mobileapi.leafly.com/indica/power-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3.97/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
