{"sl_translate":"description,descriptionPlain,category","id":397,"slug":"pure-kush","name":"Pure Kush","subtitle":null,"symbol":"Pur","category":"Indica","description":"\u003cp\u003eClear your schedule because Pure Kush is one potent indica. A longtime favorite of pain sufferers, this strain will leave you feeling heavily sedated. Pure Kush\u0026rsquo;s strength begins with its signature \u0026ldquo;kush\u0026rdquo; aroma that is extremely pungent and skunky. Upon first taste, it may have slightly sativa-like effects and create a pleasant pressure in the head and face. These head-heavy sensations are complemented by a relaxing body feeling that gives Pure Kush its reputation of one of the most powerful medical strains.\u003c/p\u003e\n","descriptionPlain":"Clear your schedule because Pure Kush is one potent indica. A longtime favorite of pain sufferers, this strain will leave you feeling heavily sedated. Pure Kush\u0026rsquo;s strength begins with its signature \u0026ldquo;kush\u0026rdquo; aroma that is extremely pungent and skunky. Upon first taste, it may have slightly sativa-like effects and create a pleasant pressure in the head and face. These head-heavy sensations are complemented by a relaxing body feeling that gives Pure Kush its reputation of one of the most powerful medical strains.\n","aka":null,"rating":4.33,"highlightedReviews":[{"id":1416994,"username":"i_miss_u_cupcake","text":"This is the Mike Tyson of strains. It just punches you right in the face and says, \"Stay the fuck down! You ain\u0027t goin\u0027 nowhere anymore. And wipe that stoney, zoned-out look off your face! Yea, I know you had a plan to eat. Everybody has a plan until they get punched in the face. Aww, you\u0027re hungry? Well, you should have grabbed some food before you started, dude. Now, you\u0027re just gonna have to sit there and think about it. Wondering how good that food would be. Wondering how do I get up with Mike Tyson here. Wondering why Mike Tyson is even in your house in the first place.  And basically wondering what the hell is even going on, because you can\u0027t focus on anything. And now your eyelids get heavy and your conscience starts to fade, because, you know, that\u0027s what happens when you get punched in the face by Mike Tyson! Now, sleep, little stoner. Drift off into the peaceful bliss of unconsciousness.\"","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"},{"id":1638927,"username":"Stonerpussy69","text":"This strain had me feeling splendid. Smoked 2 blunts and I’m ~zooted~. We are very regular smokers and it’s a good strain to look into. If you’re looking for chill ass summer vibes and looking to spend time with your step sister on the beach I highly recommend. #FreeKodak","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2967","title":"10 Cannabis Strains to Aid Digestion After a Big Meal","author":"Lisa Rough","category":null,"date":"\/Date(1448568000000)\/","text":"After you’ve devoured every last ounce of gravy your stomach can handle, doused your pumpkin pie in whipped cream, and are now lying on the couch feeling somewhere between extremely satiated and \"I hate myself,” as Louis CK would put it, I’ll bet you’re thinking what I’m thinking: Some cannabis would be mighty fine right about now.\nAfter a hefty meal loaded with (delicious, delicious) carbs, you’re bound to be feeling bloated, possibly even a little bit nauseous. You think about counteracting your discomfort with some cannabis, but which strains will offer the best digestive aid?\nDon\u0027t worry, we\u0027re hear to help! Here are some strains to ease your aching tummy after a huge holiday meal.\n \n   Thin Mint GSC (f.k.a Girl Scout Cookies)\nThis hybrid cross has some pretty impressive origins – we all know the famous GSC (f.k.a Girl Scout Cookies) of legendary status. Cross that with Durban Poison from a continent away in South Africa, and you’ve got a powerhouse combination that will knock any uncomfortable indigestion out solid (although it might knock you out, too). As an added bonus, this strain tastes like a nice minty after-dinner treat!\n \n   SFV OG Kush\nSFV OG Kush is a heavy indica to top all heavy indicas. Of Afghani origins, crossed with OG Kush and SFV OG, this indica has a spicy citrus kick followed by a sleepy stone. Don’t hit this bad boy unless you’re ready to go down for the count.\n \n   Bay Dream\nLooking for something that’ll settle your tummy but won’t leave you in a coma? Check out this savory sativa. A cross of Blue Dream and Bay 11, Bay Dream has a soothing effect on the stomach, with a cerebral burst of euphoria. This is also an excellent strain if you’re looking for a creative boost to get some work done.\n \n   Ringo’s Gift\nRingo\u0027s Gift is best for those looking for a dose of pain relief with their relaxation. This peppery strain crosses Harle-Tsu and ACDC for a powerful full-body pain reliever without the stoney couchlock effect. The body buzz is strong, but the cerebral effects are subtle – you might be talking someone’s ear off for 20 minutes before you notice.\n \n   Chemo\nThis strain’s name really says it all. It was conceived to counteract the side effects of chemotherapy, and this is easily the top strain for anyone dealing with nausea, stomach cramping, or a loss of appetite. Keep in mind that Chemo is P-O-T-E-N-T, but it\u0027s the perfect choice if you’re looking for a comfy after-dinner snooze.\n \n   Blue Hawaiian\nFor a more subtle approach, this combination of the classic Blue Dream and Hawaiian Sativa will smooth out your stomach and give you a happy head high. It\u0027s a balanced hybrid, offering a tropical taste of pineapple and a sweet burst of blueberry. After a few puffs, you’ll be feeling super mellow without a care in the world.\n \n   Strawberry\nStrawberry flavors highlight another stomach-soothing sativa strain you can try. It\u0027s especially good for those who might be prone to anxiety, as Strawberry offers a calm, relaxing buzz without the paranoia that is often common in sativa strains. This one is also a great choice for those who have social anxiety, particularly if your relatives are *ahem* out-staying their welcome.\n \n   Pure Kush\nTried and true, this indica is a favorite for those looking to stop their pain dead in its tracks. This is the strain you’ll want if you’re looking to sedate yourself into a sleepy stupor. It starts with a little sativa surge for the first few minutes, followed immediately by a pleasant pressure in your head and face. Once you settle yourself after a little dose of Pure Kush, don’t make any plans because you won’t be moving from your spot for a while.\n \n   Maui Bubble Gift\nWith a name like that, this strain sounds a bit discombobulated, but that’s really just because it’s a delightful hybrid composed of the best of all worlds. With origins in Maui Waui, Bubble Gum, and God’s Gift, this strain really is a gift. It\u0027s This usually high in CBD, with a pleasantly cerebral buzz from Maui Waui, a blast of pain relief from Bubble Gum, and a gentle, caressing body stone that swoops in at the last minute. Your tummy troubles will soon be forgotten with Maui Bubble Gift!\n \n   Hashberry\nThis is a nice indica to try as an indigestion aid that won’t knock you out. Hashberry has resinous buds covered in sticky trichomes, so keep in mind that it’s not a strain for beginners. It has a soothing effect on muscles as well as offers full body relaxation while still allowing some degree of sociability. You’ll be giggly and relaxed without being comatose.\nThere you have it! By now, hopefully you\u0027ve got your feet up, a smile on your face, and are experiencing blissful satisfaction (hopefully while wearing comfy, stretchy pants). Happy Turkey Day!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12001229/10-strains-to-aid-digestion-after-a-big-meal.jpg","urlslug":"/news/strains-products/10-strains-to-aid-digestion-after-a-big-meal"},{"id":"contentitems-2957","title":"Need to Kick-Start Your Appetite? Try These 10 Cannabis Strains to Help Induce Hunger","author":"Lisa Rough","category":null,"date":"\/Date(1441900800000)\/","text":"For some cannabis consumers, the “munchies,” or appetite stimulation, is an unwanted side effect that can lead to overeating, but for many medical marijuana patients, it provides necessary relief from symptoms like nausea and a lack of appetite. For those of you who consume cannabis as a natural appetite stimulant or to help calm gastrointestinal distress, here are 10 of the many strain varieties that can help kick-start the grumbles in your tummy:\n Goo\nGoo is a fairly heavy indica, so don’t test this strain unless you’re prepared for a strong dose of relaxation with your appetite boost. It also offers relief from painful muscle spasms, making it a good choice for spasticity or for those who suffer from gastrointestinal disorders.\n Monster Cookies\nAnother potent indica, Monster Cookies hails from the favored GSC (f.k.a Girl Scout Cookies) tribe and offers the same dose of euphoria and relaxation you know and love. The sleepy effects will increase over time, so keep your couch and your munchies close at hand and you’ll be set for the night.\n Maui Bubble Gift\nMaui Bubble Gift is an aromatic hybrid with roots in three distinctively fantastic medicinal strains: Bubble Gum, Maui Waui and God’s Gift. This indica-dominant strain has an unusually high CBD content, which makes it an excellent choice for pain and nausea sufferers. With the mental clarity of Maui Waui, the stomach-soothing spasm relief of Bubble Gum, and the relaxing effects of God’s Gift, this hybrid offers the best of three worlds in one.\n Sonoma Coma\nSonoma Coma is a rare sativa that hails from (where else?) Sonoma County, California. It offers energetic, uplifting effects with a mellow finish and a dash of the munchies to aid a diminished appetite.\n Platinum Purple Kush\nPurple Kush’s beefed-up older brother, Platinum Purple Kush provides deep muscle relaxation while still maintaining clarity and focus, making it one of the “lighter” indicas on our list. It has been known to make consumers “crazy hungry,” so make sure to have some noms on hand.\n Orange Skunk\nA citrus infusion with a clear-headed high, Orange Skunk relieves depression and anxiety in addition to a lack of appetite. With a myriad of effects, this strain can help relieve multiple symptoms, including inflammation, headaches, even pain and fibromyalgia.\n Gigabud\nThis indica-dominant hybrid is known to be expressly excellent for inducing an appetite, even among those with the most intense stomach symptoms. For those with nausea, weight loss, and issues with the digestive tract, Gigabud ought to be a staple for relief and to encourage a “ravenous” appetite.\n Caramelo\nThis sativa-dominant hybrid has indica origins in the Lavender family, offering an uplifting buzz without paranoia, along with potent pain and nausea relief. While Caramelo is an energetic strain useful for daytime consumption, be forewarned: the effects may be short-lived, so you may require a stronger strain for longtime symptom management.\n Pure Kush\nTrue to its name, Pure Kush is one of the purest, most potent indicas you’ll encounter. Watch out because this strain will knock you out like Mike Tyson if you’re not careful. Place your pizza orders before you dose or you may have trouble peeling yourself up off the couch to even get to the kitchen, which just seems….so far away….\n Diablo\nContrary to its name, this devilish strain is a kinder, gentler indica than many on this list. While couchlock is still a potential side effect, Diablo will allow you the focus and mental capacity to tackle day-to-day life without too much trouble, although you may need to watch out for a case of the giggles.\nStill looking for an appetite stimulant? Here are some other options to help make you hungry, calm your stomach, or reduce nausea:\nCannabis strains that make you hungry (click through for a full list):\n\nCannabis strains that calm your stomach (click through for a full list):\n\nCannabis strains that help relieve nausea (click through for a full list):","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/09/12001211/10-cannabis-strains-to-help-stimulate-your-appetite.jpg","urlslug":"/news/strains-products/10-cannabis-strains-to-help-stimulate-your-appetite"}],"reviewCount":280,"flavors":[{"name":"Woody","score":39.673972753241046},{"name":"Earthy","score":37.2239617666447},{"name":"Pungent","score":17.986431553504723},{"name":"Tea","score":16.895325203252032},{"name":"Berry","score":10.065782245660293}],"effects":[{"name":"Sleepy","score":65.830312019336418},{"name":"Relaxed","score":62.673725554823115},{"name":"Hungry","score":20.806553504724235},{"name":"Euphoric","score":19.423615688859591},{"name":"Happy","score":18.224703361898484}],"symptoms":[{"name":"Insomnia","score":50.054246319490218},{"name":"Stress","score":26.253158646451329},{"name":"Pain","score":25.872061085475721},{"name":"Depression","score":17.016177763128979},{"name":"Lack of Appetite","score":13.703718962865302}],"conditions":[{"name":"Anxiety","score":44.611074489123268},{"name":"PTSD","score":22.473769501208526},{"name":"ADD/ADHD","score":13.987997143484947},{"name":"Bipolar Disorder","score":12.179328718962863},{"name":"Arthritis","score":11.209074928587121}],"negatives":[{"name":"Dry Mouth","score":20.369836299714347},{"name":"Dry Eyes","score":11.842864205669084},{"name":"Dizzy","score":2.7995220830586685},{"name":"Headache","score":1.961107448912327},{"name":"Paranoid","score":1.2957317073170731}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/indica/pure-kush/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/indica/pure-kush/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pure-kush_100x100_0325.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/633550/b/pure-kush__primary_291e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pure-kush_100x100_c5cc.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/618551/b/pure-kush__primary_65bd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pure-kush_100x100_1bc4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/610064/b/pure-kush__primary_ea72.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pure-kush_100x100_7b2b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/583853/b/pure-kush__primary_88d3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pure-kush_100x100_8bac.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/552554/b/pure-kush__primary_f20d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pure-kush_100x100_8328.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/524174/b/pure-kush__primary_11eb.jpg"}],"photoTotalCount":94,"popularCities":["Portland, OR","Seattle, WA","Eugene, OR","Las Vegas, NV","Los Angeles, CA","Bellevue, WA","Salem, OR","Detroit, MI","Medford, OR","Springfield, OR"],"permalink":"https://mobileapi.leafly.com/indica/pure-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.32857142857143/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"OG Kush","subtitle":null,"slug":"og-kush","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/og-kush","symbol":"Ogk","applink":"leafly://strain/og-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":63,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"\n\tRequires a dry outdoor climate\n\tBest results when plants are grown large and not confined to pots\n\tFour phenotypes, three of which typically express sativa influence while the fourth exhibits more indica-like characteristics\n\n"}}
