{"sl_translate":"description,descriptionPlain,category","id":3708,"slug":"kosher-kush","name":"Kosher Kush","subtitle":null,"symbol":"Kos","category":"Indica","description":"\u003cp\u003eKosher Kush, offered now in seed form from DNA Genetics, originated in Los Angeles as a clone-only strain. Winner of \u003cem\u003eHigh Times\u003c/em\u003e Cannabis Cup\u0026rsquo;s Best Indica in 2010 and 2011, as well as Best Strain in 2011, Kosher Kush produces staggering levels of THC, with some samples testing over 29%. Known as one of the most odiferous \u003ca href=\"https://www.leafly.com/hybrid/og-kush\"\u003eOG Kush\u003c/a\u003e-related strains, it has a unique yet familiar smell reminiscent of rich earth and fruit, and is considered by many to be one of the tastiest smokes around. The high experienced is typical of many heavy indica strains, producing pronounced relaxation and pain relief, with sleep often following close behind. \u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Kosher Kush, offered now in seed form from DNA Genetics, originated in Los Angeles as a clone-only strain. Winner of High Times Cannabis Cup\u0026rsquo;s Best Indica in 2010 and 2011, as well as Best Strain in 2011, Kosher Kush produces staggering levels of THC, with some samples testing over 29%. Known as one of the most odiferous OG Kush-related strains, it has a unique yet familiar smell reminiscent of rich earth and fruit, and is considered by many to be one of the tastiest smokes around. The high experienced is typical of many heavy indica strains, producing pronounced relaxation and pain relief, with sleep often following close behind. \u0026nbsp;\n","aka":"koshor kush, jew gold","rating":4.55,"highlightedReviews":[{"id":1416454,"username":"Blazincropz","text":"Fucking wow man. Never before have I had a weed that i can pass around with just about everyone and have them cracking the fuck up.. this herb smell way earthy, and looks bombed with crystals.. its verrrrrrrrrrrrrrrry sticky.. it will leave the bag resinated in trichromes that you had it in and you can then press together with your fingers where the bud used to be and still hear it stick.. This is no doubt the bombest herb you may ever find if your looking for a great laugher. This bud got me fucking soaring way high, I dont think it could get any better then this for a laughy giggly ass bud to smoke. I could go on and on for days, Im amazed more people arent saying this is a giggler... Perhaps its just the way the guys grew it out here where I am.. but fucking damn its great..good for pain too, i dont notice any illness on the backpiece after blazing.. I am a fan of this weed for fucking life. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1639829,"username":"Glorious420","text":"I literally had to refind my login information just to comment about this strain. What more to say than just the Magnificent work of art and absolute pain \u0026 stress reliever immediately. I I personally smoke a lot and this really hits the spot with either one blunt, joint or a bowl rip it all does the same. Personally I recommend this strain to anyone who is curious about it.  This shitt is fire🔥","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-52310","title":"Leafly’s Faves 2017: Flower","author":"Leafly Staff","category":null,"date":"\/Date(1513710785000)\/","text":"Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis flower products of 2017. How many have you tried? What was your favorite flower of 2017? Share with us in the comments below!\n\nChocolope by Gabriel\nAvailable in: Washington\nChocolope’s bright and dreamy sativa effects are magnified by the exceptional grow practices laid out in Gabriel’s airtight facilities. Their cultivation rooms are sealed from the outside, offering perfect environmental control that is carefully manipulated to stimulate the growth of the best quality flower.\nAlso featured in:\n\nWhat Are You Smoking? Episode 15\nWashington’s Best Tasting Strains From Fall 2017\n\nKosher Kush by Santa Cruz Veteran’s Alliance\nAvailable in: California\nThe high-THC indica Kosher Kush is the perfect strain to crush symptoms of PTSD, and the Santa Cruz Veteran’s Alliance—owned and operated by military veterans—produces this pain-relieving strain for those suffering. We love that members are offered free cannabis grown by fellow veterans in rooms meant to exude peace as the cannabis flower blooms.\nAlso featured in: The VA Can’t Provide Cannabis to Veterans With PTSD, so This Group Gives It Out for Free\nDutchberry by Artizen\nAvailable in: Washington\nWith around 27% THC to 8% CBD, the cheerful hybrid Dutchberry boasts one of the highest cannabinoid contents of all time. To house such a powerhouse strain, Artizen moves in tandem with their flower from growth to packaging—and delivers some excellent buds. We love that they slow down and take a little time with their cannabis crops from start to finish.\n\nPineapple by Fire Bros.\nAvailable in: Washington\nA Seattle favorite, Fire Bros. works with their own phenotypes to produce the most effective cannabis flower for consumers. For an uplifting hybrid strain such as Pineapple, stress-relieving characteristics are an important facet enhanced by Fire Bros.’ hand-selection process.\nHybrid Blend by Lowell Farms\nAvailable in: California\nLowell Farms, which works exclusively with flower, offers seasonal blends of their best strains, and we can’t get enough of their hybrid pre-rolls. We appreciate that they’re thinking outside the box in focusing on balanced flower mixes rather than strain-specific products. Grown in organic fertilizer free of pesticides, Lowell takes pride in their dedication to all-natural cannabis as well as in providing good wages for their workers.\nAlso featured in: What Are You Smoking? Episode 3\nZkittlez by Royal Choice Farms\nAvailable in: Arizona\nArizona does not require pesticide testing for cannabis, so it’s all the more important to find a grower you can trust. Royal Choice Farms chose to be an all-organic operation built on a whole lot of love and no pesticides. By instating natural grow methods, Royal Choice keeps our minds at ease when we’re lighting up their sweet indica Zkittles.\n\nCBD Blue Shark by Marley Natural Red\nAvailable in: California, Oregon, Washington*\nWith a full cannabis operation dedicated to Jamaica’s rich culture, Marley Natural hits it out of the park with their hand-selected flower line—notably, the anti-inflammatory and CBD-rich hybrid CBD Blue Shark. Cultivated by independent growers, we love Marley Natural’s dedication to craft cannabis, their commitment to sustainable growing practices, and their RISE UP social justice program.\nBlack Cherry Soda by Royal Tree Gardens\nAvailable in: Washington\nHaving built a facility from the ground up, Washington’s Royal Tree Gardens is a company steeped in perseverance. Licensed since 2014, Royal Tree Farms has been producing fantastic cannabis ever since, and their sativa-dominant Black Cherry Soda is no exception. We’ve been packing our bowls with this strain for its potent relief, particularly for the medical patients among us.\nDo-Si-Dos by Matrix NV\nAvailable in: Nevada\nOne of the best in medical-grade cannabis production, Nevada’s Matrix NV keeps their focus on the people who will consume their products, and that’s why we love them. Their flower, including the deliciously heavy indica Do-Si-Dos, is cared for by a team of passionate people who use purified and organic products to cultivate their hand-trimmed flower collection.\nAlso featured in: Leafly TV’s Growers: Episode 101\n\nOrange Blossom by Falcanna\nAvailable in: Washington\nA small medical operation turned Tier III licensed producer, Falcanna has seen it all when comes to cannabis—from the garden to the shop. Their dedication to the herb started as a dream between founders Bethany and Justin Rondeau and turned into a full grow facility delivering exceptional cannabis across Washington State. Their bright, floral hybrid Orange Blossom is as tasty as it is elevating and provides a perfect example of their dedication to quality flower.\nWhite Tahoe Cookies by Archive Portland\nAvailable in: Oregon\nWith multiple awards under their belt, Archive Portland boasts a team of growers with over 35 years of collective cannabis growing experience. That dedication to quality trickles down to the buds, where the exceptional indica White Tahoe Cookies takes on a smooth sedative high that keeps us coming back for more.\nLemonder by Seattle’s Private Reserve\nAvailable in: Washington\nWe save Seattle’s Private Reserve flower for special occasions; grown in a facility that is tightly sealed and meticulously controlled, the euphoric hybrid Lemonder has found its way into our stash boxes and smoke circles throughout 2017. SPR’s rigorous testing of all their cannabis products lets us consume with full peace of mind.\nLead image by Nastasic/iStock\n*Editor’s note: Leafly and Marley Natural are owned by the same parent company. Also, Marley Natural Red is available in California, Oregon, and Washington but may be a different high-CBD strain in each market.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/19103646/leafly-faves-flower.jpg","urlslug":"/news/strains-products/leaflys-faves-2017-flower"},{"id":"contentitems-3605","title":"What Are the Strongest Cannabis Strains?","author":"Bailey Rahn","category":null,"date":"\/Date(1445554800000)\/","text":"Updated 02/20/2018\nLooking for a cannabis strain that will challenge your tolerance or stand up to stubborn medical symptoms? Readers ask us all the time which strains are the potent, and while that depends on a variety of factors from growing techniques to phenotypic variation, we’ve put together a list of strains that tend to deliver potent euphoric effects thanks to strong genetics and selective breeding.\nWhile THC is the main driver of potency, it’s important to understand the important role terpenes play in enhancing and shaping the strain’s high. Terpenes like myrcene, linalool, and limonene refer to aromatic compounds that lend cannabis its unique array of smells, and a cannabis strain rich in both terpenes and THC often delivers a more remarkable experience than a product that lacks chemical diversity.\n\nA Selection of the Strongest Cannabis Strains\nBelow are the mean THC levels of a few cannabis strains featured in this list. Note that these represent their average potency across several testing labs; you’ll undoubtedly come across samples with higher or lower THC levels in your own strain exploration, but this gives you a baseline idea of how these strains compare.\nNote: You can filter “potent strains” on dispensary menus to see if any of these recommendations are available near you.\nPotency data derived from six of the largest testing labs in Washington State. Click to enlarge. (Elysse Feigenblatt/Leafly)\nGSC (f.k.a. Girl Scout Cookies)\n\n\nFind GSC Nearby\nGSC (f.k.a Girl Scout Cookies) hauled its way up the ladder of fame in recent years, and it isn’t hard to see why. The genetics in this hybrid are strong, with a THC content that regularly tests above 20%. Expect a crushing wave of blissful euphoria that enshrouds both mind and body with warm relaxation for hours.\nLeafly User Review:\n“Incredible jelly foot. Very nice body pudding. Creativity mixed with amazing peaks of HD colors.” –herbknight\nKosher Kush\n\nFind Kosher Kush Nearby\nKosher Kush first blessed the world with its presence in 2010 and has been nabbing Cannabis Cup awards ever since. Its genetic background may be a mystery, but this indica’s keepers at DNA Genetics have refined a champion strain that consistently breaches 20% THC. Wrapped in a thick blanket of crystalline resin, you’ll hardly need a closer look to see that this tranquilizing indica is not one for the novices.\nLeafly User Review:\n“I can’t feel my face… or my arms, or my feet, or anything for that matter. It’s as though I’m a weightless entity with a somewhat foggy-consciousness, floating on the patio.” –ricegrain\nGhost OG\n\nFind Ghost OG Nearby\nHiding in a white cloak of crystal resin, Ghost OG is a strain that is bred for its high-octane euphoria. Said to be a cut off the original OG Kush, Ghost OG’s potency is toned by a symphony of terpenes that fuel this strain’s powerful THC engine. Find a comfy seat and prepare to be swept into a powerful, euphoric current perfect for relaxing.\nBruce Banner\n\n\nFind Bruce Banner Nearby\nBruce Banner, appropriately named after the Hulk’s alter ego, is a heavy-duty hybrid with a staggering THC content. Rated the strongest strain in 2014 by High Times following its victory in the 2013 Denver Cannabis Cup, Bruce Banner has since carved itself quite the reputation. Powered by OG Kush and Strawberry Diesel genetics, Bruce Banner delivers a dizzying punch of euphoria that anchors your body in deep relaxation.\nGhost Train Haze\n\nFind Ghost Train Haze Nearby\nIn the last few years, the Cannabis Cup leaderboards saw a new rising star: the lively and vigorous sativa known as Ghost Train Haze. Bred by Rare Dankness Seeds, Ghost Train Haze had the highest THC content of any 2011 Cannabis Cup submissions, weighing in at 25.5% THC. Inheriting genetics from Ghost OG and Neville’s Wreck, this sativa’s potency takes form in a jolt of euphoric energy that goes straight to the head, feeding focus and creativity.\nLeafly User Review:\n“My initial response was yelling. It’s almost unreasonably potent. Smooth and citrusy too, but potent. Did I mention it was potent? It was potent. A next-level sativa. Made me feel like a marijuana n00b up until now. CAREFUL, it’s potent.” –thepiginzen\nChemdawg\n\nFind Chemdawg Nearby\nChemdawg is a classic strain whose unforgettable potency keeps a vice grip on its fan base. Ripe with the scent of acrid fuel, Chemdawg delivers an unforgettable flavor profile alongside its invigorating euphoria, inviting creativity alongside firm stress relief.\nLeafly User Review:\n“I feel like I’m in gravy and it’s a real good time.” –powwow31\nGG4 (f.k.a. Gorilla Glue #4)\n\nFind GG4 Nearby\nGG4 (f.k.a. Gorilla Glue #4) is named for the stickiness of its resinous buds, and this hybrid certainly lives up to her name. It isn’t rare for GG4 to hit the mid- to upper-twenties in a potency analysis, and she’s got multiple Cannabis Cup awards to back that claim up. But we doubt you’ll need the proof when this hybrid’s got you gorilla-glued to the couch in stupefied contentment.\nThe White\n\nFind The White Nearby\nNamed for the whiteout of crystal resin cloaking her buds, The White has become a godsend for breeders looking to improve the potency of their genetics. Routinely testing between 20-28% THC, The White delivers a disorienting blizzard of euphoric delirium that commands relaxation.\nDeath Star\n\nFind Death Star Nearby\nWith a THC profile that typically dances between 20-24%, Death Star will surely wreak as much havoc as the Galactic Empire. Using its great psychoactive forces, this Sensi Star and Sour Diesel hybrid commands you to chill out as it imposes powerfully euphoric and sedating effects.\nLeafly User Review:\n“There’s no hiding the high with Death Star. We went Christmas tree shopping in the bitter cold. It took us about 45 minutes to pick out a tree…it ended up being the very first tree we saw. Then went to a bar and I confused a mirror for a window.” –hoobear\nWhite Fire OG\n\nFind White Fire OG Nearby\nBorn from The White and Fire OG, White Fire OG (also known as WiFi OG) is a force not to be trifled with. Testing data shows the impressive THC potential of this hybrid, with average levels falling between 22-29%. Its uplifting effects launch your mood into the clouds, an elevated feeling that will shake creativity and happiness wide awake.\nExplore More Potent Cannabis Strains\nCan’t get enough potent, high-THC strains for your stash jar? Here are a few more heavy-hitters for you to seek out at your next dispensary visit.\n\nKimbo Kush\nHeadband\nCherry Pie\nBubba Kush\nSFV OG\nLA Confidential\nTriangle Kush\n\nWhich other heavy-handed strains belong on this list? Tell us about them in the comments section!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12002953/what-are-the-strongest-cannabis-strains.jpg","urlslug":"/news/strains-products/what-are-the-strongest-cannabis-strains"}],"reviewCount":686,"flavors":[{"name":"Earthy","score":30.186837776638463},{"name":"Pungent","score":21.386305098814709},{"name":"Spicy/Herbal","score":14.102363099815676},{"name":"Sweet","score":13.329724673771072},{"name":"Citrus","score":11.694727237216343}],"effects":[{"name":"Relaxed","score":97.441876167283112},{"name":"Sleepy","score":71.183918805922772},{"name":"Happy","score":65.804937073522055},{"name":"Euphoric","score":50.24135294979309},{"name":"Uplifted","score":37.471237533721514}],"symptoms":[{"name":"Insomnia","score":46.47324098826919},{"name":"Pain","score":45.79778078880873},{"name":"Stress","score":44.55515832326266},{"name":"Depression","score":35.52792095433405},{"name":"Muscle Spasms","score":19.79311623393269}],"conditions":[{"name":"Anxiety","score":32.135609306527023},{"name":"PTSD","score":26.634215433161216},{"name":"ADD/ADHD","score":22.785042144260935},{"name":"Arthritis","score":16.279842012426606},{"name":"Migraines","score":12.926783120323238}],"negatives":[{"name":"Dry Mouth","score":38.632245547539696},{"name":"Dry Eyes","score":21.392866298018824},{"name":"Dizzy","score":7.3297559539068127},{"name":"Anxious","score":3.8517291048693254},{"name":"Paranoid","score":3.5485215939746828}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/indica/kosher-kush/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/indica/kosher-kush/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kosher-kush_100x100_c674.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001554/b/kosher-kush__primary_d1d6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kosher-kush_100x100_d4c5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001018/b/kosher-kush__primary_b50b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kosher-kush_100x100_e9e7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639213/b/kosher-kush__primary_0552.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kosher-kush_100x100_e70d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/634674/b/kosher-kush__primary_3fd6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kosher-kush_100x100_2ba8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/629771/b/kosher-kush__primary_77fc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kosher-kush_100x100_0a44.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/626894/b/kosher-kush__primary_c985.jpg"}],"photoTotalCount":143,"popularCities":["Portland, OR","Seattle, WA","Los Angeles, CA","Las Vegas, NV","Denver, CO","Everett, WA","Bellingham, WA","Medford, OR","Spokane, WA","Toronto, ON"],"permalink":"https://mobileapi.leafly.com/indica/kosher-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.55102040816327/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":66,"outdoorFinish":null,"height":"Tall","averageYield":"Medium","environment":null,"growNotes":"\n\tYields typically fall between\u0026nbsp;450-550g/m\u0026sup2;\n\tCan handle moderate to heavy nutrients\n\tEasy to trim\n\n"}}
