{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Lisa Rough",
            "category": null,
            "date": "/Date(1434996780000)/",
            "id": "contentitems-4265",
            "text": "Summer is heating up, but we all know that cannabis progress doesn’t take a vacation! New York’s medical program is gaining international interest, Colombia is looking at legalization, and America’s cannabis is of such high-quality that drug cartels not only prefer American-grown crops, they’ve also turned to subsidizing tomatoes to make ends meet. That and more in this week’s cannabis legalization roundup!\n \nU.S. Updates\nCOLORADO \nDenver is looking at a new proposition to allow private businesses to decide if consuming marijuana on their property should be allowed. The same group that collected signatures for recreational legalization will be leading the way to collect enough signatures to put a measure on the ballot for November 2015. The measure is still in the process of being written and revised, but would essentially allow businesses like bars and restaurants to section off an area for cannabis consumption if they so choose. This could be a big new market for Colorado and transform the already progressive landscape, as well as setting a new precedent for cannabis-friendly businesses. Keep an eye out, they’ll be releasing a campaign to collect signatures for this petition.\n \nDELAWARE \nGovernor Jack Markell just signed a measure to decriminalize the possession and private use of up to an ounce of cannabis. Despite the fact that the measure received almost no Republican support, the Delaware House and Senate, both dominated by Democrats, were able to pass it through to the governor’s desk with minimal pushback. The measure makes it legal to use cannabis in the privacy of your own home and reduces penalties down to a civil fine of $100 for the public possession of up to one ounce of cannabis.\n \nGEORGIA \nGeorgia’s Department of Public Health is launching the new registry for patients of the state’s new legal medical cannabis oil program. They just released the “Low THC Oil Registry,” a secure database for authorized patients that will allow them to obtain a special patient identification card. The patient ID card costs $25, is good for two years from the date it is issued, and will protect patients from arrest for possessing cannabis oil. Unfortunately, the law does not address how the oil will be made or distributed, as there is no legal avenue to create cannabis oil in the state of Georgia.\nIf you’re a Georgia patient looking to register, you can find all of information available here. Each patient is allowed to have up to 20 ounces of low-THC oil if they qualify according to the eight listed medical conditions:\n\nSevere seizure disorder\nMitochondrial disease\nCrohn’s disease\nCancer\nALS\nMultiple sclerosis\nParkinson’s disease\nSickle cell disease\n\n \nLOUISIANA \nAfter years of cannabis legislation stalling in Louisiana, the tide is finally turning in the Bayou State! Governor Bobby Jindal is expected to sign two separate cannabis bills into law at the end of this legislative session. Representative Austin Badon (D-New Orleans) has introduced a number of cannabis bills over the years, but many never saw the light of day or received a fair hearing in committees. One of the bills, sponsored by Rep. Badon, would lessen the penalties for second and third offenses of simple marijuana possession, significantly reducing jail time for offenses. The second bill will allow state-licensed pharmacies to dispense medical marijuana to qualified patients, which, needless to say, is a huge step forward for Louisiana.\n \nMASSACHUSETTS\nLooks like Governor Charlie Baker is fed up with the stagnant pace of Massachusetts’ medical marijuana program. The governor just issued a one-time, temporary waiver aimed at getting the ball rolling for implementation and the waiver only applies to the state’s first and only medical cannabis dispensary, Alternative Therapy Group of Salem. According to regulations, samples of product must be tested for cannabinoids, solvents, mycotoxins, heavy metals, and pesticides. Although the group has submitted samples for testing, labs in Massachusetts couldn’t test for seven out of the 18 required pesticides, essentially rendering the cannabis unsellable according to state law. Looks like Massachusetts has hit yet another stumbling block on the road to implementation despite the law’s passage more than three years ago.\n \nMICHIGAN \nThe Board of State Canvassers approved legalization petition forms for groups to gather signatures in anticipation of the 2016 general election bid. Each advocacy group will need to gather 253,000 signatures in order to place the initiative on the ballot. The Michigan Comprehensive Cannabis Law Reform Committee is being led by traditional activists and lawyers, while the other group, the Michigan Cannabis Coalition, has backing from a Republican political interest group. Each group’s initiatives differ on a number of issues, including the number personal plants and other taxation and regulation issues.\n \nNEW YORK\nThe potential market for New York’s new medical cannabis program is so high that companies from other countries are trying to get in on the action. Israel’s Tikkun Olam, one of Israel’s largest-scale industrial producers of cannabis operating under a license from the Israel Ministry of Health, will be partnering with the Compassionate Care Center of New York and applying to be a Registered Organization under the state’s new medical program. If the Compassionate Care Center gets a license from the state of New York, they will gain access to some of the top medical strains in the world, including Eran Almog, Rafael, and Erez, which are widely known and highly sought-after for their high CBD content and medicinal benefits.\nCanada is also getting into the game, with MedReleaf and Tilray, two Health Canada licensed producers of medicinal grade cannabis, applying for licenses and partnerships with local businesses. New York’s cannabis industry is heating up — we can’t wait to see what happens next!\n \nNEW HAMPSHIRE \nThe New Hampshire Department of Health & Human Services just released the list of three companies that have been selected as official Alternative Treatment Centers for the burgeoning Therapeutic Use of Cannabis Program, but the program is already facing complications. Representative Joseph Lachance (R-Manchester) is suing the department, as well as the Commissioner Nick Toumpas, over the lengthy implementation of the state’s medical marijuana program. The legislation was signed into law in 2013 and required that the state approve alternative treatment centers within 30 days of a court order and issue patient ID cards to protect the legal status of patients.\nGovernor Maggie Hassan opposes issuing patient ID cards until the treatment centers are up and running, which could be another year or more. The operators of these up-and-coming establishments certainly have their work cut out for them. In the meantime, here’s the list of the coveted new treatment centers:\n\nPrime Alternative Treatments Centers of NH (Merrimac, Hillsborough counties)\nSanctuary ATC (Grafton, Carroll, Coos counties)\nTemescal Wellness (Seacoast, Monadnock, Upper Valley counties)\n\n \nSOUTH DAKOTA \nA Native American tribe in South Dakota, the Flandreau Santee Sioux Tribe, just announced that they will be cultivating and selling cannabis for medicinal and recreational purposes by January 1, 2016. The tribe’s council just approved the decision, which will allow cannabis to be grown and sold on a single, indoor site on the reservation. This is following a federal mandate allowing tribes the power to grow and sell cannabis on their own reservations under certain conditions.\nThe Flandreau Santee Sioux Tribe already owns and operates a casino on their land and are looking at a business operation that allows a new source of revenue to develop housing, build an addiction treatment center, and improve a local clinic. This could be a new and lucrative opportunity for many reservations across the U.S. Will any others follow suit?\n \nInternational Updates\nCANADA \nThe City of Vancouver is pushing a controversial new ban on cannabis-infused edible products, despite the recent Supreme Court ruling that allows patient access to edibles. Many officials stated that they were concerned that the appeal of edibles to children may increase the number of children “poisoned” by such products, saying, “unregulated edible products pose a greater risk to adults than other forms of marijuana.”\nThere’s really quite a simple solution to this problem – regulate them! Regulations on the manufacturing of edibles, the amount of THC allowed per product, and ensuring that the packaging is clearly labeled and childproof will help improve the entire Canadian cannabis industry and ensure that patients who need or prefer the lasting effects of edibles as their medicine have access to it.\nThe silver lining? Vancouver did rule to allow cannabis oils and concentrates.\n \nCOLOMBIA \nColombia is one of the biggest drug producers in the world and is often ground zero for a negative, violent, illegal drug trade, but the country’s lawmakers are looking to change that through the legalization of marijuana. Legislators are already moving forward with a proposal for medical marijuana legalization led by Senator Roy Barreras of the city of Cali, known as a violent backdrop of southwestern Colombia. Sen. Barreras wants to take the market out of the hands of dangerous local drug gangs and allow law enforcement to confront a long-standing drug problem, saying that he truly believes that prohibition, not drugs, is fueling the prevalent gang violence. ¡Bienvenidos al futuro, Colombia!\n \nMEXICO \nIn a twist of events too strange to be foreseen, Mexican drug cartels, previously one of the largest sources of marijuana in the United States, are now requesting and actively seeking legal, American-grown cannabis. The growing trend of cannabis legalization has been hurting business for the cartels, dropping the price of their cash crop to pennies on the dollar, and now connoisseurs in Juarez are requesting Purple Haze and Purple Kush, high-quality cannabis that is available legally in the American market. Since the wave of legalization began spreading in the U.S., many cartels have been turning to harder drugs, such as meth and heroin, and, actually, even growing vegetables to sustain their business. That’s right, the cartels are turning to subsidized tomatoes over marijuana as a cash crop.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/06/23200858/leafly-cannabis-legalization-roundup-6-22-2015.jpg",
            "title": "The Leafly Legalization Roundup: Guess Which Plant Drug Cartels Are Growing Instead of Cannabis?",
            "urlslug": "/news/politics/leafly-cannabis-legalization-roundup-6-22-2015"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1390233600000)/",
            "id": "contentitems-2991",
            "text": "The Leafly Explorer is currently sitting at over 600 entries and growing. We often add new strains and products to the Explorer, ensuring that our visitors continue to receive the most up-to-date information about popular strains and products that interest them. Here's a rundown of six cannabis strains we added recently. If you've tried any of them, leave a review on their strain details pages! \n1. Erez\nErez, a best-selling cannabis variety in Israel, is an indica-dominant strain developed by the company Tikun Olam.\nCharacteristics: \n\n70% indica\nTreats sleep disorders, nausea, inflammation, indigestion, and pain\n\n2. Flowerbomb Kush\nFlowerbomb Kush by Green House Seeds is an indica-dominant hybrid bred by crossing Green Crack and OG Kush.\nCharacteristics:\n\n70% indica\nInvigorating cerebral effects\nFast-acting and long-lasting\nCreative\nStimulates appetite\nEarthy, pine, citrus, and spice aroma\nA 2nd place winner of the Amsterdam Cannabis Cup\n\n3. XXX 420\nXXX 420 from Ontario, Canada is an indica cross between Sweet Tooth #3 and Chemo.\nCharacteristics:\n\nEuphoric\nFull-body relaxation\nTook 5th place in the 2004 Cannabis Cup\n\n4. Strawberry\nOriginally bred in the Netherlands, Strawberry is a mostly sativa cannabis strain with a pungent fruity scent and uplifting effects.\nCharacteristics:\n\nStress-relieving\nRelaxing and comfortable\nFruity, berry aroma\nFlowering time of 9 weeks\n\n5. Jean Guy\nJean Guy is a sativa-dominant strain from Canada with intensely cerebral effects and a sour citrus smell.\nCharacteristics:\n\nHigh THC content\nEnergizing and uplifting\nCitrus, lime, and pine aroma\nMay treat fibromyalgia symptoms\n\n6. BC Big Bud\nA cousin to the indica-dominant Big Bud cannabis strain from Amsterdam, BC Big Bud is a mostly sativa hybrid with potent cerebral effects.\n\nPopular strain in Canada\nBalanced indica and sativa genetics\nFruity, citrus aroma\nMay treat pain and nausea\nLarge harvests\n8-9 week flowering period",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/01/12001311/6-new-strains-added-to-the-leafly-explorer.jpg",
            "title": "6 New Strains Added to the Leafly Explorer",
            "urlslug": "/news/strains-products/6-new-strains-added-to-the-leafly-explorer"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "PTSD",
            "score": 24.70238095238095
        },
        {
            "name": "Arthritis",
            "score": 19.34523809523809
        },
        {
            "name": "Parkinson's",
            "score": 4.464285714285714
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 3.571428571428571
        },
        {
            "name": "Anxiety",
            "score": 2.6785714285714284
        }
    ],
    "description": "<p>Erez, a best-selling cannabis variety in Israel, is an indica-dominant strain developed by the company Tikun Olam and is named after their first patient. Although bred for treating sleep disorders, this strain&rsquo;s 70% indica blend also effectively wards off pain, nausea, inflammation, and indigestion.</p>\n",
    "descriptionPlain": "Erez, a best-selling cannabis variety in Israel, is an indica-dominant strain developed by the company Tikun Olam and is named after their first patient. Although bred for treating sleep disorders, this strain&rsquo;s 70% indica blend also effectively wards off pain, nausea, inflammation, and indigestion.\n",
    "effects": [
        {
            "name": "Focused",
            "score": 116.66666666666666
        },
        {
            "name": "Relaxed",
            "score": 64.28571428571428
        },
        {
            "name": "Happy",
            "score": 43.1547619047619
        },
        {
            "name": "Sleepy",
            "score": 27.38095238095238
        },
        {
            "name": "Hungry",
            "score": 23.809523809523807
        }
    ],
    "flavors": [
        {
            "name": "Spicy/Herbal",
            "score": 100.89285714285714
        },
        {
            "name": "Flowery",
            "score": 33.33333333333333
        },
        {
            "name": "Berry",
            "score": 18.45238095238095
        },
        {
            "name": "Blueberry",
            "score": 18.45238095238095
        },
        {
            "name": "Sweet",
            "score": 17.559523809523807
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1397738,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/2/240",
            "text": "I am a severe PTSD sufferer.  I had high hopes for this strain as it was advertised as a new incoming.  I grabbed it the first day and have been experimenting with it for a week on and off.  I really don't have much to say.  I don't think it's a unique strain for me, it does not stand out.  I didn't notice a hard hit or even a good feel, just blaze.  Now, Tikun's Sativa strains are out of this world!",
            "username": "hax0rmort"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1615070,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/3/240",
            "text": "This got me a little dazed and confused. It's very heady and can give you a 'frozen arms' syndrome, making it hard to type. It's not necessarilly interstellar but it's up there. The one I bought was 20% THC.",
            "username": "maktown"
        }
    ],
    "id": 62127,
    "name": "Erez",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 22.023809523809522
        },
        {
            "name": "Dry Eyes",
            "score": 20.238095238095234
        },
        {
            "name": "Dizzy",
            "score": 2.6785714285714284
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/indica/erez",
    "photoTotalCount": 3,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/563477/b/erez__primary_cd71.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/erez_100x100_b947.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/403864/b/erez__primary_f348.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/erez_100x100_8bd1.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/190027/b/erez__primary_f89e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/erez_100x100_d47c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Las Vegas, NV",
        "North Las Vegas, NV",
        "Spokane Valley, WA"
    ],
    "rating": 4.27,
    "relatedStrains": [],
    "reviewCount": 26,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "erez",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.26923076923077/240",
    "subtitle": null,
    "symbol": "Ez",
    "symptoms": [
        {
            "name": "Pain",
            "score": 41.36904761904761
        },
        {
            "name": "Depression",
            "score": 39.58333333333333
        },
        {
            "name": "Stress",
            "score": 23.809523809523807
        },
        {
            "name": "Insomnia",
            "score": 22.916666666666664
        },
        {
            "name": "Nausea",
            "score": 21.13095238095238
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
