{"sl_translate":"description,descriptionPlain,category","id":367,"slug":"pure-afghan","name":"Pure Afghan","subtitle":null,"symbol":"Pua","category":"Indica","description":"\u003cp\u003eThe Pure Afghan is an exclusive \u003ca href=\"https://www.leafly.com/news/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\"\u003elandrace\u003c/a\u003e from the Mazar I\u0026nbsp;Sharif region of Afghanistan. This is one of the only DNA Genetics strains that is bred outside of Holland and are from a fresh seed stock. A rare and rewarding high for the proud cannabis connoisseur.\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"The Pure Afghan is an exclusive landrace from the Mazar I\u0026nbsp;Sharif region of Afghanistan. This is one of the only DNA Genetics strains that is bred outside of Holland and are from a fresh seed stock. A rare and rewarding high for the proud cannabis connoisseur.\n\n\u0026nbsp;\n\n\u0026nbsp;\n\n\u0026nbsp;\n","aka":null,"rating":4.72,"highlightedReviews":[{"id":1370102,"username":"MzTrillz","text":"Bedrobinol 17% THC \u003c 1% CBD\n\nThis strain makes me forget this issues of daily life and allows me to breathe again literally. It makes me calm and relaxed while, focusing on daily tasks. It also helps with pain and stomach issues from  fi·bro·my·al·gia","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png"},{"id":1583140,"username":"22ace22","text":"nice riding indica initially uplifting and great for creativity but not recommended for anything needing intense concentration. moderate couch lock with a knock-out finish good night zzzzz","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-5863","title":"The Cannabis Origin: What Is a Landrace Strain?","author":"Bailey Rahn","category":null,"date":"\/Date(1391104800000)\/","text":"At Leafly, we welcome the never ending flow of new crossbred strains. Patients are able to enjoy a spectrum of medical benefits, and connoisseurs bask in the diversity of their complex flavor profiles. For those only accustomed to plastic bags of nameless herb, signature varieties like Blackberry Kush and Red Haze introduce a new world of cannabis. But where did all these “Kushes,” “Hazes,” and countless other hybrids actually come from?\nHistorical documents from around the world, some dating as far back as 2900 B.C., tell us cannabis has lived alongside humans for thousands of years, cultivated for food, fiber, and fodder, as well as for religious and medicinal purposes.  According to the best available research, cannabis originally evolved in Central Asia and was eventually spread by humans to nearly every region of the planet. This was no accident; cannabis is one of the oldest known agricultural plants, and its multitude of uses ensured that migrants and traders took these seeds with them wherever they traveled. Prehistoric humans, who did not practice agriculture but most likely harvested wild cannabis seeds for food, spread the plant throughout the Eurasian landmass between 10,000 and 5,000 years ago. Later civilizations spread cannabis to the Middle East, Africa and Southeast Asia in the period between 2,000 and 500 years ago, and eventually to the New World around the year 1545 A.D. and Australia in 1788. Without human intervention, cannabis would have been confined to Central Asia, as its innate dispersal mechanisms are extremely limited.\n\nOutside of Central Asia, all landrace strains are the result of escaped (or “feral”), cultivars, strains that were selectively bred by humans, which then gradually adapted to their environment over time. Along the way, other newer cultivars would have interbred with these feral escapees.  (Even within the prehistoric range of Central Asia, it is suspected that feral domesticated cannabis has interbred with its wild ancestors, making the current existence of an original indigenous strain unlikely.)\nThese factors account for genetic variation between landrace strains, which have been crossbred to produce the cannabis variety we see today. Landrace strains are oftentimes named after their native or adopted region (e.g., Afghani, Thai, Hawaiian), and traces of these forefather strains are sometimes detectable in the names of their crossbred descendants. A combination of environmental conditions and selective breeding by native populations gave rise to these stable varieties, the forefathers of all modern strains.\n\nToday’s cannabis market, driven by our widespread obsession with variety, rarely sees these pure landrace strains. On Leafly, most of the sativas you find (denoted with a red tile) are not pure sativas, but rather sativa-dominant hybrids that exhibit strong sativa-like attributes. Same goes for indicas (purple tiles). The hybrids, marked with green tiles, refer to strains with more balanced indica-sativa characteristics. Hybridization leaves us with very few original landrace strains, but they are not lost completely.\nDuring the 1960s and 70s, growers worldwide began collecting landrace strains to breed in their own local gardens. These strains, called heirlooms, were then propagated in other environments like Hawaii and California. Arjan Roskam, founder of Greenhouse Seeds in Amsterdam, is one of these strain hunters. He and his colleague Franco Loja favor these landraces in their selective breeding of Greenhouse varieties.\n\n“Arjan always considered these landraces very important for the breeding process because they are the bases that have been selected by nature,” Franco told us, “The [span of time] over which nature does this is so huge that they are not replicable by man under any conditions — not indoor, not outdoor, not in any way.”\nEnvironment is a key player in the formation of cannabis compounds like cannabinoids (e.g., THC, CBD) and aromatic oils, called terpenes. Climate, weather, soil, fertilization, and even the time at which the cannabis is collected affect the chemical makeup of cannabis, and landraces, having adapted to their conditions over time, are considered by some to have preferred synergistic levels of therapeutic compounds.\n\nMost cannabis breeders have been selectively breeding their strains over time for a high THC content, favoring this psychoactive cannabinoid over its other important chemical constituents like CBD. A revival of these secondary cannabis constituents has led to the introduction of high-CBD product options, which have expanded the medical potential of cannabis by a great degree. It begs the question, what will we learn from breeding practices that further diversify cannabis’ chemical profiles?\nThey may be uncommon, but landrace and heirloom varieties still bloom around the world. Here are just a few from different regions around the world:\nAfghanistan/Pakistan\n      \nJamaica\n  \nMexico\n\nAfrica\n      \n \nSouth and Central America\n  \nAsia\n    \n \nheader photo credit: eggrole via photopin cc","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/01/29195154/the-cannabis-origin-what-is-a-landrace-strain.jpg","urlslug":"/news/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain"}],"reviewCount":53,"flavors":[{"name":"Flowery","score":93.075117370892016},{"name":"Earthy","score":51.1150234741784},{"name":"Woody","score":47.94600938967136},{"name":"Pine","score":47.241784037558681},{"name":"Pungent","score":1.7605633802816902}],"effects":[{"name":"Relaxed","score":149.11971830985917},{"name":"Sleepy","score":145.24647887323943},{"name":"Happy","score":132.74647887323943},{"name":"Euphoric","score":64.671361502347409},{"name":"Creative","score":49.706572769953048}],"symptoms":[{"name":"Stress","score":98.708920187793424},{"name":"Pain","score":74.061032863849761},{"name":"Insomnia","score":63.967136150234737},{"name":"Depression","score":28.52112676056338},{"name":"Lack of Appetite","score":15.316901408450704}],"conditions":[{"name":"Anxiety","score":63.6150234741784},{"name":"Crohn\u0027s Disease","score":47.593896713615017},{"name":"PTSD","score":25.704225352112676},{"name":"Cachexia","score":12.5},{"name":"Migraines","score":3.169014084507042}],"negatives":[{"name":"Dry Mouth","score":16.02112676056338},{"name":"Dry Eyes","score":2.464788732394366},{"name":"Dizzy","score":0.35211267605633806},{"name":"Headache","score":0.35211267605633806},{"name":"Paranoid","score":0.35211267605633806}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pure-afghan_100x100_3647.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639146/b/pure-afghan__primary_c68e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pure-afghan_100x100_3cdc.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/605579/b/pure-afghan__primary_ee5c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pure-afghan_100x100_1655.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509725/b/pure-afghan__primary_de0d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pure-afghan_100x100_86c0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/479627/b/pure-afghan__primary_dadf.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pure-afghan_100x100_9ffd.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/404014/b/pure-afghan__primary_e102.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/pure-afghan_100x100_5d0c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/293643/b/pure-afghan__primary_773c.jpg"}],"photoTotalCount":10,"popularCities":["Portland, OR","Calgary, AB","Denver, CO","Durango, CO","Edmonton, AB","Ellensburg, WA","Everson, WA","Lethbridge, AB","Phoenix, AZ","Portland, ME"],"permalink":"https://mobileapi.leafly.com/indica/pure-afghan","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.71698113207547/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
