{"sl_translate":"description,descriptionPlain,category","id":65488,"slug":"nordle","name":"Nordle","subtitle":null,"symbol":"Nor","category":"Indica","description":"\u003cp class=\"p1\"\u003eNordle, named after Howard Marks\u0026rsquo; code word for \u0026ldquo;hashish,\u0026rdquo; is a high-CBD indica cross between \u003ca href=\"http://www.leafly.com/indica/afghani\"\u003e\u003cspan class=\"s1\"\u003eAfghani\u003c/span\u003e\u003c/a\u003e and Skunk. With a CBD content as high as its THC concentrations, Nordle delivers mild effects that relieve pain and muscle spasms. Nordle, which flowers in 8 to 10 weeks, produces dense, conic buds with a pungent fruity and herbal aroma.\u003c/p\u003e\n","descriptionPlain":"Nordle, named after Howard Marks\u0026rsquo; code word for \u0026ldquo;hashish,\u0026rdquo; is a high-CBD indica cross between Afghani and Skunk. With a CBD content as high as its THC concentrations, Nordle delivers mild effects that relieve pain and muscle spasms. Nordle, which flowers in 8 to 10 weeks, produces dense, conic buds with a pungent fruity and herbal aroma.\n","aka":null,"rating":4.35,"highlightedReviews":[{"id":1414354,"username":"mindspace","text":"This was my first time trying any kind of cannabis in over 10 years. \n\nI only experimented occasionally in my youth, for a year or two when I first when to college. My experiences were very mixed, but for the most part, I didn\u0027t like it. \n\nI decided to start researching cannabis use again as I\u0027ve developed terrible insomnia which is brought on by anxiety attacks at night. Also, I do enjoy having a drink, but I\u0027d like to cut back on alcohol and have something more healthy for recreational use. \n\nAnyway, all my research pointed towards high CBD, low THC strains. I used to get panic attacks, racing heart, paranoia etc very easily with cannabis, and thats why I stopped. I was very apprehensive but was very interested in trying it again, as I had a few good experiences too. I just needed to find the right strain. \n\nNordle, being indica, was said to be good for relaxing and sleep. I had also read it was very mild in general, which also appealed to me. I bought my Nordle from CBD Crew as they had lab tested their product to prove it was indeed high in CBD. \n\nI finally bought a vaporiser and tried some. It was a very enlightening experience. (In my previous experience as a youth, people smoked joints mixed with tobacco - I don\u0027t smoke tobacco so it probably added to the dizzy and nausea). \n\nWhen I took my first draw of the vaporiser, I was feeling a little worried how I\u0027d react. Because of this - as the effects started to set in, I was a little on edge and tense. However, as I continued to take more, I realised that it wasn\u0027t getting any worse, and that it was my own mind being reluctant to let go. \n\nI began to relax and had a really good time once I realised it was my own mind, and it actually wasn\u0027t making me freak out. It made me feel quite sedated, with some heavy couch lock as I pushed further to see how much I could vape. My eye lids grew heavy. \n\nI vaped about half a gram and was feeling very floaty, a little spacey, with heavy eye lids, a little couch lock, dry mouth, and my appetite was increased. \n\nIt\u0027s hard to describe, but I still felt very lucid and self aware of how I was feeling, yet at the same time, concentration was difficult and reading simple sentences on the TV guide was a struggle. \n\nIt requires the user to allow it to take over, and allow yourself to zone out and turn off. Its for winding down and relaxing for sure. \n\nConsidering it was my first time, and my tolerance is presumably extremely low, I was surprised I could handle a half gram all to myself and remain feeling calm. It would suggest to me that this is a mild, mellow strain. Not racy or too trippy, with a mostly body stone. \n\nIts hard to know if it worked for my medical requirements, helping me to sleep, because it was my first time and I was trying to relax my mind. When I went to bed I was worried that I didn\u0027t feel sedated enough to sleep. My mind was thinking about many things, and I kept losing my train of thought.... however, somewhere during these deep thoughts, I forgot about time, and drifted off to sleep. Perhaps the more used to it I get, the more it will relax me and help me sleep - we\u0027ll see. \n\nAs for taste - I was VERY surprised. It was my first experience of using a vaporiser. I bought an Arizer Air. I had read many reviews in which people discuss all the different flavours of cannabis. I thought that as someone not used to it, it may be too subtle to notice. Instead, when I took my first vape, I could taste a fairly strong flavour of lemon, citrus and pine, with some earthy under tones. I noticed that when it was nearly time to re-fill with fresh bud, it had began to taste more of biscuit, wood and earth. \n\nI\u0027d say this strain is good for beginners. When vaped it seems to build up very slowly, but you can take enough to make the effects as strong as you like. Very manageable. No paranoia or anxiety, no dizziness or nausea. Much more of a body stone than a mind stone, but it does dull the thought process. Mellow and relaxing, good for night time. \n\nTasted very nice for those into pine and lemon/citrus.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"},{"id":1572423,"username":"FirLam","text":"The one I tried was THC 7.3 and CBD 11.9. \nA great CBD option (Medicinal) with a touch of Indica.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59186","title":"Which Cannabis Strains Are Highest in CBD, According to Lab Data?","author":"Bailey Rahn","category":null,"date":"\/Date(1519851079000)\/","text":"Cannabidiol, or CBD, is becoming a mainstay in consumers’ medicine cabinets as it combats pain, inflammation, anxiety, and much more. However, even as CBD strains and products become more readily available, the price tag can often make one flinch. For this reason, it’s worth knowing which products will bring the best value based on CBD abundance.\n\nLooking at data from cannabis testing labs across Washington State, we compiled a list of strains that tend to produce significant amount of CBD. These numbers are derived from the testing samples of cannabis flowers and do not include CBD concentrates.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nIn the above graph, you’ll find the average cannabinoid contents of ten popular CBD-dominant strains. You’ll notice that many of these strains contain only trace amounts of THC, while others exhibit a more balanced CBD:THC ratio (which means they will be more euphoric in effect). This graph is based on datasets from multiple reliable testing labs across Washington State. However, it’s worth noting that the datasets from each individual lab differ slightly.\nTake a look at the cannabinoid data from one lab, and notice how the numbers shift slightly.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nMost strains maintain a CBD:THC ratio similar to that in the averaged dataset. However, you’ll also see deviations, like ACDC which exhibits a more balanced CBD:THC ratio according to this lab’s individual testing results.\nNow let’s see how the dataset of Lab A compares to a different lab, also represented in the larger, averaged dataset above.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nAs you can see, the CBD levels from Lab B are much higher on average than those from Lab A. There are a number of possible explanations for this. A lab may manufacture bloated cannabinoid profiles, as we’ve seen some labs do in the past. It could also be that Lab B simply tested samples from growers who achieved higher CBD levels in their harvest.\nThe main takeaway here is this: the cannabinoid profile printed on your product depends not only on the strain’s genetics and expertise of the grower, but also on the testing methods (and ethics) of the local lab that performed the chemical analysis. The Dancehall you bought on your last trip to the dispensary is likely to reflect the cannabinoid data illustrated in the above graphs–however, if you see deviation, the reason lies in the many layers of strain and data variability.\n\nCannabis Strains With High Levels of CBD\nWith this caveat in mind, let’s look at the strains that expressed the highest levels of CBD according to the above lab data.\n\nFind Dancehall Nearby\nDancehall is an upbeat and inspiring strain meant to lift your spirits while coercing creativity. With a CBD:THC ratio of nearly 20:1 on average, this strain delivers little to no euphoric effects that might distract focus or dampen cognition in THC-sensitive consumers.\n\nFind ACDC Nearby\nKnown for its keen ability to lift anxiety of all shades, ACDC is a godsend to consumers susceptible to the side effects of THC. This strain allows you to harness many of the desirable traits of cannabis, like light-footed physical relaxation and gentle mood elevation, without the cost of a clear, calm mind.\n\nFind Suzy Q Nearby\nSuzy Q is a CBD-dominant strain with an extremely modest amount of THC, making it another mellow strain with little to no high. The mild effects of this pine-scented strain help you shed anxious or demotivating mental blocks that stood in the way of creativity and productivity.\n\nFind Ringo’s Gift Nearby\nNamed in recognition of the CBD pioneer Lawrence Ringo, Ringo’s Gift imbues the consumer with a sense of wellbeing alongside steady relief in the body. Use this strain to take the edge off pain and stress, while allowing the mind to roam free without the shackles of paranoia or distracting euphoria.\n\nFind Charlotte’s Web Nearby\nCharlotte’s Web was the first CBD strain to receive media attention, and has achieved legendary status among CBD varieties ever since. Although its reputation is built upon its success in treating epilepsy, this strain has aided patients treating many other conditions including pain, anxiety, and inflammation. Charlotte’s Web is grown by CW Pharmaceuticals in Colorado.\n\nFind Remedy Nearby\nRemedy is a high-CBD strain that quietly ushers in easy relaxation without mental fog. For consumers seeking something a little more relaxing than a cup of tea, Remedy offers a solution with effects that rid the mind of anxiety while soothing aches, pains, and inflammation.\n\nFind Sour Tsunami Nearby\nSour Tsunami has become a household name among high-CBD strains. This variety tends to produce less than 1-2% of THC, so you can reap its medicinal benefits without the high. Sour Tsunami is fairly prolific, so keep an eye out for this strain at your next dispensary visit if you’re looking to quell pain or anxiety symptoms without the interference of THC.\n\nFind Hawaiian Dream Nearby\nIf you’re looking to harness the benefits of THC and CBD but wary of getting too high, Hawaiian Dream is the strain for you. With a THC content of around 5% and a CBD profile stretching between 5-10%, Hawaiian Dream can help abate symptoms with only mild, gentle euphoria. As an added bonus, this strain throws in a little tropical flavor to sweeten the experience.\n\nFind Dance World Nearby\nDance World is a CBD-dominant strain that almost achieves a balanced CBD:THC ratio, making it especially appropriate for consumers struggling with pain, depression, and lack of appetite. This synergy of THC and CBD helps to inspire positivity and more vibrant moods by handing you subdued euphoria on a leash.\n\nFind Nordle Nearby\nNordle offers a balanced abundance of both THC and CBD that makes it especially suitable for patients dealing with pain, insomnia, muscle spasms, and anxiety. If your symptoms are keeping you up at night, Nordle is a great nightcap solution for dialing down pain and worries so you can spend less time tossing and turning.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28121936/high-cbd-strains.jpg","urlslug":"/news/strains-products/high-cbd-marijuana-strains-according-to-lab-data"}],"reviewCount":52,"flavors":[{"name":"Citrus","score":13.160291438979963},{"name":"Pungent","score":11.111111111111111},{"name":"Sweet","score":10.883424408014571},{"name":"Pine","score":8.0145719489981779},{"name":"Lemon","score":7.1948998178506374}],"effects":[{"name":"Relaxed","score":148.9071038251366},{"name":"Focused","score":75.5009107468124},{"name":"Euphoric","score":61.293260473588347},{"name":"Happy","score":26.502732240437155},{"name":"Uplifted","score":17.668488160291439}],"symptoms":[{"name":"Stress","score":82.4681238615665},{"name":"Insomnia","score":64.38979963570128},{"name":"Nausea","score":58.014571948998181},{"name":"Depression","score":28.369763205828779},{"name":"Pain","score":27.322404371584696}],"conditions":[{"name":"Anxiety","score":77.3224043715847},{"name":"ADD/ADHD","score":58.014571948998181},{"name":"Fibromyalgia","score":13.979963570127504},{"name":"PTSD","score":9.24408014571949},{"name":"Arthritis","score":8.83424408014572}],"negatives":[{"name":"Dry Mouth","score":27.550091074681237},{"name":"Dry Eyes","score":7.1948998178506374},{"name":"Dizzy","score":6.3752276867030968},{"name":"Paranoid","score":0.819672131147541},{"name":"Anxious","score":0.4098360655737705}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/nordle_100x100_7a5b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001315/b/nordle__primary_41cd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/nordle_100x100_fc82.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/562459/b/nordle__primary_5ea4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/nordle_100x100_ea82.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/560426/b/nordle__primary_5ef7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/nordle_100x100_7cda.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/495851/b/nordle__primary_c789.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/nordle_100x100_00ea.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/496010/b/nordle__primary_2fbc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/nordle_100x100_8337.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/355438/b/nordle__primary_e789.jpg"}],"photoTotalCount":9,"popularCities":["Denver, CO","Arlington, WA","Aurora, CO","Bellevue, WA","East Wenatchee, WA","Everson, WA","Friday Harbor, WA","Lynnwood, WA","Portland, OR","Salem, OR"],"permalink":"https://mobileapi.leafly.com/indica/nordle","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.34615384615385/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
