{
    "aka": "Black Diamond OG, Black Diamond OG Kush, Black Diamond Kush",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1509477174000)/",
            "id": "contentitems-46728",
            "text": "Rhythm and Blues is a rich genre with roots planted firmly in the black American community. It is a genre synonymous with emotion—music that feeds the soul and tells stories of pain and love. Born in the 1940s, R&B has evolved over the decades to mean different things during different times while covering other genres such as gospel, funk, hip hop, and soul.\n\nDiverse as it is, there is a rich plethora of R&B to explore and appreciate. While the genre may encompass many elements, R&B will always be known for radiating feeling and heart. As R&B artist Kenny “Babyface” Edmonds says, “R&B is the one thing that has influenced every kind of music.” Pack a bowl and turn up these five powerful R&B albums to electrify your next smoke session.\nWoman by Jill Scott\n\nStrain Pairing Recommendation: Ultraviolet OG\nJill Scott’s album Woman marks her fifth and latest release. The album showcases Scott’s powerful and hypnotic voice against irresistibly catchy beats. Don’t bother fighting it—Woman pulls you in and captures the imagination and spirit with songs such as “Run Run Run,” which hit with so much energy that it feels like Scott in the same room as you, singing her heart out, while the band plays with joyful fervor behind her.\n\nNew Amerykah Part Two: Return of the Ankh by Erykah Badu\n\nStrain Pairing Recommendation: Everlast\nNew Amerykah Part Two has an uplifting, whimsical feel, with tracks such as “Incense” featuring wistful vocals and gentle rhythms. Erykah Badu’s voice, at once both strong and soothing, is a delight to luxuriate in, and it takes center stage against a backdrop of steady and well-rounded instrumentation. Released in 2010, the album encompasses Badu’s neo-soul flavors, with elements of funk, hip hop, and electronic mixed in. All in all, it is a truly heartfelt album, with a vibe that will have you in your feels from the first to the last note.\nLet Love Rule by Ledisi\n\nStrain Pairing Recommendation: Black Diamond\nLedisi’s uplifting voice is captivating on her 2017 album, Let Love Rule. Ledisi takes the listener on a journey through various sounds and themes, with influences of hip hop and soul woven throughout. Let Love Rule is a work of poignancy, incorporating important social issues like the Black Lives Matter movement. Her song “Shot Down” addresses police brutality against black Americans with lyrics like “Shot down on display in the middle of the story / She was shot down in the park in the middle of the day,” and “The System says we matter, but the black lives only / Matter certain days.” Ledisi combines these raw, real lyrics with her powerful, soulful voice, and exquisite instrumentals make it all sound effortless—though it is anything but.\n\nFunk This by Chaka Khan\n\nStrain Pairing Recommendation: Mother of Berries\nLegendary “Queen of Funk” singer/songwriter and talented drummer Chaka Khan has been producing music for five decades, incorporating funk, jazz, and soul influences. Funk This, released in 2007, is Khan’s most modern album that exemplifies her unique sound and style. The album features funky R&B beats, full instrumentation, and Khan’s signature vocals ripe with feeling and presence. From high-energy tracks such as “Disrespectful” to soulful ballads such as “Angel,” Funk This is an immersive album that demonstrates why Khan is called Queen.\nThe Miseducation of Lauryn Hill by Ms. Lauryn Hill\n\nStrain Pairing Recommendation: Punky Lion\nLauryn Hill’s first solo album, released in 1998, gained wide spread acclaim and went on to break records. The Miseducation of Lauryn Hill is a hard-hitting and expertly assembled album featuring Lauryn Hill’s unique mix of beauty and boldness. With elements of rap, reggae, hip hop, and soul, Hill fluctuates effortlessly between commanding lyrical composition and light, effervescent singing—both of which pull the listener in and captivate. Paired with engaging and expertly composed instrumentation, The Miseducation of Lauryn Hill is a uniquely personal album, where one can truly feel a part of Hill’s being in every track and in every line.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/10/31103330/rb-albums.jpg",
            "title": "5 Exceptional R&B Albums to Listen to While High",
            "urlslug": "/news/lifestyle/great-rb-albums-to-listen-to-while-high"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1451342040000)/",
            "id": "contentitems-2997",
            "text": "In your experience, are there any particular cannabis strains that lead to more laughing fits than others? You might already know what your go-to giggly strain is, but we’ve got some recommendations for the next time you need a companion strain to that funny movie, comedy show, or time spent kicking back with friends. With the help of Leafly user-submitted reviews, we uncovered the strains that consumers like yourself rated as most giggly. Here are seven top contenders; you can also browse an expanded list of gut-busting strains in the Explorer.\nBlue Diesel\n \nIntroduced by strong flavors of sour blueberry, Blue Diesel is a hybrid to elevate you to an uplifted and jovial mindset. Its nimble cerebral effects make Blue Diesel a perfect daytime companion strain, and the giddy euphoria is sure to bring on spells of laughter (unfortunately to an exaggerated degree for one Leafly reviewer).\n\n“I laughed so hard that I threw up. And that made me laugh more.”\nLaughing Buddha\n \nLaughing Buddha’s effects can be understood simply by reading its name: a relaxed state of mind gives way to joyful elation. With an earthy and herbal sage aroma, this sativa helps you let go of stress and unlock a more lighthearted outlook on life. This strain is a favorite for weekend nature excursions with friends, or for getting your day started with a smile.\n\n“Made me feel like nothing could annoy me, I just laughed it off! Very giggly, and made me take myself less seriously.”\nChurch OG\n \nA serious name for a not-so-serious strain, Church OG is a heavy indica that’ll knock you into stupefied episodes of laughter (especially if friends are around to trigger it). The OG Kush descendent packs a sleepy punch in large doses, so take this one slowly if bedtime is still far off.\nChemdawg\n \nThe effects produced by Chemdawg’s high THC content can manifest in many ways, one of which is clearly fits of laughter. This one’s a personal favorite of mine for creative collaborations and chilling with close friends, since it lends both social and artistic energy. However, mind the word of caution from the Leafly reviewer below.\n\n“Prepare for laugh attacks and an extremely heavy body and head high. Everything becomes funny as hell and I legit pissed myself while laughing so hard at a Steak and Shake drive-thru.”\nSweet Diesel\n \nWith a champion heritage from OG Kush and Sour Diesel, Sweet Diesel masterfully captures everything we love about sativas: a little boost of wakefulness, creative energy, social engagement, and nonstop giggles.\nBlack Diamond\n \nSometimes the best way to unwind after a long, active week is to sit down with a sedating couch-lock strain and a Netflix comedy marathon. Black Diamond is a perfect match for lazy weekends or long bedrest recoveries that take a toll on your mood.\n\n“One of the main things I noticed when I’m on this is that the smallest things trigger the biggest laughing spell you will ever see in yourself again. I swear I saw the funniest shit ever on it, and it was the first time any strain made me laugh for more than 20 minutes straight.”\nMango Kush\n \nFirst comes that unforgettable mango flavor, and then it’s all giggles. Few strains have more to offer the flavor enthusiast and the social butterfly alike than Mango Kush. Named for its strong fruity mango aroma, this hybrid keeps you chatty and upbeat for social outings or when you’re just kicking it with best friends.\n\n“Two bowls put me and a buddy into a fit of giggles for a good 45 minutes while munching down on a bag of Cheetos. Then we got serious for a bit and had just about the most beautiful in-depth talk ever.”",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12001323/7-giggly-cannabis-strains-for-inducing-laughing-fits.jpg",
            "title": "7 Giggly Cannabis Strains for Inducing Laughing Fits",
            "urlslug": "/news/strains-products/7-giggly-cannabis-strains-for-inducing-laughing-fits"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 16.723184223184223
        },
        {
            "name": "PTSD",
            "score": 12.433381433381433
        },
        {
            "name": "Migraines",
            "score": 6.762145262145261
        },
        {
            "name": "Fibromyalgia",
            "score": 4.430976430976431
        },
        {
            "name": "Multiple Sclerosis",
            "score": 3.7037037037037033
        }
    ],
    "description": "<p class=\"p1\">Black Diamond is a Northern California strain ideal for patients who need strong medication but still want to be active and sociable. A cross between <a href=\"http://www.leafly.com/indica/blackberry\"><span class=\"s1\">Blackberry</span></a> and <a href=\"http://www.leafly.com/indica/diamond-og\"><span class=\"s1\">Diamond OG</span></a>, its flowers have a glittery trichome covering and purple coloring that make it a beautiful gem to look at. The strain&rsquo;s aroma is musky and earthy, almost like a deep red wine. Black Diamond is known to cause fits of giggles and is a great strain for hanging out with friends or catching up on TV shows at home. This strain tends to make consumers&nbsp;extremely hungry, making it a good choice for those looking to increase their appetite (just make sure you have some snacks on hand).</p>\n",
    "descriptionPlain": "Black Diamond is a Northern California strain ideal for patients who need strong medication but still want to be active and sociable. A cross between Blackberry and Diamond OG, its flowers have a glittery trichome covering and purple coloring that make it a beautiful gem to look at. The strain&rsquo;s aroma is musky and earthy, almost like a deep red wine. Black Diamond is known to cause fits of giggles and is a great strain for hanging out with friends or catching up on TV shows at home. This strain tends to make consumers&nbsp;extremely hungry, making it a good choice for those looking to increase their appetite (just make sure you have some snacks on hand).\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 63.14093314093314
        },
        {
            "name": "Happy",
            "score": 38.28234728234728
        },
        {
            "name": "Sleepy",
            "score": 37.63047138047138
        },
        {
            "name": "Euphoric",
            "score": 31.288840788840787
        },
        {
            "name": "Hungry",
            "score": 24.36111111111111
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 19.806758056758056
        },
        {
            "name": "Woody",
            "score": 13.053511303511302
        },
        {
            "name": "Berry",
            "score": 12.300264550264549
        },
        {
            "name": "Pungent",
            "score": 11.465848965848966
        },
        {
            "name": "Grape",
            "score": 7.952861952861952
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1391865,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This is one of my favorite strains still and i get it whenever possible. This strain is one of those magical strains that just seems to cure all ailments without any negative side effects. It also feels the best out of any strain and the high is a real treat. It has an excellent body high similar to that of blackberry kush but its on a whole other level. Its strong but not overwhelming, almost similar to an opiate high but warm and inviting. This is the best strain for any occasion really, as it will cure even the worst of insomnia without knocking you out, relieve you of your pain and stress and give you a good mood for the rest of the day. I recommend this for medical and recreational purposes and it is something that will satisfy even the most experienced weed connoisseurs.\n\nThis strain comes from Diamond OG x Blackberry Kush so it has everything a good OG has plus the darker buds and fruity smell. I enjoy both of those strains but i feel as if combining the two has actually multiplied the effects of both rather than added.",
            "username": "DionysianMystery"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1642764,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/3/240",
            "text": "After five minutes vaping this strain:\n•not feeling much so far;\n•flavor is very earthy, smells sweet-ish;\n•lots of coughing;\n•starting to feel it lightly in the very middle of my head; gradually turns into a slight heaviness in the head and shoulders;\n•made for a pleasant sleep. \n\nAll in all, BD hit me quite mildly. I'll have to try it again sometime and re-evaluate. ",
            "username": "LaTig001"
        }
    ],
    "id": 7981,
    "name": "Black Diamond",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 25.246632996632997
        },
        {
            "name": "Dry Eyes",
            "score": 8.655002405002405
        },
        {
            "name": "Dizzy",
            "score": 2.2564935064935066
        },
        {
            "name": "Anxious",
            "score": 1.62012987012987
        },
        {
            "name": "Paranoid",
            "score": 0.9090909090909091
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/blackberry",
            "category": "Hybrid",
            "name": "Blackberry",
            "permalink": "https://mobileapi.leafly.com/hybrid/blackberry",
            "slug": "blackberry",
            "subtitle": null,
            "symbol": "Bbr"
        },
        {
            "applink": "leafly://strain/diamond-og",
            "category": "Indica",
            "name": "Diamond OG",
            "permalink": "https://mobileapi.leafly.com/indica/diamond-og",
            "slug": "diamond-og",
            "subtitle": null,
            "symbol": "Dg"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/black-diamond",
    "photoTotalCount": 73,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003333/b/black-diamond__primary_5e1c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-diamond_100x100_39ca.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003331/b/black-diamond__primary_c6b8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-diamond_100x100_f01a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001754/b/black-diamond__primary_37aa.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-diamond_100x100_1c96.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000139/b/black-diamond__primary_7543.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-diamond_100x100_84dd.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636272/b/black-diamond__primary_7eca.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-diamond_100x100_a635.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/582123/b/black-diamond__primary_25d9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-diamond_100x100_9f7a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Vancouver, BC",
        "Toronto, ON",
        "Calgary, AB",
        "Montréal, QC",
        "Edmonton, AB",
        "Hamilton, ON",
        "Los Angeles, CA",
        "Portland, OR",
        "San Diego, CA",
        "Winnipeg, MB"
    ],
    "rating": 4.41,
    "relatedStrains": [],
    "reviewCount": 258,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "black-diamond",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.40697674418605/240",
    "subtitle": null,
    "symbol": "Bdi",
    "symptoms": [
        {
            "name": "Stress",
            "score": 29.288840788840787
        },
        {
            "name": "Depression",
            "score": 25.246632996632997
        },
        {
            "name": "Pain",
            "score": 23.295334295334296
        },
        {
            "name": "Insomnia",
            "score": 14.267797017797017
        },
        {
            "name": "Inflammation",
            "score": 11.54052429052429
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
