{"sl_translate":"description,descriptionPlain,category","id":25,"slug":"northern-lights","name":"Northern Lights","subtitle":null,"symbol":"Nl","category":"Indica","description":"\u003cp\u003e\u003ca href=\"http://www.leafly.com/news/products/strain-highlight-northern-lights-the-indica-legend-up-close\"\u003eNorthern Lights\u003c/a\u003e stands among the most famous strains of all time, a pure \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e cherished for its resinous buds, fast flowering, and resilience during growth. Itself a descendant of indigenous \u003ca href=\"http://leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e\u0026nbsp;and \u003ca href=\"https://www.leafly.com/sativa/thai\"\u003eThai\u003c/a\u003e\u0026nbsp;\u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\"\u003elandrace strains\u003c/a\u003e, Northern Lights has given rise to famous \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrids\u003c/a\u003e like\u0026nbsp;\u003ca href=\"http://www.leafly.com/hybrid/shiva-skunk\"\u003eShiva Skunk\u003c/a\u003e\u0026nbsp;and \u003ca href=\"http://www.leafly.com/sativa/super-silver-haze\"\u003eSuper Silver Haze\u003c/a\u003e. Rumor has it that Northern Lights first sprouted near Seattle, Washington, but was propagated out of Holland after 1985 at what is now Sensi Seeds.\u003c/p\u003e\n\n\u003cp\u003ePungently \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-spicyherbal\"\u003espicy\u003c/a\u003e aromas radiate from the crystal-coated buds, which sometimes reveal themselves in hues of purple. Northern Lights\u0026rsquo; psychoactive effects settle in firmly throughout the body, \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003erelaxing\u003c/a\u003e muscles and pacifying the mind in dreamy \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\"\u003eeuphoria\u003c/a\u003e. Comfortable laziness allows patients to relieve \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-insomnia\"\u003esleeplessness\u003c/a\u003e, while its mellow contentment roots out \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-depression\"\u003edepression\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e. Several different Northern Lights \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\"\u003ephenotypes\u003c/a\u003e circulate the market, but Sensi Seeds recommends a general indoor flowering time of 45 to 50 days.\u003c/p\u003e\n","descriptionPlain":"Northern Lights stands among the most famous strains of all time, a pure indica cherished for its resinous buds, fast flowering, and resilience during growth. Itself a descendant of indigenous Afghani\u0026nbsp;and Thai\u0026nbsp;landrace strains, Northern Lights has given rise to famous hybrids like\u0026nbsp;Shiva Skunk\u0026nbsp;and Super Silver Haze. Rumor has it that Northern Lights first sprouted near Seattle, Washington, but was propagated out of Holland after 1985 at what is now Sensi Seeds.\n\nPungently sweet, spicy aromas radiate from the crystal-coated buds, which sometimes reveal themselves in hues of purple. Northern Lights\u0026rsquo; psychoactive effects settle in firmly throughout the body, relaxing muscles and pacifying the mind in dreamy euphoria. Comfortable laziness allows patients to relieve pain and sleeplessness, while its mellow contentment roots out depression and stress. Several different Northern Lights phenotypes circulate the market, but Sensi Seeds recommends a general indoor flowering time of 45 to 50 days.\n","aka":"Nl","rating":4.43,"highlightedReviews":[{"id":1417755,"username":"ImaFlyboy","text":"I am a 60 year old male who has had two back surgeries and have a myopathy called Pompe disease. I am about at the end of my time here on earth as this disease progresses and the best medicine I have found to relieve the pain has come from this plant. I was on the \"normal\" protocol of opiates from my doctor for years and then I tried this strain. Daily usage has allowed me to greatly reduce the dosage of the Morphine and Oxycodone with their awful side effects, and I live a much better life since using this strain. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"},{"id":1642170,"username":"C3p0","text":"Concentrates are cheap when they have their daily specials. Great great deals. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-54104","title":"7 Cannabis Strains That Changed the Game","author":"David Bienenstock","category":null,"date":"\/Date(1515455352000)\/","text":"Like avocados, apples, potatoes, and most other commercial crops, cannabis comes in a wide range of varietals, commonly called strains. Think Haas, McIntosh, Russet—only, you know, with weed.\n\nThe oldest cannabis strains are collectively categorized as landraces, a term used to describe any genetically distinct varietal that’s indigenous to a specific geographic region, where it has—over a long period of time and isolation—adapted to the area’s climate and traditional cultivation techniques. Part of this process is natural acclimation, but local cannabis growers have also selectively bred these landraces over many generations, choosing for propagation individual plants that show desired traits, like drought resistance in an arid climate or mold resistance in a place with chilly nights and dense fog.\n\nOften these landrace cannabis strains are named at least in part for their region of origin: Think Panama Red, Maui Wowie, and Malawi Gold. Further back, according to most scholars, the cannabis species originated as a feral annual plant in Central Asia approximately 15,000 years ago, and from there spread worldwide along ancient trading routes, which means that all strains throughout history share a common ancestor.\n\nNorth America’s earliest pot smokers came up puffing on pure sativa landrace strains native to Mexico, the Caribbean, and points further south. Back in those pre-sinsemilla days (1900–1970), every bag of grass came with a large supply of free seeds, but those seeds wouldn’t grow well in northern climates. Pure sativas take weeks longer than indicas to mature, and thus require a longer, warmer growing season—a problem that became a crisis in the United States when the War on Marijuana began focusing on border patrols and shutting off foreign supply lines.\n\nAs demand for cannabis spiked in the late 1960s, the situation grew so dire there were well-publicized cannabis droughts. Then enterprising cannabis breeders in California and elsewhere discovered that by crossing these landrace sativa strains they were used to smoking with landrace indica strains brought back from Nepal, Afghanistan, and other stops along the then-popular Hippie Trail, they could produce hybrids with the best traits of both subspecies. Thus, they transformed homegrown American cannabis from ditch weed laughingstock into the envy of the world.\n\nAnd how exactly did we get from a handful of landraces to Zkittlez and Blue Dream? Through a series of incredible breeding breakthroughs that largely took place behind a heavy veil of prohibition. So be warned that while it’s well documented that the McIntosh apple was first discovered by John McIntosh in 1811 in Canada, the stories of the world’s greatest cannabis breeders are a lot murkier (which definitely comes with the territory when your creative output happens to be illegal). As such, please kindly forgive any missing information in the origin stories of these seven game-changing cannabis strains (and reach out to us if you have insight you believe we’ve missed).\nSkunk #1\n\nFrom one of California’s original underground cannabis breeding outfits—the legendary Sacred Seeds—came one of the first true hybrid cannabis strains.\nNamed for its powerful skunky aroma, Skunk #1 was bred over multiple generations to incorporate diverse genetics from three blockbuster landraces—Afghani, Acapulco Gold, and Colombian Gold. Combining the short flowering time and heavy harvest of Afghani (an indica) with the soaring high of the two sativas, this landmark achievement in cannabis breeding changed the game by helping forge a path for US cannabis growers to be self-sufficient, while bringing into the world one of the most righteously uplifting buzzes of all time.\nSkunk #1 also later served as a key breeding stock for many well-loved second-generation strains, including Cheese and Super Silver Haze. In the UK, to this day, “skunk” is used as a general term to describe any high-potency strain.\n\nNorthern Lights #5\nAnother classic first-generation hybrid, Northern Lights #5 was quite literally the fifth of its name. The first varietal known as Northern Lights was 100% indica, a result of crossing several Afghani landraces. Bred for high potency, a fast, heavy harvest, and a high bud-to-leaf ratio prized by growers, Northern Lights #1 was absolutely a stand-out in its heyday.\nBy the time we get to NL#5—the strain’s fifth incarnation, at least to those in the know—a bit of Thai landrace sativa had found its way into the genetic mix, bringing fruity flavor notes and a skyrocketing cerebral high to the party. Sensi Seeds won the Cannabis Cup in Amsterdam with the strain in 1989, 1990 and 1992, while producing large amounts of NL#5 seeds that would find their way all over the world.\nNorthern Lights #5 changed the game primarily by being a truly kick-ass strain that’s incredibly easy to grow indoors or outdoors in a wide variety of climates. That encouraged countless hobbyist growers and underground commercial cultivators to grow it, allowing the mass market to develop a taste for something far more elevated than their typical schwag.\n\nNeville’s Haze\n\nThe original Haze strains date back to the late 1960s, when a group of pioneering seed breeders known as The Haze Brothers discovered that the unique microclimate in Santa Cruz, California allowed them to experiment with growing heavily sativa-dominant hybrids. Blessed with a long, dry, mild autumn, those visionary Haze Brothers quickly became underground-famous among local heads for developing and growing Original Haze, a hybrid strain which blended landrace genetics from Thailand, Mexico, and Colombia.\nAs one of the Haze Brothers told High Times in 1980, “The stuff they grow in Northern California is mostly indica, but it’s harvested early to get it in before the frost. In our county the flowers pump out resin until December, [so we made] Haze pot from sativa seeds.”\nA slow-to-mature, tall and finicky plant, Haze made up for all that by delivering one of the most electric, uplifting, cerebral highs of all time, coupled with a sharp piney smell and taste that’s instantly recognizable to anyone who’s had the extreme pleasure of smoking some. But it didn’t become a game-changing sensation or the world’s ultimate head stash until the 1980s, when Original Haze reached Amsterdam. There, an OG seed breeder named Neville tinkered with it until he produced a variety that was significantly easier to grow without compromising on potency, flavor, or effect. Neville then produced copious Haze seeds and shipped them all over the world.\nOG Kush\nAt last we enter the second-generation hybrid era, when cannabis breeders began to cross hybrids with other hybrids in hopes that a magic varietal would emerge and prove greater than the sum of its parts. Which brings us to one of the most iconic strains of all time.\nNow, remember when we noted that the story of underground cannabis breeding sometimes gets a bit murky? Nothing makes that point clearer than the origin story of OG Kush, which—with the help of a lot of rap lyrics—made its way from humble begins and unknown parentage to the upper echelon of the cannabis strain pantheon.\nThe little we do know of this epic journey is unconfirmed and incomplete, but according to the most credible accounts, OG Kush appears to have begun life as a cutting smuggled to the West Coast from Florida where it was originally known as Krippy—a generic term for good weed. Once the strain made its way to Los Angeles, and into the hands of grower JoshD, the genetics were proliferated and spread up and down the West Coast.\nOG Kush changed the game by being the first strain of the hybrid era to become a cultural touchstone, following in the illustrious footsteps of larger-than-life landraces like Panama Red and Acapulco Gold.\n\nSour Diesel\n\nWhat makes Sour Diesel stand out, first and foremost, is the strain’s powerful smell and taste, which is every bit as sour and diesel-like as the name suggests, but somehow in a way that you just can’t get enough of. It’s a quickly-acquired taste, probably because every time you encounter it you’re about to get super-blazed in a really uplifting, creative way.\nBelieved to be a cross between Chemdawg and Super Skunk, Sour Diesel changed the game in two ways: First, much as Justin Timberlake brought sexy back, Sour Diesel brought sativa back. Since indicas grow faster and yield more, most modern cannabis growers stuck to indica-dominant strains until Sour D (as it came to be known) came along in the mid-1990s and began fetching such a premium that it drove the entire cannabis market in a wonderful new direction.\nIt also changed the game by being the first East Coast strain to achieve prominence. As noted, little is known of where it actually came from, but we do know that—like many upstart hopefuls from all over the world—it came to New York City to make it big.\n\nGranddaddy Purple\nKen Estes was gifted as both a student and an athlete in high school, but not long after he graduated in 1976 a motorcycle accident left him paralyzed from the neck down. After languishing in a rehabilitation center in a pharmaceutical fog for six months, he befriended a disabled Vietnam vet recovering in the same facility who offered him some cannabis.\nEstes says that first puff “was the turnaround of my life,” which he thereafter dedicated to advocating for cannabis legalization and breeding new varietals with powerful medicinal effects. In 2011, his Bay 11 strain took home top honors at the High Times Medical Cannabis Cup in San Francisco, but he’ll always be best known for Granddaddy Purple, a strain he says was gifted to him by a longtime grower from southern Humboldt County.\nBest known for its deep purple appearance, GDP changed the game by setting off a sustained craze for purple cannabis that begat The Purps, Grape Ape, and many others. The strain’s sweet grape flavor also pushed future breeders in that direction, as a balance to the acrid diesel notes associated with both OG Kush and Sour Diesel.\n\nSour Tsunami\nOne of the primary therapeutic compounds found in cannabis, cannabidiol (CBD) is now widely available via a variety of CBD-rich strains like ACDC, Cannatonic, and Harlequin. But not so long ago, CBD was nearly extinct from the cannabis gene pool, all because the world’s second-best known cannabinoid counteracts the psychoactive effects of THC.\n\nThis means that strains with a lot of CBD don’t get you as high. So in an effort to get their customers as high as possible, underground breeders for decades unwittingly bred CBD out of their strains, until only trace amounts remained. Researchers, however, learned about the medicinal benefits of CBD, and so did the team of scientists and activists behind Project CBD, a non-profit organization founded in 2010. From its inception, Project CBD has partnered with California’s commercial cannabis testing labs to flag any bud testing high in CBD, in order to build up a breeding stock of high-CBD strains.\nSour Tsunami—bred by Lawrence Ringo of Southern Humboldt Seed Collective—changed the game by being the first stabilized CBD-rich strain in California. Ringo has sadly passed away, but his legacy lives on: Today CBD is revered by patients treating everything from pediatric epilepsy to anxiety and chronic pain.\nIn an interview with O’Shaughnessy’s, Ringo gave a lengthy explanation of how Sour Tsunami came to be. It’s worth reading both to understand the determination and painstaking work involved in cannabis breeding, and also the love and passion underpinning the endeavor.\nI saved seeds whenever a plant gave me a creative feeling. I bought ‘New York City Diesel’ seeds from Marc Emery. I took the males from that and crossed them onto Sour Diesel female clones. I crossed the NYC Diesel and the Sour Diesel for about four years—kept crossing it back to the Sour Diesel clone. Each year I’d save the male and do the dusting and make my seeds. One year a friend popped in with something that had a really nice creamy taste. I thought it was an indica but it turned out to be 60% sativa called Ferrari. I’ll never forget that creamy taste. I smoked it and my brain just took off. I’m a musician so I just grabbed a guitar and was going nuts for hours.\nIt took me about a year to get that Ferrari clone… I crossed my Sour Diesel—Double Diesel, I called it—to the Ferrari clone five years ago. Two years ago I re-crossed it back onto the Sour Diesel. Before I did that I had this thing called Tsunami. It was the Double Diesel crossed four times to the Sour Diesel then crossed to the Ferrari and then crossed back to the Sour Diesel. That made Sour Tsunami. It’s unbelievable. The creamy taste was there. I had no idea what the CBD count was until Samantha Miller [of Pure Analytics] analyzed my stuff and said it was 11.3% CBD. ‘And by the way,’ she said, ‘You have eight other strains with great CBD potential.’\nFlood images: Leafly","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/08120955/sour-diesel-strain-article.jpg","urlslug":"/news/strains-products/7-weed-strains-that-changed-the-game"},{"id":"contentitems-31866","title":"Tips for Growing Northern Lights Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1498151225000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nhttps://www.youtube.com/watch?v=5fF11ruCN9A\u0026feature=youtu.be\nStrain Overview: Northern Lights is a classic indica strain bred from Afghani and Thai landrace genetics. It has been used countless times in breeding projects to create many famous strains on the market today. Offering a profound and heavy high, Northern Lights is enjoyed for its effects as well as its sweet, earthy flavor profile. Thought to be from the Pacific Northwest region originally, it has since been propagated by Sensi Seeds in Amsterdam.\nGrow Techniques: Grow indoors and get multiple cycles each year with this fast growing and flowering strain. Northern Lights is well suited for the SOG (sea of green) method, and as a hydroponic or soil based strain. Keep steady airflow through the garden to prevent humidity buildup in the dense canopy.\nFlowering Time:  6-7 weeks\nYield: High\nGrow Difficulty: Easy\nClimate: Prefers long summer seasons and warm, sunny climates between 70 and 85 degrees Fahrenheit.\nIndoor/Outdoor: Northern Lights is a great choice for indoor growers.\nFeeding: Northern Lights grows well with high levels of nitrogen as it develops and can continue to take heavy feedings through its flowering cycle.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/22100523/nl.jpg","urlslug":"/news/growing/how-to-grow-northern-lights-marijuana"}],"reviewCount":2479,"flavors":[{"name":"Sweet","score":25.386556448656979},{"name":"Earthy","score":24.005673967206359},{"name":"Pine","score":16.209557365459681},{"name":"Woody","score":10.728328641411574},{"name":"Citrus","score":6.43376660105138}],"effects":[{"name":"Relaxed","score":88.62286030527568},{"name":"Happy","score":61.198051526900265},{"name":"Sleepy","score":59.742693679508172},{"name":"Euphoric","score":58.614403035613478},{"name":"Uplifted","score":33.813225207330788}],"symptoms":[{"name":"Stress","score":43.192521967279326},{"name":"Pain","score":37.272275436088265},{"name":"Insomnia","score":32.639891295596335},{"name":"Depression","score":27.589697054306853},{"name":"Muscle Spasms","score":13.096403889822971}],"conditions":[{"name":"Anxiety","score":36.122813617290063},{"name":"PTSD","score":14.397543050979491},{"name":"Migraines","score":10.382394152515671},{"name":"Arthritis","score":10.164246647320901},{"name":"Gastrointestinal Disorder","score":7.6710488017992162}],"negatives":[{"name":"Dry Mouth","score":35.673131037784238},{"name":"Dry Eyes","score":15.924776510273237},{"name":"Anxious","score":7.33313296439628},{"name":"Paranoid","score":6.8728014695820274},{"name":"Dizzy","score":6.8595052290704466}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/indica/northern-lights/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/indica/northern-lights/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/northern-lights_100x100_d111.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003563/b/northern-lights__primary_078a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/northern-lights_100x100_7085.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002933/b/northern-lights__primary_c91a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/northern-lights_100x100_9317.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002811/b/northern-lights__primary_4ea5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/northern-lights_100x100_a8ee.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002444/b/northern-lights__primary_f29e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/northern-lights_100x100_5e59.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/707946/b/northern-lights__primary_7190.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/northern-lights_100x100_cd00.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/675787/b/northern-lights__primary_d3f6.jpg"}],"photoTotalCount":602,"popularCities":["Los Angeles, CA","Portland, OR","Seattle, WA","Denver, CO","Phoenix, AZ","Spokane, WA","Bellingham, WA","Montréal, QC","San Diego, CA","San Francisco, CA"],"permalink":"https://mobileapi.leafly.com/indica/northern-lights","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.42718838241226/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Thai","subtitle":null,"slug":"thai","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/thai","symbol":"Tha","applink":"leafly://strain/thai"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":47,"outdoorFinish":null,"height":"Short","averageYield":"High","environment":null,"growNotes":"\n\tHigh calyx-to-leaf ratio makes for easy trimming\n\tGrows best as a multi-branch plant\n\tDoes well with moderate to heavy nutrients\n\tYields typically fall between 400-500g/m\u0026sup2;\n\n"}}
