{
    "aka": "Bubba Gift, Bubba's, Gift Bubba's",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Ocean Malandra",
            "category": null,
            "date": "/Date(1520701248000)/",
            "id": "contentitems-60005",
            "text": "For any cannabis aficionado, hearing the words “Humboldt County” can get the goosebumps going. One of the top cannabis producers in the Emerald Triangle—reaching back to the 1960s and 70s—Humboldt is known far and wide as the Napa Valley of weed; the place that produces the best quality outdoor cannabis in the entire country.\nBut while many connoisseurs have sampled its finest wares, Humboldt County has a lot more to offer than its incredible bud; it’s also a natural paradise filled with gorgeous landscapes and stunning views. And now that California has finally gone recreational, exploring Humboldt County—and all it has to offer—has become one of the best cannabis-infused trips in the world.\n\nBursting with wild coastlines, pristine rivers, unique small towns, and towering stands of ancient redwoods, Humboldt County is a truly breathtaking experience.\nBelow, discover some incredible places to light up and enjoy one of California’s greatest gems.\nPatrick’s Point State Park\n(Redwood Coast/Flickr Creative Commons)\nThe dramatic meeting of land and sea that Humboldt County embodies is on full display at Patrick’s Point State Park—a single square mile of lush forest teeters over the vast ocean on rugged rock promontories. Day hikes along the cliff edge offer fantastic views of raw Humboldt coastline, while inside the park a model Yurok village gives you a chance to explore daily indigenous life before European contact.\nCheck out Wedding Rock before you go, where countless couples have tied the knot backed by awe-inspiring panoramas of Agate Beach, where semi-precious stones lie hidden in the golden sands. Spark up a deliciously relaxing and euphoric strain, like Blueberry Muffins from Humboldt Seed Company, to take in this Eden-like paradise.\nThe Trinity River\n(CampPhoto/iStock)\nClear as glass and sparkling green, the living jewel known as the Trinity River winds its way out of the snowcapped Trinity Alps—the highest point on California’s coastal range. Locals flock here in the summertime to soak in high temperatures in this mountainous paradise. An hour inland from Eureka and Arcata, the town of Willow Creek is the center of activity here. Stop by River Song Natural Foods (a great place to stock up on munchies before hitting the river), and check out a handful of white water rafting outfits around the area.\nCamp Kimtu, just outside Willow Creek, fronts multiple swimming holes and riverside camping while the South Fork of Trinity offers a crystalline paradise of natural pools and rocky edges. For something truly mind-blowing, head into the Hoopa Indian Reservation, the largest in the state, and check out Tish Tang. This native run campground and natural beach offers a spectacular backdrop of forest covered mountains at a picture-perfect bend in the shimmering river. End the day by massaging your tired muscles with Wipe Out Salve by Humboldt Marijuana Company before beginning another adventure in the clear waters.\n\nThe Manila Dunes\n(Redwood Coast/Flickr Creative Commons)\nThe narrow spits that separate the tranquil Humboldt Bay from the Pacific Ocean are home to eco-systems bursting with wildflowers. They seem to have been made just for whiling away the better part of a cannabis-infused afternoon.\nMake your way to the lookout point above the Manila community center for a panoramic view of the bay and the rolling redwood hills before meandering through the dunes and, finally, onto the wilderness beach. From here, it’s a short trot over to the Humboldt Coastal Nature Center, a hobbit-hole like structure built right into the side of a massive sand dune that hosts a variety of educational exhibits for public enjoyment.\nThe Lost Coast\n(Redwood Coast/ Flickr Creative Commons)\nAn endless stretch of black sand beaches against a backdrop of rugged, ocean-worn mountains, the Lost Coast is the largest wilderness coastline on the west outside of Alaska. While the breathtaking Lost Coast Trail takes up to five days to hike—weaving up and down the wind swept summits of the Kings Range to isolated beaches—it is also possible to access the pristine coastline from the town of Shelter Cove, where you’ll find the Black Sands Beach trailhead.\nAn incredible day hike is also possible at King’s Peak, which offers dramatic 360° views of the Lost Coast at 4,000 feet. Exploring the old farming communities of the Matolle Valley, a bastion of old school hippies and a center of cannabis fueled counter cultures via the Lost Coast Scenic Drive, makes for slow travel at its best. It boasts several stand-out swimming holes along the Matolle River made more spectacular with fresh fruit dipped in Humboldt Valley Farms’ infused Chocolate Space Sauce.\n\nThe Humboldt Bay\n(shunyufan/iStock)\nThe largest protected body of water between San Francisco Bay and Puget Sound, Humboldt Bay is bookended by two unique towns—the Victorian seaport of Eureka and the hip college town of Arcata. The bay is home to California sea lions, river otters, and other marine mammals as well as an abundance of avian species.\nFrom the Eureka side, you’ll find the mural-peppered waterfront where Old Town reveals several stand-out small businesses worth patronizing. The Works record store, the palatial Eureka Books with its vast selection of local hiking and wildlife guides, and Humboldt Herbals, where you can stock up on natural, local products like Redwood Honey and talk to an herbalist about your medical marijuana regime.\nThe Victorian downtown area gives way to a bay-front promenade lined with benches, making it a wonderful place to spark up Bubba’s Gift—developed by Humboldt Seed Organization—before taking in the views over the marina and the redwood carpeted hills in the background. If you’re feeling adventurous, kayaks and small sailboat rentals are available, while the 1930s-era Madaket Ferry offers daily sunset cocktail cruises which sets out from the Eureka boardwalk daily.\nIn Arcata, known far and wide for its dedication to all things eco-friendly, an innovative wastewater treatment program has transformed a tidal marsh into a bird sanctuary that offers sweeping views out over the Humboldt Bay.\nThe Arcata Community Forest\n(yhelfman/iStock)\nConsidered a “model” for ecological sustainability, Arcata’s community owned forest blankets the hills just behind Humboldt State University, covering nearly 800 acres. Although you won’t find the several thousand-year-old giants here that exist in nearby State and National Parks, you will enjoy the pleasant and well-kept trail system that let you get completely lost in nature just steps from downtown Arcata. Frisbee golfers have set up a world-class course within the community forest, and just below it—in the grassy open space known as Redwood Park—cannabis lovers gather to puff and pass all day long.\n\nGrizzly Creek Redwoods State Park\n(maislam/iStock)\nYou have to leave the tourist track and head up the rural Highway 36 into Humboldt’s mountainous interior in order to reach Grizzly Creek Redwoods State Park. It’s a hidden gem where old growth forest surrounds the sapphire waters of the Van Duzen River. Fill a thermos of Kikoko’s Positivi-Tea (made with Humboldt-grown bud) to lift the spirits as you travel through the woods and rivers.\nThis small but picture-perfect park is the ultimate place to shun reality in exchange for clear summer skies, hot swimming weather, and spectacular star-gazing through the forest canopy. While car-camping is available at the main entrance, there are several nicely clandestine camping sites located in the gorgeous groves just steps from the riverbank.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/08123143/8-amazing-places-to-toke-up-31.jpg",
            "title": "8 Amazing Places to Blaze Up in Humboldt County",
            "urlslug": "/news/lifestyle/8-amazing-places-to-blaze-up-in-humboldt-county"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1448038800000)/",
            "id": "contentitems-3371",
            "text": "New strains have just been added to Leafly's strain database and they need your reviews! As things cool down outside, snuggle up with Bubba's Gift or Cherry Grapefruit to get your full-body relaxation on. Motivate yourself to think creatively with Cambodian Haze, Strawberry Amnesia, or Sour LSD. And, of course, celebrate the announcement of Primus' winter tour with none other than the Primus indica. These strains are just what you'll need to get through the holidays, so figure out which ones are available near you by checking out the links below!\n \n   1. Primus\n\nPrimus, also called Primus OG, is a complex indica strain that combines Arcata, Trainwreck, and 303 OG. Each parent strain passes on something special to Primus: Arcata with its creative activation, Trainwreck with its long-lasting euphoria, and 303 OG with its sour fruit flavors. This trifecta of duration, fragrance, and quality of high makes for a potent hybrid cherished by patients and recreational consumers alike. For those using cannabis medicinally, consider choosing Primus for evening management of depression, anxiety, appetite loss, or pain relief.\n\nFind out which locations are currently carrying Primus\n \n   2. Sour LSD\n\nSour LSD is a balanced hybrid strain that brings the best of its parent strains: the sour, funky aroma of Sour Bubble and the trippy head space provided by the hybrid LSD. Elevating the senses to new heights, Sour LSD is a great companion strain for enjoying the outdoors or creative activities. This BOG Seeds creation is a nostalgic throwback for all fans of Barney's Farm's original LSD, as it carries similar active sativa-like traits only with a little more body relaxation.\n\nFind out which locations are currently carrying Sour LSD\n \n   3. Strawberry Amnesia\n\nA powerful and uplifting flower from Dinafem Seeds, Strawberry Amnesia is a strain made in sativa heaven. Bred from Strawberry Cough and Amnesia, this strain delivers the familiar sweet strawberry and earthy flavors of its parents. Having the typical energizing and euphoric effects of a sativa, Strawberry Amnesia also induces the calming body high from its distant indica relatives. The dark green buds of Strawberry Amnesia are very dense and heavily coated in resin, so this potent sativa should be handled with caution.\n\n \n   4. Bubba's Gift\n\nDeveloped by Humboldt Seed Organization, Bubba’s Gift is a strain unlike any other. Despite being almost purely indica, this cross between Bubba Kush and God’s Gift produces functional and uplifting effects with a mild body high. Given its strong indica genetics, this sweet, fruity strain is surprisingly well-suited for daytime creative activities. Bubba’s Gift will flower in 6 weeks and can be grown indoors and outdoors.\n\nFind out which locations are currently carrying Bubba's Gift\n \n   5. Cherry Grapefruit\n\nCherry Grapefruit by Kera Seeds is a super fruity sativa-dominant hybrid that brings out the best qualities of parent strains Cherry and Grapefruit. The effects position themselves with gentle full-body relaxation and a nice head-buzz that would be best for anyone needing muscle relief and mood elevation. This easy-to-grow strain will flower in 9 weeks and is suitable for growing both indoors or outdoors.\n\n \n   6. Cambodian Haze\n\nReeferman Seeds created the vibrant Cambodian Haze sativa by crossing a Cambodian landrace strain with Purple Haze. This South East Asian spin on the classic Purple Haze will deliver a strong euphoric experience without exacerbating paranoia. Known to be extremely sticky in texture and sweet in flavor, Cambodian Haze is the perfect sativa for staying productive without being up all night. Flowering in 11 to 12 weeks, this strain is best suited for indoor and greenhouse grows for an experienced grower.\n\n \n   7. Grandpa Larry OG\n\nAn instant classic from top tier genetics, Grandpa Larry OG is the next elite OG strain. Granddaddy Purple and Larry OG were crossed to create this indica that behaves more like a hybrid. With clear, creative thoughts paired with a subtle relaxing effect, this strain can relieve pain without locking you to the couch. Taking after Granddaddy Purple in growth, these dense dark green and purple buds are covered in trichomes and orange hairs.\n\nFind out which locations are currently carrying Grandpa Larry OG\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12002318/new-strains-alert-primus-sour-lsd-strawberry-amnesia-bubbas-gift.png",
            "title": "New Strains Alert: Primus, Sour LSD, Strawberry Amnesia, Bubba's Gift, and More",
            "urlslug": "/news/strains-products/new-strains-alert-primus-sour-lsd-strawberry-amnesia-bubbas-gift"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Migraines",
            "score": 16.171875
        },
        {
            "name": "Anxiety",
            "score": 13.125
        },
        {
            "name": "Bipolar Disorder",
            "score": 10.390625
        },
        {
            "name": "HIV/AIDS",
            "score": 10
        },
        {
            "name": "PMS",
            "score": 10
        }
    ],
    "description": "<p>Developed by Humboldt Seed Organization, Bubba&rsquo;s Gift is a strain unlike any other. Despite being almost purely indica, this cross between <a href=\"https://www.leafly.com/indica/bubba-kush\">Bubba Kush</a> and <a href=\"https://www.leafly.com/indica/gods-gift\">God&rsquo;s Gift</a> produces functional and uplifting effects with a mild body high. Given its strong indica genetics, this sweet, fruity strain is surprisingly well-suited for daytime creative activities. Bubba&rsquo;s Gift will flower in 6 weeks and can be grown indoors and outdoors.</p>\n",
    "descriptionPlain": "Developed by Humboldt Seed Organization, Bubba&rsquo;s Gift is a strain unlike any other. Despite being almost purely indica, this cross between Bubba Kush and God&rsquo;s Gift produces functional and uplifting effects with a mild body high. Given its strong indica genetics, this sweet, fruity strain is surprisingly well-suited for daytime creative activities. Bubba&rsquo;s Gift will flower in 6 weeks and can be grown indoors and outdoors.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 92.109375
        },
        {
            "name": "Happy",
            "score": 82.421875
        },
        {
            "name": "Sleepy",
            "score": 58.515625
        },
        {
            "name": "Euphoric",
            "score": 32.421875
        },
        {
            "name": "Uplifted",
            "score": 23.125
        }
    ],
    "flavors": [
        {
            "name": "Berry",
            "score": 68.90625
        },
        {
            "name": "Earthy",
            "score": 61.5625
        },
        {
            "name": "Sweet",
            "score": 34.296875
        },
        {
            "name": "Flowery",
            "score": 25.78125
        },
        {
            "name": "Grape",
            "score": 8.90625
        }
    ],
    "growInfo": {
        "averageYield": "Medium",
        "difficulty": "Easy",
        "environment": null,
        "floweringDays": 50,
        "growNotes": "",
        "height": "Medium",
        "outdoorFinish": "Early September",
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1385948,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This wonderful creation of Bubba Kush crossed with God's Gift (I got it from Phat Panda farms, don't know if they created it or not) produces one of the best and most diverse smell, flavor, and effect profile I've experienced in a LONG time. It's thoroughly indica and has an ineffable combination of sweet, fruity, earthy, purple/grape-like, flowerly smells that carry over almost entirely into the taste -- the effects are also as extensively varied, and start with a strong and warm body high and is followed by a strong visual effect bordering on psychedelic, something you might expect from a sativa. It's thoroughly relaxing, sedating, intense, and certainly ideal for painkilling, and evening/lazy day creativity.",
            "username": "Purple_Baphomet"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1492912,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "This strain gives me a good body an head high. It has a fruity taste, a good over all smoke. I would definitely get it again",
            "username": "Smokefie206"
        }
    ],
    "id": 188847,
    "name": "Bubba's Gift",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 13.125
        },
        {
            "name": "Anxious",
            "score": 5.78125
        },
        {
            "name": "Dry Eyes",
            "score": 1.5625
        },
        {
            "name": "Dizzy",
            "score": 0.78125
        },
        {
            "name": "Paranoid",
            "score": 0.390625
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/bubba-kush",
            "category": "Indica",
            "name": "Bubba Kush",
            "permalink": "https://mobileapi.leafly.com/indica/bubba-kush",
            "slug": "bubba-kush",
            "subtitle": null,
            "symbol": "Bk"
        },
        {
            "applink": "leafly://strain/gods-gift",
            "category": "Indica",
            "name": "God's Gift",
            "permalink": "https://mobileapi.leafly.com/indica/gods-gift",
            "slug": "gods-gift",
            "subtitle": null,
            "symbol": "God"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/bubbas-gift",
    "photoTotalCount": 23,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/553259/b/bubba-s-gift__primary_52a3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bubba-s-gift_100x100_f563.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/546346/b/bubba-s-gift__primary_7801.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bubba-s-gift_100x100_4220.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/508868/b/bubba-s-gift__primary_a2a2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bubba-s-gift_100x100_f088.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/508735/b/bubba-s-gift__primary_8ede.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bubba-s-gift_100x100_57f2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506675/b/bubba-s-gift__primary_115b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bubba-s-gift_100x100_913b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/505978/b/bubba-s-gift__primary_ed9b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bubba-s-gift_100x100_1fa9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Redmond, WA",
        "Spokane, WA",
        "Vancouver, WA",
        "Beaverton, OR",
        "Bothell, WA",
        "Bozeman, MT",
        "Breedsville, MI",
        "Bremerton, WA",
        "Cook, WA"
    ],
    "rating": 4.53,
    "relatedStrains": [],
    "reviewCount": 60,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "bubbas-gift",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.53333333333333/240",
    "subtitle": null,
    "symbol": "Bgf",
    "symptoms": [
        {
            "name": "Fatigue",
            "score": 55.390625
        },
        {
            "name": "Stress",
            "score": 28.90625
        },
        {
            "name": "Depression",
            "score": 16.953125
        },
        {
            "name": "Headaches",
            "score": 12.34375
        },
        {
            "name": "Insomnia",
            "score": 12.34375
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
