{"sl_translate":"description,descriptionPlain,category","id":208303,"slug":"kc-36","name":"KC 36","subtitle":null,"symbol":"K36","category":"Indica","description":"\u003cp\u003eCultivated by KC Brains, KC\u0026nbsp;36 is an indica strain bred specifically to flourish at high latitudes. A cross between \u003ca href=\"https://www.leafly.com/hybrid/white-widow\"\u003eWhite Widow\u003c/a\u003e and KC 606, these frosty and compact buds deliver\u0026nbsp;full-on body\u0026nbsp;relaxation alongside a sweet and spicy floral aroma. The peaceful, introspective qualities of KC 36 make this indica a perfect pair for meditation and enjoying nature.\u003c/p\u003e\n","descriptionPlain":"Cultivated by KC Brains, KC\u0026nbsp;36 is an indica strain bred specifically to flourish at high latitudes. A cross between White Widow and KC 606, these frosty and compact buds deliver\u0026nbsp;full-on body\u0026nbsp;relaxation alongside a sweet and spicy floral aroma. The peaceful, introspective qualities of KC 36 make this indica a perfect pair for meditation and enjoying nature.\n","aka":"KC-36","rating":4.25,"highlightedReviews":[{"id":1371548,"username":"zachh0683","text":"this is a very very powerful body high. once you smoke a lot don\u0027t be surprised if you start to feel like you\u0027re going to pass out on the couch. I smoked 5 joints of it throughout the day, and 2 about 45 minutes before I went to bed. I almost knocked out at my friends house, and when I got home I fell asleep but I don\u0027t even remember. according to my roommate, I fell asleep sitting up with a cough drop in my mouth and woke up and sleepwalked (which I never do) yelling about how I left beer at my friends house which wasn\u0027t even true. when you smoke KC36 make sure you maintain control over your body so you can fall asleep in a more ideal environment. also, make sure you keep food around when smoking. you\u0027re gonna want it","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1396968,"username":"vonlupus624","text":"MY GOD this smells absolutely amazing. like cottoncandy, stewed blueberrys and lavender hardcore. very dense and sticky. not sedating but rathering soothing and calming. smoked 2 one hitter packs and i was nice and calm. not sleepy though. just embracing. slight paranoia in close quarter public places, probably the white widow lineage. AMAZING for wandering around aimlessly without a destination in site on a day off. no anxiety, no sense of urgency. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3337","title":"New Strains Alert: Mai Tai Cookies, Purple Tangie, Sputnik, Go Time, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1455303660000)\/","text":"This week\u0027s newly added strains are a mix of Los Angeles Cannabis Cup winners, classic genetics, and varieites that are fairly new to the game. Find out if they\u0027re available near you by checking the links below, and don\u0027t forget to leave reviews for the ones you\u0027ve tried.\n \n   1. Mai Tai Cookies\n\nMai Tai Cookies is a CBD-rich hybrid strain bred by Terraform Genetics, who crossed Alien Orange Cookies and ACDC. She took 1st place for “Best CBD Flower” at the 2016 High Times Cannabis Cup in Los Angeles. This hybrid is very frosty compared to most CBD strains and has a unique aroma of cherries and orange peels. With a high that is very relaxing and yet functional, patients would typically choose this strain for pain and anxiety. Her flowers have a dense structure similar to that of GSC (f.k.a Girl Scout Cookies) and are ready for harvest after a flowering cycle of 50-55 days.\n\n \n   2. Purple Tangie\n\nA spin on the citrus-loaded Tangie sativa, Purple Tangie is a flavorful strain that invigorates the spirit with uplifting euphoria. In a show of its quality, Purple Tangie took 1st place in the “Best Medical Sativa Concentrate” category at the 2016 High Times Cannabis Cup in Los Angeles. You may find that Purple Tangie offers an energetic kick to your social skills, but this strain can certainly be enjoyed in isolation, especially when you’re occupied by creative projects.\n\n \n   3. P-51\n\nP-51 is a piney, earthy indica strain that crosses a Tahoe OG male and a Blackberry mother. Created by Clint Pipkin, a grower in both Humboldt County and Northwestern Washington, the male was flowered in a window sill on the Key Peninsula in Pierce County. Thousands of seeds were created during this cross, and Washington producer Rootworx narrowed this strain down to the best cut from 70 phenotypes. This has become Rootworx’s signature strain, resulting in DOPE Magazine’s “Strain of the Month” in June 2015. This deeply relaxing indica has also been deemed “The Tranquilizer Dart” in recreational retail shops throughout Washington state.\n\nClick here for a full list of locations currently carrying P-51\n \n   4. Go Time\n\nGo Time is a sativa-dominant hybrid strain bred by JinxProof Genetics. A cross between Norton and JOG Kush, this uplifting strain is perfect for perking up moods, stimulating focus, and coercing arousal. Zesty lemon aromas combine with sour, skunky diesel notes with an earthy, hashy finish. As pretty as it is potent, Go Time flowers erupt with bulging calyxes of pastel purples, pinks, and greens underneath a snow-white coat of crystal resin.\n\n \n   5. Sputnik\n\nWhat happens when you cross a space-themed Apollo 13 strain with Black Russian? You get Sputnik, a strain named after the satellite the Soviet Union launched into a quick orbit around the Earth in 1957. Sputnik has an aroma of a sweet fruit with hints of sour and diesel when exhaled. Patients typically look to Sputnik for relief of chronic pain, anxiety, and insomnia.\n\nClick here for a full list of locations currently carrying Sputnik\n \n   6. KC 36\n\nCultivated by KC Brains, KC 36 is an indica strain bred specifically to flourish at high latitudes. A cross between White Widow and KC 606, these frosty and compact buds deliver full-on body relaxation alongside a sweet and spicy floral aroma. The peaceful, introspective qualities of KC 36 make this indica a perfect pair for meditation and enjoying nature.\n\n \n   7. Queso\n\nCreated in 2011 by Kannabia Seeds using Cheese and Afghani genetics, Queso (Spanish for “cheese”) is a hybrid strain that provides powerful body effects and mood elevation. This potent strain is typically used to relieve pain, stress, anxiety, and insomnia. Growers, take note: Queso requires a minimum flowering cycle of 7 weeks , but optimal yields arrive after 8 weeks.\n\nClick here for a full list of locations currently carrying Queso\n \nBrowse through other new strains that were added recently to the Leafly Explorer or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/12002229/new-strains-alert-mai-tai-cookies-purple-tangie-sputnik-go-time-a.png","urlslug":"/news/strains-products/new-strains-alert-mai-tai-cookies-purple-tangie-sputnik-go-time-a"}],"reviewCount":4,"flavors":[{"name":"Sweet","score":4.1666666666666661},{"name":"Blueberry","score":4.1666666666666661},{"name":"Grape","score":4.1666666666666661},{"name":"Flowery","score":4.1666666666666661},{"name":"Lavender","score":4.1666666666666661}],"effects":[{"name":"Sleepy","score":12.5},{"name":"Relaxed","score":12.5},{"name":"Uplifted","score":4.1666666666666661},{"name":"Euphoric","score":4.1666666666666661},{"name":"Hungry","score":4.1666666666666661}],"symptoms":[{"name":"Fatigue","score":8.3333333333333321},{"name":"Depression","score":4.1666666666666661},{"name":"Stress","score":4.1666666666666661}],"conditions":[{"name":"ADD/ADHD","score":4.1666666666666661},{"name":"Anxiety","score":4.1666666666666661},{"name":"Cancer","score":4.1666666666666661},{"name":"Hypertension","score":4.1666666666666661}],"negatives":[{"name":"Dry Eyes","score":4.1666666666666661},{"name":"Dry Mouth","score":4.1666666666666661},{"name":"Paranoid","score":4.1666666666666661}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kc-36_100x100_6512.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/538069/b/kc-36__primary_b4c8.jpg"}],"photoTotalCount":1,"popularCities":["West Hollywood, CA"],"permalink":"https://mobileapi.leafly.com/indica/kc-36","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.25/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"White Widow","subtitle":null,"slug":"white-widow","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/white-widow","symbol":"Ww","applink":"leafly://strain/white-widow"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":64,"outdoorFinish":null,"height":null,"averageYield":"High","environment":null,"growNotes":""}}
