{"sl_translate":"description,descriptionPlain,category","id":12,"slug":"g-13","name":"G13","subtitle":null,"symbol":"G13","category":"Indica","description":"\u003cp\u003eG13 is a very strong strain of cannabis indica that is the subject of many urban legends. According to some accounts, the CIA, FBI, and other agencies gathered the best strains of marijuana from breeders all over the world.\u0026nbsp;At a super-secret installation at the University of Mississippi, they bred many new super hybrids in the late 1960s.\u0026nbsp;Allegedly, a single cutting of this plant was liberated by an unnamed technician and bred for the masses.\u003c/p\u003e\n\n\u003cp\u003eAlthough the legends are probably not true, G13 delivers effects like no other. If you have the opportunity, definitely partake in this strain.\u003c/p\u003e\n","descriptionPlain":"G13 is a very strong strain of cannabis indica that is the subject of many urban legends. According to some accounts, the CIA, FBI, and other agencies gathered the best strains of marijuana from breeders all over the world.\u0026nbsp;At a super-secret installation at the University of Mississippi, they bred many new super hybrids in the late 1960s.\u0026nbsp;Allegedly, a single cutting of this plant was liberated by an unnamed technician and bred for the masses.\n\nAlthough the legends are probably not true, G13 delivers effects like no other. If you have the opportunity, definitely partake in this strain.\n","aka":"G-13, G 13","rating":4.38,"highlightedReviews":[{"id":1414072,"username":"Migl","text":"Another one of my top faves. Makes doing public activities more fun. I find myself talkative and wanting to hang out. Relieves anxiety and creates tranquility. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1641484,"username":"NedoTheVet","text":"I took a gamble on this for my bed time shmoke...and, well....it\u0027s not Indica as usual for me...indica strains usually have me passed out on the couch at 7p erry night.\n\nI feel very uplifted and happy with the perfect body buzz...I am locked in my backyard lawn chair.\n\nI shmoked 25 mins ago and feel absolutely no urge to do ANYTHING outside of relax and enjoy this feeling for a little while longer. this would be the perfect strain for camping/star gazing. Personally, I would hate to ruin this feeling with another person around....unless that person would shut the funk up and just look at the stars!\n\nreviewing off one hit.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-8012","title":"These Cannabis Strains Are So Good, They\u0027ll Make You Utter \"Holy ___, Batman!\"","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1475690456000)\/","text":"I grew up watching Adam West and Burt Ward thwart evildoers after school. Back then I would saunter into the living room and settle down in front of our JC Penney television to admire the collected demeanor of gentleman millionaire Bruce Wayne and his eager ward/sidekick as they unraveled the nefarious tapestry of evil that had been subtly stitched together with sinister subterfuge. (Apparently alliteration attracted audiences back then; or, if nothing else, it gave the dialogue a poetic quality.)\nOne of the most famous turns-of-phrase that came out of the dynamic duo of the mid-60s was Robin’s, “Holy ___, Batman!” This particular set of words arises hilariously often in strain reviews, so without further ado, here’s a small sampling of some of my favorites. Holy strain reviews, Batman!\nHybrid Cannabis Strains\n   GSC (f.k.a Girl Scout Cookies)\n\n“Holy carp fish, batman. This is magic. Definitely gives you a floaty, yet energized feel. You feel it creeping up behind your eyes and in two shakes of a lambs tail, you’re high as goddamn ever.” – Anonymous\n\n   Fruity Pebbles\n\n“Holy hand grenade of Antioch, Batman. Smoking this is like watching high speed film of a remote detonation. But a detonation of giggles and time slippage. Bring this to game-night at the beach. I did, and I’m very happy about that. Social, happy, very fast acting. The super-high phase came on within 5 minutes and lasted about 10-20 minutes. After words a really happy normal to low key high kicked in and took the wheel for around 3 hours. Two of us fell asleep during this time and three of us had energy to spare.  A very solid night sleep followed for me.” – ChestyMcDeathrack\n\n   Chemdawg\n\n“Holy space balls batman. I think we’ve got a winner right here. Toked a small bowl last after a month of FireOG and White Widow. Let me tell you I nearly tripped my balls out. I had a legit out of body experience lying in bed with my wife after smoking. Needless to say I couldn’t sleep. Headed down to TV land, Jay Leno’s new show is pretty good.” – jamtastic\n\nIndica Cannabis Strains\n   Superman OG\n\n“Holy sh*t Batman, I just found one of the newest to my Top 10!!! Dare I say to the coveted #1 slot?!? Honestly, I love ALL strains but you know the standouts and this strain STANDS out! When the description uses the word ‘pungent’, yep, it IS pungent and smokes the same. I usually cough during a bowl but the HIGH it totally worth it!! Definitely agree with many, this is NOT for beginners starting on meds like this but for everyone else, if you come across Superman, GET YOU SOME, you will not be disappointed!!! Believe it or not, this doesn’t really knock me out like others I know that have came across it but DAMN, I love the deeply euphoric, giggly, happy, relaxing high, one the best I’ve felt. Thank you GROWERS of this strain, your the BEST!!!” – dhlvisdrt\n\n   SFV OG Kush\n\n“Holy amazing sleep, Batman! SLEEPIES!! This knocked my ass OUT – I haven’t slept in 2 days and this let me sleep for 7 hours straight, didn’t even move. Super important different between this ‘Kush’ and regular OG…. Smelled like pine, a bit pungent, woody, lemon/citrus, and a slight herbal scent with a little spicy kick. This OG Kush combination is an amazingly super light and smooth smoke! Packed 1/2 a bowl and it tasted like sweet flowers, pine, dankish, and herbal, like tearing open a packet of tea. Went straight to my head and my face was nuuuuumb. Helped my spine amazingly well 5/5, took my kidney stone pain down to 30%, felt cold spots in my back where it hurts, helped with my tendon pain 3/5, and a little bit of nerve pain 2/5 – noticeable enough. No munchies, I passed out – definitely a night time use, great for insomnia. Hits heavy, so I wouldn’t use this as a beginner unless you have insomnia – this is your golden ticket!” – Midnyte003\n\n   G-13\n\n“uuuuuuhhhhh…. I don’t remember what I was doing. or anything at all for that matter. where am i, who am i. it’s about like that. lol. by far the best escape from reality I’ve ever experienced personally if u wanna sit back and chill and just not give a shit about a freaking thing period simply cause u can’t remember a freaking thing. this one is an absolute must try to believe what it can actually achieve for you. review does no justice cause it simply cannot be explained in words properly. has to be experienced personally to know. I just got my first experience with it and will definitely be getting again any and every time I have chance. HOLY MOLY COW BATMAN!!!!” – 247kushpuffer\n\nSativa Cannabis Strains\n   Crystal Coma\n\n“Holy high, Batman! This is some amazing product! Awesome high, good upper, and I’m not a space cadet either! Perfect for a ‘getting shit done but still would like to smoke’ day.” – Anonymous\n\n   Sour Diesel\n\n“Holy racing heart beat and heart pounding out of my chest batman! Everyone has the same experience.” – Anonymous\n\n   East Coast Sour Diesel\n\n“Holy Batman! This thing is like a triple dose of espresso for me! Makes me so hyper I cannot sit still LOL.! Energetic for sure, good for picking up the afternoon blehs. Also gives you an appetite. I don’t think I’ll smoke this at night or I’ll be sleepless!” – HappilyPainFree\n\n   Alaskan Thunder Fuck\n\n“Holy sweet jumped up sativa, Batman. This has to be the most aptly named strain yet. As powerful and as potent as being screwed by an angry Thor. Good if unique taste, rather a sweet note. Has good legs, at 5 to 6. Definitely worth getting when possible. Extraordinary body effects for a sativa. Get some and have intimate relations with the God of Thunder today!” – doobwalker\n\n\n“Leaping caribou, Batman! If this bud doesn’t embody the cold, rugged, wintery majesty that is the Alaskan wilderness, then I dont know what does. With notes of pine trees and freedom, this kush is optimum for white water rafting, eating a raw salmon, fighting a bear, or a combination of the three. Would ride a dog sled for miles in the dead of winter to get ahold of this weed. As in the words of the Eskimos this is some ‘ˈtʃaknaχ ˈhwaʁiχ’.” – wespeterson24\n\nLead image: Twentieth Century Fox Film Corporation","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/10/04153114/holy-cannabis-strain-reviews-batman.jpg","urlslug":"/news/strains-products/holy-cannabis-strains-batman"},{"id":"contentitems-32843","title":"Tips for Growing G13 Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1498844205000)\/","text":"Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: The G13 indica is supposedly a strain that was taken from a U.S. government research facility — though, considering other images we have seen of government-produced cannabis, this is probably a fallacy. The euphoria produced by G13 is regarded as pleasurable and manageable in social settings, with a sweet earthy flavor that could be enjoyed any time of day.\nGrow Techniques: Grow hydroponically in a SOG (sea of green) setup to develop huge buds. Give space between the branches to allow the buds room to bulk up while keeping plenty of airflow between plants.\nFlowering Time: 9 weeks\nYield: High\nGrow Difficulty: Moderate\nClimate: Can handle lower temperatures, but ideally keep this strain between 65 and 85 degrees Fahrenheit.\nIndoor/Outdoor: Performs well indoors or out. G13 can handle colder fall temperatures better than most cannabis plants. Growing outdoors is a great option for those seeking large, quality yields.\nFeeding: Feed G13 heavily, as it needs plenty of nutrients to pack on its gigantic buds.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/30103449/g13-strain.jpg","urlslug":"/news/growing/how-to-grow-g13-marijuana"}],"reviewCount":944,"flavors":[{"name":"Earthy","score":34.156896551724138},{"name":"Woody","score":13.970019157088123},{"name":"Sweet","score":12.843773946360152},{"name":"Citrus","score":11.885727969348659},{"name":"Diesel","score":10.525957854406132}],"effects":[{"name":"Relaxed","score":99.282854406130269},{"name":"Happy","score":71.9477969348659},{"name":"Euphoric","score":62.079693486590038},{"name":"Uplifted","score":45.545306513409962},{"name":"Sleepy","score":43.327681992337169}],"symptoms":[{"name":"Stress","score":32.010057471264368},{"name":"Pain","score":28.685919540229886},{"name":"Lack of Appetite","score":22.775191570881226},{"name":"Depression","score":20.3860153256705},{"name":"Insomnia","score":20.329406130268197}],"conditions":[{"name":"Anxiety","score":21.076149425287355},{"name":"PTSD","score":18.850191570881226},{"name":"Fibromyalgia","score":9.8450191570881227},{"name":"Bipolar Disorder","score":8.7774904214559388},{"name":"Migraines","score":8.41772030651341}],"negatives":[{"name":"Dry Mouth","score":56.494348659003833},{"name":"Dry Eyes","score":22.476628352490422},{"name":"Dizzy","score":16.686206896551724},{"name":"Paranoid","score":6.3690613026819918},{"name":"Anxious","score":2.94176245210728}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/g13_100x100_850d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003315/b/g13__primary_b606.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/g13_100x100_c890.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/679179/b/g13__primary_9b74.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/g13_100x100_4ed5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/634122/b/g13__primary_819d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/g13_100x100_68c8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/624716/b/g13__primary_ff9b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/g13_100x100_3d7e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/612715/b/g13__primary_c614.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/g13_100x100_15e1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/605911/b/g13__primary_99cf.jpg"}],"photoTotalCount":220,"popularCities":["Portland, OR","Toronto, ON","Montréal, QC","Seattle, WA","Calgary, AB","Eugene, OR","Vancouver, BC","Hamilton, ON","Ottawa, ON","Bend, OR"],"permalink":"https://mobileapi.leafly.com/indica/g-13","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.3760593220339/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":82,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":null,"growNotes":""}}
