{
    "aka": "bc purple afghani",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1421954100000)/",
            "id": "contentitems-6265",
            "text": "Amsterdam has long been the pilgrimage for cannabis tourism, but the recent changes in regulation have given way to a shift towards more accessible locations within the United States. Denver and Seattle have both been inundated with the addition of travel centered on cannabis after their states Colorado and Washington were the first to legalize recreational cannabis. Tasting tours and cannabis-friendly accommodations are molding cannabis tourism into a model that closely resembles high-end wine tourism, taking it from taboo to all-access and giving the public a greater understanding of where their legal cannabis comes from.\nOne company leading the charge is Kush Tourism, who opened their public Kush Tour of Seattle’s cannabis industry and thriving local culture in March 2014. Besides introducing travelers to cannabis and the city, Kush Tourism is using their tours to educate the less informed by highlighting safe and effective practices to enjoying cannabis, recommending accommodations that accept cannabis consumption, and even providing travelers with the option to rent a vaporizer. Recently, they invited me along to see what their tours have to offer.\n \nMy Seattle Cannabis Tour Experience\n\nIt was a clear, sunny day in late autumn, the first cold day Seattle had seen in some time after an unseasonably long and warm summer. Despite the chilly temps, it was a perfect day to see the city. Besides our guide and myself, the tour included a couple from Tennessee who was nearing retirement age and wanted to explore Seattle’s culinary and cannabis cultures.\n \nThe Cannabis Studio Tours\nWe started our adventure at 7 Point Studios, a creative hub for artists, entrepreneurs, and other imaginative minds. It is home of The Boro School, a glass blowing school and studio designed to bring artists together and incite art through collaboration.\nFirst, we were given a quick tour of the massive studio space that hosts events like The Secret Cup and The Pipemasters Collab. The warehouse was covered with a collection of street art and other mixed media, giving color to an otherwise industrial interior. Doors lining the second floor led to small offices that are leased by artists and upstart cannabis companies like Mary’s Medicinals, makers of transdermal cannabis patches, and Pharm Pods, a plug-and-grow solution for upstart cannabis gardens.\nBefore we entered the glass studio, we passed an elaborate electric nail set-up that gave our tour guide Chase an opportunity to introduce everyone to the process of vaporization and how an electric nail works. He explained that while we wouldn’t get the opportunity to test the technology, this dab bar is regularly used when hosting events and allows for consistent temperatures when vaporizing cannabis concentrates.\n \nAn Introduction to Glass Artistry\nThe first interactive experience of the tour was the opportunity to watch a local glass artist demonstrate the steps to make a glass pipe. We all put on protective eyewear to shield our eyes from the intense light given off by the torch and were able to see a work of art come together right in front of us.\nThe artist, Erin, is an apprentice under Nate Aweida, who is better known as Nate Dizzle in the glass community and owner of 7 Point Studios. Erin walked us through her process of adding colored glass to clear tubing, shaping the pipe into its classic spoon-like shape, and eventually to forming the bowl, carb, and mouth piece. She happily answered any questions we had as she worked, reinforcing the respect I have for those willing to follow their creative passions, especially glass artists.\n\nAfter the pipe-making demonstration, we were led upstairs to see an incredible gallery of glass pieces on display. The pieces were a collaborative effort by a collection of artists who had participated in the Pipemasters Collab the month before. These weren’t your average glass pipes; instead, the collection was made up of extremely stylized and heady renditions of pipes, bongs, and oil rigs most valued at thousands of dollars.\n \nTaking to the Road\nOnce we had a chance to inspect the intricacies of each elaborate glass creation, we exited 7 Point Studios and made our way to the Kush Tours’ van, a clean, comfortable vehicle outfitted with educational material from none other than Leafly that explained Washington’s recreational cannabis laws. The ride also came complete with snacks and water to combat any bouts of the munchies or cottonmouth we may encounter along the way.\nAs we drove through the industrial SoDo district of Seattle, Chase called out area landmarks like CenturyLink Stadium, Safeco Field, and the Starbucks headquarters. He also mentioned the variety of cannabis-focused businesses that operate in the area, such as Zoot, makers of cannabis-infused concentrate drops made to enhance any beverage, and High Class Studio, a cannabis-friendly recording studio.\n \nTouring a Cannabis Testing Lab\nWe parked the van in front of Analytical 360, Washington’s first I-502 certified laboratory for testing cannabis. Once inside, we were introduced to the friendly staff of lab technicians who walked us through the process of testing cannabis samples. Starting with a high resolution photo, Analytical 360 records the visual record of each cannabis sample and inspects it for any foreign materials or contaminants. The flowers are screened for any impurities like mold or bugs before they undergo a dry weight analysis that helps determine the correlation between the sample and the lab’s baseline data. After performing all of their scientific magic, the results of every sample that is analyzed are published to Analytical 360’s website to serve as public record.\n \nVisiting a Retail Cannabis Store\nThe staff at Analytical 360 sent us off with a smile as we headed towards our next stop, Uncle Ike’s Pot Shop. Along the way, Chase explained the differences between the cannabis laws in Washington and Colorado and answered any questions we had about the city or the cannabis industry. As one of the few recreational cannabis retailers in the city, Uncle Ike’s has a line of customers waiting, which Chase explained is normal due to the slow trickle of approval for retail permits being issued by the state. However, after waiting for a few minutes, the security guard announced that that state-approved software for tracking cannabis inventory and sales, BioTrackTHC, was having technical difficulties and that they were working to resolve the issues.\nSince we were on a bit of a schedule, Chase recommended that we head to another retail location before continuing on to our next stop. We hopped back in the van and headed towards Cannabis City, Seattle’s first licensed cannabis retailer. When we arrived, we learned that they too had been hit by whatever glitch Uncle Ike’s experienced but it had been resolved in the time it took us to drive there. We skipped the line at Cannabis City, one of the perks of being on the tour, and after a quick ID check went right in.\nHaving been a medical patient for years and traveling to places like Amsterdam, I had some idea of what to expect. And aside from the taxes, the only real difference in the purchasing process was that everything is pre-packaged in tamper-proof packaging, which somewhat limits your opportunity to smell and interact with the product before making your decision. The best part is that everything is local and labeled with the product’s cannabinoid profile. The staff was friendly and knowledgeable, but generally speaking I prefer the more personal approach and experience that medical dispensaries offer.\nAfter scanning the selection of strains available, I elected to go with a two gram package of Blueberry Grape Ape and a gram of Purple Afghani, totaling $62 after tax. While more than I would typically like to pay, it was a refreshing feeling to have safe, dependable access to cannabis and know that my tax dollars are going towards furthering Washington’s public health programs.\n \nA Cannabis-Friendly Bed and Breakfast\nCannabis in hand, we headed back to the van and made our way to the Bacon Mansion, a cannabis-friendly bed and breakfast in Seattle’s Capitol Hill neighborhood.\n\nSurprisingly, there is no bacon on the Bacon Mansion menu. Instead, the mansion takes its name from the original builder, Cecil Bacon. Luckily, there wasn’t much time to dwell on the lack of bacon as we toured the grounds, which included a beautiful courtyard that allows smoking, before heading inside to get a crash course in vaporization.\n \nChecking Out a Medical Marijuana Dispensary\nKush Toursism keeps a Volcano vaporizer onsite for travelers to use while touring the city and staying at the mansion. We passed around a few bags of fresh, flavorful vapor and chatted about our experiences at Cannabis City before packing up for our next stop, a medical dispensary.\nOn our drive to the dispensary, Chase decided it was too nice of a day to pass up the view at Kerry Park. After a quick pit stop to take in the scenic skyline, we arrived at Green Anne.\nThe clean office space and friendly staff make Green Anne a welcoming medical dispensary with top-shelf organic medicine. Once inside, we were introduced to Eddie, who greeted us with a smile and imparted a wealth of knowledge and compassion for medical marijuana patients while giving us a rundown of Green Anne’s operations. He answered any questions we had and explained the differences between the recreational and medical markets. Unfortunately, it was an informational stop only as not everyone on the tour was a patient under Washington’s medical marijuana laws, but it was nice to see and better understand the juxtaposition of medical cannabis vs. recreational cannabis.\nGreen Anne was the final stop on the tour. After we said our goodbyes to Eddie and the staff, we piled into the van to head back to 7 Point Studios where the tour began.\n\n \nOther Kush Tour Opportunities\nWe wrapped our day with some laughs on the ride back while Chase shared some of the other exciting tours Kush Tourism has in the pipeline. Besides the Kush Tour, there is an outdoor farm experience that explores outdoor organic cannabis growing techniques, as well as private tours and custom vacation packages that allow you to personalize your experience. Just recently they added two new tours to the mix. One is of Sky High Gardens, a licensed Tier 3 grower, that gives travelers the opportunity to experience a 21,000 square foot commercial production facility firsthand. The other is labeled Toke ’n Brush, a spinoff from the popular trend of paint ‘n sip wine and painting parties that allows you enjoy cannabis while you paint with your friends or significant other.\nWith companies like Kush Tourism paving the way for the cannabis travel sector, I expect to see more exciting opportunities for consumers to dive deeper into the cannabis industry. As cannabis consumption becomes more universally accepted, travelers will find it easier and even be encouraged to enjoy their active lifestyles alongside cannabis when they adventure away from home.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/01/13214140/cannabis-tourism.jpg",
            "title": "Cannabis Tourism: The Kush Tour Experience",
            "urlslug": "/news/lifestyle/cannabis-tourism-the-kush-tour-experience"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 14.108236895847515
        },
        {
            "name": "Migraines",
            "score": 6.05854322668482
        },
        {
            "name": "ADD/ADHD",
            "score": 4.731109598366236
        },
        {
            "name": "PTSD",
            "score": 4.731109598366236
        },
        {
            "name": "Bipolar Disorder",
            "score": 1.7699115044247788
        }
    ],
    "description": "<p>A strong plant that is easy to grow. This Afghani is a mostly Indica inbred to produce thick and heavy buds. This variety has dark green leaves and calyxes that turn purple at flowering. Medium-high leaf to flower ratio with a subtle aroma and a very good high.</p>\n",
    "descriptionPlain": "A strong plant that is easy to grow. This Afghani is a mostly Indica inbred to produce thick and heavy buds. This variety has dark green leaves and calyxes that turn purple at flowering. Medium-high leaf to flower ratio with a subtle aroma and a very good high.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 60.55139550714772
        },
        {
            "name": "Uplifted",
            "score": 40.742001361470386
        },
        {
            "name": "Sleepy",
            "score": 27.416609938733835
        },
        {
            "name": "Happy",
            "score": 22.2430224642614
        },
        {
            "name": "Euphoric",
            "score": 16.626957113682778
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 18.481960517358747
        },
        {
            "name": "Earthy",
            "score": 12.338325391422737
        },
        {
            "name": "Grape",
            "score": 7.9135466303607895
        },
        {
            "name": "Spicy/Herbal",
            "score": 5.173587474472431
        },
        {
            "name": "Berry",
            "score": 4.952348536419333
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1375513,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "It has that stinky, cheesy, musty, dank smell, like Ingrid or UK Cheese.\r\n\r\nMy microscope inspection revealed plenty of gorgeous, matured trichromes that were either perfectly clear or hazy and sugary-looking. EXCELLENT for anxiety, and I have no doubt that it will help me sleep incredibly well tonight.",
            "username": "allgovernmentsLIE"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1613612,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I had a variation of this called afghani purple kush that was UNREAL. Highly recommend ",
            "username": "Skywaytraffic"
        }
    ],
    "id": 61,
    "name": "Purple Afghani",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 20.91558883594282
        },
        {
            "name": "Dry Eyes",
            "score": 7.385976855003404
        },
        {
            "name": "Dizzy",
            "score": 4.731109598366236
        },
        {
            "name": "Headache",
            "score": 0.8849557522123894
        },
        {
            "name": "Paranoid",
            "score": 0.6637168141592921
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/purple-kush",
            "category": "Indica",
            "name": "Purple Kush",
            "permalink": "https://mobileapi.leafly.com/indica/purple-kush",
            "slug": "purple-kush",
            "subtitle": null,
            "symbol": "Pk"
        },
        {
            "applink": "leafly://strain/afghani",
            "category": "Indica",
            "name": "Afghani",
            "permalink": "https://mobileapi.leafly.com/indica/afghani",
            "slug": "afghani",
            "subtitle": null,
            "symbol": "Afg"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/purple-afghani",
    "photoTotalCount": 52,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002408/b/purple-afghani__primary_825a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-afghani_100x100_460c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/643183/b/purple-afghani__primary_ba1d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-afghani_100x100_811f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/615534/b/purple-afghani__primary_fa00.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-afghani_100x100_0546.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/615884/b/purple-afghani__primary_4edc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-afghani_100x100_4d63.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/575603/b/purple-afghani__primary_8662.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-afghani_100x100_8a1a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/561130/b/purple-afghani__primary_6c99.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/purple-afghani_100x100_bf3d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Calgary, AB",
        "Montréal, QC",
        "Seattle, WA",
        "Toronto, ON",
        "Vancouver, BC",
        "Winnipeg, MB",
        "Bellingham, WA",
        "Brampton, ON",
        "Custer, WA",
        "Denver, CO"
    ],
    "rating": 4.23,
    "relatedStrains": [],
    "reviewCount": 88,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "purple-afghani",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.22727272727273/240",
    "subtitle": null,
    "symbol": "Ppa",
    "symptoms": [
        {
            "name": "Stress",
            "score": 21.57930565010211
        },
        {
            "name": "Insomnia",
            "score": 20.694349897889722
        },
        {
            "name": "Pain",
            "score": 13.444520081688223
        },
        {
            "name": "Headaches",
            "score": 9.904697072838665
        },
        {
            "name": "Fatigue",
            "score": 9.019741320626277
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
