{
    "aka": "SHK",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1476380337000)/",
            "id": "contentitems-8593",
            "text": "Cannabidiol, or CBD, is the second most common cannabinoid found in cannabis. Unlike its psychoactive sister, THC (or tetrahydrocannabinol), CBD plays it cool, offering relaxing, non-intoxicating effects that lend themselves to a variety of personal and medicinal uses. Because CBD lacks the stoney side effects typical of high-THC strains, it’s a great choice for patients needing to keep a clear head while treating pain, nausea, headaches, stress, anxiety, muscle spasms, epilepsy, and more.\nBut with so many high-CBD strains hitting the market today, it can be difficult to choose one. These high-CBD strains are the most popular and easy-to-find based on Leafly user-submitted reviews. Just click the strain tile to check if a strain is available near you!\nHarlequin\n \nHarlequin is one of the most popular CBD strains available. Typically testing around the 5:2 CBD/THC ratio, it exhibits a sativa-dominant alertness with only mild euphoria. Harlequin has a happy bent that most will find enhances whatever activity they are engaged in.\nRingo’s Gift\n \nRingo’s Gift – named for activist, CBD specialist, and founder of SoHum Seeds, Lawrence Ringo – is a hybrid cross of Harle-Tsu and ACDC. It keeps on giving to patients seeking a nearly full-on CBD-driven strain, with an average ratio of 24:1 CBD/THC.\nSweet and Sour Widow\n \nSweet and Sour Widow lands in the middle ground with a 1:1 CBD/THC ratio. This even split offers first-time cannabis consumers an enjoyable entry point to both THC and CBD without sending them into orbit. It also makes for good medicine while being slightly euphoric and stoney.\nStephen Hawking Kush\n \nStephen Hawking Kush offers mild, relaxing effects while doling out a healthy dose of CBD, too. This indica-dominant strain is one of the more unique CBD cuts out there, offering both heady and soothing effects.\nACDC\n \nACDC is easily my favorite CBD strain. The cannabinoid content is usually heavily CBD-dominant, sitting on average at 20:1 in its CBD/THC ratio. An imperceptible amount of THC makes ACDC an outstanding companion for daily medicinal cannabis consumers seeking to relieve tension, pain, or anxiety.\nCannatonic\n \nCannatonic isn’t nearly as sedative as the name implies. This strain usually brings a smaller CBD/THC split, ranging from 5:1 down to 1:1. This even-keeled cannabinoid profile gives consumers a great deal of flexibility to use Cannatonic as medicine or as an enjoyable, mild mannered strain to unwind with.\nHarle-Tsu\n \nHarle-Tsu, one of a few lovingly handcrafted strains created by the late Lawrence Ringo, is an outstandingly functional CBD cut. By combining Harlequin and Sour Tsunami, Harle-Tsu achieves a pleasant disposition without encumbering the consumer with strong sedation.\nCanna-Tsu\n \nCanna-Tsu is a more balanced CBD/THC strain that offers a unique bouquet of smells. With aromas of citrus and sweet earth, Canna-Tsu gives the CBD enthusiast a complex palate of flavor and terpenes to enjoy.\nSour Tsunami\n \nCreated by the larger-than-life grower and activist Lawrence Ringo, Sour Tsunami was brought into being by combining Sour Diesel and NYC Diesel. This unlikely pair of stimulating plants bred the high-CBD phenotype that has since redefined the medicinal qualities of cannabis.\nPennywise\n \nPennywise certainly has the scariest of all the names that made this list, or at least it does for those familiar with the Stephen King book responsible for its namesake. But fear not, Pennywise truly gets its name from its genetic cross of Harlequin and Jack the Ripper. It synthesizes Jack the Ripper’s mental clarity and an even 1:1 CBD/THC to make a strain that is functional and enjoyable at almost any dose.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/10/23143140/cbd-week-7.jpg",
            "title": "The 10 Best CBD Cannabis Strains According to Leafly Users",
            "urlslug": "/news/strains-products/10-best-cbd-cannabis-strains-according-to-leafly-users"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1469051100000)/",
            "id": "contentitems-3061",
            "text": "Space: the final frontier. The massively empty wonder which has tantalized the imagination of mankind since first gazing upwards to witness the brilliance of the celestial. Whether for discovery, in reaction to climate change, or because you’re an overly excited core that wants to go to space, exploration is more relevant and possible than ever. With private space companies reigniting the torch of space travel and helmed by incredibly smart and innovative individuals (like Elon Musk, founder of SpaceX, or Sir Richard Branson of Virgin Galactic), it’s not hard to believe we are entering a golden age of cosmological discovery.\nOn the shoulders of giants we stride forward into a future not grounded on Earth. Here at Leafly, we’d like to reengage the booster switch and combust a little propellant in honor of the men and women around the world making the dream of space exploration a reality. We’ve compiled a list of outer space-themed cannabis strains to help you celebrate the scientists, star formations, conspiratorial UFO hunters, Apollo missions, and others on this Space Exploration Day.\n  Project Blue Book\nOriginating in 1952, Project Blue Book kicked off a series of studies conducted by the U.S. Air Force to determine if UFOs were a threat to national security. Its strain counterpart is a sativa-leaning hybrid offering a serene body high and calm, focused effects that are perfect for star-gazing.\n  Sputnik\nThis rocket was used by the Soviet Union to perform the world’s first satellite launch in 1957. Strain-wise, the spunky Sputnik sativa (say that three times fast!) has hints of sour and diesel, perhaps from that rocket boost of uplifting effects you may experience.\n“2 hits to liftoff. Decent buzz out of the launchpad. mid buzz nice and headize, no burn out at the end. good strain to kick back, and rate strains.” – sonofabrokenman\n  Apollo 11\nThe first space flight that brought humans on the Moon, Apollo 11 is the reason we’re celebrating this date today since it occurred on July 20th, 1969. Neil Armstrong and Buzz Aldrin took one small step for man and one giant leap for mankind. The strain, meanwhile, offers strong cerebral effects that are good for treating stress and moderate pain.\n“I love this strain. It takes you on a cosmic journey while leaving you grounded on planet earth. –symbol9991\n  Stephen Hawking Kush\nThe iconic theoretical physicist brought us predictions on black holes, gravitational singularity theorems, and cosmology. His strainsake, Stephen Hawking Kush, is an indica-dominant offering that helps with pain, nausea, and relaxation.\n“Healing codes from the universe immediately came to me when I smoked a hit of this high 11.4 CBD strain. Absolutely Smiles and TOTAL RELEIF are endrenching me in this dream. My love of indica just got greater because I have had a crush on Stephen Hawking and now I can smoke bud named after his fine ass and mind. WOW I think this strain will make me more intelligent. It is so much stonier and higher than I thought it …” – StellarStoner\n  Apollo 13\nThe seventh manned mission in the Apollo space program, Apollo 13 was the United States’ third intended Moon landing. Unfortunately, an oxygen tank exploded and crippled the Service Module. The crew managed to cobble together some makeshift repairs and return safely to Earth on April 17th. Not only did this historical event result in a blockbuster film of the same name, it also inspired the popular Apollo 13 hybrid strain featuring cerebral, energizing effects and an appropriately earthy scent.\n“WOW! Such an appropriate name, because I’m blasted light years past the moon. Light speed ahead, on a rocket ship I said, catch me if you can, I’m your spaceman…” –NunoFreak\n  Cosmic Collision\nThis sativa collided Cosmic Charlie with Piña Collision to create a fusion that’s out of this world. Enjoy the pineapple-kiwi flavors of Cosmic Collision and its uplifting, euphoric effects while you ponder exactly how far the universe extends.\n  Carl Sagan\nThe American astronomer, cosmologist, astrophysicist, and astrobiologist dedicated his efforts to researching extraterrestrial life and sent the first physical messages into space. His Carl Sagan strain counterpart offers balanced effects and relaxation.\n  Outer Space\nDefined as the void that exists between celestial bodies, the mystery of outer space will keep scientists hunting for answers well into the next millennium. The sativa Outer Space is widely touted for its creative, uplifting, and energetic effects.\n“Really makes you feel like taking off into space. More of a head uplifting feeling and focus.” – robmorales\n  Nebula\nA nebula is an interstellar cloud comprised of dust, helium, hydrogen, and other ionized gases. Its hybrid Nebula strain version twinkles with THC coating and offers intense, almost psychedelic effects.\n“Out of this world!” – hermantheworm420",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001512/cannabis-strains-for-space-exploration-day.jpg",
            "title": "Celebrate Space Exploration Day With These Cannabis Strains",
            "urlslug": "/news/strains-products/cannabis-strains-for-space-exploration-day"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 71.05263157894736
        },
        {
            "name": "PTSD",
            "score": 43.859649122807014
        },
        {
            "name": "Migraines",
            "score": 13.596491228070175
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 10.087719298245613
        },
        {
            "name": "ADD/ADHD",
            "score": 9.210526315789473
        }
    ],
    "description": "<p>Stephen Hawking Kush, or SHK, is the second release in the Great Minds series of seeds from Alphakronik Genes. Named for famed scientist Dr. Stephen Hawking, SHK was created by pollenating a <a href=\"http://www.leafly.com/hybrid/harle-tsu\">Harle-Tsu</a> female with a <a href=\"https://www.leafly.com/indica/sin-city-kush\">Sin City Kush</a> male. This <a href=\"http://www.leafly.com/indica\">indica</a>-dominant <a href=\"http://www.leafly.com/hybrid\">hybrid</a> is also part of Alphakrokik Genes&rsquo; CBD+ line of genetics that emphasize <a href=\"http://www.leafly.com/news/cannabis-101/whats-the-deal-with-these-high-cbd-strains\">high-CBD strains</a>. There are 3 known <a href=\"http://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\">phenotypes</a> of Stephen Hawking Kush, all with vivid cherry and <a href=\"http://www.leafly.com/explore#!/explore/flavors-berry\">berry</a> flavors that mix with a <a href=\"http://www.leafly.com/explore#!/explore/flavors-minty\">minty</a> note. The soothing, <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\">relaxing</a> effects help keep pain away and also stimulate your stomach to suppress <a href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\">nausea</a>.</p>\n",
    "descriptionPlain": "Stephen Hawking Kush, or SHK, is the second release in the Great Minds series of seeds from Alphakronik Genes. Named for famed scientist Dr. Stephen Hawking, SHK was created by pollenating a Harle-Tsu female with a Sin City Kush male. This indica-dominant hybrid is also part of Alphakrokik Genes&rsquo; CBD+ line of genetics that emphasize high-CBD strains. There are 3 known phenotypes of Stephen Hawking Kush, all with vivid cherry and berry flavors that mix with a minty note. The soothing, relaxing effects help keep pain away and also stimulate your stomach to suppress nausea.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 79.3859649122807
        },
        {
            "name": "Sleepy",
            "score": 54.824561403508774
        },
        {
            "name": "Happy",
            "score": 43.421052631578945
        },
        {
            "name": "Euphoric",
            "score": 21.929824561403507
        },
        {
            "name": "Uplifted",
            "score": 21.052631578947366
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 19.298245614035086
        },
        {
            "name": "Woody",
            "score": 10.526315789473683
        },
        {
            "name": "Pine",
            "score": 9.210526315789473
        },
        {
            "name": "Pepper",
            "score": 8.771929824561402
        },
        {
            "name": "Pungent",
            "score": 8.771929824561402
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 53,
        "growNotes": "\n\t7-8 weeks flowering\n\tPhenotype #1: tall and stretchy with heavy yields and higher CBD content\n\tPhenotype #2: more balanced hybrid with wide array of colors, CBD:THC ratio around 5:1\n\tPhenotype #3: &quot;Father&#39;s Daughter&quot; takes after Sin City father and is short and purple\n\n",
        "height": "Tall",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1390583,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "My favorite strain by far. I've often compared it to waking up, getting laid, taking a hot shower and then finding $20.  It's super.",
            "username": "Avocado_bob313"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1616125,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Doesn't trigger my pain. I felt woken up, present but still high. emotionally feel happy and calm. ",
            "username": "FairyHairDontCare"
        }
    ],
    "id": 137136,
    "name": "Stephen Hawking Kush",
    "negatives": [
        {
            "name": "Dry Eyes",
            "score": 3.070175438596491
        },
        {
            "name": "Dry Mouth",
            "score": 3.070175438596491
        },
        {
            "name": "Dizzy",
            "score": 0.43859649122807015
        },
        {
            "name": "Headache",
            "score": 0.43859649122807015
        },
        {
            "name": "Paranoid",
            "score": 0.43859649122807015
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/harle-tsu",
            "category": "Hybrid",
            "name": "Harle-Tsu",
            "permalink": "https://mobileapi.leafly.com/hybrid/harle-tsu",
            "slug": "harle-tsu",
            "subtitle": null,
            "symbol": "Hts"
        },
        {
            "applink": "leafly://strain/sin-city-kush",
            "category": "Indica",
            "name": "Sin City Kush",
            "permalink": "https://mobileapi.leafly.com/indica/sin-city-kush",
            "slug": "sin-city-kush",
            "subtitle": null,
            "symbol": "Sin"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/stephen-hawking-kush",
    "photoTotalCount": 6,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503159/b/stephen-hawking-kush__primary_ecf8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/stephen-hawking-kush_100x100_71f6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/401070/b/stephen-hawking-kush__primary_aeef.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/stephen-hawking-kush_100x100_542f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/360459/b/stephen-hawking-kush__primary_1ff5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/stephen-hawking-kush_100x100_d3a4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/360014/b/stephen-hawking-kush__primary_6e34.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/stephen-hawking-kush_100x100_886c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/309939/b/stephen-hawking-kush__primary_63f4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/stephen-hawking-kush_100x100_ea51.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/285550/b/stephen-hawking-kush__primary_988f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/stephen-hawking-kush_100x100_ef0f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Bellingham, WA",
        "Bremerton, WA",
        "Des Moines, WA",
        "Eugene, OR",
        "Everett, WA",
        "Granite Falls, WA",
        "Medford, OR",
        "Molalla, OR",
        "Mukilteo, WA"
    ],
    "rating": 4.61,
    "relatedStrains": [],
    "reviewCount": 51,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "stephen-hawking-kush",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.6078431372549/240",
    "subtitle": null,
    "symbol": "Shk",
    "symptoms": [
        {
            "name": "Pain",
            "score": 38.59649122807017
        },
        {
            "name": "Stress",
            "score": 37.71929824561403
        },
        {
            "name": "Fatigue",
            "score": 11.842105263157894
        },
        {
            "name": "Nausea",
            "score": 10.964912280701753
        },
        {
            "name": "Depression",
            "score": 10.526315789473683
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
