{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1443740400000)/",
            "id": "contentitems-2939",
            "text": "There’s something about settling down with your favorite video game and a bowl of your go-to strain ready at your side. Cannabis can be a magnificent companion to the virtual world, so we dug into Leafly’s strain reviews to find out which games were most cherished and how different varieties affected your abilities and experiences.\nWhat Cannabis Strains Do You Pair with Video Games?\nWe mapped the relationship between different video games and their strain reviews (click on the below image to enlarge it) to see which strains were connected to popular video games.\n\nClick on the image for a full-sized version.\nEach connection represents Leafly visitors’ strain reviews mentioning specific video game titles. Both the Call of Duty and Grand Theft Auto franchises are the obvious favorites, with Sour Diesel and Durban Poison acting as the bridges between them.\nSpeaking of Sour Diesel, this consumer favorite is unsurprisingly also a go-to for gaming, as it’s connected to six titles. But were these strain selections actually a good pairing with these games, or did they lead to consumer regret? Let’s take a look at what some of you reviewers said about them.\nCannabis Strains That Helped Gamers Focus\nThere’s nothing quite like plopping down with your favorite video game and feeling completely immersed in it, thanks to the help of a good focusing strain. Here are a couple strains our reviewers called out as performance enhancers:\n Fruity Pebbles\n“I also did fucking great at [Call of Duty] afterwards, which usually takes an act of God. So studies may prove that this stuff improves your video game skills.”\n Diablo\n“My girlfriend and I cleaned the whole house and also beat some long standing high scores on Rock Band.”\nLooking for cannabis strains to help you stay on your game? Check out this list of all focusing strains on Leafly.\nCannabis Strains That Were Paired with Creative Gaming\nAnother way cannabis and video games pair beautifully is through creativity. Many games have a creative component that cannabis can cater to, whether you’re exploring the wastelands of Fallout, building mods for Skyrim, or constructing a glorious palace for yourself in Minecraft.\n Green Crack\n“Gave me inspiration. Had a lot of fun playing Skyrim on my PC and modding the hell out of it.”\nWhat other strains can help pique your creativity in the virtual realms? Refer to Leafly’s full list of creative strains to find out.\nCannabis Strains That Were Too Distracting for Gamers\nFor every strain that boosts creativity and focus, you know there’s another one to throw off your groove completely. It may be that heavy indica that defeats your sense of purpose in the game, or that buzzing sativa that keeps your focus jumping from one irrelevant detail to the next. Let’s take a look at some of the struggles our Leafly reviewers endured:\n GSC (f.k.a Girl Scout Cookies)\n“Be careful because if you play Call of Duty, you’re gonna be running into a shit ton of walls.”\n Purple Urkle\n“I normally play Madden way better stoned but on this stuff I suck. I get confused real easy on it.”\nCannabis Strains That Blew Gamers’ Minds\nLeave it to cannabis to ensure you have a great time even when you’re beyond your ability to operate a controller. These reviewers prove that sometimes it isn’t always about winning, it’s about having fun.\n Cherry Pie\n“We smoke a bowl and in a few minutes Mario Kart is like the best thing on the planet.”\n Lemon Kush\n“Great for playing video games. I smoked a bowl and sat in front of a towel trying to move it with my mind for an hour. Played GTA V after smoking a ton of this, so much fun. Drove around the countryside for hours.”\nWhat are the Most Popular Video Games According to Leafly Visitors?\nThe below graph shows which games were most commonly talked about in Leafly cannabis strain reviews. The larger the bubble, the more popular the game. Call of Duty is king, with Minecraft, Grand Theft Auto, and Skyrim close behind. These games are popular in their own right, but based on our user reviews, cannabis sure brings something special to the experience, too.\n\nClick to enlarge.\nWhich Cannabis Strains are Most Popularly Paired with Video Games?\nIt should come as no surprise that Blue Dream, Sour Diesel, Green Crack, and AK-47 are among the most popular video game partner strains – they’re some of the more prolific varieties available. But it also makes sense that these classics pair so well with video games when you look at their effect profiles.\nBlue Dream and AK-47 offer a balance of relaxation and creativity, while other sativas like Sour Diesel and Green Crack provide cerebral energy and focus. Even heavy indicas like Bubba Kush and Northern Lights have something to offer gamers chasing a blissful couchlock feeling that lets you ease yourself into a fully immersive experience.\nThe below chart indicates the most popular cannabis strains for playing video games. The larger the bubble, the more frequently that strain is consumed when gaming. And, of course, each bubble’s color is designated by which strain type it is, with red representing sativa strains, purple representing indica strains, and green representing hybrid strains.\n\nClick to enlarge.\nWhich Video Game Genres are Most Popular Among Cannabis Consumers?\nIf you’re curious as to which genres are preferred among cannabis, consumers, we broke the data out into a pie chart. Shooter games were the clear favorite, followed by action/adventure and role-playing games.\n\nClick to enlarge.\nThis breakdown differs from 2014 statistics via the Entertainment Software Association, which had action games as the most popular genre at 28.2% and shooter titles in second place at 21.7%. Their stats looked more like this:\n\nAction and adventure: 34.2% (we combined action, which had 28.2%, with adventure, which was broken out as a separate genre at 6%)\nShooter: 21.7%\nSports: 13.3%\nRole-playing: 9.5%\nFighting: 6%\n\nWhich Game Ratings are the Most Popular Among Cannabis Consumers?\nUnsurprisingly, with shooter games being the most popular among Leafly’s cannabis consumers, games rated “M” for “Mature” (meaning the content is suitable for players ages 17 and up) were similarly the most popular rating at 54%.\nHowever, titles rated “E” for “Everyone” (meaning all ages) came in second, which may seem remarkable at first until you consider that many gamers who settle in with with a packed strain in one hand and a controller in the other could be looking to relax and have fun playing a game that doesn’t require excessive concentration, skill, or experience. It’s no fun getting your ass kicked while poorly playing an impaired game of Call of Duty, but button mashing through a round of Super Smash Bros. or warbling through “Blitzkrieg Bop” when playing Rock Band with friends can be entertaining even if you’re sucking it up. (Note that Leafly.com requires its visitors to be at least 21 years of age or a legal, valid medical marijuana patient.)\n\nClick to enlarge.\nWhich Game Platforms are the Most Popular Among Cannabis Consumers?\nLastly, we analyzed the most popular gaming platforms according to our cannabis consumers.\n\nClick to enlarge.\nXbox is the most popular gaming platform, with Playstation firmly in second place, PC games in third, and Nintendo bringing up the rear. However, when it came to the console wars, our reviewers don’t specify which generation console they’re using. In actuality, the Nintendo Wii actually sold more units than either the Xbox 360 or the Playstation 3, and lifetime sales of each platform’s newest generation console (the Xbox One, Playstation 4, and Wii U) through February 2015 were as follows:\n\nPlaystation 4: 19,052,353\nXbox One: 11,298,462\nWii U: 9,137,844\n\nTime for you to weigh in! Which video games do enjoy most while high, and what cannabis strains make them even better?",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12000733/whats-the-most-popular-video-game-to-play-while-high.jpg",
            "title": "What’s the Most Popular Video Game to Play While High?",
            "urlslug": "/news/lifestyle/whats-the-most-popular-video-game-to-play-while-high"
        },
        {
            "author": "Lisa Rough",
            "category": null,
            "date": "/Date(1441900800000)/",
            "id": "contentitems-2957",
            "text": "For some cannabis consumers, the “munchies,” or appetite stimulation, is an unwanted side effect that can lead to overeating, but for many medical marijuana patients, it provides necessary relief from symptoms like nausea and a lack of appetite. For those of you who consume cannabis as a natural appetite stimulant or to help calm gastrointestinal distress, here are 10 of the many strain varieties that can help kick-start the grumbles in your tummy:\n Goo\nGoo is a fairly heavy indica, so don’t test this strain unless you’re prepared for a strong dose of relaxation with your appetite boost. It also offers relief from painful muscle spasms, making it a good choice for spasticity or for those who suffer from gastrointestinal disorders.\n Monster Cookies\nAnother potent indica, Monster Cookies hails from the favored GSC (f.k.a Girl Scout Cookies) tribe and offers the same dose of euphoria and relaxation you know and love. The sleepy effects will increase over time, so keep your couch and your munchies close at hand and you’ll be set for the night.\n Maui Bubble Gift\nMaui Bubble Gift is an aromatic hybrid with roots in three distinctively fantastic medicinal strains: Bubble Gum, Maui Waui and God’s Gift. This indica-dominant strain has an unusually high CBD content, which makes it an excellent choice for pain and nausea sufferers. With the mental clarity of Maui Waui, the stomach-soothing spasm relief of Bubble Gum, and the relaxing effects of God’s Gift, this hybrid offers the best of three worlds in one.\n Sonoma Coma\nSonoma Coma is a rare sativa that hails from (where else?) Sonoma County, California. It offers energetic, uplifting effects with a mellow finish and a dash of the munchies to aid a diminished appetite.\n Platinum Purple Kush\nPurple Kush’s beefed-up older brother, Platinum Purple Kush provides deep muscle relaxation while still maintaining clarity and focus, making it one of the “lighter” indicas on our list. It has been known to make consumers “crazy hungry,” so make sure to have some noms on hand.\n Orange Skunk\nA citrus infusion with a clear-headed high, Orange Skunk relieves depression and anxiety in addition to a lack of appetite. With a myriad of effects, this strain can help relieve multiple symptoms, including inflammation, headaches, even pain and fibromyalgia.\n Gigabud\nThis indica-dominant hybrid is known to be expressly excellent for inducing an appetite, even among those with the most intense stomach symptoms. For those with nausea, weight loss, and issues with the digestive tract, Gigabud ought to be a staple for relief and to encourage a “ravenous” appetite.\n Caramelo\nThis sativa-dominant hybrid has indica origins in the Lavender family, offering an uplifting buzz without paranoia, along with potent pain and nausea relief. While Caramelo is an energetic strain useful for daytime consumption, be forewarned: the effects may be short-lived, so you may require a stronger strain for longtime symptom management.\n Pure Kush\nTrue to its name, Pure Kush is one of the purest, most potent indicas you’ll encounter. Watch out because this strain will knock you out like Mike Tyson if you’re not careful. Place your pizza orders before you dose or you may have trouble peeling yourself up off the couch to even get to the kitchen, which just seems….so far away….\n Diablo\nContrary to its name, this devilish strain is a kinder, gentler indica than many on this list. While couchlock is still a potential side effect, Diablo will allow you the focus and mental capacity to tackle day-to-day life without too much trouble, although you may need to watch out for a case of the giggles.\nStill looking for an appetite stimulant? Here are some other options to help make you hungry, calm your stomach, or reduce nausea:\nCannabis strains that make you hungry (click through for a full list):\n\nCannabis strains that calm your stomach (click through for a full list):\n\nCannabis strains that help relieve nausea (click through for a full list):",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/09/12001211/10-cannabis-strains-to-help-stimulate-your-appetite.jpg",
            "title": "Need to Kick-Start Your Appetite? Try These 10 Cannabis Strains to Help Induce Hunger",
            "urlslug": "/news/strains-products/10-cannabis-strains-to-help-stimulate-your-appetite"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 32.54770992366412
        },
        {
            "name": "ADD/ADHD",
            "score": 18.158396946564885
        },
        {
            "name": "Arthritis",
            "score": 3.7404580152671754
        },
        {
            "name": "PMS",
            "score": 3.549618320610687
        },
        {
            "name": "Fibromyalgia",
            "score": 3.454198473282443
        }
    ],
    "description": "<p>With lineage from <a href=\"http://www.leafly.com/sativa/grapefruit\">Grapefruit</a>, <a href=\"http://www.leafly.com/hybrid/blueberry\">Blueberry</a> and South African Sativa, there is a sweet flavor to the Diablo cannabis strain. This indica&nbsp;has a purple hue,&nbsp;fruity and&nbsp;spicy flavors, and&nbsp;a&nbsp;THC content that tends to fall&nbsp;between&nbsp;15-20%. Diablo&nbsp;has&nbsp;an indoor&nbsp;flowering time of 6-7 weeks&nbsp;and took&nbsp;second place at the 2002&nbsp;BC Harvest Cup in the outdoor category.</p>\n",
    "descriptionPlain": "With lineage from Grapefruit, Blueberry and South African Sativa, there is a sweet flavor to the Diablo cannabis strain. This indica&nbsp;has a purple hue,&nbsp;fruity and&nbsp;spicy flavors, and&nbsp;a&nbsp;THC content that tends to fall&nbsp;between&nbsp;15-20%. Diablo&nbsp;has&nbsp;an indoor&nbsp;flowering time of 6-7 weeks&nbsp;and took&nbsp;second place at the 2002&nbsp;BC Harvest Cup in the outdoor category.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 62.729007633587784
        },
        {
            "name": "Uplifted",
            "score": 50.62977099236641
        },
        {
            "name": "Relaxed",
            "score": 48.57824427480916
        },
        {
            "name": "Tingly",
            "score": 45.54389312977099
        },
        {
            "name": "Talkative",
            "score": 39.98091603053435
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 38.92175572519084
        },
        {
            "name": "Blueberry",
            "score": 33.74045801526717
        },
        {
            "name": "Pine",
            "score": 32.1087786259542
        },
        {
            "name": "Spicy/Herbal",
            "score": 29.12213740458015
        },
        {
            "name": "Sweet",
            "score": 29.112595419847327
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1417090,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I like Diablo Og. The Name Steered me away from it but its a very good og strain. Potent with a 70/30 sativa characteristics dominant. I feel it in the back of my eyes and in my head mainly. It helps me to not think so much and not over worry about things. It also kicked up a appetite!",
            "username": "coreymeans"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1622270,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Pretty strong but enjoyable ",
            "username": "asapmarky14"
        }
    ],
    "id": 400,
    "name": "Diablo",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 32.166030534351144
        },
        {
            "name": "Dry Eyes",
            "score": 19.198473282442748
        },
        {
            "name": "Paranoid",
            "score": 14.895038167938932
        },
        {
            "name": "Dizzy",
            "score": 14.50381679389313
        },
        {
            "name": "Headache",
            "score": 13.263358778625953
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/african",
            "category": "Sativa",
            "name": "African",
            "permalink": "https://mobileapi.leafly.com/sativa/african",
            "slug": "african",
            "subtitle": null,
            "symbol": "Afr"
        },
        {
            "applink": "leafly://strain/grapefruit",
            "category": "Sativa",
            "name": "Grapefruit",
            "permalink": "https://mobileapi.leafly.com/sativa/grapefruit",
            "slug": "grapefruit",
            "subtitle": null,
            "symbol": "Grf"
        },
        {
            "applink": "leafly://strain/blueberry",
            "category": "Indica",
            "name": "Blueberry",
            "permalink": "https://mobileapi.leafly.com/indica/blueberry",
            "slug": "blueberry",
            "subtitle": null,
            "symbol": "Bry"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/diablo",
    "photoTotalCount": 57,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/613516/b/diablo__primary_7a5e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/diablo_100x100_404d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/553807/b/diablo__primary_6ade.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/diablo_100x100_1647.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/519601/b/diablo__primary_3cc5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/diablo_100x100_abd5.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/516876/b/diablo__primary_ce9d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/diablo_100x100_18ff.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509221/b/diablo__primary_29d4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/diablo_100x100_0ec0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502646/b/diablo__primary_5f29.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/diablo_100x100_4a56.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Los Angeles, CA",
        "Portland, OR",
        "Vancouver, BC",
        "Montréal, QC",
        "Ottawa, ON",
        "Saskatoon, SK",
        "Toronto, ON",
        "Victoria, BC",
        "Waterloo, ON",
        "West Hollywood, CA"
    ],
    "rating": 4.19,
    "relatedStrains": [],
    "reviewCount": 237,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "diablo",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.18987341772152/240",
    "subtitle": null,
    "symbol": "Dia",
    "symptoms": [
        {
            "name": "Stress",
            "score": 46.00190839694656
        },
        {
            "name": "Depression",
            "score": 37.56679389312977
        },
        {
            "name": "Pain",
            "score": 24.666030534351144
        },
        {
            "name": "Insomnia",
            "score": 22.270992366412216
        },
        {
            "name": "Muscle Spasms",
            "score": 14.50381679389313
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
