{"sl_translate":"description,descriptionPlain,category","id":30,"slug":"hindu-kush","name":"Hindu Kush","subtitle":null,"symbol":"Hk","category":"Indica","description":"\u003cp\u003eHindu Kush is a pure \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e strain named after the mountain range stretching 500 miles between Pakistan and Afghanistan where it originated. The harsh climate of its homeland has conditioned this strain to express a thick, protective coat of crystal \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\"\u003etrichomes\u003c/a\u003e cherished by \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-great-wide-world-of-cannabis-concentrates\"\u003ehash\u003c/a\u003e makers worldwide. With a subtle \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eearthy\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-woody\"\u003esandalwood\u003c/a\u003e\u0026nbsp;aroma, Hindu Kush induces a deep sense of calm that helps bring relief to those suffering \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\"\u003enausea\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress disorders\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"Hindu Kush is a pure indica strain named after the mountain range stretching 500 miles between Pakistan and Afghanistan where it originated. The harsh climate of its homeland has conditioned this strain to express a thick, protective coat of crystal trichomes cherished by hash makers worldwide. With a subtle sweet and earthy sandalwood\u0026nbsp;aroma, Hindu Kush induces a deep sense of calm that helps bring relief to those suffering pain, nausea, and stress disorders.\n","aka":"Hindi Kush","rating":4.36,"highlightedReviews":[{"id":1416953,"username":"nycyankeesm","text":"Just got this strain and have been smoking it for a few hours, and it\u0027s a different kind of indica high for me but I really like it. I have the body high and am completely stoned, feeling uplifted and euphoric but somewhat couch locked. But I\u0027m also getting really weird visuals when I close my eyes. The strangest thing is it makes me really focused and I\u0027m getting some studying done at almost midnight now. I recommend this strain to any working professional, someone with a difficult job or college/grad students that need to relieve some stress because you can still be productive while high. I mean look at this long ass review I wrote! ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"},{"id":1641678,"username":"hab13","text":"Great strain for end of the day before bed.\nI vape it in my chair and the next thing I know it carefully carries me to my bed and makes me so comfortable before falling asleep.\nIn that time I just feel so relaxed, happy and just really good.\nAfter I quickly nod off it provides me with a great sleep and wake up refreshed in the morning.\nTaste is real nice just as it says sweet citrus with earthy tones love the exhale on the vape around 355 degrees.\nI used to vary my nighttime strains but hindu kush is quickly becoming one of my favs for nighttime, highly recomended.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-40128","title":"Hungover? These Cannabis Strains Can Help","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1514822427000)\/","text":"For most of us in the Western hemisphere, drinking is usually the first step into the wide and varied world of intoxicants. Drinking, like cannabis, can give a person access to a wide range of sensations–but in all fairness, only one of these significantly increases your chance of barfing. And yes, I mean alcohol. Alcohol can be a lot of fun, but one of the primary deterrents for getting lit on liquor or wrecked on red wine (especially after age 30) is the fierce hangover the next day.\nHangovers can feel like a vampire drained your body of all life-giving fluids just before throwing you in front of a speeding city bus. And somehow you miraculously survived.\nEnter cannabis and its soothing cocktail of cannabinoids. These unique chemical compounds can induce pleasurable euphoria while tempering nausea, reducing inflammation, and stimulating appetite. Cannabis is not a silver bullet for removing a hangover, but it’s often a step toward recovery. Cannabis mixed with a good breakfast and the steady intake of water can revive and rejuvenate even the most wretched party monster.\n\nA cannabis oil cartridge and pen battery is my preferred cannabis consumption method following a long night of drinking. This method is convenient for a few reasons:\n\nYou don’t have to get out of bed\nThe potency and variety of cartridges are at my disposal\nNo need for extra steps like lighting a bowl\nThey are generally less harsh (i.e., you’re less likely to cough and exacerbate your current discomfort)\n\nBrowse Cannabis Vape Pens\nGoing a step further, I would recommend a CBD-dominant cartridge with a 1:1 or 3:1 CBD/THC ratio. This mixture of cannabinoids is utilized by cannabis consumers in and outside the medicinal cannabis community for its anti-inflammatory, anti-anxiety, and analgesic (pain reducing) qualities.\nI encourage you to explore and experiment with strains and products that work best for you. Some folks would rather snap off a zippy sativa to front-load their body and mind with energy. Others seek out strains that help dull the pounding headache of a hangover. My point is, there is no one way. Just be sure to supplement all cannabis consumption with plenty of water and food (and maybe a multivitamin after said food) to assist in the recovery process.\n\nExplore your local dispensary beforehand, and who knows, you might find a deal or two that prepares you for a long Saturday or Sunday of post-party recuperation.\nCannabis Strain Recommendations for Alleviating Hangovers\nHigh-CBD Cannabis Strains\n   Harlequin\nOne of the most popular, and thus, readily available CBD-dominant strains in many cannabis markets, Harlequin offers a solid CBD:THC ratio and a gentle, but noticeable mood boost. This strain’s soothing, happy buzz can work wonders after a solid holiday brunch.\nFind Harlequin Nearby\n   Sour Tsunami\nSour Tusnami is another popular CBD strain that can help tone down nausea and temper inflammation. The bouquet can be a little flat, but the overall effects (especially when mixed with food and water) are stunningly apparent and not mentally or physically cumbersome, which some THC-dominant strain can be.\nFind Sour Tsunami Nearby\n   Dancehall\nHangover or no hangover, Dancehall is curently my favorite CBD dominant flower, period. With usually less than 2% THC and upwards of 20% CBD, Dancehall hits all the right notes at the perfect pitch and volume. The terpene profile is surprisingly dank, reeking of skunk and swamp grass, but the flavor is sweet and herbaceous on the tongue. In a pipe, joint, or vaporizer, Dancehall will be your host at the after-after-after party come New Years Day.\nFind Dancehall Nearby\n   Cannatonic\nCannatonic is known for having a 3:1 CBD/THC ratio, which is perfect for consumers looking for a little headiness with their dose of wellness. This strain is also a popular concentrate, giving vapers, dabber, and other high-potency consumers a good option if smoke inhalation is too harsh. But beware of the dreaded dab cough! Uncontrollable post-hit hacking is the absolute worst with a hangover–trust me!\nFind Cannatonic Nearby\nTHC-Dominant Cannabis Strains\n   Lavender\nLavender is a natural choice for this list: 1) it is indica-dominant in effect, 2) its high concentrations of the terpene linalool should help with the discomfort caused by a hangover, 3) Lavender is sedative at a higher dose, but can be quite functional with only a hit or two. This allows consumer modulate their dosage depending on the severity of their hangover.\nFind Lavender Nearby\n   Hindu Kush\nHindu Kush is one of the more mellow options on this list. The goal is to reduce the overall physical discomfort caused by a hangover, and Hindu Kush dulls just about every sense a person could have. This isn’t a one-and-done painkiller, but consumption should lead to some degree of physical and mental relief from a hangover.\nFind Hindu Kush Nearby\n   Jillybean\nJillybean is a joyous strain with delicious flavors that can add a little pep to your step post-NYE. This strain’s sweet citrus flavor and sativa-dominant bent give the consumer a nudge toward alertness and a slight boost of energy.\nFind Jillybean Nearby\n   Chocolope\nChocolope is a spicy, nutty flower with good energy in store. This strain is pungent and invigorating, leaving the consumer with a happy feeling right between the ears. Mood elevation is a great way to stem the down-and-out feeling of a hangover. Chocolope is a great rallying call on New Years Day to bring your fellow hungover party goers out and back to life.\nFind Chocolope Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/29164217/hangover.jpg","urlslug":"/news/strains-products/best-cannabis-strains-for-hangovers"},{"id":"contentitems-35872","title":"Tips for Growing Hindu Kush Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1501535254000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Hindu Kush is a landrace strain from the Hindu Kush mountain range in Pakistan and Afghanistan. It’s been grown and consumed for centuries, and remains cherished for its calming and therapeutic high. The earthy flavor and smell is reminiscent of Afghani hash, and Hindu Kush genetics have been behind the production of Middle Eastern hashish for ages.\nGrow Techniques: Hindu Kush is an indica strain, which means its growth is short, dense, and bushy. This can be taken advantage of when growing indoors in small spaces. Hydroponically, Hindu Kush takes off and produces large resinous buds. SOG (sea of green) is recommended for maximum yields. Keep the airflow strong in the garden to help reduce humidity in the dense canopy.\nFlowering Time: 7-8 weeks\nYield: High\nGrow Difficulty: Moderate\nClimate: Hindu Kush likes a dry climate with low humidity. It can handle cold temperatures well but suffers with moisture. Ideally, keep this strain between 65 and 80 degrees Fahrenheit.\nIndoor/Outdoor: This plant performs well indoors and out as long as humidity and moisture is low.\nFeeding: Go heavy on the CalMag and nitrogen to start, and end with strong bloom recipes to help produce dense buds.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/31134328/hindu-kush-strain.jpg","urlslug":"/news/growing/how-to-grow-hindu-kush-marijuana"}],"reviewCount":969,"flavors":[{"name":"Earthy","score":32.567958276031234},{"name":"Sweet","score":18.057137227463187},{"name":"Citrus","score":16.42217772094482},{"name":"Woody","score":15.539363524501169},{"name":"Pine","score":14.511987196499948}],"effects":[{"name":"Relaxed","score":102.83524742442154},{"name":"Euphoric","score":71.540682478024138},{"name":"Happy","score":68.5397415172791},{"name":"Sleepy","score":60.070933963857456},{"name":"Uplifted","score":50.378173731914643}],"symptoms":[{"name":"Stress","score":55.589145977593866},{"name":"Pain","score":48.9214539049871},{"name":"Insomnia","score":41.848565638043759},{"name":"Depression","score":39.322669111556117},{"name":"Lack of Appetite","score":20.026962144425411}],"conditions":[{"name":"Anxiety","score":42.816307573527631},{"name":"PMS","score":13.294991193572514},{"name":"PTSD","score":11.668395782565685},{"name":"Migraines","score":11.023234492243105},{"name":"Arthritis","score":9.5755623647871566}],"negatives":[{"name":"Dry Mouth","score":45.51067226417674},{"name":"Dry Eyes","score":18.705776855582631},{"name":"Paranoid","score":14.490172187773945},{"name":"Headache","score":12.026483621653357},{"name":"Dizzy","score":9.7718974433211887}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/indica/hindu-kush/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/indica/hindu-kush/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/hindu-kush_100x100_f491.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005405/b/hindu-kush__primary_a8c8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/hindu-kush_100x100_98dc.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/675694/b/hindu-kush__primary_8bd5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/hindu-kush_100x100_acf6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/663984/b/hindu-kush__primary_2892.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/hindu-kush_100x100_5dc2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646899/b/hindu-kush__primary_c386.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/hindu-kush_100x100_ff53.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646189/b/hindu-kush__primary_8c15.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/hindu-kush_100x100_dfe1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639478/b/hindu-kush__primary_668c.jpg"}],"photoTotalCount":208,"popularCities":["Vancouver, BC","Seattle, WA","Montréal, QC","Toronto, ON","Calgary, AB","Portland, OR","Edmonton, AB","Eugene, OR","Mississauga, ON","Winnipeg, MB"],"permalink":"https://mobileapi.leafly.com/indica/hindu-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.36016511867905/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":63,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":null,"growNotes":"\n\tSuitable for indoors or\u0026nbsp;warmer outdoor climates under\u0026nbsp;42\u0026deg;N latitude\n\n"}}
