{
    "aka": "High Rise, High-Rise, Grandmaster Kush, Grand Master Kush",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1485980117000)/",
            "id": "contentitems-17245",
            "text": "Cannabis can be classified in many different ways. Typically, this resinous flower is categorized as sativa, hybrid, or indica, based on the morphology of the plant. But cannabis can be further categorized through a vernacular defined by the popular culture, such as Kush, Haze, and Purple. These terms refer to types of cannabis characterized by distinct smells, flavors, effects, and/or geographic regions.\n\nWhat Characterizes ‘Kush’ Cannabis?\n\nKush is a particular variety of cannabis that descends from the Hindu Kush mountains. This mountain range spans the Afghanistan-Pakistan border and is one of the few geographic regions where the cannabis plant grows natively.\nHaving strong Kush genetics usually means a strain will have a few of the following attributes:\n\nAppearance: Your strain may exhibit deep green colas and leaves with hints of purple. Pistils (hairs) can look orange, bronze, or rust colored.  Buds are dense, chunky, and knotted, coming from squat, thick plants.\nSmell: Aroma can vary between earthy, floral, pungent, pine, incense, sweet fruit, hash spice, pepper, citrus, gas, and herbs.\nFlavor: Smoke or vapor should be smooth and herbaceous, tasting of flowers, grape, diesel, citrus, and earth.\nEffects: The effects are typically heavy and sedative. OG Kush crosses are usually coupled with a bright euphoria that puts a smile on the couch-locked consumer. Introspection or internal reflection is a common effect of Kush as well. These cerebral effects make a strong case for Kush as a meditative variety of cannabis.\n\nKeep in mind that these attributes can vary from Kush strain to Kush strain. How a strain is grown and its unique genetic expression (referred to as a “phenotype”) naturally affect a strain’s attributes.\n\nAmong strain breeders, Kush varieties are popular candidates for backcrossing and in turn, stabilizing hybrid genetics. As with many landrace strains, Kush genetics present natural resistance to certain elements native to their land of origin. This includes hardy stocks and vegetation that can survive colder, harsher climates and moderate water consumption, allowing the plant to endure somewhat parched terrain. In addition to their natural resilience, many growers choose to grow Kush strains for their heavy yields and manageable height.\nWhat Are the Most Popular Kush Cannabis Strains?\nA simple search of “Kush” will yield hundreds of strains with an Afghani ancestor, but let’s start with the five most popular:\n1. OG Kush\n\nThe most famous of all Kush varieties, OG Kush hits the sweet spot on the indica-dominant hybrid scale. This strain’s comfortable yet potent sedation coupled with an uplifting euphoria make it the perfect strain to just feel good with.\n2. Bubba Kush\n\nBubba Kush is what usually comes to mind when people think of indica-dominant effects. This strain is stoney and sedative, weighing the consumer to couch as though they were wearing cement boots with a matching cement tracksuit and stately cement trench coat. Bubba Kush may also ignite your appetite; just try not to fall asleep in front of the fridge while spooning a box of Eggo waffles.\n3. Purple Kush\n\nPurple Kush is an excellent example of indica-dominant attributes. This strain has purple foliage and will generally have an earthy, grapey flavor, as well as sleepy effects.\n4. Skywalker OG\n\nSkywalker OG takes the classic hybrid effects of OG Kush and deepens its sedating effects with the addition of Skywalker. This Kush develops a fruit-rich, diesel-driven flavor and aroma while mimicking the happy, uplifted mental characteristics of its paternal genetics. The creeping, sedative effects melt over the body, taking the consumer from the light side of day into the dark side of night (and sleep.)\n5. Master Kush\n\nMaster Kush is another Kush classic that inherits attributes directly from Hindu Kush. With a mixture of sleepy, happy, and relaxing effects, Master Kush earns its title. This strain is an excellent alternative to Bubba Kush.\nWhich Kush varieties are your favorite? Share them in the comments section below!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/02/01113652/kush.jpg",
            "title": "What Is 'Kush' Cannabis?",
            "urlslug": "/news/cannabis-101/what-is-kush-marijuana"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1498250427000)/",
            "id": "contentitems-32078",
            "text": "Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: A beautiful example of landrace genetics, Master Kush was created by White Label Seeds by collecting two indica landrace strains from the Hindu Kush mountain range. It has classic Kush genetics, with pungent earthy and recognizable incense smells. Reminiscent of the charas hash from the Hindu Kush mountains, its high relaxes the body while keeping the head clear, making it a unique and enticing strain.\nGrow Techniques: Master Kush is perfect for a hydroponic SOG (sea of green) setup. Its plants remain short and dense, making it ideal for filling a small grow space. Use garden trellises, then clear out lower bud sites to direct the energy into the colas.\nFlowering Time: 7-8 weeks\nYield: High\nGrow Difficulty: Easy\nClimate: Ideally, keep temperature between 65-80 degrees Fahrenheit and humidity levels low, between 30-40% RH.\nIndoor/Outdoor: A great indoor strain for those with small spaces, Master Kush can also do well outside with its ability to handle colder night temperatures.\nFeeding: Master Kush needs lots of feeding, as it grows dense and stalky.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/23133928/master-kush-cannabis.jpg",
            "title": "Tips for Growing Master Kush Cannabis",
            "urlslug": "/news/growing/how-to-grow-master-kush-marijuana"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 41.74808436511489
        },
        {
            "name": "PTSD",
            "score": 13.778099932596179
        },
        {
            "name": "Arthritis",
            "score": 9.50891614198595
        },
        {
            "name": "Migraines",
            "score": 9.337426586147972
        },
        {
            "name": "ADD/ADHD",
            "score": 5.331894499013526
        }
    ],
    "description": "<p>Master Kush is a popular indica cross created out of two <a href=\"https://www.leafly.com/news/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\">landrace</a> strains&nbsp;from different parts of the Hindu&nbsp;Kush region. Master Kush is bred by the Dutch White Label Seed Company, located in Amsterdam. During maturation the plant produces a subtle earthy, citrus smell with&nbsp;a hint of incense, which is often described as a vintage flavor. The taste of Master Kush is reminiscent of the famous hard-rubbed charas hash. This strain holds a superb balance of full-body relaxation without the mind-numbing effect that many indica strains produce. Instead,&nbsp;Master Kush offers a sharpened sensory awareness that can bring out the best of any activity.</p>\n",
    "descriptionPlain": "Master Kush is a popular indica cross created out of two landrace strains&nbsp;from different parts of the Hindu&nbsp;Kush region. Master Kush is bred by the Dutch White Label Seed Company, located in Amsterdam. During maturation the plant produces a subtle earthy, citrus smell with&nbsp;a hint of incense, which is often described as a vintage flavor. The taste of Master Kush is reminiscent of the famous hard-rubbed charas hash. This strain holds a superb balance of full-body relaxation without the mind-numbing effect that many indica strains produce. Instead,&nbsp;Master Kush offers a sharpened sensory awareness that can bring out the best of any activity.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 87.47481646894308
        },
        {
            "name": "Euphoric",
            "score": 55.659044575135816
        },
        {
            "name": "Sleepy",
            "score": 52.5711784920639
        },
        {
            "name": "Happy",
            "score": 49.26630097664078
        },
        {
            "name": "Uplifted",
            "score": 30.425932548155995
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 45.03273072945341
        },
        {
            "name": "Sweet",
            "score": 17.533526111691387
        },
        {
            "name": "Pungent",
            "score": 14.28635489969751
        },
        {
            "name": "Woody",
            "score": 13.31077892289952
        },
        {
            "name": "Pine",
            "score": 11.120315534494006
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": "Moderate",
        "environment": null,
        "floweringDays": 58,
        "growNotes": "\n\tHigh calyx-to-leaf ratio makes for easy trimming\n\tGrows best as a multi-branch plant\n\tDoes well with moderate to heavy nutrients\n\tYields typically fall between 400-500g/m&sup2;\n\n",
        "height": "Short",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1415812,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "This is my default strain lately.  It has a very potent but level effect from start to finish, and just tends to take the edge off of things enough so I can relax, enjoy, but still focus on whatever I am doing at the time. I am a casual smoker, so usually it's the weekend and I am doing things around the house, yard work, etc. I also like this one when I am going to hang out at a bar with friends because it allows me to be \"present\" and social.  Some other strains tend to make me check out too much for that.\r\n\r\nI can also read some pretty heavy books while using Master Kush, which is nice since I am into all kinds of philosophical subjects. It's a good one for video games and movies since it doesn't tend to cause your mind to wander much like other strains do.\r\n\r\nMedicinally speaking, I suffer from some hereditary depression and anxiety which I have mostly controlled without the use of any drugs at all, thanks to educating myself about the problem.  However, there are some days where I wake up and I get some depressive effects and I become quiet, irritable and unmotivated.  A small hit of Kush tends to alleviate this for me, and put me in a much better mood.  Even once the effect of the weed wares off, I seem to have shaken off the depression I had felt prior.  ",
            "username": "MindTrigger"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1643261,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This is my kind of strain 👏🏼👏🏼👏🏼👏🏼😎🤩😎🙌🏾👊🏾👌🏻! As advertised 🌜🌛🌚🌚🌑🌙 time strain for sure.  Would not want to party 🕺🕺🏿💃🏻💃💃🏽🍺🍸🍻🍹🥂🍾🍷🥃 on this strain but good to chill and watch some 📺🖥📺📽🎞📺 and⛹🏾‍♂️🏇🏾⛹🏽‍♀️🤸🏿‍♀️⛷🏈🏀⚽️🎾⚾️🏓⛳️🥊. 🙏 👊🏾🙌🏾👏🏼👏🏼👏🏼🙌🏾👌🏻😍😘😻😺😸😺😺😺😎😎😎👏🏼👏🏼👏🏼👏🏼 Master Kush!",
            "username": "grifa"
        }
    ],
    "id": 117,
    "name": "Master Kush",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 35.66841622173856
        },
        {
            "name": "Dry Eyes",
            "score": 19.2513730884385
        },
        {
            "name": "Dizzy",
            "score": 9.462479540167589
        },
        {
            "name": "Anxious",
            "score": 6.899165541840393
        },
        {
            "name": "Paranoid",
            "score": 4.96501818874099
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/hindu-kush",
            "category": "Indica",
            "name": "Hindu Kush",
            "permalink": "https://mobileapi.leafly.com/indica/hindu-kush",
            "slug": "hindu-kush",
            "subtitle": null,
            "symbol": "Hk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/master-kush",
    "photoTotalCount": 478,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/indica/master-kush/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/indica/master-kush/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005413/b/master-kush__primary_0ddd.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/master-kush_100x100_9f3a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/668526/b/master-kush__primary_5fbc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/master-kush_100x100_5a2d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/663084/b/master-kush__primary_39f7.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/master-kush_100x100_f042.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/653178/b/master-kush__primary_ef31.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/master-kush_100x100_7e34.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/651723/b/master-kush__primary_1d1a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/master-kush_100x100_c079.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/638349/b/master-kush__primary_b895.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/master-kush_100x100_69c9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Toronto, ON",
        "Vancouver, BC",
        "Calgary, AB",
        "Montréal, QC",
        "Edmonton, AB",
        "Hamilton, ON",
        "Denver, CO",
        "Ottawa, ON",
        "Seattle, WA"
    ],
    "rating": 4.33,
    "relatedStrains": [],
    "reviewCount": 1533,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "master-kush",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.3307240704501/240",
    "subtitle": null,
    "symbol": "Mks",
    "symptoms": [
        {
            "name": "Stress",
            "score": 52.28773870757318
        },
        {
            "name": "Depression",
            "score": 42.1960925221778
        },
        {
            "name": "Insomnia",
            "score": 38.040691983976295
        },
        {
            "name": "Pain",
            "score": 30.52179290161729
        },
        {
            "name": "Lack of Appetite",
            "score": 20.47658331804027
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
