{
    "aka": "Zombie Kush",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Rebecca Kelley",
            "category": null,
            "date": "/Date(1402677600000)/",
            "id": "contentitems-2971",
            "text": "Whether you want to properly celebrate Friday the 13th or are simply in the mood for some elevated frights, here are 13 strains that each have an appropriate scary movie to pair. Enjoy, and remember, that creaking noise you hear coming from the creepy corner of the house is nothing more than a figment of your imagination…\n1. Killer Queen / Carrie\n\nSkip the remake and go with the original 1976 adaptation of the Stephen King novel about an unpopular teenage girl with an overbearing mom. Typical high school angst, right? Not when the teenage girl is telekinetic and a wee bit unstable.\nYou probably don’t want to pull a mean prank on her during the prom—instead, offer her some Killer Queen, a hybrid that yields happy, uplifting effects. Sounds like a match made in sticky, bloody heaven.\n2. Pennywise / It\n\nYou have the option to cue up the original It TV miniseries or check out the 2017 film adaptation of the Stephen King novel. Either way, you’ll be confronted with one of the scariest horror movie villains you’ll peek through your fingers to catch a glimpse of.\nClowns are creepy enough on their own, but a sewer-dwelling razor-teethed clown that eats children will provide enough nightmare fuel that you might need some of the indica Pennywise strain to relax you back down into a state where you aren’t likely to pee yourself at any given moment. Just remember, they all float down here…\n\n3. Jack the Ripper / The Shining\n\nI know that the historic Jack the Ripper went after prostitutes in ye olde timey London, but when I think of a scary Jack, only one man comes to mind: Mr. Torrance from yet another Stephen King novel-turned-movie, The Shining.\nIt may be a little less unnerving to watch the family man become unhinged as a brutal winter keeps his wife and son held captive inside the sinister Overlook Hotel if you pair the experience with the happiness-inducing Jack the Ripper hybrid. Better yet, chase that strain with some appropriately-named Jack Frost once the axe-wielding papa succumbs to that tricky hedge maze.\n4. Alien OG – Alien\n\nFinally, an entry that didn’t come from the warped mind of Stephen King! This Ridley Scott classic boasts impressive special effects and the clever tagline, “In space, no one can hear you scream.”\nSure, Alien practically invented the “What’s that scary rustling in the corner? Oh, it’s just the damn cat OH CRAP A MONSTER’S TRYING TO EAT ME” horror movie trope, but it’s still a top entry in my book mainly because Ellen Ripley is one of the most bad-ass female protagonists in movie history. Celebrate her victory over the drooling, acid-blooded behemoth with a little Alien OG, a hybrid strain with earthy and pine flavors that will make you relieved you’re save and sound back here on Earth.\n\n5. Little Devil / The Exorcist\n\nFrom the iconic creepy-sounding score to the “you’ll never look at pea soup the same again” projectile vomiting, The Exorcist is a horror movie classic. A poor little girl gets possessed by the devil and promptly behaves like the Antichrist (or like those girls on My Super Sweet Sixteen).\nAfter you watch her spider-crawl down the stairs, you might want to chase that scene with some high-THC Little Devil to bring your heart rate back down to a normal range.\n6. Ghost OG / Poltergeist\n\n“You just moved the headstones! You didn’t move the bodies!!” Poltergeist is a cautionary tale as to why you should avoid buying houses built over ancient Indian burial grounds no matter how sweet the deal may seem.\nPair this spooky ghost thriller with the hybrid Ghost OG for a sweet counterbalance to all of the sour supernatural events that plague the Freeling family. Just make sure you peace out if your TV turns on by itself and is all staticky (and whatever you do, don’t go into the light).\n\n7. Zombie OG / Night of the Living Dead\n\nIf you’re going to enjoy some Zombie OG, it’s only fitting to pair the earthy indica with the 1968 classic that kicked off over 45 years of zombie mania, George Romero’s Night of the Living Dead. The black and white film doesn’t bother with happy endings, just wave after wave of undead citizens keen on taking a bite out of anyone within a rotted arm’s reach.\nIf you want to extend your movie marathon, I recommend following up the original with the iconic Dawn of the Dead, a cheeky wink at our society’s zombie-like consumerist ways, and Day of the Dead, which takes the horror underground to a military bunker.\n8. Killing Fields / The Texas Chainsaw Massacre\n\nThe 1974 horror classic The Texas Chainsaw Massacre was so unsettling, some people actually thought it was a real snuff film. What’s remarkable about the movie is that it isn’t gory at all—the creepy family and the film’s realistic, grimy feel mess with your head and make you think it’s more grisly than it actually is.\nWhile watching, partake in the sativa Killing Fields so you’ll have some energy to sprint across a field if Leatherface bursts through your door wielding a gas-powered killing apparatus.\n\n9. Pandora’s Box / Hellraiser\n\nThis ’80’s horror offering is a cautionary tale for anyone who comes across a mysterious puzzle box in a creepy knickknacks shop. Stop, put down the box, and buy a snow globe instead; otherwise, you might accidentally summon some nasty-looking dudes who are all-too keen on dragging you to hell.\nPair Hellraiser with the sweet, grapefruity Pandora’s Box for a little juxtaposition as you watch a dude with pins in his face rip a guy apart with some rusty chains.\n10. Kali Mist / The Mist\n\nHere’s one more Stephen King entry for your horror movie marathon. The Mist is a surprisingly good film from 2007 that follows a man and his son as they struggle to survive against the evils of both otherworldly creatures and mankind after a mysterious mist rolls through a small town. The ending is bleak and if you opt to watch the black and white version, it’ll seem even more eerie.\nHelp clear your mood afterwards with some Kali Mist, which delivers happy, uplifting effects to counterbalance the dread you experience while watching this bummerfest.\n\n11. Mother’s Finest / Psycho\n\nYou think you’ve got mommy issues? This iconic Hitchcock film is the ultimate example of “This dude needs therapy and a hug.” Stay far, far away from the pointless Gus Van Sant remake and opt for the original 1960 classic.\nExperience Psycho with the sweet sativa Mother’s Finest and make sure to lock the bathroom door before you hop into the shower.\n12. OG Shark / Jaws\n\nThe original summer blockbuster that made millions of people afraid to dip a toe into the ocean, Jaws is one of my all-time favorite movies. Given how every other classic horror movie has suffered through an inferior remake, it says a lot about this Steven Spielberg offering that nobody has dared to touch this masterpiece since it first debuted.\nPartake in the hybrid OG Shark and bask in its diesel flavor when Brody shouts “Smile, you son of a bitch!” and blows the massive great white shark to smithereens.\n\n13. Funky Monkey / Dead Alive\n\nOkay, admittedly this warped film from Peter Jackson is more funny-gross than scary, but Dead Alive is still a classic in its own right and a cautionary example of why you shouldn’t mess with rabid Sumatran rat-monkeys.\nEnjoy some of the indica Funky Monkey and giggle it up while you watch a priest kick ass for the Lord and an unlikely protagonist wield a lawnmower against a room full of nasty undeads.\nWhat are some of your favorite movies you can’t wait to watch tonight? Share in the comments and we’ll think of strain pairings to go with them!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/06/12001235/13-strains-and-their-scary-movie-pairings-to-celebrate-friday-the.jpg",
            "title": "13 Cannabis Strains and Their Scary Movie Pairings",
            "urlslug": "/news/strains-products/13-strains-and-their-scary-movie-pairings-to-celebrate-friday-the"
        },
        {
            "author": "Anna Wilcox",
            "category": null,
            "date": "/Date(1383244200000)/",
            "id": "contentitems-3043",
            "text": "Happy Halloween, Leafly readers! In order to help you celebrate, we’ve complied a brief list of our top five spooky strains. Our only advice? Try not to eat too much candy, and you might want to think twice before braving that haunted corn maze.\nHere are our picks: \n1. Zombie OG\n\nZombie OG is a classic choice for those who’d like to show their holiday cheer with a movie marathon and a personal pack of mini candy bars. More Shaun of the Dead than 28 Days Later, Zombie OG is a potent indica that will leave you brainless and catatonic. \n2. Durban Poison\n\nThis spooky strain has truly mind-altering effects. Durban Poison is a surefire sativa, energizing consumers while creating an almost out of body sensation. One word of caution: be wary of the monsters out on Halloween night; this strain might make them seem just a little too realistic.  \n3. Jack the Ripper\n\nWhile the Jack the Ripper is perhaps the most frightening in our cast of Halloween strains, strength and stealth are the only things this Jack has in common with the real deal. Overall this hybrid is quite happy and uplifting. With all the giggling you’ll be doing, you probably won’t have the willpower to hunt for potential victims. \n4. Black Widow\n\nBe careful, because this strain sure can bite. Naturally high in THC, you can feel Black Widow’s psychoactive effects almost immediately after your first taste. Novice consumers should start out tentatively; much like its namesake, this hybrid doesn’t mess around. \n5. Green Goblin\n\nFrom the much hated Spiderman nemesis to the ever so meticulous bankers in Harry Potter, goblins have taken on many forms over the ages. This particular monster takes shape as a heavy-hitting sativa. It's the perfect choice for a night filled with all sorts of tomfoolery. The only thing Green Goblin can truly scare is the pumpkin pie at your office Halloween party. \nPhoto credits: madlyinlovewithlife; Felix42 contra la censura; the cherry blossom girl; ihave3kids; Scott Kinmartin; elviskennedy via photopin cc",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2013/10/12001447/boo-leaflys-top-5-strains-for-halloween-night.jpg",
            "title": "Boo! Leafly's Top 5 Strains for Halloween Night",
            "urlslug": "/news/strains-products/boo-leaflys-top-5-strains-for-halloween-night"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 20.621657754010695
        },
        {
            "name": "Migraines",
            "score": 7.854278074866311
        },
        {
            "name": "Arthritis",
            "score": 6.7513368983957225
        },
        {
            "name": "PTSD",
            "score": 6.3836898395721935
        },
        {
            "name": "ADD/ADHD",
            "score": 6.016042780748664
        }
    ],
    "description": "<p class=\"p1\">If you&rsquo;re looking to transform into a flesh-eating monster, Zombie OG is not the choice for you. After a taste of this indica, the only thing you&rsquo;ll be hungry for are the cold cuts in the fridge (though you may be too catatonic to get up and grab them). Heavy and lethargic, this cross between <a href=\"http://www.leafly.com/hybrid/og-kush\"><span class=\"s1\">OG Kush</span></a> and <a href=\"http://www.leafly.com/indica/blackberry\"><span class=\"s1\">Blackberry</span></a> has been a favorite among those suffering from muscle spasms and acute pain. Due to its strong sedative effects, don&rsquo;t expect to have the energy to rampage the city. This strain is best used at nighttime, when you&rsquo;re not expecting to do much of anything.</p>\n",
    "descriptionPlain": "If you&rsquo;re looking to transform into a flesh-eating monster, Zombie OG is not the choice for you. After a taste of this indica, the only thing you&rsquo;ll be hungry for are the cold cuts in the fridge (though you may be too catatonic to get up and grab them). Heavy and lethargic, this cross between OG Kush and Blackberry has been a favorite among those suffering from muscle spasms and acute pain. Due to its strong sedative effects, don&rsquo;t expect to have the energy to rampage the city. This strain is best used at nighttime, when you&rsquo;re not expecting to do much of anything.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 71.63547237076648
        },
        {
            "name": "Happy",
            "score": 59.60338680926916
        },
        {
            "name": "Euphoric",
            "score": 59.23573975044563
        },
        {
            "name": "Creative",
            "score": 46.10071301247772
        },
        {
            "name": "Sleepy",
            "score": 28.108288770053477
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 21.490641711229948
        },
        {
            "name": "Pungent",
            "score": 16.57754010695187
        },
        {
            "name": "Pine",
            "score": 12.032085561497327
        },
        {
            "name": "Sweet",
            "score": 7.854278074866311
        },
        {
            "name": "Lavender",
            "score": 6.7513368983957225
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1387564,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "WOW! love this!! happy ,giggly like the good old days!! #1 strain in my books!  PLEASE someone(dispensary)  in phx. get a hold of this!!! cant find any , WAH!!!!",
            "username": "db6"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png",
            "id": 1640096,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "One of my favs now, and one of the best looking buds I have seen immensely covered in trichomes with green/purple color and potent",
            "username": "FadedFam"
        }
    ],
    "id": 18512,
    "name": "Zombie OG",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 24.431818181818183
        },
        {
            "name": "Dry Eyes",
            "score": 7.854278074866311
        },
        {
            "name": "Dizzy",
            "score": 2.941176470588235
        },
        {
            "name": "Paranoid",
            "score": 1.8382352941176472
        },
        {
            "name": "Headache",
            "score": 1.4705882352941175
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/indica/zombie-og",
    "photoTotalCount": 15,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/704081/b/zombie-og__primary_70fe.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/zombie-og_100x100_5b80.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/578768/b/zombie-og__primary_f0ea.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/zombie-og_100x100_f70d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/462823/b/zombie-og__primary_374b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/zombie-og_100x100_d898.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/462874/b/zombie-og__primary_e4f4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/zombie-og_100x100_6314.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/440655/b/zombie-og__primary_1cd0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/zombie-og_100x100_6f68.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/381547/b/zombie-og__primary_2157.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/zombie-og_100x100_1e14.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Detroit, MI",
        "Los Angeles, CA",
        "Seattle, WA",
        "Spokane, WA"
    ],
    "rating": 4.47,
    "relatedStrains": [],
    "reviewCount": 62,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "zombie-og",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.46774193548387/240",
    "subtitle": null,
    "symbol": "Zog",
    "symptoms": [
        {
            "name": "Insomnia",
            "score": 28.24197860962567
        },
        {
            "name": "Depression",
            "score": 23.328877005347593
        },
        {
            "name": "Stress",
            "score": 22.961229946524064
        },
        {
            "name": "Pain",
            "score": 21.72459893048128
        },
        {
            "name": "Lack of Appetite",
            "score": 15.474598930481282
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
