{
    "aka": "ak, afghani kush",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1416865260000)/",
            "id": "contentitems-3561",
            "text": "Winter is coming, and we don’t need every department store nationwide whipping out their Christmas supplies in October to feel it. Whether you love them or despise them with a flaming Grinch-like passion, the holidays are upon us and getting through the madness may require some help from our little green friend. Each chapter of the holidays poses a different challenge, and for this reason, we’ve compiled a handy list of strains to pair with each festivity (and struggle). \nThanksgiving: The Pre-Feast\nIt’s you versus a table full of food. What appetite-stimulating weapon will you choose?\n   Sour OG\nThis Sour Diesel and SFV OG Kush cross dishes out a good balance of uplifting euphoria alongside the hunger rampage, making this hybrid the perfect contender for both appetite loss and the seasonal blues.\n   Afghan Kush\nThis heavy-duty indica is the rocket-launcher equivalent when it comes to fighting appetite loss with cannabis. A little bit of this earthy, relaxing strain and you’ll be inhaling more food than you thought was humanly possible.\nThanksgiving: The Recovery\nYou have just defeated your enemy with the power of sheer gluttony, and now it’s time to deflate. Choose one of these tummy-calming strains to help you harness your full digestive potential:\n   Casey Jones\nJust like the hockey-masked vigilante of the Ninja Turtle world, this Casey Jones will beat any gastointestinal discomfort to a pulp without inducing an early night’s sleep.\n   Headband\nGood for both relaxation and relieving stomach pain, Headband offers long-lasting, carefree effects that will help you accept the feast’s passing as opposed to mourning it. (But seriously, R.I.P., you delicious bowl of stuffing.)\n   Death Star\nThis crushing indica strain will destroy any stomach aches with the choke-hold force of Darth Vader himself. Prepare to die, bloated gut.\nBlack Friday\nBlack Friday could be considered the second major boss fight of the holiday season. Rather than battling the mother ship that is Thanksgiving dinner, Black Friday poses a horde of frenzied consumers looking to get those deals before you do. Luckily, you’ve got quite the psychoactive arsenal to help you get there first:\n   Green Crack\nFew strains can truly be described as energizing, but this sativa is the exception. Green Crack’s active, buzzing effects will have you darting from shelf to shelf like a mad(wo)man for as long as you can remember what you were doing.\n   Lavender\nFor some of us, nothing induces more anxiety than crowds of people flocking around the disarray under those irritating fluorescent lights. You can choose to stay home, or utlize the calming, anti-paranoia properties of Lavender to help you brave the mobs.\nChristmas\nOh, Christmas. This is a day full of different festivities, but whether you’re preparing yourself for Feast Madness: Part II or simply wanting to kick it with that video game you gifted yourself, we’ve got some recommendations for you:\n   Power Plant\n‘Tis the season for obligatory conversation with relatives you see once a year. Power Plant is here to help bring out your more talkative half for those awkward, unnatural exchanges.\n   Chemdawg\nA good, well-rounded hybrid, Chemdawg brings joy, creativity, and sensory elevation to whatever it is you find yourself doing on Christmas Day. Loafing around with your cats? Crafting a masterpiece from snow? Scarfing down an entire tube of raw cinnamon rolls? Chemdawg will make it even better.\nNew Year’s Eve/Day\nNew Year’s Eve and New Year’s Day are literally as different as night and day, so you may want to pick up the entire trifecta here to ensure proper preparation…and recovery:\n   Harlequin\nYou may be the type of person who believes that midnight is an ungodly hour, and for you we suggest Harlequin. This high-CBD sativa provides all the clear-headed energy you’ll need to keep up with those night owl youngsters.\n   Grape Ape\nStaving off a hangover? We recommend ending your holiday season with this indica whose nausea-relieving, restful qualities are sure to bring you back to your baseline.\nImage credit: Martin Cathrae via Photopin cc",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/11/12002842/the-leafly-holiday-survival-guide-15-strains-to-help-you-make-it.jpg",
            "title": "The Leafly Holiday Survival Guide: 12 Strains to Help You Make It to the New Year",
            "urlslug": "/news/strains-products/the-leafly-holiday-survival-guide-15-strains-to-help-you-make-it"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1498505474000)/",
            "id": "contentitems-32201",
            "text": "Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Afghan Kush has been around since long before the modern cannabis industry. It comes from the Hindu Kush mountain range and has been made available through the help of White Label Seeds. Centuries of selective breeding have gone into creating this plant that was designed for producing charas (a form of hashish). Afghan Kush has often been used in breeding projects, and is considered a baseline for indica exploration.\nGrow Techniques: Growing clones of this short-in-stature plant through the SOG (sea of green) method will result in a quick turnaround. Crop out anything that isn’t going to produce and let the big colas thrive. Try a hydroponic setup to maximize Afghan Kush’s yield and potency.\nFlowering Time: 5-7 weeks\nYield: High\nGrow Difficulty: Easy to moderate\nClimate: Keep between 65-80 degrees Fahrenheit. Be mindful of moisture and mold.\nIndoor/Outdoor: Afghan Kush performs well both indoors and out, but look out for moisture and mold production.\nFeeding: Heavy feeding brings out the power of this indica. Keeping the plant strong and healthy with micronutrients will help prevent pests and mold from finding their way into the dense colas.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/26111409/afghan-kush-cannabis.jpg",
            "title": "Tips for Growing Afghan Kush Cannabis",
            "urlslug": "/news/growing/how-to-grow-afghan-kush-marijuana"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 20.19161310070401
        },
        {
            "name": "PTSD",
            "score": 7.801652892561983
        },
        {
            "name": "ADD/ADHD",
            "score": 7.117539026629935
        },
        {
            "name": "Arthritis",
            "score": 5.60085705540251
        },
        {
            "name": "Spinal Cord Injury",
            "score": 4.3872053872053876
        }
    ],
    "description": "<p>Afghan Kush&#39;s roots trace back to the Hindu Kush mountain range near the Afghanistan-Pakistan border. There&nbsp;its genotype has been perfected over centuries,&nbsp;making&nbsp;it the ultimate source for&nbsp;hash such as charas and the sticky black Afghani hash. White Label Seed Company, a Sensi Seeds partner from the Netherlands, made the seeds of this strain available for everyone to grow. The buds of Afghan Kush&nbsp;develop into massive, blunt-topped nuggets full of resin; pure indica goodness with a heavy yield. Revered for its heavy resin content and powerfully sedating effects, Afghan Kush is a top choice for anyone looking to relax after a long day.</p>\n",
    "descriptionPlain": "Afghan Kush&#39;s roots trace back to the Hindu Kush mountain range near the Afghanistan-Pakistan border. There&nbsp;its genotype has been perfected over centuries,&nbsp;making&nbsp;it the ultimate source for&nbsp;hash such as charas and the sticky black Afghani hash. White Label Seed Company, a Sensi Seeds partner from the Netherlands, made the seeds of this strain available for everyone to grow. The buds of Afghan Kush&nbsp;develop into massive, blunt-topped nuggets full of resin; pure indica goodness with a heavy yield. Revered for its heavy resin content and powerfully sedating effects, Afghan Kush is a top choice for anyone looking to relax after a long day.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 61.80961126415672
        },
        {
            "name": "Sleepy",
            "score": 51.94031221303948
        },
        {
            "name": "Euphoric",
            "score": 39.82491582491583
        },
        {
            "name": "Hungry",
            "score": 39.61524334251607
        },
        {
            "name": "Happy",
            "score": 38.19406183042547
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 35.38812366085093
        },
        {
            "name": "Spicy/Herbal",
            "score": 20.291398836853382
        },
        {
            "name": "Woody",
            "score": 19.73033363942455
        },
        {
            "name": "Pungent",
            "score": 15.927150290786654
        },
        {
            "name": "Pine",
            "score": 11.371594735231099
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": "Easy",
        "environment": null,
        "floweringDays": 57,
        "growNotes": "",
        "height": "Medium",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1417522,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Great Stain!\r\n\r\nBe warned: you will get munchies and become stupidly lazy. \r\n\r\nSmoked a bowl with a couple of friends,.. ended up going through 4 XL pizzas, content with relaxing on couch and watching stupid random movies and enjoying them. (Kentucky Fried chicken). \r\n\r\nIts really easy to pass out after smoking this strain. Knocked us all out, woke up hungry as hell.\r\n\r\nDo not recommend smoking in the morning or afternoon, reserve for night time fun",
            "username": "aeritano"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEGvh_xvvKZBGmtv7KLCwRMjeGk=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2faXqT5TCeS3GfO16qN4eO_architectural-design-architecture-buildings-438968+(2).jpg",
            "id": 1639334,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I'll start by saying that I suffer from severe anxiety and schizophrenia, as to get a reference of where this review is coming from. \n\nUsually when I smoke (mainly sativa) I get extremely panic induced feelings/thoughts and start having delusions and thoughts associated with panic attacks; of all strains (besides girl scout cookies) this is definitely the first strain that's managed to calm me down almost completely and take away weird thoughts I usually have. However just the other night I over did it and this started making me hallucinate, but it most certainly brings you to difference places and gives me endless amounts of beautiful perspectives in regards to those places.\n\nIt also brings me back some years (I feel like a kid that doesn't have a care in the world and just wants to inspect everything and see everything for what it might be)",
            "username": "grr-AHHH"
        }
    ],
    "id": 47,
    "name": "Afghan Kush",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 39.59534741352923
        },
        {
            "name": "Dry Eyes",
            "score": 12.406795224977042
        },
        {
            "name": "Dizzy",
            "score": 9.258647076828895
        },
        {
            "name": "Paranoid",
            "score": 3.4037343128252218
        },
        {
            "name": "Headache",
            "score": 1.507499234771962
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/afghani",
            "category": "Indica",
            "name": "Afghani",
            "permalink": "https://mobileapi.leafly.com/indica/afghani",
            "slug": "afghani",
            "subtitle": null,
            "symbol": "Afg"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/afghan-kush",
    "photoTotalCount": 239,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/indica/afghan-kush/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/indica/afghan-kush/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001334/b/afghan-kush__primary_a110.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/afghan-kush_100x100_389a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000095/b/afghan-kush__primary_caef.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/afghan-kush_100x100_0fec.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/680395/b/afghan-kush__primary_d2fc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/afghan-kush_100x100_58d9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/670831/b/afghan-kush__primary_aeb8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/afghan-kush_100x100_2f6d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/670896/b/afghan-kush__primary_81a8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/afghan-kush_100x100_5dd2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/662122/b/afghan-kush__primary_244a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/afghan-kush_100x100_f1c0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Toronto, ON",
        "Vancouver, BC",
        "Montréal, QC",
        "Calgary, AB",
        "Ottawa, ON",
        "Edmonton, AB",
        "Hamilton, ON",
        "Mississauga, ON",
        "Winnipeg, MB"
    ],
    "rating": 4.09,
    "relatedStrains": [],
    "reviewCount": 1005,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "afghan-kush",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.09054726368159/240",
    "subtitle": null,
    "symbol": "Afk",
    "symptoms": [
        {
            "name": "Pain",
            "score": 27.492194674012854
        },
        {
            "name": "Stress",
            "score": 25.59810223446587
        },
        {
            "name": "Insomnia",
            "score": 20.74502601775329
        },
        {
            "name": "Lack of Appetite",
            "score": 18.22895622895623
        },
        {
            "name": "Depression",
            "score": 16.53688399142945
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
