{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Hannah Meadows",
            "category": null,
            "date": "/Date(1484171120000)/",
            "id": "contentitems-15444",
            "text": "For every color in the rainbow there is a complementing strain ready to match each individual’s absolute favorite hue. Only drink out of blue cups? Wear a lot of purple?  Refuse to eat something that isn’t orange-tinted? Pair your number one color with a little bit of green! Below we list a strain pairing that goes hand in hand with each letter in ROYGBIV.\nRed\n\nFiery, passionate, sensual – red is a power color that tends to allure the sexes and could possibly give you a promotion. Pair this magnetic color with the “speedy and intense” Panama Red, a full sativa that will match that flash of red lipstick or vibrant watch band.\nOrange\n\nThis warm and fizzy hue can only pair best with a warm and fizzy strain. Enter Orange Crush – its sweet and tangy flavor perfectly complements its twin color.\nYellow\n\nIn the dead of winter, yellow reminisces sunny days and lemonade. Try Lemon Haze to melt the frost – it’s a citrusy sativa whose buds appear green and yellow. The lemony taste will bring back your sunny disposition through these chilly months.\nGreen\n\nWith 2017’s color of the year being “greenery,” the hybrid Green Dream is an excellent addition to any green stash.\nBlue\n\nBlue has always been a fan favorite and possibly the most popular color of the rainbow – it’s calming, tranquil, and makes one think of the sky and the sea. The hybrid ArcticBlue pairs well with this peaceful color and its anti-anxiety effects.\nHonorable mention goes to the hybrid Blue Dream, a strain that has become just as popular as the color itself.\nIndigo\n\nIndigo is the in-between of purple and blue – a deep, gorgeous hue that can only be complemented by the hybrid strain Blurple. It’s the best mix of Blue Dream and Mendocino Purps, just as indigo is the best mix of purple and blue, aka “blurple.”\nViolet\n\nA color that received its name from the violet flower, it’s only logical to pair this beautiful hue with the hybrid strain Violet Delight. It releases a strong floral flavor that will have you dreaming in shades of purple.\nIf your favorite color is outside of the rainbow spectrum, we have a couple of honorary mentions for you to pick up.\n\nPink\n\nThough pink is not technically a color of the rainbow, we couldn’t leave out this bubblegum pop favorite. Pair that Pepto-Bismol toned jacket that’s been collecting dust in your closet with the sweet and fruity indica Pink Berry.\nBlack\n\nFor those who live and breathe in waves of black, don’t pass up the indica Black Domina. It’s a strain designed for late night, so grab your best black pajamas, black slippers, black robe, and pull in this heavy strain deep into the night.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/25130741/rainbow.jpg",
            "title": "Taste the 'Strainbow' With These Colorful Cannabis Pairings",
            "urlslug": "/news/strains-products/rainbow-marijuana-strains"
        },
        {
            "author": "Rebecca Kelley",
            "category": null,
            "date": "/Date(1446147180000)/",
            "id": "contentitems-2831",
            "text": "Who doesn’t love a good Netflix and chill sesh? Now that the days are getting shorter, the weather a little colder, and the sweatpants a little cozier, we thought we’d peruse the list of new releases coming to Netflix in November to recommend a few options that would pair well with these delectable strains. If you find yourself interested in any of these streaming offerings, try to pick up the corresponding strains to enhance your Netflix and chill experience.\n \nCOMEDIES\nMaster of None: Season 1\n\nDate Available: November 6\nThis new comedy series stars Aziz Ansari, who you may recognize as Tom Haverford from “Parks and Recreation.” His new show follows the personal and professional life of a 30-year old actor in New York City.\nStrain Pairing: Black Domina\n\nIn homage to Ansari’s Tom Haverford character and his food language, we thought a nice appetite-inducing strain like Black Domina would pair well with his new comedy series. Order up some chicky chicky parm parm and some big ol’ cookies — you wouldn’t want to laugh on an empty stomach!\n \nW/Bob & David\n\nDate Available: November 13\nThese two veteran comedians are back with another round of sketch comedy. The pair became notable for their first sketch series, Mr. Show with Bob and David, and each has enjoyed acclaim in separate television series (David Cross for “Arrested Development” and Bob Odenkirk for “Breaking Bad” and “Better Call Saul”). So pull up a chair (just ask if you can use it first) and get ready for some good laughs!\nStrain Pairing: Fire Haze\n\nThis daytime sativa will help get the giggles going for a marathon sesh of sketch comedy, and its happy, uplifting effects will ensure that you won’t lose steam while you binge-watch.\n \nDOCUMENTARIES\nLast Days in Vietnam\n\nDate Available: November 1\nThis Oscar-nominated documentary explores the chaotic final weeks of the Vietnam War, when American soldiers and diplomats were faced with the tough decision to obey White House orders to evacuate only U.S. citizens, or whether they were willing to risk treason charges in order to save South Vietnamese citizens as well.\nStrain Pairing: Dream Queen\n\nThe hybrid strain Dream Queen should help balance the sobering effects of this wartime documentary by delivering uplifting relaxation while still allowing you to focus on the film.\n \nSoaked in Bleach\n\nDate Available: November 15\nYes, it’s another Kurt Cobain documentary. You may have heard of the film “Kurt Cobain: Montage of Heck” that’s been generating attention lately, but “Soaked in Bleach” follows a private investigator who had been hired by Courtney Love and his perspective on the death of the grunge legend.\nStrain Pairing: Chemdawg\n\nThe creative Chemdawg should help you tap into your inner artist as you revisit the life of one of the 90s’ most iconic musicians.\n \nFOR THE KID IN ALL OF US\nThe SpongeBob Squarepants Movie\n\nDate Available: November 1\nSometimes a “Netflix and chill” night is best spent watching a silly children’s film, and SpongeBob Squarepants can deliver just that. Follow your favorite pineapple under the sea-dwelling creature and his pal Patrick as they attempt to track down King Neptune’s stolen crown.\n[BLURB]\nStrain Pairing: Pineapple Express\n\nNothing should put a smile on your face like a silly animated feature paired with the grin-inducing Pineapple Express. You’ll feel energetic and uplifted, plus the pineapple flavor is an all-too appropriate combination for Spongebob’s humble abode.\n \nSCI-FI/ACTION\nRobot Overlords\n\nDate Available: November 1\nOh no! Earth has been overtaken by alien robots, and it’s up to Gillian Anderson and Ben Kingsley to save the day! If you’re in the mood for a so-bad-it-might-be-good robot sci-fi film starring Gandhi and Scully, this ridiculous action/adventure offering could be right up your alley.\nStrain Pairing: Chocolope\n\nThis optimistic sativa will keep you happy long after the movie does, keeping you alert and energetic while you slog through what will either be a “guilty pleasure” or a “never again.”\n \nMarvel’s Jessica Jones: Season 1\n\nDate Available: November 20\nA superhero (the titular Jessica Jones) goes the private investigator route in this new Netflix original series based on the Marvel graphic novels. Starring a who’s who of recognizable actors, including Krysten Ritter (who you may recognize from “Breaking Bad”), David Tennant (“Dr. Who” fans should know him all too well), and Carrie-Anne Moss (aka Trinity from “The Matrix” trilogy), this show could be a fun entry into the ever-expanding Marvel universe.\nStrain Pairing: Bruce Banner\n\nWhat better pairing for a Marvel television series than this comic book character-inspired strain? The powerful Bruce Banner will settle you into a euphoric and creative state of mind, perfect for getting absorbed into the vast world of Marvel.\n \nWILDCARD SELECTION\nThe Runner\n\nDate Available: November 5\nOh, Nicolas Cage. He’s an actor so enigmatic that it’s tough to decide whether he’s good or bad. In “The Runner,” he plays a sex scandal-plagued politician during the 2010 BP oil spill. Is this a “good” Nic Cage flick or a “bad” one? Grab a strain and decide for yourself!\nStrain Pairing: LA Confidential\n\nThis potent indica has strong psychedelic effects, putting you in the perfect state of mind to fully embrace the Nic Cage experience. Whether your mind is blown or bored by this movie, you’ll feel calm and relaxed enough to easily drift off to sleep afterwards.\nImage sources: IMDb",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12000405/netflix-and-chill-with-these-eight-strain-pairings-for-november-2.jpg",
            "title": "Netflix and \"Chill\" with These Eight Strain Pairings for November 2015",
            "urlslug": "/news/lifestyle/netflix-and-chill-with-these-eight-strain-pairings-for-november-2"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "ADD/ADHD",
            "score": 13.716258631512869
        },
        {
            "name": "Anxiety",
            "score": 12.16572504708098
        },
        {
            "name": "PTSD",
            "score": 8.848085373509102
        },
        {
            "name": "Arthritis",
            "score": 8.170119271814187
        },
        {
            "name": "Crohn's Disease",
            "score": 7.661644695543
        }
    ],
    "description": "<p>Working with four prime examples of Cannabis <a href=\"http://www.leafly.com/hybrid/afghanica\">Afghanica</a> led Sensi Seeds to blend the world&#39;s finest <a href=\"http://leafly.com/indica\">indica</a> genetics into a rapid-flowering, crystal-coated <a href=\"http://leafly.com/hybrid\">hybrid</a>: Black Domina. Combining desirable features from the <a href=\"http://www.leafly.com/indica/northern-lights\">Northern Lights</a>, <a href=\"http://www.leafly.com/indica/ortega\">Ortega</a>, <a href=\"http://www.leafly.com/indica/hash-plant\">Hash Plant</a>, and <a href=\"http://www.leafly.com/indica/afghani\">Afghani</a> SA&nbsp;has made this strain equally suited to the needs of commercial growers, connoisseurs,&nbsp;and first-time cultivators. Black Domina delivers a <a href=\"http://www.leafly.com/explore#!/explore/flavors-spicyherbal\">spicy</a>&nbsp;<a href=\"http://www.leafly.com/explore#!/explore/flavors-pepper\">pepper</a> aroma alongside overwhelming <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\">relaxation</a> and <a href=\"http://www.leafly.com/explore#!/explore/tags-sleepy\">sleepiness</a>, making this strain&nbsp;ideal for late night use.</p>\n",
    "descriptionPlain": "Working with four prime examples of Cannabis Afghanica led Sensi Seeds to blend the world&#39;s finest indica genetics into a rapid-flowering, crystal-coated hybrid: Black Domina. Combining desirable features from the Northern Lights, Ortega, Hash Plant, and Afghani SA&nbsp;has made this strain equally suited to the needs of commercial growers, connoisseurs,&nbsp;and first-time cultivators. Black Domina delivers a spicy&nbsp;pepper aroma alongside overwhelming relaxation and sleepiness, making this strain&nbsp;ideal for late night use.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 89.4601381042059
        },
        {
            "name": "Sleepy",
            "score": 80.0313873195229
        },
        {
            "name": "Happy",
            "score": 56.993094789704955
        },
        {
            "name": "Hungry",
            "score": 55.360954174513495
        },
        {
            "name": "Euphoric",
            "score": 30.44256120527307
        }
    ],
    "flavors": [
        {
            "name": "Pepper",
            "score": 41.20841180163214
        },
        {
            "name": "Earthy",
            "score": 26.669805398618955
        },
        {
            "name": "Pine",
            "score": 19.85247959824231
        },
        {
            "name": "Woody",
            "score": 16.741996233521657
        },
        {
            "name": "Nutty",
            "score": 12.360326428123038
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": "Easy",
        "environment": "Indoor",
        "floweringDays": 50,
        "growNotes": "\n\tWell suited for sea of green (SOG)\n\tYields typically reach up to 430g/m&sup2;\n\tCan exhibit many different indica phenotypes\n\n",
        "height": "Short",
        "outdoorFinish": null,
        "preferredMedium": "Hydro"
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1394256,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "The heavy narcotic indica I was searching for.\r\n\r\nThis underrated gem is a proper night time med.  As a sufferer of ulcerative colitis, Black D helps to keep the cramping down and kill the pain, stress and anxiety associated with chronic illness. This allows for a peaceful nights rest when it is needed most.\r\n\r\nOverall a very effective tool for helping to combat the hellish effects of disease.  It allows one to ease the pain and relax with a smile.  A gift from God that facilitates a gentle tranquility.\r\n\r\nBottom line:  BD will cure what ails ya and put a blissful smile across your face as you sink deeply into that couch :)",
            "username": "thatgoodgreen"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Pl-Y2_w7iIfXMq-susdCw64Abdk=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fZFL3vk8uSMmuki8G4w8c_old-school-purple.png",
            "id": 1633538,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Very powerful indica. Pure indica. You get no head High at all it’s almost like it’s a narcotic. Great for night use and all around lounging. Don’t expect too do much after using Black D. ",
            "username": "GreenCaptin87"
        }
    ],
    "id": 978,
    "name": "Black Domina",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 38.06026365348399
        },
        {
            "name": "Dry Eyes",
            "score": 15.834902699309477
        },
        {
            "name": "Dizzy",
            "score": 2.2033898305084745
        },
        {
            "name": "Paranoid",
            "score": 0.9322033898305085
        },
        {
            "name": "Headache",
            "score": 0.6779661016949152
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/afghani",
            "category": "Indica",
            "name": "Afghani",
            "permalink": "https://mobileapi.leafly.com/indica/afghani",
            "slug": "afghani",
            "subtitle": null,
            "symbol": "Afg"
        },
        {
            "applink": "leafly://strain/northern-lights",
            "category": "Indica",
            "name": "Northern Lights",
            "permalink": "https://mobileapi.leafly.com/indica/northern-lights",
            "slug": "northern-lights",
            "subtitle": null,
            "symbol": "Nl"
        },
        {
            "applink": "leafly://strain/hash-plant",
            "category": "Indica",
            "name": "Hash Plant",
            "permalink": "https://mobileapi.leafly.com/indica/hash-plant",
            "slug": "hash-plant",
            "subtitle": null,
            "symbol": "Hp"
        },
        {
            "applink": "leafly://strain/ortega",
            "category": "Indica",
            "name": "Ortega",
            "permalink": "https://mobileapi.leafly.com/indica/ortega",
            "slug": "ortega",
            "subtitle": null,
            "symbol": "Ort"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/black-domina",
    "photoTotalCount": 89,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/indica/black-domina/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/indica/black-domina/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/635950/b/black-domina__primary_4401.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-domina_100x100_0aff.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/634795/b/black-domina__primary_0df1.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-domina_100x100_458b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/616079/b/black-domina__primary_1f64.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-domina_100x100_f646.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/602188/b/black-domina__primary_2ca6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-domina_100x100_1d9d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/602282/b/black-domina__primary_a2ad.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-domina_100x100_5447.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/587860/b/black-domina__primary_f3ee.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/black-domina_100x100_01f4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Bend, OR",
        "Denver, CO",
        "Seattle, WA",
        "Anchorage, AK",
        "Brunswick, ME",
        "Cathedral City, CA",
        "Cave Junction, OR",
        "Central City, CO",
        "Cook, WA",
        "Coos Bay, OR"
    ],
    "rating": 4.17,
    "relatedStrains": [],
    "reviewCount": 258,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "black-domina",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.17441860465116/240",
    "subtitle": null,
    "symbol": "Bdm",
    "symptoms": [
        {
            "name": "Pain",
            "score": 38.90772128060264
        },
        {
            "name": "Stress",
            "score": 33.11989956057752
        },
        {
            "name": "Depression",
            "score": 26.77652228499686
        },
        {
            "name": "Insomnia",
            "score": 24.526051475204014
        },
        {
            "name": "Lack of Appetite",
            "score": 23.39924670433145
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
