{
    "aka": "Ever Last",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1509477174000)/",
            "id": "contentitems-46728",
            "text": "Rhythm and Blues is a rich genre with roots planted firmly in the black American community. It is a genre synonymous with emotion—music that feeds the soul and tells stories of pain and love. Born in the 1940s, R&B has evolved over the decades to mean different things during different times while covering other genres such as gospel, funk, hip hop, and soul.\n\nDiverse as it is, there is a rich plethora of R&B to explore and appreciate. While the genre may encompass many elements, R&B will always be known for radiating feeling and heart. As R&B artist Kenny “Babyface” Edmonds says, “R&B is the one thing that has influenced every kind of music.” Pack a bowl and turn up these five powerful R&B albums to electrify your next smoke session.\nWoman by Jill Scott\n\nStrain Pairing Recommendation: Ultraviolet OG\nJill Scott’s album Woman marks her fifth and latest release. The album showcases Scott’s powerful and hypnotic voice against irresistibly catchy beats. Don’t bother fighting it—Woman pulls you in and captures the imagination and spirit with songs such as “Run Run Run,” which hit with so much energy that it feels like Scott in the same room as you, singing her heart out, while the band plays with joyful fervor behind her.\n\nNew Amerykah Part Two: Return of the Ankh by Erykah Badu\n\nStrain Pairing Recommendation: Everlast\nNew Amerykah Part Two has an uplifting, whimsical feel, with tracks such as “Incense” featuring wistful vocals and gentle rhythms. Erykah Badu’s voice, at once both strong and soothing, is a delight to luxuriate in, and it takes center stage against a backdrop of steady and well-rounded instrumentation. Released in 2010, the album encompasses Badu’s neo-soul flavors, with elements of funk, hip hop, and electronic mixed in. All in all, it is a truly heartfelt album, with a vibe that will have you in your feels from the first to the last note.\nLet Love Rule by Ledisi\n\nStrain Pairing Recommendation: Black Diamond\nLedisi’s uplifting voice is captivating on her 2017 album, Let Love Rule. Ledisi takes the listener on a journey through various sounds and themes, with influences of hip hop and soul woven throughout. Let Love Rule is a work of poignancy, incorporating important social issues like the Black Lives Matter movement. Her song “Shot Down” addresses police brutality against black Americans with lyrics like “Shot down on display in the middle of the story / She was shot down in the park in the middle of the day,” and “The System says we matter, but the black lives only / Matter certain days.” Ledisi combines these raw, real lyrics with her powerful, soulful voice, and exquisite instrumentals make it all sound effortless—though it is anything but.\n\nFunk This by Chaka Khan\n\nStrain Pairing Recommendation: Mother of Berries\nLegendary “Queen of Funk” singer/songwriter and talented drummer Chaka Khan has been producing music for five decades, incorporating funk, jazz, and soul influences. Funk This, released in 2007, is Khan’s most modern album that exemplifies her unique sound and style. The album features funky R&B beats, full instrumentation, and Khan’s signature vocals ripe with feeling and presence. From high-energy tracks such as “Disrespectful” to soulful ballads such as “Angel,” Funk This is an immersive album that demonstrates why Khan is called Queen.\nThe Miseducation of Lauryn Hill by Ms. Lauryn Hill\n\nStrain Pairing Recommendation: Punky Lion\nLauryn Hill’s first solo album, released in 1998, gained wide spread acclaim and went on to break records. The Miseducation of Lauryn Hill is a hard-hitting and expertly assembled album featuring Lauryn Hill’s unique mix of beauty and boldness. With elements of rap, reggae, hip hop, and soul, Hill fluctuates effortlessly between commanding lyrical composition and light, effervescent singing—both of which pull the listener in and captivate. Paired with engaging and expertly composed instrumentation, The Miseducation of Lauryn Hill is a uniquely personal album, where one can truly feel a part of Hill’s being in every track and in every line.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/10/31103330/rb-albums.jpg",
            "title": "5 Exceptional R&B Albums to Listen to While High",
            "urlslug": "/news/lifestyle/great-rb-albums-to-listen-to-while-high"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1429297200000)/",
            "id": "contentitems-3227",
            "text": "So 4/20 is right around the corner, and the more proactive participants are probably thinking about what strains should be included in this year's arsenal. Or maybe you'll just be sitting at home training for the big day with your snap-away sweats and some HBO. That's cool, too. Either way, we're going to give you a few strain recommendations. Leave strain reviews for the varieties you've already tried so others will know what to expect!\n   1. GRiZ Kush\n\nGRiZ Kush is a custom strain bred by Native Roots in collaboration with Root Cellar Genetics. This exclusive hybrid blend of Tangerine Haze and Pakistani Chitral Kush genetics was hand-selected by the musician GRiZ based on his favorite flavors and desired effects. The strain was developed to have an earthy citrus aroma and a balance between heady sativa energy and relaxing indica effects. The buds present themselves with a hint of purple coloring and carry a robust tangerine flavor with a hint of pine from the Kush undertones.\n\nAvailable at Native Roots South Denver and Native Roots Edgewater\n \n   2. Black Russian\n\nBlack Russian is an 80/20 indica-dominant strain bred by Delicious Seeds, who created this strain by crossing a Black Domina mother with White Russian. Notes of mango and citrus collide with lemon candy to create a medley of sweet tropical aromas that burst from Black Russian’s compact buds. This indica is known for her potency and endurance, making Black Russian the perfect choice for either patients seeking long-lasting symptom relief or anyone in need of deep relaxation of both mind and body.\n\n \n   3. Dutch Queen\n\nDutch Queen is a hybrid strain bred by Buddy Boy Farms in Washington. A cross between Dutch Treat and Space Queen, Dutch Queen inherits a sweet pine aroma with subtle fruity highlights. The sativa in her promises a light, uplifting euphoria that helps you find energy and focus. Replacing stress with a sense of elevated bliss, Dutch Queen is perfect for unwinding or unraveling bad moods.\n\n \n   4. Everlast\n\nEverlast from Machias, Washington is an 80/20 indica-dominant strain that induces deeply relaxing effects with a hashy, skunky aroma. With a THC content that can tower as high as 28%, Everlast is best chosen by experienced, seasoned consumers. It gets its name from the long-lasting euphoria that leaves your body suspended in tingling tranquility while the mind floats to active, happy escapes. Its heavy, body-focused effects are recommended for patients treating stubborn pain or sleeplessness.\n\nAvailable at Herbal Nation Recreational in Bothell, WA\n \n   5. Twisted Citrus\n\nTwisted Citrus is a sativa-dominant strain with a THC content that can climb to heights as high as 27%. With a name like Twisted Citrus, you might anticipate the tropical fruity aromas even before opening your stash jar. A bold fusion of oranges and banana flavors overwhelm the inhale and fade to subtle earthiness on the release. Next comes the upbeat, energized cerebral euphoria coupled with mellow, uplifting body effects, sensations that you can appreciate any time of the day.\n\n \n   6. Kush Cleaner\n\nKush Cleaner is a hybrid strain that combines Kush genetics with Jack’s Cleaner. Exactly which Kush was used in breeding this sativa-leaning strain is up for debate, but OG Kush, Ogre, and Purple Kush are all likely suspects. Its aroma is a strong mix of earthiness and pine, much like that of its Jack Herer ancestor. Expect Kush Cleaner to focus its efforts cerebrally, but its mellow relaxation will eventually permeate throughout the body, easing pain and tension.\n\n \n   7. Glad Max\n\nGlad Max, cultivated by Monarch Wellness in Arizona, is a spin on the classic sativa-dominant Caramelicious. This high-THC hybrid strain is known to have long-lasting euphoria that lifts the mood while relaxing the body. Consumers have compared this strain to Mother’s Helper in its aroma and effects, but Glad Max is said to carry even happier, more lighthearted qualities. Its buds have a sweet, earthy aroma and tend to take on a slight caramel hue with maturation.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12001947/new-strains-alert-black-russian-dutch-queen-glad-max-everlast-and.png",
            "title": "New Strains Alert: Black Russian, Dutch Queen, Glad Max, Everlast, and More",
            "urlslug": "/news/strains-products/new-strains-alert-black-russian-dutch-queen-glad-max-everlast-and"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 57.8125
        },
        {
            "name": "Fibromyalgia",
            "score": 51.5625
        },
        {
            "name": "Hypertension",
            "score": 51.5625
        },
        {
            "name": "Migraines",
            "score": 4.6875
        },
        {
            "name": "ADD/ADHD",
            "score": 3.125
        }
    ],
    "description": "<p>Everlast from Machias, Washington is an 80/20 <a href=\"http://www.leafly.com/explore/category-indica\">indica</a>-dominant strain that induces deeply <a href=\"http://www.leafly.com/explore/tags-relaxed\">relaxing</a> effects with a hashy, <a href=\"http://www.leafly.com/explore/flavors-skunk\">skunky</a> aroma. With a THC content that can tower as high as 28%, Everlast is best chosen by experienced, seasoned consumers. It gets its name from the long-lasting <a href=\"http://www.leafly.com/explore/tags-euphoric\">euphoria</a> that leaves your body suspended in <a href=\"http://www.leafly.com/explore/tags-tingly\">tingling</a> tranquility while the mind floats to active, <a href=\"http://www.leafly.com/explore/tags-happy\">happy</a> escapes. Its heavy, body-focused effects are recommended for patients treating stubborn <a href=\"http://www.leafly.com/explore/symptoms-pain\">pain</a> or <a href=\"http://www.leafly.com/explore/symptoms-insomnia\">sleeplessness</a>.</p>\n",
    "descriptionPlain": "Everlast from Machias, Washington is an 80/20 indica-dominant strain that induces deeply relaxing effects with a hashy, skunky aroma. With a THC content that can tower as high as 28%, Everlast is best chosen by experienced, seasoned consumers. It gets its name from the long-lasting euphoria that leaves your body suspended in tingling tranquility while the mind floats to active, happy escapes. Its heavy, body-focused effects are recommended for patients treating stubborn pain or sleeplessness.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 62.5
        },
        {
            "name": "Sleepy",
            "score": 59.375
        },
        {
            "name": "Happy",
            "score": 54.6875
        },
        {
            "name": "Tingly",
            "score": 53.125
        },
        {
            "name": "Euphoric",
            "score": 9.375
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 53.125
        },
        {
            "name": "Skunk",
            "score": 51.5625
        },
        {
            "name": "Flowery",
            "score": 6.25
        },
        {
            "name": "Spicy/Herbal",
            "score": 4.6875
        },
        {
            "name": "Woody",
            "score": 3.125
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1273035,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Excellent, long-lasting, clear-headed body high. Testing at nearly 30% THC, you only need a couple puffs.",
            "username": "johnnyclem"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1396731,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I just picked up an eighth of this tonight, and just finished a bowl...I always read up on the strains before I smoke..well not this time...and man I should have...I would have to say, being more of an Indica fan, out of the four strains I have at the moment, which are all really good as well(Bubba Kush, GSC, Yoda OG, and Everlast..of course) this is definitely the most potent and the most beautiful body high of the bunch!...still on my bucket list is GDP and the Original White Widow...Happy smoking all...😎✌💨💨🌳",
            "username": "VinnyM1970"
        }
    ],
    "id": 151919,
    "name": "Everlast",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 4.6875
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/indica/everlast",
    "photoTotalCount": 2,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/464679/b/everlast__primary_b1c1.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/everlast_100x100_8c7e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/421685/b/everlast__primary_c973.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/everlast_100x100_6507.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Everett, WA",
        "Spokane, WA"
    ],
    "rating": 4.57,
    "relatedStrains": [],
    "reviewCount": 14,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "everlast",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.57142857142857/240",
    "subtitle": null,
    "symbol": "Evr",
    "symptoms": [
        {
            "name": "Stress",
            "score": 59.375
        },
        {
            "name": "Insomnia",
            "score": 54.6875
        },
        {
            "name": "Pain",
            "score": 54.6875
        },
        {
            "name": "Depression",
            "score": 3.125
        },
        {
            "name": "Inflammation",
            "score": 3.125
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
