{"sl_translate":"description,descriptionPlain,category","id":236943,"slug":"frida","name":"Frida","subtitle":null,"symbol":"Fri","category":"Indica","description":"\u003cp\u003eWith the dense, full flavor of her indica parentage and over 12% CBD from an \u003ca href=\"https://www.leafly.com/hybrid/acdc\"\u003eACDC\u003c/a\u003e mother, Frida is a complex and enchanting strain that provides relief for mind and body while fueling inspiration, sensuality, appetite, and meditation. Named in celebration of \u0026ldquo;The Heroine of Pain,\u0026rdquo; Frida by Raven Grass reminds the consumer to reach further, encouraging physical wellness without encumbering you with sedation. Enjoy Frida\u0026rsquo;s therapeutic effects as a panacea for hangovers, chronic pain, anxiety, and depression. This high-CBD indica-dominant hybrid is a beautiful stone-alone strain, but is also an excellent addition to cannabis blends. \u0026nbsp; \u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"With the dense, full flavor of her indica parentage and over 12% CBD from an ACDC mother, Frida is a complex and enchanting strain that provides relief for mind and body while fueling inspiration, sensuality, appetite, and meditation. Named in celebration of \u0026ldquo;The Heroine of Pain,\u0026rdquo; Frida by Raven Grass reminds the consumer to reach further, encouraging physical wellness without encumbering you with sedation. Enjoy Frida\u0026rsquo;s therapeutic effects as a panacea for hangovers, chronic pain, anxiety, and depression. This high-CBD indica-dominant hybrid is a beautiful stone-alone strain, but is also an excellent addition to cannabis blends. \u0026nbsp; \u0026nbsp;\n","aka":null,"rating":4.9,"highlightedReviews":[{"id":1356528,"username":"Dbp25","text":"Another high CBD strain lover here. Frida is a charming and disarming lady. I am not sure why it is classified as indica. It certainly is relaxing and calming, but that is due to the CBD.\n\nAnyway, reviews of high CBD strains rarely include \"this weed ripped my face off - I was soooo stoned!\u0027 That is not the point of high CBD strains. But the example I purchased from The Novel Tree certainly does what it is supposed to do. I have terrible anxiety and stress issues, and Frida knocks that stuff to the curb. And it really puts me in a relaxed, ever so slightly stoned land of comfort.\n\nCannotonic, and now Frida are my go to stress relievers. Kudos to Raven Grass on this excellent strain.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"},{"id":1624157,"username":"Markelis","text":"This is what I turn to as an athlete when I\u0027m nursing a serious injury.  Pain and the inability to sleep are the main reasons I seek out high CBD strains and concentrates, and Frida...she is the Queen. \n\nA lot of users might feel slightly high on this, but I honestly attribute that to the extreme relaxation that takes over your body about 5 minutes into your session.  There isn\u0027t much of a cerebral feel to this, but your body will melt.  Sleep is not going to be a hard thing to find if you take a healthy helping of what Frida has to offer.  \n\nThe inflammation reduction is real here.  It\u0027s the equivalent of toking on some seriously strong Aleve or Tylenol.  Your relief is noticeable almost immediately but with your wits still about you.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3387","title":"New Strains Alert: Robert Plant, Zoom Pie, Frida, and More","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1470423600000)\/","text":"Cannabis has an odd kind of reverence about it. It inters people of fame, infamy, and import by immortalizing their names through the creation of unique genetic crossbreeds. Few other industries pay homage to a canon of sharks, musicians, activists, and pure nonsense like cannabis does, and this week\u0027s New Strains Alert is no different. You will find a guitar god, an escaped criminal, a fork, a bottle of blended Canadian whisky, a doctor/gorilla hybrid, a pie that goes zoom, and Frida, \"the heroin of pain,\" all in one place, living in harmony. \n \n   Robert Plant\n\nRobert Plant is the heady, stimulating virtuoso brought to life by crossing Blue Dream and Rebel God Smoke. This creative and drastically energetic strain combines Blue Dream’s hazy, uplifted mental energy and Rebel God Smoke’s full-throttle stimulation to bring about motivation and creativity. Respect the potency of this strain, as even pro-level consumers can experience a racing heart. This strain wad crafted by Colorado Seed Inc. \n\n \n   Zoom Pie\n\nZoom Pie (also known as Zombie Pie) is a heavy indica-dominant strain that blends the potency of Blue Zombie with the Cookie Fam legend, Cherry Pie. This combination yields blue and purple foliage that reeks of tart cherries and pungent skunky fuel. It is known to stimulate appetite while imbuing the consumer with a heady euphoria (presumably from the recessive African landrace, Durban Poison, nestled in Cherry Pie). Enjoy this strain as a means to crush stress, physical discomfort, and depression. But be aware, this strain will apply sedative effects to the body when dosed heavily.\n\n \n   Frida\n\nWith the dense, full flavor of her indica parentage and over 12% CBD from an ACDC mother, Frida is a complex and enchanting strain that provides relief for mind and body while fueling inspiration, sensuality, appetite, and meditation. Named in celebration of “The Heroine of Pain,” Frida by Raven Grass reminds the consumer to reach further, encouraging physical wellness without encumbering you with sedation. Enjoy Frida’s therapeutic effects as a panacea for hangovers, chronic pain, anxiety, and depression. This high-CBD indica-dominant hybrid is a beautiful stone-alone strain, but is also an excellent addition to cannabis blends.    \n\n \n   The Fork\n\nColorado Seed Inc.’s “The Fork” is dubbed as such because the original breeders utilized a fork, a knife, and a spoon in lieu of tagging their three mysterious Hawaiian strains with specific names. Those marked with a knife and spoon turned out to be less than satisfactory, but “The Fork” expressed brilliant sativa-dominant qualities that could not be ignored. With effects similar to those of Durban Poison, The Fork dishes up exhilarating physical and mental energy that encourages activity.\n\n \n   El Chapo OG\n\nEl Chapo OG is a potent indica strain out of California that smells of rich earth and pine. With dense jade popcorn buds that exhibit a shimmering coat of trichomes, this strain is visually striking and worth keeping on display. Its effects are initially stunning and settle on the body as carefree relaxation. El Chapo OG is preferred near the end of the day as its effects can become rather sedating with continued use.   \n\n \n   Crown Royale\n\nCrown Royale is a sweet indica-dominant hybrid that blends the best of parent strains Blueberry and Purple Kush together. This flower is a feast for the eyes with bright purple hues and deep green foliage. Just as delightful on the palate, Crown Royale exhibits notes of the forest floor with piney aromas and a telltale berry tartness. These scents show up in the flavor as a sweeter, fruiter pine. Enjoy this strain for pervasive physical effects that dull pain, nausea, and stress.    \n\n \n   Guptilla\n\nGuptilla is a potent indica-dominant cross bred by Colorado Seed Inc. With the glittering trichome laden foliage of GG4 (f.k.a Gorilla Glue #4) intermixed with the “Dr. of Dankness” Gupta Kush, this strain raises kushy, full-bodied indica effects to a level that few have the privilege of enjoying. Anticipate pungent floral and earthy overtones with pronounced cerebral headiness that is anchored to the earth by the physical weight this strain places on the limbs. Enjoy this strain at the end of the day, as its effects are very sedating.  \n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/08/12002341/new-strains-alert-robert-plant-zoom-pie-frida-and-more.jpg","urlslug":"/news/strains-products/new-strains-alert-robert-plant-zoom-pie-frida-and-more"}],"reviewCount":20,"flavors":[{"name":"Citrus","score":53.888888888888886},{"name":"Sweet","score":41.388888888888886},{"name":"Spicy/Herbal","score":20},{"name":"Cheese","score":20},{"name":"Woody","score":20}],"effects":[{"name":"Relaxed","score":130},{"name":"Euphoric","score":53.888888888888886},{"name":"Uplifted","score":35.277777777777779},{"name":"Creative","score":26.944444444444443},{"name":"Focused","score":25}],"symptoms":[{"name":"Stress","score":84.444444444444443},{"name":"Pain","score":82.222222222222229},{"name":"Inflammation","score":71.944444444444443},{"name":"Insomnia","score":42.777777777777779},{"name":"Depression","score":36.666666666666664}],"conditions":[{"name":"Anxiety","score":73.333333333333329},{"name":"Arthritis","score":47.777777777777779},{"name":"Bipolar Disorder","score":32.5},{"name":"Fibromyalgia","score":24.166666666666664},{"name":"Migraines","score":22.777777777777779}],"negatives":[{"name":"Anxious","score":2.7777777777777777},{"name":"Dry Eyes","score":1.3888888888888888}],"articlesAvailable":true,"articleTotalCount":1,"photos":[],"photoTotalCount":0,"popularCities":["Los Angeles, CA","Spokane, WA","San Francisco, CA","Anaheim, CA","Fremont, CA","Hayward, CA","Irvine, CA","Lakewood, CA","Oakland, CA","Olympia, WA"],"permalink":"https://mobileapi.leafly.com/indica/frida","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.9/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"ACDC","subtitle":null,"slug":"acdc","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/acdc","symbol":"Acd","applink":"leafly://strain/acdc"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
