{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1515718797000)/",
            "id": "contentitems-54561",
            "text": "I’m not clairvoyant and I don’t have a crystal ball, so ultimately I can’t predict which strains growers will decide to grow in 2018. But recently I’ve come across some amazing genetics that I’m pretty excited about. These are the five strains I’ll be on the hunt for in 2018. Keep an eye out for these up-and-coming genetics, as some might make an appearance on your local dispensary menu. Others, however, may never make it beyond their exclusive Cannabis Cup showing, perhaps too good to share.\n1. White Tahoe Cookies\nWhite Tahoe Cookies bred by Kush4Breakfast and grown by Royal Tree Gardens. (Julia Sumpter/Leafly)\nAlready available up and down the West Coast and beyond thanks to some of the most respected farms, White Tahoe Cookies–bred by Kush4Breakfast– is a complex hybrid that combines genetics from The White, Tahoe OG, and GSC. I appreciate all three of these strains individually, and the combination makes for an intriguing trifecta of citrus, skunk, and musky pine aromas. The flowers express a thick frosting of trichomes thanks to The White’s genetic influence. Its soaring euphoria and deep relaxation can be attributed to its Tahoe OG lineage, while the Cookies component adds a unique doughiness to the sweet, earthy terpene profile.\n2. Mimosa\n\n\n\n\n\n Some more 🔥🔥🔥 #Mimosa grown and pheno hunted by @partytimegenetics #Clementine x #PurplePunchF2 #SymbioticGenetics #Budologist420 x #_TheVillage\nA post shared by @ symbioticgenetics on Dec 30, 2017 at 9:05pm PST\n\n\n\nMimosa might be the best new strain I’ve come across recently. Bred by Symbiotic Genetics, Mimosa is a hybrid of Clementine  and Purple Punch. This strain presents itself with several exotic and fruity phenotypes. The Clementine influence brings a heavy orange citrus note that is true to its Tangie lineage, and the Purple Punch lends some sweet berry flavoring and, in some cases, a hint of color to Mimosa’s buds. A beautiful bud with shimmering trichomes that sparkle in the sunlight, Mimosa looks as good as she smells. A great strain for hash makers, I’d be hard pressed to pass up any solventless hash that features Mimosa’s terpene profile.\n\n3. The Vision\nArchive dropped their New Dosidos Line of genetics at The Emerald Cup this year. This series of genetics was bred from their renowned strain, Dosidos (also spelled “Dos-Si-Dos”) and crossed with an amazing selection of different genetics from their stable. There were a few hybrids that really stood out to me: their Valley Vixen (SFV OG x Dosidos), their High Five (Tahoe OG x Dosidos), and The Vision (Lemon G x Dosidos). By the time I made it to their booth on day one of the cup, they had already sold out of The Vision which tells me a lot of other growers shared my excitement at the potential of these genetics.\nThe Vision specifically caught my attention because of its parent strain Lemon G, a hard-to-find strain native to Ohio. Lemon G has a strong lemony, sour terpene profile. It’s prized for its uplifting effects that are known to bring on fits of uncontrollable laughter and good times. Add in the deeply relaxing effects and pungent, spiced flavors of Dosidos and you can start to see The Vision. I haven’t had a chance to taste any of the New Dosidos Line, but knowing the quality, potency, and complexity of Archive breeding projects, I’m sure we’ll see these genetics bubble up on more dispensary menus soon.\n4. Tina\nTina bred by Exotic Genetix. (Trevor Hennings/Leafly)\nExotic Genetix is one of my favorite breeders, and Tina is one of their newest creations. Tina is a heavy-hitting, award-winning indica with an exceptionally frosty appearance. I’m excited to taste this strain because I know the Exotic team always puts a lot of passion behind their breeding projects and their internal quality standards to make sure that they are only releasing the best genetics. According to Mike of Exotic Genetix:\n\n“She’s colorful, potent, high in THC, and smells like jet fuel. If you’re going for a Kush, this is the mother of all Kushes. All the hard work paid off because we won Best Indica with Tina at the 2017 High Times SoCal Harvest Cup.”\n\n\n5. 999\n\n\n\n\n\n 2017 December .. Emerald Cup is here! Come find me or hit me up for this limited release from Karma Genetics 🌟  #Karmagenetics #Karmasquad #999 #JoshD #OGKushStory @karmagenetics @thekarmasquad @nwblacklab @prodigy_og_ @trichome_he8d @thekushcritic @420kushkush @kushfamilygenetix @theebubbakush @killdrama @breal @joel_og_glass @terraformgenetics @calikushfarms\nA post shared by  JoshD. (@therealogkushstory) on Dec 9, 2017 at 10:41am PST\n\n\n\nThe man behind “The Real OG Kush Story,” JoshD, teamed up with Karma Genetics for a limited release of this new strain, called 999. It’s the compelling blend of genetics that attracted me to this hybrid. Labeled as a Tahoe x TK x Biker cross, I assume this is a kushy cross of Tahoe OG, Triangle Kush, and Karma’s Biker Kush, but I wasn’t able to confirm the specifics with JoshD. All three of these kushes hold pungent, sharp pine flavors with other dank, earthy notes. If the 999 meets JoshD’s standards, then I’m excited. His genetics have never steered me wrong in the past, and I’m looking forward to tracking this strain down.\nThese are just a few of the latest and greatest genetics that have piqued my interest lately, but there are plenty more on the horizon. Breeders are continuously hard at work, pushing boundaries, and innovating cannabis further in 2018. What strains are you most excited for? Are they listed and easy to find on Leafly yet? If not, share your enthusiasm and email our Strain Research department: strains-(at)-leafly.com",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/11151319/up-and-coming-cannabis-strains-tina2.jpg",
            "title": "5 Cannabis Strains You Should Be Excited About in 2018",
            "urlslug": "/news/strains-products/cannabis-strains-to-try-in-2018"
        },
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1514934606000)/",
            "id": "contentitems-53439",
            "text": "I’m a firm believer that quality cannabis should captivate all of the senses, starting with the nose. Aroma has always been an important characteristic when choosing a cannabis strain, and it’s generally the first thing that will attract you to a specific variety. A strain’s smell is a major indicator the flower’s flavor profile and gives you some semblance of what tastes can be expected when you inhale.\nMost connoisseurs will tell you that cannabis should be purchased with your nose, letting the natural harmony of terpenes guide your decision. One of the flaws with state regulations requiring pre-packaged cannabis is that it removes the nose from the equation and forces you to wait until you get home to find out how pungent the purchased flower may be. To help overcome this roadblock the legal cannabis market presents, I’ll share some of my favorite strains available in Washington that carry truly exceptional and complex aromas.\n\n#1 | Lemonder by Seattle’s Private Reserve\n\nLemonder from Seattle’s Private Reserve is a 91-point strain that was awarded the Best Aroma in Washington State using Leafly’s Cannabis Rating System. While somewhat wispy in appearance, it was the only qualifying strain that scored perfectly for its aroma. The strain is a hybrid of Super Lemon Haze, OG Kush, and Lavender, and it produces a sweet citrus aroma with the added pungent zest of fruit when ground up. Its flavor is a fruity, floral experience that reminds me of candied orange.\nFind Lemonder Nearby\nFrom the Tasting Notebook:\n “Lemon, cream, spice, and some middle savory note that is mellowing the lemon in an unexpected way.” –Jeremiah Wilhelm, Strain Researcher\n\n#2 | White Tahoe Cookies by Royal Tree Gardens\n\nRoyal Tree Gardens has a diverse mix of aromas and flavors coming from their flowering rooms. Their White Tahoe Cookies is a prime example of the quality and consistency their garden produces. A 94-point strain overall, White Tahoe Cookies’ aroma is a compelling mix of its parent genetics, The White, Tahoe OG, and an unspecified GSC cut. This flower has a grape and berry sweetness that blends with notes of musky mint, pine, and skunky earth to complete its enchanting bouquet.\nFind White Tahoe Cookies Nearby\nFrom the Tasting Notebook:\n“Robust grape and berry notes charged with a hint of dank, musky Kush and a sweet finish. Aromas of mint, eucalyptus, and pine forest erupt when this bud is broken down into shake.” –Will Hyde, Cannabis Expert\n\n#3 | Gummo by Gabriel Cannabis\n\nGummo from Gabriel Cannabis is an irresistible 92-point strain that crosses the sweetness of Bubble Gum with the intricate citrus aroma of Orange Bud. The tight buds covered in fiery orange hairs emit an intense citrus sour with soft floral sweetness. The flavor follows suit with a sharper, spiced finish reminiscent of cinnamon and sandalwood. The resulting effects are immediate, heady, and introspective.\nFind Gummo Nearby\nFrom the Tasting Notebook:\n“Loud, ripe berry aroma that expands into a sweet citrus medley of mandarin and tangerine.” –Bailey Rahn, Strains & Products Editor\n\nGummo grown by Gabriel Cannabis.\n#4 | Blueberry Pancakes by Nebula Gardens\n\nA truly amazing flower with a captivating, nuanced, and unique terpene profile, Blueberry Pancakes from Nebula Gardens really does emulate its namesake: a mix of berry notes that finish with a creamy touch of citrus, evoking memories of fresh baked muffins. Scoring 89 points overall and near perfect for its aroma, Blueberry Pancakes provides soothing effects that pair nicely with its pungent essence.\nFind Blueberry Pancakes Nearby\nFrom the Tasting Notebook:\n“Bright strawberry, wildflower, and sweet pine with doughy vanilla. Its aroma feels clarifying with diverse nuance.”–Bailey Rahn, Strains & Products Editor\n\n#5 | Golden Ticket by Khush Kush\n\nAn 87-point strain overall, Golden Ticket from Khush Kush is a flower with fragrant fruity notes of citrus and subtle undertones of tropical flowers. The nuanced smells of Golden Ticket were just a couple points shy of a perfect aroma score. Its complex smell gives way to fresh pine and spearmint flavors with just a touch of sharp lime upon exhale.\nFind Golden Ticket Nearby\nFrom the Tasting Notebook:\n“Sweet, floral, and sort of tropical like a papaya\u2028. Reminds me of a Trainwreck\u2028 cross. When I grind it up, the aroma is even sweeter like a sour green apple or an overripe pineapple\u2028.” –Will Hyde, Cannabis Expert",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/02145135/lemonader-macro.jpg",
            "title": "5 Best-Smelling Cannabis Strains in Washington",
            "urlslug": "/news/strains-products/best-smelling-strains-in-washington-fall-2017"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 27.17391304347826
        },
        {
            "name": "Bipolar Disorder",
            "score": 27.17391304347826
        },
        {
            "name": "Fibromyalgia",
            "score": 14.673913043478262
        },
        {
            "name": "Migraines",
            "score": 14.673913043478262
        },
        {
            "name": "PTSD",
            "score": 14.673913043478262
        }
    ],
    "description": "<p>White Tahoe Cookies is an indica-dominant strain created by Kush4Breakfast and distributed by Archive Seed Bank. This strain is a blend of <a href=\"https://www.leafly.com/hybrid/the-white\">The White</a>, <a href=\"https://www.leafly.com/hybrid/tahoe-og\">Tahoe OG</a>, and an unknown <a href=\"https://www.leafly.com/hybrid/girl-scout-cookie\">Girl Scout Cookies</a> cut, and exemplifies attributes of each in trichome coverage, effect, and aroma. The GSC bouquet has been enhanced through this cross, offering up sweeter, hashier notes with distant OG undertones. Its restful effects pile on with each hit, weighing the consumer to their seat while alleviating minor pain and anxiety.</p>\n",
    "descriptionPlain": "White Tahoe Cookies is an indica-dominant strain created by Kush4Breakfast and distributed by Archive Seed Bank. This strain is a blend of The White, Tahoe OG, and an unknown Girl Scout Cookies cut, and exemplifies attributes of each in trichome coverage, effect, and aroma. The GSC bouquet has been enhanced through this cross, offering up sweeter, hashier notes with distant OG undertones. Its restful effects pile on with each hit, weighing the consumer to their seat while alleviating minor pain and anxiety.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 96.73913043478261
        },
        {
            "name": "Relaxed",
            "score": 77.71739130434783
        },
        {
            "name": "Sleepy",
            "score": 48.369565217391305
        },
        {
            "name": "Energetic",
            "score": 48.369565217391305
        },
        {
            "name": "Hungry",
            "score": 41.84782608695652
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 31.52173913043478
        },
        {
            "name": "Skunk",
            "score": 31.52173913043478
        },
        {
            "name": "Flowery",
            "score": 16.847826086956523
        },
        {
            "name": "Sweet",
            "score": 14.673913043478262
        },
        {
            "name": "Diesel",
            "score": 12.5
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png",
            "id": 1510510,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This strain is lovely. My girlfriend and I both enjoy smoking it, and it enhances our sexual vibrations after smoking. The White Tahoe Cooks are a mans best friend... fellas ",
            "username": "graybaybay17"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Vt5M48GWTthyYLbmsfpetoWhvCA=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmlu7GeVZTteolLKW62f8_old-school-green.png",
            "id": 1639412,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "One of the best 2018 strains out there. My husband was speechless when it came to how good this one is. And he’s a 24/7 smoker. It’s very hard to impress his green palate-but this one did the trick. Be careful if you’re a novice smoker. ",
            "username": "KikiKittens"
        }
    ],
    "id": 500581,
    "name": "White Tahoe Cookies",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 27.17391304347826
        },
        {
            "name": "Paranoid",
            "score": 25
        },
        {
            "name": "Headache",
            "score": 14.673913043478262
        },
        {
            "name": "Anxious",
            "score": 14.673913043478262
        },
        {
            "name": "Dry Eyes",
            "score": 2.1739130434782608
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/the-white",
            "category": "Hybrid",
            "name": "The White",
            "permalink": "https://mobileapi.leafly.com/hybrid/the-white",
            "slug": "the-white",
            "subtitle": null,
            "symbol": "Twt"
        },
        {
            "applink": "leafly://strain/tahoe-og",
            "category": "Hybrid",
            "name": "Tahoe OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/tahoe-og",
            "slug": "tahoe-og",
            "subtitle": null,
            "symbol": "Tok"
        },
        {
            "applink": "leafly://strain/gsc",
            "category": "Hybrid",
            "name": "GSC",
            "permalink": "https://mobileapi.leafly.com/hybrid/gsc",
            "slug": "gsc",
            "subtitle": null,
            "symbol": "Gsc"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/white-tahoe-cookies",
    "photoTotalCount": 0,
    "photos": [],
    "popularCities": [
        "Portland, OR",
        "Seattle, WA",
        "Eugene, OR",
        "Bellingham, WA",
        "Spokane, WA",
        "Everett, WA",
        "Bend, OR",
        "Medford, OR",
        "Springfield, OR",
        "Astoria, OR"
    ],
    "rating": 4.37,
    "relatedStrains": [],
    "reviewCount": 27,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "white-tahoe-cookies",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.37037037037037/240",
    "subtitle": null,
    "symbol": "Wtc",
    "symptoms": [
        {
            "name": "Depression",
            "score": 33.69565217391305
        },
        {
            "name": "Pain",
            "score": 33.69565217391305
        },
        {
            "name": "Inflammation",
            "score": 31.52173913043478
        },
        {
            "name": "Stress",
            "score": 23.369565217391305
        },
        {
            "name": "Insomnia",
            "score": 21.195652173913043
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
