{"sl_translate":"description,descriptionPlain,category","id":220,"slug":"sweet-tooth","name":"Sweet Tooth","subtitle":null,"symbol":"St","category":"Indica","description":"\u003cp\u003eSweet Tooth was awarded 1st place at the High Times Cannabis Cup in 2001, and as you could probably guess from the name, it has a \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e smell of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-flowery\"\u003eflowers\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-berry\"\u003eberries\u003c/a\u003e that accompanies\u0026nbsp;it. The potent \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\"\u003ecolas\u003c/a\u003e of this balanced \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e are candy-coated with trichomes, providing \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003euplifted\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\"\u003eeuphoric\u003c/a\u003e effects that are great for combating \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\"\u003estress\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-migraines\"\u003eheadaches\u003c/a\u003e. Bred by Barney\u0026rsquo;s Farm, Sweet Tooth\u0026rsquo;s genetics sprout from mixing \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\"\u003elandrace\u003c/a\u003e strains from \u003ca href=\"http://www.leafly.com/indica/afghani\"\u003eAfghanistan\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/sativa/hawaiian\"\u003eHawaii\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/indica/nepalese\"\u003eNepal\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"Sweet Tooth was awarded 1st place at the High Times Cannabis Cup in 2001, and as you could probably guess from the name, it has a sweet smell of flowers and berries that accompanies\u0026nbsp;it. The potent colas of this balanced hybrid are candy-coated with trichomes, providing uplifted and euphoric effects that are great for combating stress and headaches. Bred by Barney\u0026rsquo;s Farm, Sweet Tooth\u0026rsquo;s genetics sprout from mixing landrace strains from Afghanistan, Hawaii, and Nepal.\n","aka":null,"rating":4.24,"highlightedReviews":[{"id":1417777,"username":"Chill_Panda","text":"Its a dry woody pungent flowery taste and smell. If you have massive depression you\u0027ll want to do SweetTooth. It has an outstanding knack for making you feel better, very sticky and dense round nuggets in deep green \u0026 orange hairs. These compact buds give you the smell of fruit and spicy flowers. Do not pass up Sweet Tooth, but bring a jug of water this strain will make you thirsty.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"},{"id":1642016,"username":"SafetyLast","text":"I kinda expected this to be similar to bubblegum or cream caramel. But the taste is less sweet. It has a resinous pine taste, sweet and lightly woody, but not too harsh. The smell is rather sharp so it\u0027s hard to tell any aromas with a joint. On the effects side: I have never felt so relaxed in my life. I felt the indica effects sneaking in, while I got happier and my stressful thoughts disappeared, which was a while ago. I\u0027m in my backyard, lit a candle, ate a hotdog, watched slow mo videos on YouTube. Felt amazing, content, but not anxious or uneasy. I was overwhelmed when I lit the 2nd, but a few minutes later I got the hang of it. Physically couchlocked, clear headed and positive mindset. In smaller quantities (or temperature if you\u0027re vaping) you have more of the latter, maybe even somewhat sativa leaning effects. Also great to chill with friends and play Xbox very, very badly, which is always a great indicator for the stone-o-meter. Deserves its five stars.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-8229","title":"Try These Cannabis Strains That Are as Sweet as Honey","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1475440520000)\/","text":"Honey is an amazing substance — it’s a natural sweetener, a super-food with a nearly endless shelf life (if sealed properly), and has outstanding nutritional and medicinal benefits that can even help people adapt to local allergens (not to mention how delicious it is on baklava, peanut butter sandwiches, and in a cup of hot coffee or tea!).\nLeafly is home to over 60 specific strains that exhibit notes of honey. As your strain researcher and a passionate purveyor of fine cannabis, I’ve curated a shortlist of honey-flavored strains that will make your fingers sticky and your taste buds smile. Enjoy!\n   Panama Red\nPanama Red is best described as an old-school cannabis classic. Originating from Panama, this pure sativa rose to stardom in the late 1960’s thanks to its typical sativa effects: speedy and intense, bordering on psychedelic. As cannabis cultivation matured, Panama Red, which has a lengthy flowering time of at least 11 weeks, was left behind for faster growing strains and increased profits. However, those who fondly recall days of its prominence love its smooth medicating experience and loftily contemplate its revival. If you can get your hands on this sentimental throwback, do not hesitate to groove down memory lane and enjoy the ride.\n   Chocolate Thunder\nWhen you combine the sweet cocoa flavor of Chocolope with the strength and potency of Alaskan Thunder Fuck, you get none other than Chocolate Thunder. This clear-headed, active sativa may be all you need to inspire creativity or promote concentration, and patients will appreciate its ability to dull symptoms without fogging mental faculties. True to its name, Chocolate Thunder has a subtle sweet, earthy aroma similar to that of chocolate.\n   Thor’s Hammer\nThor’s Hammer by SnowHigh Seeds is an uplifting sativa strain that combines genetics from Vortex, Cinderella 99, and Acapulco Gold. Like a bolt of lightning commanded by the Norse god himself, Thor’s Hammer delivers an electrifying blast of cerebral energy that awakens creativity and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush fatigue and depression like the giants of Jotunheimr will likely find Thor’s Hammer to be the perfect weapon. You may also find a genetic variant of Thor’s Hammer from Alaska that instead combines God Bud and Sour Diesel in a more balanced indica-sativa hybrid cross.\n   Honey Banana\nHoney Bananas from Elemental Seeds is a heavy-handed hybrid strain bred from Strawberry Banana and Honey Boo Boo. This cannabis strain earns its name with a resinous coat as sticky as honey and an unmistakable banana aroma. She leans heavily toward the indica side of the family, providing weighty full-body effects coupled with an invigorating buzz of cerebral euphoria.\n   Lodi Dodi\nLodi Dodi is a sativa-dominant hybrid popular in Washington State. Exclusively bred by The Clone Zone, the genetic heritage of Lodi Dodi is undefined and closely guarded. Lodi Dodi carries a sweet, unique flavor of tropical fruit and fresh wildflowers. The pungent aroma leads the way towards a cerebral buzz, known to spark creativity and a boost of energy that will turn any task into a more enjoyable adventure.\n   Nebula\nThe Nebula marijuana strain was bred by Paradise Seeds in 1996. Its name means “Starcloud” and it has been known to “twinkle” with THC coating, with a head and body buzz described as intense and almost psychedelic. The buds have been known to smell and taste like honey, and flowering time is a minimum of 9 weeks. Nebula has won many awards, including 3rd place in the sativa category at the High Times Cannabis Cup in 1999 and 2nd place in 2005. It also took 3rd place at the Highlife Cup in 2004 in the Hydro category, and 1st place at the Copa La Bella Flor Spain in 2005.\n   Fortune Cookies\nFortune Cookies is a hybrid cannabis strain that combines the famed genetics of GSC (f.k.a Girl Scout Cookies) and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in GSC (f.k.a Girl Scout Cookies), but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty “couch-lock” effects typically associated with indica strains.\n   BC Sweet Tooth\nDeveloped in British Columbia by BC Bud Depot, BC Sweet tooth is an indica-dominant hybrid known for its quick flowering time and candy taste.  A hardy plant, this strain can be grown outdoors where it can flower in under 7 weeks, but it prefers the indoors where it may flower as soon as 6 weeks. The result of a cross with earlier generations of BC Sweet Tooth and classic Sweet Tooth, these sugary flowers are sure to satisfy your craving. The crystalline buds have a strong, sweet smell with a hint of citrus, and consumers report that this treat satisfies with a long-lasting, potent feeling that hits fast.\n   Danky Doodle\nOriginally named Double D as a reference to the large buds on these plants (we’ll let you make the connection there), breeder KC Brains decided to rename the strain Danky Doodle at the suggestion of some American friends in order to avoid confusion with the similarly named Double Dutch. Danky Doodle certainly isn’t a shy plant; it grows like the weed it is and will make its presence known with its pungent sweet smell. Plants flower at 9 to 11 weeks and should provide a high yield of large buds covered in a rich frost. This plant is a cross between several strains, and it’s no surprise that Big Bud is included in its lineage along with the strains Viking and the breeder’s own KC 636. The result is a strong indica that provides full body relief no matter what you call it.\n   Cream Caramel\nCream Caramel, named after its sweet caramel aroma, is a 90% indica cross between BlueBlack, Maple Leaf Indica, and White Rhino. Covered in a sugary coat of THC-rich resin, Cream Caramel delivers heavy, relaxing indica effects that soothe the mind and body. Though originally bred by Sweet Seeds in Spain, Royal Queen Seeds have also championed their own rendition called Royal Caramel. Early October is the finish line for outdoor Cream Caramel flowers, while indoor gardens should be harvested after a 7 to 8 week flowering period.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/02131126/cannabis-strains-that-taste-like-honey.jpg","urlslug":"/news/strains-products/cannabis-strains-that-taste-like-honey"},{"id":"contentitems-39637","title":"Tips for Growing Sweet Tooth Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1504030772000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Sweet Tooth is an indica-dominant strain that was created by crossing three landrace strains in the early 2000s. Stemming from Afghani, Nepalese, and Hawaiian genetics, this award-winning strain has a sweet and fruity flavor, and its effects are deeply relaxing and euphoric.\nGrow Techniques: Sweet Tooth is as enjoyable to grow as it is to consume. It offers heavy yields while also being a low-maintenance plant. It is generally pest-resistant and has a strong immune system. Grow this strain indoors or outdoors, and prune the dense indica foliage to promote airflow around the buds.\nFlowering Time: 8 to 9 weeks\nYield: High\nGrow Difficulty: Easy\nClimate: Sweet Tooth likes a cooler climate than most strains. Ideally, keep this strain between 68 and 75 degrees Fahrenheit.\nIndoor/Outdoor: This strain grows well either indoors or outdoors. \nFeeding: Feed heavily during the vegetative stage to encourage a quality growth structure and to help the plant develop before its flowering cycle. Use silica to help keep the branches strong as Sweet Tooth’s buds gain weight.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/29111833/sweet-tooth-strain.jpg","urlslug":"/news/growing/how-to-grow-sweet-tooth-marijuana"}],"reviewCount":526,"flavors":[{"name":"Sweet","score":53.158417652078505},{"name":"Berry","score":21.147567962940386},{"name":"Flowery","score":20.993721809094232},{"name":"Woody","score":15.597769108862611},{"name":"Earthy","score":12.627880043886384}],"effects":[{"name":"Relaxed","score":96.194075338290872},{"name":"Happy","score":69.928075094477634},{"name":"Uplifted","score":55.308545654029018},{"name":"Euphoric","score":53.97372912349141},{"name":"Hungry","score":36.972388150676579}],"symptoms":[{"name":"Stress","score":55.9987809338047},{"name":"Pain","score":41.243691332439354},{"name":"Depression","score":40.129708643179328},{"name":"Insomnia","score":30.063452395465074},{"name":"Lack of Appetite","score":29.187187614287456}],"conditions":[{"name":"Anxiety","score":34.992990369377054},{"name":"ADD/ADHD","score":13.142935511398269},{"name":"Migraines","score":11.705961233694989},{"name":"Arthritis","score":8.5196879190540056},{"name":"PTSD","score":7.5078629769596494}],"negatives":[{"name":"Dry Mouth","score":35.34493477995855},{"name":"Paranoid","score":10.031269047909301},{"name":"Dry Eyes","score":7.7638668779714735},{"name":"Headache","score":6.675850298671218},{"name":"Dizzy","score":4.0335852736803606}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-tooth_100x100_852f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005396/b/sweet-tooth__primary_5c53.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-tooth_100x100_7e08.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003415/b/sweet-tooth__primary_3dfa.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-tooth_100x100_4b32.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002997/b/sweet-tooth__primary_8aca.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-tooth_100x100_0447.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/641979/b/sweet-tooth__primary_e5e6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-tooth_100x100_4fd5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/634352/b/sweet-tooth__primary_2cc3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-tooth_100x100_17ab.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/611893/b/sweet-tooth__primary_8059.jpg"}],"photoTotalCount":195,"popularCities":["Portland, OR","Montréal, QC","Vancouver, BC","Calgary, AB","Toronto, ON","Ann Arbor, MI","Beaverton, OR","Bothell, WA","Denver, CO","Detroit, MI"],"permalink":"https://mobileapi.leafly.com/indica/sweet-tooth","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.23764258555133/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Nepalese","subtitle":null,"slug":"nepalese","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/nepalese","symbol":"Np","applink":"leafly://strain/nepalese"},{"name":"Hawaiian","subtitle":null,"slug":"hawaiian","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/hawaiian","symbol":"Haw","applink":"leafly://strain/hawaiian"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":66,"outdoorFinish":"End of September","height":"Medium","averageYield":"High","environment":null,"growNotes":"\n\tYields tend to fall between\u0026nbsp;350-450 g/m\u0026sup2;\n\n"}}
