{
    "aka": "Blue Mistic",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1517865543000)/",
            "id": "contentitems-56274",
            "text": "The blues is a timeless genre full of heart and soul. Starting in the 19th century, blues formed in black communities of the deep south and has strong roots in African musical traditions. Early blues songs were accompanied by lyrics recounting experiences of racial discrimination and other similar hardships faced by black Americans. The genre has persisted through the years, often being combined with elements of jazz, soul, rock, spirituals, and R&B.\n\nWhatever form it takes, the blues is a genre that grabs you by the heart and demands an emotional response. Below, enjoy five impactful blues albums with our recommended strains and tune in to your emotional center.\nSouthern Avenue by Southern Avenue\n(Spotify)\nStrain Pairing Recommendation: Bluniverse\nSouthern Avenue released its lively self-titled album in 2017 and burst onto the blues scene with a refreshing style. The 10-track album features a full electric band, backup vocals, and versatile lead singer Tierinii Jackson, who wows with her strong, harmonious voice. Jackson is joined by her sister Tikyra Jackson on drums, Ori Naftaly on guitar, Jeremy Powell on keys, and Gage Markey on bass. Together, the five create an upbeat, energetic soundscape on Southern Avenue with an added influence of soul and R&B.\nFind Bluniverse Nearby\nDidn’t It Rain by Amy Helm\n(Spotify)\nStrain Pairing Recommendation: Blue Lights\nAmy Helm released her breakout album, Didn’t It Rain, in 2015, and has left fans eager for her next project. Helm’s voice, light with a tinge of roughness, is a powerful instrument that pulls your heart out of your chest with each upward lilt. Didn’t It Rain has a southern blues feel with elements of rock that keep it fresh and interesting with each new track. Helm’s lyrics are engaging and soulful, making it a joy to sing along and pour your emotions into every note.\nFind Blue Lights Nearby\n\nThe Marcus King Band by The Marcus King Band\n(Spotify)\nStrain Pairing Recommendation: Blue Diesel\nThe Marcus King Band is a powerful, hard-hitting album released in 2016, and also marks frontman Marcus King’s second album. Relatively new to the scene, The Marcus King Band has swept the blues world by storm, with its album reaching No. 2 on Billboard’s blues album chart. The Marcus Kind Band has an intricately rich sound accompanied by gritty heart and King’s soulful, raw vocals. Each track on the album features the band’s perfectly orchestrated and impactful instrumentation with a sweet, mournful essence of blues.\nFind Blue Diesel Nearby\nBy My Side by Kat Wright\n(Spotify)\nStrain Pairing Recommendation: Blue Mystic\nBy My Side, released in 2016, is Kat Wright’s first album, and it wastes no time getting right to the heart of the matter. Wright’s soulful, longing voice is effortless, whisking you away and holding you close. The music shoots straight to your center as it churns with emotion, all while the eight-piece band captures your attention with playful transitions. By My Side is a breakout album that carves out a prominent spot for Wright and her band in the world of blues.\nFind Blue Mystic Nearby\n\nMigration Blues by Eric Bibb\n(Spotify)\nStrain Pairing Recommendation: Blue Dragon\nMigration Blues is smooth like silk. This acoustic blues album, released in 2017, is a raw, more organic approach to blues that eases you back in time to a simpler place. Eric Bibb’s voice is pristine and rich as he sings over his melodic guitar playing. Occasionally accompanied by harmonica, the album is stripped down but drips so heavily with emotion that it feels full and rounded. It’s the perfect collection of songs to sink into after a long day, cradling you as it drifts you away from your hardships in every note.\nFind Blue Dragon Nearby",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/02150511/soul-albums-while-high.jpg",
            "title": "5 Soulful Blues Albums to Listen to While High",
            "urlslug": "/news/lifestyle/soulful-blues-albums-listen-while-high"
        },
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1500942707000)/",
            "id": "contentitems-34817",
            "text": "Mix together American roots music such as bluegrass, rhythm and blues, country, and folk, then stir in a hearty portion of down-to-earth charisma, et voilà: Americana music. At its heart, Americana has a deeply rustic feel, and exists at the intersection of some or all of these classic roots genres. It’s the kind of music that paints a grand picture of open country, roaming plains and old American charm.\n\nAmericana is special not only because it acts as the child of so many other beloved genres, but because it exemplifies the blending of the old with the new. It has the capacity to uplift and energize while spilling over with honest emotion, creating a sound that is both deeply human and largely joyful. We recommend gathering your favorite people, rolling a fat joint, and exploring the following Americana albums as you nestle into an elevated state of mind.\nLeaving Eden by Carolina Chocolate Drops\n\nStrain Pairing Recommendation: Blueberry Pie\nLeaving Eden is at once up-on-your-feet, slap-your-knee, circle-swinging-dance music. But in the next breath it is also soft, heartfelt and gentle. This album can make you feel like you’re stepping back in time to rediscover the quintessential idea of old folk roots music—as with the song “Boodle-De-Bum-Bum”—but the very next song “Country Girl” will yank you out of the reverie and thrust you into the present with its upbeat, modern vibes and vocals. The title track “Leaving Eden” encourages reflection and a release of emotion with its gentle purring.\nCarolina Chocolate Drops is comprised of Hubby Jenkins, Rowan Corbett, Malcolm Parson, and Rhiannon Giddens, with Giddens’ powerful yet delicate vocals often at the forefront of their sound. Between the four of them is a wide variety of instrumentation including guitar, banjo, mandolin, fiddle, kazoo, drum, djembe, and cello. This album has a full, intricate sound that shifts and changes with each track, allowing it to hold its listener’s attention effortlessly.\nThe Carrier by Dirtwire\n\nStrain Pairing Recommendation: Lucid Dream\nThis is not your traditional Americana. The Carrier is fresh and modern with a vibrant, dirty sound that lives up to the band’s name. Their unique perspective on Americana often features influences from Eastern, African, and South American music threaded throughout. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), the band describes their music as “a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.”\nNo two songs are quite alike on this almost exclusively instrumental album. From “The Well,” featuring Rising Appalachia, to the aptly named “Last Call,” with its sleepy afternoon vibe, The Carrier invites listeners to dive deep into a world with truth and whimsical fancy married together in happy harmony.\n\nBest Of Old Crow Medicine Show by Old Crow Medicine Show\n\nStrain Pairing Recommendation: Huckleberry\nBest Of Old Crow Medicine Show starts off with “Wagon Wheel,” a song co-written with Bob Dylan. He first developed the chorus in 1973, 25 years before Old Crow Medicine Show added verses and finalized the song. The classic, like much of Old Crow Medicine Show’s music, tells a lyrical story that is set to a distinctly old-timey country-bluegrass-folk sound.\nOCMS features guitar, banjo, standup bass, fiddle, harmonica, mandolin, drums, and keys, among many other instruments. The result of so much instrumental combination is a wonderfully rich, full sound that is as fanciful as it is familiar. Best Of Old Crown Medicine Show is a farmer on a front porch, a half-empty whiskey bottle, dusty boots, and sunflower fields for miles. It would be a challenge to listen to it without cracking a smile.\nCaptain Nowhere by Railroad Earth\n\nStrain Pairing Recommendation: Lemon Drop\nCaptain Nowhere is beautiful, heartfelt, and earthy. The album combines elements of folk, roots, country, bluegrass, and even jazz to create an Americana sound with a life of its own. Todd Sheaffer’s vocals, together with the album’s lyricism, evoke nostalgia, emotion, and at times yearning, which together paint Captain Nowhere’s unique soundscape with true-to-life human elements.\nKnown for improvisation, Railroad Earth’s jam band version of Americana brings a fresh take to the genre, as seen in their song “The Berkley Flash,” which delves into instrumentation that breathes and moves like white clouds on a windy day. All in all, Captain Nowhere leads the listener across vast waters of roots sound that will delight, uplift, and inspire—just like its strain pairing.\n\nWider Circles by Rising Appalachia\n\nStrain Pairing Recommendation: Blue Mystic\nWider Circles is ethereal, light, heartfelt, and raw. Multi-instrumentalist sister duo Leah and Chloe Smith combine their unique sound with strong, harmonious vocals and creative, original lyrics. Wider Circles blends all these talents beautifully, as the album leads the listener down a gentle river of sound that flows softly together even as it twists and turns along the way.\nWorking in conjunction with an array of fellow musicians, the Smith sisters are able to incorporate a wide range of instruments including (but not limited to) banjos, fiddles, drums, congas, djembe, tablas, and even a washboard. The result is music that is folksy yet worldly and filled to the brim with life. Wider Circles will inspire, delight, and encourage movement of both body and mind.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/24100103/americana-music.jpg",
            "title": "5 Rustic Americana Albums to Listen to While High",
            "urlslug": "/news/lifestyle/americana-albums-listen-high"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Migraines",
            "score": 29.865506329113924
        },
        {
            "name": "Anxiety",
            "score": 11.787974683544302
        },
        {
            "name": "PTSD",
            "score": 4.549050632911392
        },
        {
            "name": "Cancer",
            "score": 3.757911392405063
        },
        {
            "name": "Spinal Cord Injury",
            "score": 3.757911392405063
        }
    ],
    "description": "<p class=\"p1\">Blue Mystic is as mysterious as its name indicates, with unknown genetics that definitely contain some <a href=\"http://leafly.com/indica/blueberry\">Blueberry</a> and possibly some <a href=\"https://www.leafly.com/hybrid/skunk-1\">Skunk</a> or <a href=\"http://leafly.com/indica/northern-lights\">Northern Lights</a>. These plants flower between 7 to 9 weeks, with light blue coloring that can make the trichome-covered buds look almost gray. It does have the distinctive Blueberry aroma, but it&rsquo;s fairly subtle compared to other strains, making it a good choice for growers or patients who need discretion. &nbsp;</p>\n",
    "descriptionPlain": "Blue Mystic is as mysterious as its name indicates, with unknown genetics that definitely contain some Blueberry and possibly some Skunk or Northern Lights. These plants flower between 7 to 9 weeks, with light blue coloring that can make the trichome-covered buds look almost gray. It does have the distinctive Blueberry aroma, but it&rsquo;s fairly subtle compared to other strains, making it a good choice for growers or patients who need discretion. &nbsp;\n",
    "effects": [
        {
            "name": "Happy",
            "score": 80.41930379746836
        },
        {
            "name": "Relaxed",
            "score": 77.61075949367088
        },
        {
            "name": "Creative",
            "score": 60.99683544303797
        },
        {
            "name": "Energetic",
            "score": 41.61392405063291
        },
        {
            "name": "Tingly",
            "score": 35.04746835443038
        }
    ],
    "flavors": [
        {
            "name": "Blueberry",
            "score": 42.24683544303797
        },
        {
            "name": "Berry",
            "score": 15.50632911392405
        },
        {
            "name": "Earthy",
            "score": 15.031645569620252
        },
        {
            "name": "Sweet",
            "score": 12.38132911392405
        },
        {
            "name": "Skunk",
            "score": 4.390822784810126
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 60,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1410705,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Wow. This must be the best weed I have ever smoked! After the first bong hit, I almost instantly felt a sensation of tingling and numbness at the same time in my fingers, the same feeling of being given strong pain medication intravenously. After the second hit, a strong headhigh kicked in almost instantly. I felt a tingling sensation at the top of my head.\n As I walked in to my livingroom, everything seemed very surreal. Then, as I was prepearing some food in my kitchen, a song on TV made me think that I was prepearing a meal in a spacestation. After about 15 minutes, it REALLY kicked in, and my heart was racing so fast it felt like it was just vibrating, and I became paranoid. (I underestimated how potent is was) I managed to calm down and then it was just pure pleasure from head to toe! I My thoughts went on a spacy journey. Very euphoric, and a bit hallusinogenic! My backpain was just gone, and so was my stress and anxiety. Made sex feel very, very good. I've had some trouble sleeping too, but sleeping was no problem on this strain. Slept trough the whole night. I can't remember even trying to sleep, and woke up with a clear and refreshed mind. \nThe buds are beautiful light green-grey-ish with a lot of amber hairs, and the smell is incredible. Smells like freshly picked blueberries, or blueberry tea!! YUM! Very smooth smoke, not harsh on lungs and throath. Love it!",
            "username": "frkfors"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1597648,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Love this. I think I can sing on this shit. Everything smells, sounds, and tastes better, especially the 15 natty lights that went down  with it!",
            "username": "Jarlitz"
        }
    ],
    "id": 2278,
    "name": "Blue Mystic",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 38.212025316455694
        },
        {
            "name": "Dry Eyes",
            "score": 9.414556962025316
        },
        {
            "name": "Dizzy",
            "score": 2.0569620253164556
        },
        {
            "name": "Paranoid",
            "score": 1.4240506329113924
        },
        {
            "name": "Headache",
            "score": 0.7911392405063291
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/blueberry",
            "category": "Indica",
            "name": "Blueberry",
            "permalink": "https://mobileapi.leafly.com/indica/blueberry",
            "slug": "blueberry",
            "subtitle": null,
            "symbol": "Bry"
        },
        {
            "applink": "leafly://strain/northern-lights",
            "category": "Indica",
            "name": "Northern Lights",
            "permalink": "https://mobileapi.leafly.com/indica/northern-lights",
            "slug": "northern-lights",
            "subtitle": null,
            "symbol": "Nl"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/blue-mystic",
    "photoTotalCount": 75,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/675372/b/blue-mystic__primary_3805.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-mystic_100x100_dc1e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/669197/b/blue-mystic__primary_9124.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-mystic_100x100_e828.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/601489/b/blue-mystic__primary_6ce0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-mystic_100x100_4c88.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/549962/b/blue-mystic__primary_04ed.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-mystic_100x100_3c81.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/526632/b/blue-mystic__primary_449f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-mystic_100x100_2b61.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/519833/b/blue-mystic__primary_3330.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-mystic_100x100_04d4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Anchorage, AK",
        "Detroit, MI",
        "Aberdeen, WA",
        "Astoria, OR",
        "Bellingham, WA",
        "Bothell, WA",
        "Bremerton, WA",
        "Corvallis, OR",
        "Hoquiam, WA"
    ],
    "rating": 4.22,
    "relatedStrains": [],
    "reviewCount": 139,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "blue-mystic",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.22302158273381/240",
    "subtitle": null,
    "symbol": "Bm",
    "symptoms": [
        {
            "name": "Stress",
            "score": 13.528481012658228
        },
        {
            "name": "Pain",
            "score": 10.996835443037975
        },
        {
            "name": "Insomnia",
            "score": 9.731012658227847
        },
        {
            "name": "Nausea",
            "score": 8.623417721518987
        },
        {
            "name": "Depression",
            "score": 8.188291139240507
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
