{
    "aka": "San Fernando Valley Kush, San Fernando Valley OG Kush",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1475690456000)/",
            "id": "contentitems-8012",
            "text": "I grew up watching Adam West and Burt Ward thwart evildoers after school. Back then I would saunter into the living room and settle down in front of our JC Penney television to admire the collected demeanor of gentleman millionaire Bruce Wayne and his eager ward/sidekick as they unraveled the nefarious tapestry of evil that had been subtly stitched together with sinister subterfuge. (Apparently alliteration attracted audiences back then; or, if nothing else, it gave the dialogue a poetic quality.)\nOne of the most famous turns-of-phrase that came out of the dynamic duo of the mid-60s was Robin’s, “Holy ___, Batman!” This particular set of words arises hilariously often in strain reviews, so without further ado, here’s a small sampling of some of my favorites. Holy strain reviews, Batman!\nHybrid Cannabis Strains\n   GSC (f.k.a Girl Scout Cookies)\n\n“Holy carp fish, batman. This is magic. Definitely gives you a floaty, yet energized feel. You feel it creeping up behind your eyes and in two shakes of a lambs tail, you’re high as goddamn ever.” – Anonymous\n\n   Fruity Pebbles\n\n“Holy hand grenade of Antioch, Batman. Smoking this is like watching high speed film of a remote detonation. But a detonation of giggles and time slippage. Bring this to game-night at the beach. I did, and I’m very happy about that. Social, happy, very fast acting. The super-high phase came on within 5 minutes and lasted about 10-20 minutes. After words a really happy normal to low key high kicked in and took the wheel for around 3 hours. Two of us fell asleep during this time and three of us had energy to spare.  A very solid night sleep followed for me.” – ChestyMcDeathrack\n\n   Chemdawg\n\n“Holy space balls batman. I think we’ve got a winner right here. Toked a small bowl last after a month of FireOG and White Widow. Let me tell you I nearly tripped my balls out. I had a legit out of body experience lying in bed with my wife after smoking. Needless to say I couldn’t sleep. Headed down to TV land, Jay Leno’s new show is pretty good.” – jamtastic\n\nIndica Cannabis Strains\n   Superman OG\n\n“Holy sh*t Batman, I just found one of the newest to my Top 10!!! Dare I say to the coveted #1 slot?!? Honestly, I love ALL strains but you know the standouts and this strain STANDS out! When the description uses the word ‘pungent’, yep, it IS pungent and smokes the same. I usually cough during a bowl but the HIGH it totally worth it!! Definitely agree with many, this is NOT for beginners starting on meds like this but for everyone else, if you come across Superman, GET YOU SOME, you will not be disappointed!!! Believe it or not, this doesn’t really knock me out like others I know that have came across it but DAMN, I love the deeply euphoric, giggly, happy, relaxing high, one the best I’ve felt. Thank you GROWERS of this strain, your the BEST!!!” – dhlvisdrt\n\n   SFV OG Kush\n\n“Holy amazing sleep, Batman! SLEEPIES!! This knocked my ass OUT – I haven’t slept in 2 days and this let me sleep for 7 hours straight, didn’t even move. Super important different between this ‘Kush’ and regular OG…. Smelled like pine, a bit pungent, woody, lemon/citrus, and a slight herbal scent with a little spicy kick. This OG Kush combination is an amazingly super light and smooth smoke! Packed 1/2 a bowl and it tasted like sweet flowers, pine, dankish, and herbal, like tearing open a packet of tea. Went straight to my head and my face was nuuuuumb. Helped my spine amazingly well 5/5, took my kidney stone pain down to 30%, felt cold spots in my back where it hurts, helped with my tendon pain 3/5, and a little bit of nerve pain 2/5 – noticeable enough. No munchies, I passed out – definitely a night time use, great for insomnia. Hits heavy, so I wouldn’t use this as a beginner unless you have insomnia – this is your golden ticket!” – Midnyte003\n\n   G-13\n\n“uuuuuuhhhhh…. I don’t remember what I was doing. or anything at all for that matter. where am i, who am i. it’s about like that. lol. by far the best escape from reality I’ve ever experienced personally if u wanna sit back and chill and just not give a shit about a freaking thing period simply cause u can’t remember a freaking thing. this one is an absolute must try to believe what it can actually achieve for you. review does no justice cause it simply cannot be explained in words properly. has to be experienced personally to know. I just got my first experience with it and will definitely be getting again any and every time I have chance. HOLY MOLY COW BATMAN!!!!” – 247kushpuffer\n\nSativa Cannabis Strains\n   Crystal Coma\n\n“Holy high, Batman! This is some amazing product! Awesome high, good upper, and I’m not a space cadet either! Perfect for a ‘getting shit done but still would like to smoke’ day.” – Anonymous\n\n   Sour Diesel\n\n“Holy racing heart beat and heart pounding out of my chest batman! Everyone has the same experience.” – Anonymous\n\n   East Coast Sour Diesel\n\n“Holy Batman! This thing is like a triple dose of espresso for me! Makes me so hyper I cannot sit still LOL.! Energetic for sure, good for picking up the afternoon blehs. Also gives you an appetite. I don’t think I’ll smoke this at night or I’ll be sleepless!” – HappilyPainFree\n\n   Alaskan Thunder Fuck\n\n“Holy sweet jumped up sativa, Batman. This has to be the most aptly named strain yet. As powerful and as potent as being screwed by an angry Thor. Good if unique taste, rather a sweet note. Has good legs, at 5 to 6. Definitely worth getting when possible. Extraordinary body effects for a sativa. Get some and have intimate relations with the God of Thunder today!” – doobwalker\n\n\n“Leaping caribou, Batman! If this bud doesn’t embody the cold, rugged, wintery majesty that is the Alaskan wilderness, then I dont know what does. With notes of pine trees and freedom, this kush is optimum for white water rafting, eating a raw salmon, fighting a bear, or a combination of the three. Would ride a dog sled for miles in the dead of winter to get ahold of this weed. As in the words of the Eskimos this is some ‘ˈtʃaknaχ ˈhwaʁiχ’.” – wespeterson24\n\nLead image: Twentieth Century Fox Film Corporation",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/10/04153114/holy-cannabis-strain-reviews-batman.jpg",
            "title": "These Cannabis Strains Are So Good, They'll Make You Utter \"Holy ___, Batman!\"",
            "urlslug": "/news/strains-products/holy-cannabis-strains-batman"
        },
        {
            "author": "Lisa Rough",
            "category": null,
            "date": "/Date(1448568000000)/",
            "id": "contentitems-2967",
            "text": "After you’ve devoured every last ounce of gravy your stomach can handle, doused your pumpkin pie in whipped cream, and are now lying on the couch feeling somewhere between extremely satiated and \"I hate myself,” as Louis CK would put it, I’ll bet you’re thinking what I’m thinking: Some cannabis would be mighty fine right about now.\nAfter a hefty meal loaded with (delicious, delicious) carbs, you’re bound to be feeling bloated, possibly even a little bit nauseous. You think about counteracting your discomfort with some cannabis, but which strains will offer the best digestive aid?\nDon't worry, we're hear to help! Here are some strains to ease your aching tummy after a huge holiday meal.\n \n   Thin Mint GSC (f.k.a Girl Scout Cookies)\nThis hybrid cross has some pretty impressive origins – we all know the famous GSC (f.k.a Girl Scout Cookies) of legendary status. Cross that with Durban Poison from a continent away in South Africa, and you’ve got a powerhouse combination that will knock any uncomfortable indigestion out solid (although it might knock you out, too). As an added bonus, this strain tastes like a nice minty after-dinner treat!\n \n   SFV OG Kush\nSFV OG Kush is a heavy indica to top all heavy indicas. Of Afghani origins, crossed with OG Kush and SFV OG, this indica has a spicy citrus kick followed by a sleepy stone. Don’t hit this bad boy unless you’re ready to go down for the count.\n \n   Bay Dream\nLooking for something that’ll settle your tummy but won’t leave you in a coma? Check out this savory sativa. A cross of Blue Dream and Bay 11, Bay Dream has a soothing effect on the stomach, with a cerebral burst of euphoria. This is also an excellent strain if you’re looking for a creative boost to get some work done.\n \n   Ringo’s Gift\nRingo's Gift is best for those looking for a dose of pain relief with their relaxation. This peppery strain crosses Harle-Tsu and ACDC for a powerful full-body pain reliever without the stoney couchlock effect. The body buzz is strong, but the cerebral effects are subtle – you might be talking someone’s ear off for 20 minutes before you notice.\n \n   Chemo\nThis strain’s name really says it all. It was conceived to counteract the side effects of chemotherapy, and this is easily the top strain for anyone dealing with nausea, stomach cramping, or a loss of appetite. Keep in mind that Chemo is P-O-T-E-N-T, but it's the perfect choice if you’re looking for a comfy after-dinner snooze.\n \n   Blue Hawaiian\nFor a more subtle approach, this combination of the classic Blue Dream and Hawaiian Sativa will smooth out your stomach and give you a happy head high. It's a balanced hybrid, offering a tropical taste of pineapple and a sweet burst of blueberry. After a few puffs, you’ll be feeling super mellow without a care in the world.\n \n   Strawberry\nStrawberry flavors highlight another stomach-soothing sativa strain you can try. It's especially good for those who might be prone to anxiety, as Strawberry offers a calm, relaxing buzz without the paranoia that is often common in sativa strains. This one is also a great choice for those who have social anxiety, particularly if your relatives are *ahem* out-staying their welcome.\n \n   Pure Kush\nTried and true, this indica is a favorite for those looking to stop their pain dead in its tracks. This is the strain you’ll want if you’re looking to sedate yourself into a sleepy stupor. It starts with a little sativa surge for the first few minutes, followed immediately by a pleasant pressure in your head and face. Once you settle yourself after a little dose of Pure Kush, don’t make any plans because you won’t be moving from your spot for a while.\n \n   Maui Bubble Gift\nWith a name like that, this strain sounds a bit discombobulated, but that’s really just because it’s a delightful hybrid composed of the best of all worlds. With origins in Maui Waui, Bubble Gum, and God’s Gift, this strain really is a gift. It's This usually high in CBD, with a pleasantly cerebral buzz from Maui Waui, a blast of pain relief from Bubble Gum, and a gentle, caressing body stone that swoops in at the last minute. Your tummy troubles will soon be forgotten with Maui Bubble Gift!\n \n   Hashberry\nThis is a nice indica to try as an indigestion aid that won’t knock you out. Hashberry has resinous buds covered in sticky trichomes, so keep in mind that it’s not a strain for beginners. It has a soothing effect on muscles as well as offers full body relaxation while still allowing some degree of sociability. You’ll be giggly and relaxed without being comatose.\nThere you have it! By now, hopefully you've got your feet up, a smile on your face, and are experiencing blissful satisfaction (hopefully while wearing comfy, stretchy pants). Happy Turkey Day!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12001229/10-strains-to-aid-digestion-after-a-big-meal.jpg",
            "title": "10 Cannabis Strains to Aid Digestion After a Big Meal",
            "urlslug": "/news/strains-products/10-strains-to-aid-digestion-after-a-big-meal"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 32.82166782166782
        },
        {
            "name": "PTSD",
            "score": 20.574805574805573
        },
        {
            "name": "Migraines",
            "score": 14.599214599214598
        },
        {
            "name": "Fibromyalgia",
            "score": 10.625240625240625
        },
        {
            "name": "Arthritis",
            "score": 8.90852390852391
        }
    ],
    "description": "<p>SFV OG Kush, not to be confused with its precursor <a href=\"http://www.leafly.com/hybrid/sfv-og\">SFV OG</a>, is an indica-dominant strain bred from <a href=\"http://leafly.com/hybrid/og-kush\">OG Kush</a> genetics by The Cali Connection. By crossing an SFV OG clone with an Afghani father and selecting for favorable traits over several generations, the indica-heavy SFV OG Kush was born. You can smell the OG genes in this one, as its odor is commonly described as a strong lemon cleaner smell intermixed with pine.</p>\n",
    "descriptionPlain": "SFV OG Kush, not to be confused with its precursor SFV OG, is an indica-dominant strain bred from OG Kush genetics by The Cali Connection. By crossing an SFV OG clone with an Afghani father and selecting for favorable traits over several generations, the indica-heavy SFV OG Kush was born. You can smell the OG genes in this one, as its odor is commonly described as a strong lemon cleaner smell intermixed with pine.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 89.94725494725495
        },
        {
            "name": "Euphoric",
            "score": 79.02633402633403
        },
        {
            "name": "Happy",
            "score": 69.84753984753985
        },
        {
            "name": "Sleepy",
            "score": 60.858550858550856
        },
        {
            "name": "Uplifted",
            "score": 36.7956417956418
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 28.6979286979287
        },
        {
            "name": "Pine",
            "score": 25.494725494725493
        },
        {
            "name": "Lemon",
            "score": 21.560791560791564
        },
        {
            "name": "Sweet",
            "score": 13.828443828443827
        },
        {
            "name": "Flowery",
            "score": 10.49010549010549
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 56,
        "growNotes": "\n\tLonger flowering cycle tends to yield more aromatic buds\n\n",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1414062,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "You better get your wheelchair now, because you will need it. Smoked this bud with a friend at his trailer park while a bunch of senior citizens walked by, and they knew that we had that good good lmao. Anyways, this bud WILL give you a couch lock high, so beware. The flowers that I got were SUPER dense, rock solid. Super frosty nugs, you could definitely tell that they were an Og. This high creeped in on me, slowly numbing my body, legs first. Definitely recommend everyone to try it out, especially if you're an Indica fan.",
            "username": "GoochMaster27"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1638125,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "This strain is pretty sweet. Perfect for relaxing at the end of the day, for insomnia, and for alleviating some nighttime aches. ✌🏻💖🐝",
            "username": "amazonhippie"
        }
    ],
    "id": 101328,
    "name": "SFV OG Kush",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 35.84969584969585
        },
        {
            "name": "Dry Eyes",
            "score": 31.565411565411566
        },
        {
            "name": "Headache",
            "score": 24.022869022869024
        },
        {
            "name": "Anxious",
            "score": 7.827442827442828
        },
        {
            "name": "Paranoid",
            "score": 3.9739739739739735
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/sfv-og",
            "category": "Hybrid",
            "name": "SFV OG",
            "permalink": "https://mobileapi.leafly.com/hybrid/sfv-og",
            "slug": "sfv-og",
            "subtitle": null,
            "symbol": "Sfv"
        },
        {
            "applink": "leafly://strain/afghani",
            "category": "Indica",
            "name": "Afghani",
            "permalink": "https://mobileapi.leafly.com/indica/afghani",
            "slug": "afghani",
            "subtitle": null,
            "symbol": "Afg"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/sfv-og-kush",
    "photoTotalCount": 39,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/indica/sfv-og-kush/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/indica/sfv-og-kush/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/642833/b/sfv-og-kush__primary_46ab.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sfv-og-kush_100x100_1fe9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/589995/b/sfv-og-kush__primary_6c22.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sfv-og-kush_100x100_855d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/562964/b/sfv-og-kush__primary_0ed2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sfv-og-kush_100x100_eb1a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/512113/b/sfv-og-kush__primary_e991.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sfv-og-kush_100x100_f1e6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/493798/b/sfv-og-kush__primary_b19f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sfv-og-kush_100x100_6e09.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/481994/b/sfv-og-kush__primary_6b9f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sfv-og-kush_100x100_eaa7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Los Angeles, CA",
        "Portland, OR",
        "Denver, CO",
        "Phoenix, AZ",
        "Vancouver, WA",
        "McMinnville, OR",
        "San Francisco, CA",
        "Tacoma, WA",
        "Vancouver, BC",
        "Arnold, CA"
    ],
    "rating": 4.47,
    "relatedStrains": [],
    "reviewCount": 174,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "sfv-og-kush",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.46551724137931/240",
    "subtitle": null,
    "symbol": "Sfk",
    "symptoms": [
        {
            "name": "Stress",
            "score": 44.7982597982598
        },
        {
            "name": "Pain",
            "score": 39.09293909293909
        },
        {
            "name": "Depression",
            "score": 28.292523292523292
        },
        {
            "name": "Insomnia",
            "score": 24.223454223454223
        },
        {
            "name": "Lack of Appetite",
            "score": 23.778008778008775
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
