{
    "aka": "Royal Caramel",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1475440520000)/",
            "id": "contentitems-8229",
            "text": "Honey is an amazing substance — it’s a natural sweetener, a super-food with a nearly endless shelf life (if sealed properly), and has outstanding nutritional and medicinal benefits that can even help people adapt to local allergens (not to mention how delicious it is on baklava, peanut butter sandwiches, and in a cup of hot coffee or tea!).\nLeafly is home to over 60 specific strains that exhibit notes of honey. As your strain researcher and a passionate purveyor of fine cannabis, I’ve curated a shortlist of honey-flavored strains that will make your fingers sticky and your taste buds smile. Enjoy!\n   Panama Red\nPanama Red is best described as an old-school cannabis classic. Originating from Panama, this pure sativa rose to stardom in the late 1960’s thanks to its typical sativa effects: speedy and intense, bordering on psychedelic. As cannabis cultivation matured, Panama Red, which has a lengthy flowering time of at least 11 weeks, was left behind for faster growing strains and increased profits. However, those who fondly recall days of its prominence love its smooth medicating experience and loftily contemplate its revival. If you can get your hands on this sentimental throwback, do not hesitate to groove down memory lane and enjoy the ride.\n   Chocolate Thunder\nWhen you combine the sweet cocoa flavor of Chocolope with the strength and potency of Alaskan Thunder Fuck, you get none other than Chocolate Thunder. This clear-headed, active sativa may be all you need to inspire creativity or promote concentration, and patients will appreciate its ability to dull symptoms without fogging mental faculties. True to its name, Chocolate Thunder has a subtle sweet, earthy aroma similar to that of chocolate.\n   Thor’s Hammer\nThor’s Hammer by SnowHigh Seeds is an uplifting sativa strain that combines genetics from Vortex, Cinderella 99, and Acapulco Gold. Like a bolt of lightning commanded by the Norse god himself, Thor’s Hammer delivers an electrifying blast of cerebral energy that awakens creativity and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush fatigue and depression like the giants of Jotunheimr will likely find Thor’s Hammer to be the perfect weapon. You may also find a genetic variant of Thor’s Hammer from Alaska that instead combines God Bud and Sour Diesel in a more balanced indica-sativa hybrid cross.\n   Honey Banana\nHoney Bananas from Elemental Seeds is a heavy-handed hybrid strain bred from Strawberry Banana and Honey Boo Boo. This cannabis strain earns its name with a resinous coat as sticky as honey and an unmistakable banana aroma. She leans heavily toward the indica side of the family, providing weighty full-body effects coupled with an invigorating buzz of cerebral euphoria.\n   Lodi Dodi\nLodi Dodi is a sativa-dominant hybrid popular in Washington State. Exclusively bred by The Clone Zone, the genetic heritage of Lodi Dodi is undefined and closely guarded. Lodi Dodi carries a sweet, unique flavor of tropical fruit and fresh wildflowers. The pungent aroma leads the way towards a cerebral buzz, known to spark creativity and a boost of energy that will turn any task into a more enjoyable adventure.\n   Nebula\nThe Nebula marijuana strain was bred by Paradise Seeds in 1996. Its name means “Starcloud” and it has been known to “twinkle” with THC coating, with a head and body buzz described as intense and almost psychedelic. The buds have been known to smell and taste like honey, and flowering time is a minimum of 9 weeks. Nebula has won many awards, including 3rd place in the sativa category at the High Times Cannabis Cup in 1999 and 2nd place in 2005. It also took 3rd place at the Highlife Cup in 2004 in the Hydro category, and 1st place at the Copa La Bella Flor Spain in 2005.\n   Fortune Cookies\nFortune Cookies is a hybrid cannabis strain that combines the famed genetics of GSC (f.k.a Girl Scout Cookies) and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in GSC (f.k.a Girl Scout Cookies), but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty “couch-lock” effects typically associated with indica strains.\n   BC Sweet Tooth\nDeveloped in British Columbia by BC Bud Depot, BC Sweet tooth is an indica-dominant hybrid known for its quick flowering time and candy taste.  A hardy plant, this strain can be grown outdoors where it can flower in under 7 weeks, but it prefers the indoors where it may flower as soon as 6 weeks. The result of a cross with earlier generations of BC Sweet Tooth and classic Sweet Tooth, these sugary flowers are sure to satisfy your craving. The crystalline buds have a strong, sweet smell with a hint of citrus, and consumers report that this treat satisfies with a long-lasting, potent feeling that hits fast.\n   Danky Doodle\nOriginally named Double D as a reference to the large buds on these plants (we’ll let you make the connection there), breeder KC Brains decided to rename the strain Danky Doodle at the suggestion of some American friends in order to avoid confusion with the similarly named Double Dutch. Danky Doodle certainly isn’t a shy plant; it grows like the weed it is and will make its presence known with its pungent sweet smell. Plants flower at 9 to 11 weeks and should provide a high yield of large buds covered in a rich frost. This plant is a cross between several strains, and it’s no surprise that Big Bud is included in its lineage along with the strains Viking and the breeder’s own KC 636. The result is a strong indica that provides full body relief no matter what you call it.\n   Cream Caramel\nCream Caramel, named after its sweet caramel aroma, is a 90% indica cross between BlueBlack, Maple Leaf Indica, and White Rhino. Covered in a sugary coat of THC-rich resin, Cream Caramel delivers heavy, relaxing indica effects that soothe the mind and body. Though originally bred by Sweet Seeds in Spain, Royal Queen Seeds have also championed their own rendition called Royal Caramel. Early October is the finish line for outdoor Cream Caramel flowers, while indoor gardens should be harvested after a 7 to 8 week flowering period.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/02131126/cannabis-strains-that-taste-like-honey.jpg",
            "title": "Try These Cannabis Strains That Are as Sweet as Honey",
            "urlslug": "/news/strains-products/cannabis-strains-that-taste-like-honey"
        },
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1474398818000)/",
            "id": "contentitems-7785",
            "text": "Compared to most other cocktails and mocktails, punches are easy-peasy – combine all ingredients, stir, chill, and serve. In lieu of extensive preparation, the best punches are simply made by layering complementary flavors, and terpene-laden cannabis adds one more element of both flavor and effect, augmenting the overall experience of classic fall punch drinks.\nThe following autumnal drink recipes are adapted to accommodate the addition of cannabis tinctures. While any infused tincture you have on hand will do, we’ve recommended a few specific strains whose terpenes amplify each elixir. If you don’t have any tinctures handy, you can make your own, or check the menus of your favorite local dispensaries to find a place where you can pick one up.\n\nMix up a batch of one of the following, pop the pitcher in your fridge, and enjoy an extra-chill punch at your leisure. Cheers to fall!\nSparkling Sativa-Pear Punch\n\nThis pretty pink punch is ideal for the last few semi-sunny fall afternoons on the patio or porch. Whether you’re expecting company or cozied up on your own, keep plenty on hand so you’re ready whenever autumn calls for something to sip.\n\n2 parts pear nectar or pear juice\n2 parts Prosecco (make this a non-alcoholic punch with sparkling cider or lemon-lime soda)\n1 part cranberry juice\n10 mg-worth of cannabis tincture (suggested strains: sweet Candy Jack, tart Vortex, or floral Alice in Wonderland)\nGarnish: pear slice and/or freshly grated nutmeg\n\nAdapted from Sparking Pear-Prosecco Punch by Delish.\nCanna-Pome-Grapefruit Punch\n\nThis fruity pomegranate-grapefruit concoction marries your cannabis tincture with bright citrus notes and deep dark pomegranate colors and characteristics. It’s bold, beautiful, and guaranteed to put a smile on your face.\n\n2 parts pomegranate juice\n1 part grapefruit vodka (try Deep Eddy, Smirnoff, or Absolut – or omit the alcohol by subbing in soda water)\n1 part fresh-squeezed grapefruit juice\n10 mg-worth of cannabis tincture (suggested strains: fruit-punchy Dream Berry, grapefruit-orangey Citrix, or the descriptively-named Grapefruit)\nGarnish: pomegranate seeds or a grapefruit wheel\n\nAdapted from Pomegranate Grapefruit Punch by A Simple Pantry.\nAutumn Apple Indica Punch\n\nThis non-alcoholic apple punch is bona-fide fall in a glass: at once crisp, cool, juicy, and refreshing, it’s ratcheted up a notch by the addition of an indica-infused tincture. What better way to melt seasonal stress away?\n\n3 parts apple cider\n2 parts cranberry juice\n1 part ginger beer\n10 mg-worth of cannabis tincture (suggested strains: apple-vanilla Butter OG, honeyed Cream Caramel, or rich, sweet Love Potion #9)\nSqueeze of fresh lime juice\nGarnish: fresh cranberries and a cinnamon stick\n\nAdapted from Apple Orchard Punch by Allrecipes.\nNote: Always imbibe both cannabis and alcohol responsibly, and never drive after consuming either. When in doubt on the potency of your tincture, start with a small amount and work up – you can always add more, but you can’t add less.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/20132059/fruit-punch-header.jpg",
            "title": "Try These Cannabis-Infused Fall Punch Recipes That Use Fruity Strains",
            "urlslug": "/news/lifestyle/recipes-for-cannabis-fall-fruit-punch-drinks"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "ADD/ADHD",
            "score": 24.015401540154016
        },
        {
            "name": "Bipolar Disorder",
            "score": 20.742574257425744
        },
        {
            "name": "Cancer",
            "score": 20.495049504950494
        },
        {
            "name": "Migraines",
            "score": 20.495049504950494
        },
        {
            "name": "Epilepsy",
            "score": 20.247524752475247
        }
    ],
    "description": "<p>Cream Caramel, named after its <a href=\"http://www.leafly.com/explore/flavors-sweet\">sweet</a> caramel aroma, is a 90% <a href=\"http://leafly.com/indica\">indica</a> cross between BlueBlack, <a href=\"http://www.leafly.com/indica/maple-leaf-indica\">Maple Leaf Indica</a>, and <a href=\"http://www.leafly.com/hybrid/white-rhino\">White Rhino</a>. Covered in a sugary coat of THC-rich resin, Cream Caramel delivers heavy, <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\">relaxing</a> indica effects that soothe the mind and body. Though originally bred by Sweet Seeds in Spain, Royal Queen Seeds have also championed their own rendition called Royal Caramel. Early October is the finish line for outdoor Cream Caramel flowers, while indoor gardens should be harvested after a 7 to 8 week flowering period.</p>\n",
    "descriptionPlain": "Cream Caramel, named after its sweet caramel aroma, is a 90% indica cross between BlueBlack, Maple Leaf Indica, and White Rhino. Covered in a sugary coat of THC-rich resin, Cream Caramel delivers heavy, relaxing indica effects that soothe the mind and body. Though originally bred by Sweet Seeds in Spain, Royal Queen Seeds have also championed their own rendition called Royal Caramel. Early October is the finish line for outdoor Cream Caramel flowers, while indoor gardens should be harvested after a 7 to 8 week flowering period.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 119.60396039603961
        },
        {
            "name": "Sleepy",
            "score": 96.99669966996699
        },
        {
            "name": "Happy",
            "score": 89.0979097909791
        },
        {
            "name": "Euphoric",
            "score": 56.55665566556656
        },
        {
            "name": "Focused",
            "score": 56.36413641364136
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 99.03190319031904
        },
        {
            "name": "Earthy",
            "score": 28.525852585258527
        },
        {
            "name": "Coffee",
            "score": 25.005500550055007
        },
        {
            "name": "Woody",
            "score": 21.237623762376238
        },
        {
            "name": "Berry",
            "score": 20.495049504950494
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 60,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1413855,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Elegí cream caramel buscando una indica, y su olor y aspecto me llamó la atención. El punto de curado era perfecto, lo que siempre es de agradecer.\n\nLos cogollos son firmes y compactos, de un verde intenso y cubiertos de resina, que brilla y tiene tonos marrones, azucarados -entiendo que por el grado de maduración en que fueron cosechados.\n\nEl olor no es muy intenso. Es agradable, con tonos cítricos y dulces. No encuentro un tono claro a \"caramelo\", si bien hay notas muy dulces, pero predomina un elemento algo cítrico y otro matiz más tenue y en cierto modo terroso.\n\nEl sabor es inequívocamente dulce, si bien no muy fuerte. Hierba correcta, suave y sin estridencias.\n\nPega fuerte y rápido, con el clásico zumbido en la cabeza que baja rápidamente a los músculos. Relajante y tranquila, con efectos típicos de indica, músculos pesados. No tiene un efecto \"cierraojos\" inmediato, pero se nota mucho en el cuerpo. \n\nParece tener niveles altos de THC, y también bastante CBO o similares por sus efectos de relajación y bienestar.\n\nHierba tranquila, para ver una peli o para desconectar después de hacer deporte o del trabajo. Buena calidad, 4/5.",
            "username": "Adrenocromo"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1585949,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "It took me a bit of searching to find this under Caramel Cream. I bought this as Sweet Candy, as a heavy indica. I couldn't find SC on here, but seedbanks listed it as the same genetics and growing as CC. The buds have the same dark color and puffy appearance, and it definitely tastes sweet, while it creeps up on you with a tingling sensation and a slow, calm, focussed mind. Early on very couchlocked, later more sociable. But it is most definitely a true indica. I have been longing for one this strong since I started out with morning glory. Which used to be one of the heaviest, and possibly my favourite indica. But CC surpasses it as a calming, painkilling medicine. Absolutely no paranoia, very subtle CEVs, no audial hallucinations or anxiety. This is a very potent strain, and beginners should start slooow with this one, or it will catch them off guard like a second slice of spacecake. \n\nTL;DR: Good stuff. Chill, hang back, stare into space, without feeling like you're wasting time. Discover secrets of the universe but being like super chill about it. It's different, in many ways better than anything I've had and you want it.",
            "username": "SafetyLast"
        }
    ],
    "id": 83375,
    "name": "Cream Caramel",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 112.78877887788778
        },
        {
            "name": "Dry Eyes",
            "score": 25.748074807480748
        },
        {
            "name": "Anxious",
            "score": 23.520352035203523
        },
        {
            "name": "Headache",
            "score": 0.49504950495049505
        },
        {
            "name": "Dizzy",
            "score": 0.24752475247524752
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/maple-leaf-indica",
            "category": "Indica",
            "name": "Maple Leaf Indica",
            "permalink": "https://mobileapi.leafly.com/indica/maple-leaf-indica",
            "slug": "maple-leaf-indica",
            "subtitle": null,
            "symbol": "Ml"
        },
        {
            "applink": "leafly://strain/white-rhino",
            "category": "Indica",
            "name": "White Rhino",
            "permalink": "https://mobileapi.leafly.com/indica/white-rhino",
            "slug": "white-rhino",
            "subtitle": null,
            "symbol": "Wr"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/cream-caramel",
    "photoTotalCount": 41,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/677866/b/cream-caramel__primary_f0a4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cream-caramel_100x100_d570.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/638412/b/cream-caramel__primary_b01b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cream-caramel_100x100_724d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/594032/b/cream-caramel__primary_db02.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cream-caramel_100x100_e668.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/585009/b/cream-caramel__primary_6465.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cream-caramel_100x100_5b45.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/565749/b/cream-caramel__primary_ea47.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cream-caramel_100x100_a242.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/565687/b/cream-caramel__primary_9279.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cream-caramel_100x100_e225.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Las Vegas, NV",
        "Nanaimo, BC",
        "Salem, OR",
        "Shelton, WA"
    ],
    "rating": 4.2,
    "relatedStrains": [],
    "reviewCount": 87,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "cream-caramel",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.19540229885058/240",
    "subtitle": null,
    "symbol": "Cre",
    "symptoms": [
        {
            "name": "Stress",
            "score": 114.02640264026402
        },
        {
            "name": "Pain",
            "score": 86.98569856985698
        },
        {
            "name": "Insomnia",
            "score": 47.97579757975798
        },
        {
            "name": "Lack of Appetite",
            "score": 41.48514851485149
        },
        {
            "name": "Depression",
            "score": 27.53575357535754
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
