{
    "aka": "Master Jedi Kush, Master Jedi OG, Jedi Kush, Jedi OG",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1450378800000)/",
            "id": "contentitems-3003",
            "text": "The long-awaited Star Wars sequel The Force Awakens is here, which means it's time to load a bowl in celebration — and what better strains to pair it with than those with names like Skywalker, Ewok, and Jedi Kush? You'll notice that most of these strains are heavy indicas, so be sure to bring some snacks and comfy blankets to the new release or when you marathon episodes IV, V, and VI in anticipation of the latest chapter.\n \n \nDeemed \"the ultimate power in the universe,\" this Death Star indica isn't altogether unlike the moon-like superweapon of the Galactic Empire. A cross between Sensi Star and Sour Diesel, it delivers a blast of potent euphoria that annihilates stress and tension like the helpless planet of Alderaan, letting you ease into heavy full-body relaxation.\n \n \nThe Master Jedi indica is not meant for padawans — the crushing force of this sedating strains is meant only for those who have trained long and hard under the guidance of a true master. Ushering in tingly full-body sensations that bring peace to both mind and body, this strain is intended for those looking to attain the patience, tolerance, and receptivity required of the Jedi Order.\n \n \nLike the Endor natives this strain was named after, Ewok is a lighthearted and cheery option that evokes curiosity and creativity. These fuzzy little nugs are just what you need the next time you throw on Return of the Jedi to revisit the furry bears of the Forest Moon.\n \n \nDun, dun, dun, dun, dun-dun, dun, dun-dun! Darth Vader may be missing from The Force Awakens, but you can still honor his memory by indulging in the heavy-handed Darth Vader OG. As if commanded by the Sith Lord himself, this indica will leave you unable to resist sinking deeply into the couch while relaxing bliss invades the mind.\n \n \nLike the Rebel Alliance pilot himself, Skywalker OG will fly you across the galaxies with soaring euphoria. Perhaps the relaxing effects of this hybrid will provide you with all the patience you need to become a Jedi master, but don't underestimate its power — overdo this one and you'll find yourself too comfy to save the world from intergalactic tyranny.\n \n \nThe green, fuzzy buds of Yoda OG may not impart quite as much wisdom as its Jedi namesake, but it just might make you hungry enough to steal Luke Skywalker's dinner. This long-lasting indica is a perfect companion for a night of Star Wars marathons, but be careful with the force of this indica: too much and you'll be snoring before the opening lore finishes scrolling up your screen.\n \n \nThe Jedi Kush indica is meant to encourage the principles of Jedi Code through a peaceful and harmonious mindset. Harness the pacifying effects this indica has to offer and let it help you achieve a higher understanding and sympathy towards life of all forms.\nHungry for more Star Wars strains? Get a head start on 2016's May the Fourth holiday with these celebratory options!\n\nImage Source: JD Hancock via Flickr Creative Commons",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12001333/7-star-wars-strains-to-prepare-you-for-the-force-awakens.jpg",
            "title": "7 Star Wars Strains to Prepare You for ‘The Force Awakens’",
            "urlslug": "/news/strains-products/7-star-wars-strains-to-prepare-you-for-the-force-awakens"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1403218175000)/",
            "id": "contentitems-3563",
            "text": "They make us smile, they make us laugh, they make us stop mid-sentence and say, \"Wait. What?\" The Leafly Strain Review Hall of Fame has made its glorious comeback to celebrate the very best of your cannabis-fueled quirkiness. Yes, we take elevating the cannabis conversation seriously and we want to show the world that the cannabis community is comprised of mature, responsible individuals…but we can all share a harmless chuckle every once in a while, too.\nSo sit back, grab your favorite strain, and marvel at the amazing(ly hilarious) places our minds can sometimes go with a little help from our green friend. \n   Purple Haze\nFrom the producers that brought you Hermit Crab Hotbox comes the true story of a lost adventurer and his unlikely crawdad friend. A compelling tale of love and loss.\n\nTook me from down in the dumps to having a cool time. Went on an adventure and found a crawdad. I subsequently made friends with said crawdad and hung out with him. Man I miss Craymond.\n\n   XJ-13\nBecause butts are funny.\n\nAt one point i had tingling feelings in my butt. Great for hanging out.\n\n   Pure Power Plant\nYikes. At least Pure Power Plant was nice. (Also, we hope the scorpion made bail.)\n\nUsually when I get stung by a scorpion, I capture them and make them kill themselves by circling them with lighter fluid and then lighting it so they sting themselves in the back. Smoking pure power plant helped me to understand that scorpions aren't inherently aggressive creatures, they're just defending themselves according to their genetic patterns. I took him out to a field behind my house and was going to let him go but a cop stopped me and arrested me due to a warrant and now he's sitting in a small jar with my other personal belongings at the county jail pending my trial date next month :/ Pure power plant was nice.\n\n   Juicy Fruit\nThree profound questions that we may never have the answers to. May Juicy Fruit one day help us unlock these mysteries.\n\nJesus…is he real…will we ever be able to see…how the kids see the taste of cinnamon toast crunch…or are frosted flakes better\n\n   Master Jedi\nFriends are there to love and support you, to pick you up off the ground when the going gets rough. And to point out when you're unable to accurately interpret reality.\n\nThis got me so high that I was convinced that the street light outside my house was the moon. Luckily my friend pointed out that \"that's no moon.\"\n\n   Afghan Kush\nI would judge, except I think we've all been that guy with a dog bed hat at some point in our lives.\n\nSmoked this shit and I was walking in tunnels made of rainbows and then proceeded to have a chocolate bar fight while wearing dog beds as hats in a London [drugstore]\n\n   Purple Trainwreck\n\"The greatest pillow fort in all the land.\"\n\nI learned how to make the greatest pillow fort in all the land. No girls allowed, just me and my dog Jack (to be fair he came up with the password so I had to let him in).\n\n   Green Crack\nBecause no one has ever described the munchies better than this wordsmith.\n\nI get really hungry every time I smoke this. Like really hungry. Like whole left side of the taco bell menu hungry.\n\n   Maui Waui\nSome feats just deserve an entire chicken's worth of credit.\n\nSmoked a bowl of this and got inspired enough to clean my entire house. I felt incredibly accomplished and rewarded myself by eating a whole chicken.\n\n   Platinum Bubba Kush\nToday's lesson in sharing is brought to you by Platinum Bubba and the color purple.\n\nGreat floral taste and some of the strongest munchies ever. While we were on this strain, my friend asked if he could have some of the pizza I was making and I said no. I realized later that my munchies were so strong that I was not thinking rationally and of course split the pizza with him…and another. Make sure you have some Red Baron pizzas standing by in the freezer.\n\nPhoto credit: Kevin O'Mara via Flickr CC",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/06/12002845/the-leafly-strain-review-hall-of-fame-we-miss-craymond-too.jpg",
            "title": "The Leafly Strain Reviews Hall of Fame: We Miss Craymond, Too",
            "urlslug": "/news/strains-products/the-leafly-strain-review-hall-of-fame-we-miss-craymond-too"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 21.787148594377506
        },
        {
            "name": "PTSD",
            "score": 7.362784471218205
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 6.760374832663989
        },
        {
            "name": "Anorexia",
            "score": 6.45917001338688
        },
        {
            "name": "Fibromyalgia",
            "score": 6.157965194109773
        }
    ],
    "description": "<p>The secret of the Jedis may lie in this powerful plant. We can only assume that Master Jedi was created in the Galactic Republic, most likely as a cross between <a href=\"http://www.leafly.com/hybrid/master-kush\">Master Kush</a> and <a href=\"https://www.leafly.com/indica/jedi-kush\">Jedi&nbsp;Kush</a>. When growing, these younglings are bushy and generally high yielders. Once they flower at about 8 weeks, the buds will give off the distinctly musky aroma that kush strains are known for. These kush traits come through in the taste as well along with a lemony citrus aftertaste. The indica Force is strong with this one and it definitely promotes full body relaxation, so make sure you&rsquo;re ready to begin your training. Master Jedi may also be a Jedi 41 backcross.&nbsp;</p>\n",
    "descriptionPlain": "The secret of the Jedis may lie in this powerful plant. We can only assume that Master Jedi was created in the Galactic Republic, most likely as a cross between Master Kush and Jedi&nbsp;Kush. When growing, these younglings are bushy and generally high yielders. Once they flower at about 8 weeks, the buds will give off the distinctly musky aroma that kush strains are known for. These kush traits come through in the taste as well along with a lemony citrus aftertaste. The indica Force is strong with this one and it definitely promotes full body relaxation, so make sure you&rsquo;re ready to begin your training. Master Jedi may also be a Jedi 41 backcross.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 36.37884872824632
        },
        {
            "name": "Euphoric",
            "score": 33.065595716198125
        },
        {
            "name": "Happy",
            "score": 24.364123159303883
        },
        {
            "name": "Hungry",
            "score": 23.594377510040157
        },
        {
            "name": "Sleepy",
            "score": 21.4859437751004
        }
    ],
    "flavors": [
        {
            "name": "Spicy/Herbal",
            "score": 22.82463186077644
        },
        {
            "name": "Earthy",
            "score": 20.582329317269075
        },
        {
            "name": "Pungent",
            "score": 20.582329317269075
        },
        {
            "name": "Skunk",
            "score": 18.172690763052206
        },
        {
            "name": "Pine",
            "score": 15.629183400267738
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1389153,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "This got me so high that I was convinced that the street light outside my house was the moon. Luckily my friend pointed out that \"that's no moon\"",
            "username": "NorrinRadd"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1577223,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/2/240",
            "text": "much like you Ky-lo Ren this strain is lost and confused. No distinct taste, burned my throat a little while smoking it. Wish the high were stronger",
            "username": "MMJsupporter"
        }
    ],
    "id": 41460,
    "name": "Master Jedi",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 38.45381526104417
        },
        {
            "name": "Dry Eyes",
            "score": 24.63186077643909
        },
        {
            "name": "Dizzy",
            "score": 11.713520749665328
        },
        {
            "name": "Headache",
            "score": 11.41231593038822
        },
        {
            "name": "Anxious",
            "score": 0.6024096385542169
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/master-kush",
            "category": "Indica",
            "name": "Master Kush",
            "permalink": "https://mobileapi.leafly.com/indica/master-kush",
            "slug": "master-kush",
            "subtitle": null,
            "symbol": "Mks"
        },
        {
            "applink": "leafly://strain/jedi-kush",
            "category": "Indica",
            "name": "Jedi Kush",
            "permalink": "https://mobileapi.leafly.com/indica/jedi-kush",
            "slug": "jedi-kush",
            "subtitle": null,
            "symbol": "Jed"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/master-jedi",
    "photoTotalCount": 13,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/396150/b/master-jedi__primary_dc82.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/master-jedi_100x100_155a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/394477/b/master-jedi__primary_37d3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/master-jedi_100x100_525f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/268010/b/master-jedi__primary_f180.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/master-jedi_100x100_7b0d.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/256491/b/master-jedi__primary_7a3b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/master-jedi_100x100_3ac7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/256267/b/master-jedi__primary_5485.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/master-jedi_100x100_11b2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/187693/b/master-jedi__primary_65d0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/master-jedi_100x100_564b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Toronto, ON",
        "Montréal, QC",
        "Calgary, AB",
        "Edmonton, AB",
        "Hamilton, ON",
        "Mississauga, ON",
        "Ottawa, ON",
        "Saskatoon, SK",
        "Vancouver, BC",
        "Winnipeg, MB"
    ],
    "rating": 4.36,
    "relatedStrains": [],
    "reviewCount": 73,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "master-jedi",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.35616438356164/240",
    "subtitle": null,
    "symbol": "Mjd",
    "symptoms": [
        {
            "name": "Stress",
            "score": 24.799196787148592
        },
        {
            "name": "Insomnia",
            "score": 15.327978580990628
        },
        {
            "name": "Fatigue",
            "score": 9.170013386880857
        },
        {
            "name": "Inflammation",
            "score": 7.362784471218205
        },
        {
            "name": "Depression",
            "score": 6.927710843373494
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
