{"sl_translate":"description,descriptionPlain,category","id":102320,"slug":"bubblegum-kush","name":"Bubblegum Kush","subtitle":null,"symbol":"Bgk","category":"Indica","description":"\u003cp\u003eAn 80% indica strain from Bulldog Seeds in the Netherlands, Bubblegum Kush is a cross between \u003ca href=\"https://www.leafly.com/hybrid/bubble-gum\"\u003eBubble Gum\u003c/a\u003e and an undisclosed Kush. An easy-to-grow plant that produces huge yields of frosty, resinous buds, it is popular with growers and hash-makers alike. Bubblegum Kush has a sour smell and flavor, and with a THC content in the 18% range, this indica will leave users fully relaxed and glued to the couch.\u003c/p\u003e\n","descriptionPlain":"An 80% indica strain from Bulldog Seeds in the Netherlands, Bubblegum Kush is a cross between Bubble Gum and an undisclosed Kush. An easy-to-grow plant that produces huge yields of frosty, resinous buds, it is popular with growers and hash-makers alike. Bubblegum Kush has a sour smell and flavor, and with a THC content in the 18% range, this indica will leave users fully relaxed and glued to the couch.\n","aka":"bubble gum kush","rating":4.34,"highlightedReviews":[{"id":1391914,"username":"meangreenduramax747","text":"My favorite strain so far. Long, strong head and body stone. Spicy smell, and a great strain right before bed. Smoke is a bit rough, but has a great flavor being sweet and a little spicy. Stone lasts for hours.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1638842,"username":"Definitelyauser","text":"Literally the one strain I always tell people to get. Tastes like bubblegum. Favorite strain by far!!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-49637","title":"The 13 Best Cannabis Strains for Parties","author":"Brett Konen","category":null,"date":"\/Date(1511383998000)\/","text":"A lot of people think of alcohol as the classic social lubricant. For some of us, it is. Alcohol can loosen us up, make us chatty and animated, and wash away social anxiety. It’s also often readily available at social occasions. Meanwhile, many people avoid cannabis use during social events—for one thing, it’s generally not served, and for another, many can recall a time cannabis made them paranoid or sleepy at a party, and don’t want to have that happen again.\n\nLuckily, with the right strains you can avoid the unwanted effects mentioned above. We used the advanced filters in Leafly’s strain explorer to get started, sorting to include strains with the happiest, most talkative highs, and to exclude any strains that make users anxious, paranoid, or sleepy. (If only alcohol’s drawbacks were so easy to filter out, am I right?)\nWe’ve curated the resultant list with our in-house expertise, vetting all suggestions against our own experiences and ensuring there’s a pick for every type of party. Attendees heading to any social occasion will find something below.\nAnd the awards for the best party cannabis strains go to…\nChocolope\nStrain type: Sativa\nBest for: All occasions.\nDNA Genetics developed Chocolope by crossing Chocolate Thai with Cannalope Haze to create their homage to the super-popular Chocolate strains of the 1980s. The hefty sativa buds give earthy, sweet coffee flavors that provide a dreamy, cerebral effect. It’s known around the Leafly office as “the party strain,” and for good reason—it’s basically impossible to be unhappy or introverted with such a feel-good high.\n\nWhite Russian\nStrain type: Hybrid\nBest for: Dinner parties.\nOriginally created by Dutch breeders Serious Seeds, White Russian is a cross of two legendary strains, White Widow and AK-47. An indica-dominant hybrid, it won the High Times Cannabis Cup “Best Overall” in 1996. White Russian is an extremely fragrant plant, and with a flavor that is smooth and spicy with undertones of skunk and earth, and its high is quite cerebral (especially for an indica-dominant strain), making it great for conversation with those around you.\nTangie\nStrain type: Sativa\nBest for: Cocktail parties.\nAnother fave among the Leafly crew, particularly for group gatherings after work, Tangie is a fantastic offering from DNA Genetics in Amsterdam. This strain is a remake of sorts of the popular version of Tangerine Dream that was sought-after in the 1990s, with genetics derived from a cross of California Orange and a Skunk hybrid. Its citrus heritage is the most evident in its refreshing tangerine aroma.\nBlue Goo\nStrain type: Hybrid\nBest for: Friends and family gatherings.\nBlue Goo is a sativa-dominant hybrid that’s a cross between the famous hybrid Blue Dream and indica Afgoo. A moderate to high potency yields uplifting effects that are standard for sativas, but not excessively energetic thanks to Afgoo’s contribution as well as the mellow nature of Blue Dream. This strain is appropriate for day or nighttime consumption and provides smooth smoke and berry flavor.\n\nSour Lemon OG\nStrain type: Hybrid\nBest for: Birthday parties.\nBred by Emerald Triangle Seeds, Sour Lemon OG is a sativa-dominant hybrid cross between California Sour and Lemon OG. This 65% sativa strain is named after its aromatic sour smell with recognizable notes of lemon, lime, and apple. Sour Lemon OG elevates the mind and body simultaneously, making this a natural go-to strain for celebrations, social engagements, or even just a busy day.\nBlue Diesel\nStrain type: Hybrid\nBest for: Happy hour.\nDaughter of indica-dominant Blueberry and sativa-dominant NYC Diesel, Blue Diesel (also known as Blue City Diesel) falls slightly on the indica side of things with a pleasant, moderate- to long-lasting body buzz (perfect if you want to extend the happy for more than an hour). Thanks to its Blueberry genetics, this flower emanates a light berry aroma that is smooth, expansive, and fast-acting. This strain is optimal for daytime use, and relaxes the consumer in social settings without putting you to sleep.\nPez\nStrain type: Indica\nBest for: Cannabis-focused parties.\nPez is an indica daughter of Afghani and Pakistani strains. These sweet, frosty buds offer the relaxation typical of indicas without the drowsiness, making the strain great for daytime use. We recommend this one as a shareable contribution to any 420-friendly gathering—it’s also on our list of the Top 100 Must-Try Strains, meaning it will be a particularly popular addition to any event with open cannabis consumption.\n\nOrange Bud\nStrain type: Hybrid\nBest for: Hosting.\nMatching plenty of social energy with a dose of subtle relaxation, this strain is perfect for gatherings where you’re in charge and want to stay upbeat and level-headed. First bred in 1980s by Dutch Passion, Orange Bud is a combination of two members of the 100% Skunk family. With bright orange hairs coating the surface, it showcases scents of orange and nectarine.\nBlueberry Headband\nStrain type: Hybrid\nBest for: Parties you don’t want to attend.\nSeveral renditions of the Blueberry Headband hybrid are known to exist, but the original Blueberry Headband from NorCal’s Emerald Triangle Seeds is the most well-known. It’s a 50/50 indica-sativa hybrid that smells of diesel, berries and pepper, and it produces a perfectly balanced high with a nice cerebral rush and relaxing body effects. This is great for staying sufficiently present while mentally floating high above any social event you wish you didn’t have to attend (think work parties, baby showers, and so on).\nBanana Kush\nStrain type: Hybrid\nBest for: Potlucks.\nThis legendary West Coast strain crosses Ghost OG and Skunk Haze to create an indica-dominant hybrid that tastes and smells like a bushel of fresh bananas (and will whet your appetite if there’s food around). Although it leans towards an indica genetically, the effects are balanced by the Haze’s mellow sativa buzz that provides a relaxed sense of euphoria. Banana Kush also help its consumers remain talkative in social settings.\n\nDurban Cookies\nStrain type: Sativa\nBest for: Loud parties.\nDurban Cookies is the Durban Poison-dominant phenotype of GSC. Known for its invigorating mental energy and body buzz, Durban Cookies offers a more energizing experience, making this sativa-dominant strain a top choice throughout the day and into the evening, particularly if you’re headed to a high-energy event where you’ll be surrounded by music, people, and movement.\nBubblegum Kush\nStrain type: Indica\nBest for: Low-key get-togethers.\nThis strain is for laid-back social situations; it’ll leave you relaxed and comfy on any given couch, but also chatty and ready to hang with whoever sits down next to you. An 80% indica strain from Bulldog Seeds in the Netherlands, Bubblegum Kush is a cross between Bubble Gum and an undisclosed Kush, and has a satisfyingly sour smell and flavor.\nStrawberry\nStrain type: Sativa\nBest for: Being a plus-one.\nOriginally bred in the Netherlands, Strawberry is a mostly sativa cannabis strain with a pungent fruity scent and uplifting effects. Consumers prone to anxiety choose Strawberry for its stress-relieving qualities without the jarring paranoia common among high-THC strains (which makes it great for small talk with people you don’t know). Comfortable and relaxing, Strawberry brings with it a hearty dose of physical and mental ease.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/22124021/best-cannabis-strains-for-parties.jpg","urlslug":"/news/strains-products/the-13-best-cannabis-strains-for-parties"},{"id":"contentitems-3591","title":"The Top Trending Cannabis Strains of 2015","author":"Bailey Rahn","category":null,"date":"\/Date(1451246400000)\/","text":"Looking back at 2015, I can’t help but play a nostalgic montage in my head of all the strains that came and went over the year. Legal markets are becoming saturated with choices, so much so that it’s impossible to determine 2015’s best cream of the crop. Instead, we took a look at the fastest growing strain trends based on Leafly reviews and determined which varieties made the biggest splash last year.\nDispensaries and rec shops, you better keep your eye out for these rising stars in 2016! You’ll definitely want them blessing your shelves.\n \n\n \n#1. GG4 (f.k.a Gorilla Glue #4)\n \nGG4 (f.k.a Gorilla Glue #4) blew it out of the water this year with an astounding 906% increase in user ratings and reviews. That kind of growth is pretty mind-blowing, but if you’ve tried Gorilla Glue, it starts to make sense.\nEven through a sealed container, I could pick up every intricacy of its aroma: earthy pine soured by loud notes of skunky diesel. Trying to pry the buds apart, I can see how this champ got its name; the resin oozing from these trichomes might as well be heavy-duty adhesive. In describing the effects, I can say it no better than this Leafly reviewer who wrote, “I needed a seatbelt for reality.” Me too, dude.\n \n#2. Critical Kush\n \nHeir to the Critical Mass throne is Critical Kush, an indica strain that saw a staggering 407% increase in user engagement this year. By crossing Critical Mass with the West Coast favorite OG Kush, it’s no surprise that Critical Kush is taking off in the U.S. A subtle citrusy lemon OG aroma adds a layer of interest to Critical Mass’ muted hashy and earthy flavors, and its moderate CBD content complements its THC-rich profile for beautifully relaxing effects that one Leafly user compares to a slow massage.\n \n#3. Candyland\n \nCandyland grew almost 380% this year, making it the fastest growing sativa among Leafly users in 2015. The first thing most people note about this strain is its strikingly sweet flavor, a quality that’s earned this strain her name. Its twisting hues of blue, purple, white, and green are also something to write home about, as well as its dueling effects that balance gracefully between relaxing and uplifting. Candyland has been called “a work of art” by Leafly users, while another claimed it was “By far one of the best strains I had of 2015.” Apparently everyone else agrees.\n \n#4. ACDC\n \nNext up is ACDC, a high-CBD hybrid that grew 356% this year. I believe it. A lot of high-CBD strains I’ve tried have a grassy, hay-like aroma and a scraggly appearance, but ACDC is a refreshingly beautiful anomaly. Sweet, zesty lemon notes burst from its crystal-coated buds in an impressively fragrant introduction to its relaxing, clear-headed effects. Reviewers rave over its ability to chase off pain and anxiety without cerebral euphoria or mental cloudiness, which can make all the difference in many medical patients’ lives.\n \n#5. Bubblegum Kush\n \nStep aside, Bubble Gum. Your Kush-infused offspring is taking center stage with a yearly growth rate of 284%. Maintaining a sweet floral and bubble gum aroma, this hybrid gets its enhanced resin production from its hash monster of its second parent, Hindu Kush. It may anchor your body with a physical heaviness, but many reviewers claim this strain still leaves the mind agile and motivated.\n \n#6. Sunset Sherbet\n \nOnce upon a time, you’d see its parent GSC (f.k.a Girl Scout Cookies) on this list, so it comes as no surprise that the offspring Sunset Sherbert is dominating the market with a year-over-year growth rate of nearly 276%. As one reviewer wrote, Sunset Sherbert “smells as if heaven cracked open its Mason jars and said ‘enjoy.’” Yes, it’s that good.\n \n#7. Tangie\n \nClimbing 236% in ratings and reviews this year, the Tangie sativa is a flavor masterpiece. Its aroma spans the entire citrus spectrum with fruity notes of orange, lemon, lime, and grapefruit. Even if this strain didn’t have its amazingly uplifting and upbeat effects, I bet you’d still buy this strain for its flavor alone.\n \n#8. Jedi Kush\n \nEither Star Wars fans spent the entirety of 2015 enjoying Jedi Kush in anticipation of the new sequel or it really is that good, because this indica grew 235% among Leafly visitors. It hits with the force of a Jedi master, delivering heavy-handed euphoria that’ll launch you to a galaxy far, far away.\n \n#9. Animal Cookies\n \nAlso called Animal Crackers, this powerhouse hybrid hiked 224% in 2015. This one’s known to reach impressively high THC heights and provide stupefying effects that can knock out even the most seasoned veteran. As one Leafly reviewer poetically describes it, Animal Cookies is a “soothing, nap-time, I-wish-I-had-money-for-pizza, loving-my-1,000-thread-count-sheets strain.”\n \n#10. OG #18\n \nWith an annual growth rate of 210%, OG #18 (AKA Private Reserve) gained quite a bit of momentum this year. This supreme OG Kush phenotype has snagged numerous awards for its potency, and fans of OG genetics will appreciate how this hybrid captures and enhances the most cherished qualities of OG Kush: its pungent diesel, lemon, and pine flavors; a thick and sticky coat of resin; high-flying euphoria; and pain-relieving anesthetic effects that patients gush over.\nDispensaries, you might want to update your Leafly listing menus to include these trending strains. Don’t have a Leafly listing? We can fix that!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12002930/top-trending-cannabis-strains-of-2015.jpg","urlslug":"/news/strains-products/top-trending-cannabis-strains-of-2015"}],"reviewCount":298,"flavors":[{"name":"Sweet","score":44.202729951915622},{"name":"Earthy","score":20.452665322372162},{"name":"Pungent","score":16.321544904606792},{"name":"Spicy/Herbal","score":12.719094152318908},{"name":"Honey","score":11.904761904761905}],"effects":[{"name":"Relaxed","score":95.771935267049258},{"name":"Happy","score":68.685693604260379},{"name":"Uplifted","score":58.977043586164108},{"name":"Sleepy","score":56.005377178015621},{"name":"Euphoric","score":53.54428416317667}],"symptoms":[{"name":"Stress","score":29.957085983144609},{"name":"Depression","score":26.680368129879525},{"name":"Insomnia","score":24.909518639160332},{"name":"Lack of Appetite","score":23.871568171242437},{"name":"Fatigue","score":19.882632749082259}],"conditions":[{"name":"Anxiety","score":23.342898505764957},{"name":"ADD/ADHD","score":17.359495372524687},{"name":"Migraines","score":12.332609482446616},{"name":"PTSD","score":10.521689674784136},{"name":"Asthma","score":5.7184220050669561}],"negatives":[{"name":"Dry Mouth","score":49.554056150147353},{"name":"Dry Eyes","score":19.923995656894679},{"name":"Anxious","score":15.893697326922082},{"name":"Dizzy","score":10.847422573806938},{"name":"Headache","score":9.21875807869293}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/indica/bubblegum-kush/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/indica/bubblegum-kush/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/bubblegum-kush_100x100_555c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645450/b/bubblegum-kush__primary_0753.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/bubblegum-kush_100x100_4470.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645324/b/bubblegum-kush__primary_f00b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/bubblegum-kush_100x100_7e4f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645388/b/bubblegum-kush__primary_0cad.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/bubblegum-kush_100x100_a955.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/600565/b/bubblegum-kush__primary_e80c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/bubblegum-kush_100x100_9d26.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/598858/b/bubblegum-kush__primary_f106.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/bubblegum-kush_100x100_26a0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/596266/b/bubblegum-kush__primary_c793.jpg"}],"photoTotalCount":86,"popularCities":["Portland, OR","Bellingham, WA","Bremerton, WA","Detroit, MI","Everett, WA","San Jose, CA","Seattle, WA","Spokane, WA","Eugene, OR","Glendale, AZ"],"permalink":"https://mobileapi.leafly.com/indica/bubblegum-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.34228187919463/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Bubble Gum","subtitle":null,"slug":"bubble-gum","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/bubble-gum","symbol":"Bg","applink":"leafly://strain/bubble-gum"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":56,"outdoorFinish":null,"height":null,"averageYield":"High","environment":null,"growNotes":"\n\tYield can be expected to fall between 600 and 700 grams per square meter\n\n"}}
