{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1475690456000)/",
            "id": "contentitems-8012",
            "text": "I grew up watching Adam West and Burt Ward thwart evildoers after school. Back then I would saunter into the living room and settle down in front of our JC Penney television to admire the collected demeanor of gentleman millionaire Bruce Wayne and his eager ward/sidekick as they unraveled the nefarious tapestry of evil that had been subtly stitched together with sinister subterfuge. (Apparently alliteration attracted audiences back then; or, if nothing else, it gave the dialogue a poetic quality.)\nOne of the most famous turns-of-phrase that came out of the dynamic duo of the mid-60s was Robin’s, “Holy ___, Batman!” This particular set of words arises hilariously often in strain reviews, so without further ado, here’s a small sampling of some of my favorites. Holy strain reviews, Batman!\nHybrid Cannabis Strains\n   GSC (f.k.a Girl Scout Cookies)\n\n“Holy carp fish, batman. This is magic. Definitely gives you a floaty, yet energized feel. You feel it creeping up behind your eyes and in two shakes of a lambs tail, you’re high as goddamn ever.” – Anonymous\n\n   Fruity Pebbles\n\n“Holy hand grenade of Antioch, Batman. Smoking this is like watching high speed film of a remote detonation. But a detonation of giggles and time slippage. Bring this to game-night at the beach. I did, and I’m very happy about that. Social, happy, very fast acting. The super-high phase came on within 5 minutes and lasted about 10-20 minutes. After words a really happy normal to low key high kicked in and took the wheel for around 3 hours. Two of us fell asleep during this time and three of us had energy to spare.  A very solid night sleep followed for me.” – ChestyMcDeathrack\n\n   Chemdawg\n\n“Holy space balls batman. I think we’ve got a winner right here. Toked a small bowl last after a month of FireOG and White Widow. Let me tell you I nearly tripped my balls out. I had a legit out of body experience lying in bed with my wife after smoking. Needless to say I couldn’t sleep. Headed down to TV land, Jay Leno’s new show is pretty good.” – jamtastic\n\nIndica Cannabis Strains\n   Superman OG\n\n“Holy sh*t Batman, I just found one of the newest to my Top 10!!! Dare I say to the coveted #1 slot?!? Honestly, I love ALL strains but you know the standouts and this strain STANDS out! When the description uses the word ‘pungent’, yep, it IS pungent and smokes the same. I usually cough during a bowl but the HIGH it totally worth it!! Definitely agree with many, this is NOT for beginners starting on meds like this but for everyone else, if you come across Superman, GET YOU SOME, you will not be disappointed!!! Believe it or not, this doesn’t really knock me out like others I know that have came across it but DAMN, I love the deeply euphoric, giggly, happy, relaxing high, one the best I’ve felt. Thank you GROWERS of this strain, your the BEST!!!” – dhlvisdrt\n\n   SFV OG Kush\n\n“Holy amazing sleep, Batman! SLEEPIES!! This knocked my ass OUT – I haven’t slept in 2 days and this let me sleep for 7 hours straight, didn’t even move. Super important different between this ‘Kush’ and regular OG…. Smelled like pine, a bit pungent, woody, lemon/citrus, and a slight herbal scent with a little spicy kick. This OG Kush combination is an amazingly super light and smooth smoke! Packed 1/2 a bowl and it tasted like sweet flowers, pine, dankish, and herbal, like tearing open a packet of tea. Went straight to my head and my face was nuuuuumb. Helped my spine amazingly well 5/5, took my kidney stone pain down to 30%, felt cold spots in my back where it hurts, helped with my tendon pain 3/5, and a little bit of nerve pain 2/5 – noticeable enough. No munchies, I passed out – definitely a night time use, great for insomnia. Hits heavy, so I wouldn’t use this as a beginner unless you have insomnia – this is your golden ticket!” – Midnyte003\n\n   G-13\n\n“uuuuuuhhhhh…. I don’t remember what I was doing. or anything at all for that matter. where am i, who am i. it’s about like that. lol. by far the best escape from reality I’ve ever experienced personally if u wanna sit back and chill and just not give a shit about a freaking thing period simply cause u can’t remember a freaking thing. this one is an absolute must try to believe what it can actually achieve for you. review does no justice cause it simply cannot be explained in words properly. has to be experienced personally to know. I just got my first experience with it and will definitely be getting again any and every time I have chance. HOLY MOLY COW BATMAN!!!!” – 247kushpuffer\n\nSativa Cannabis Strains\n   Crystal Coma\n\n“Holy high, Batman! This is some amazing product! Awesome high, good upper, and I’m not a space cadet either! Perfect for a ‘getting shit done but still would like to smoke’ day.” – Anonymous\n\n   Sour Diesel\n\n“Holy racing heart beat and heart pounding out of my chest batman! Everyone has the same experience.” – Anonymous\n\n   East Coast Sour Diesel\n\n“Holy Batman! This thing is like a triple dose of espresso for me! Makes me so hyper I cannot sit still LOL.! Energetic for sure, good for picking up the afternoon blehs. Also gives you an appetite. I don’t think I’ll smoke this at night or I’ll be sleepless!” – HappilyPainFree\n\n   Alaskan Thunder Fuck\n\n“Holy sweet jumped up sativa, Batman. This has to be the most aptly named strain yet. As powerful and as potent as being screwed by an angry Thor. Good if unique taste, rather a sweet note. Has good legs, at 5 to 6. Definitely worth getting when possible. Extraordinary body effects for a sativa. Get some and have intimate relations with the God of Thunder today!” – doobwalker\n\n\n“Leaping caribou, Batman! If this bud doesn’t embody the cold, rugged, wintery majesty that is the Alaskan wilderness, then I dont know what does. With notes of pine trees and freedom, this kush is optimum for white water rafting, eating a raw salmon, fighting a bear, or a combination of the three. Would ride a dog sled for miles in the dead of winter to get ahold of this weed. As in the words of the Eskimos this is some ‘ˈtʃaknaχ ˈhwaʁiχ’.” – wespeterson24\n\nLead image: Twentieth Century Fox Film Corporation",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/10/04153114/holy-cannabis-strain-reviews-batman.jpg",
            "title": "These Cannabis Strains Are So Good, They'll Make You Utter \"Holy ___, Batman!\"",
            "urlslug": "/news/strains-products/holy-cannabis-strains-batman"
        },
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1465740000000)/",
            "id": "contentitems-3135",
            "text": "It’s important to celebrate our heroes. Real or imaginary, these men and women help us define our ideal selves. Sometimes these heroes are imbued with superhuman abilities, like the power of flight or telepathy, but much of the time, the attributes that make a superhero are inherently human. Heroes are characters that stand up for the weak and defenseless. They go beyond the call to raise up their fellow man. Heroes are not indestructible, but simply willing to give more of themselves without the need of thanks or admiration.\nYes, heroes are among us and within us, and on this day devoted to Superman, the Übermensch, I’ve curated a shortlist of strains that will imbue you with superhuman sensations that will hopefully enable you to do something heroic…or at least conquer the villainous forces of laziness and depression. Up, up, and away!\n \nAllen Wrench\n \n“This strain is pow!!! Gets you a super uplifting high with a great taste and smooth smoke not very harsh at all even when the bowl is almost ass and still tastes good and the smell is unbelievable super earthy citrus and could smell it from across my house, great strain won’t regret.” – sillbillybro\n \nMaui\n \n“Beautiful strain came on subtle and took over my whole body for a wonderful ride. I have permanent nerve damage due to an IED this stuff makes me feel like superman.” – Dungy51\n \nKryptonite\n\n“Yup. So that’s what Superman feels like when he is flying. I got a top shelf, frosty, extra strength dose of this stuff. I hit in a vape… Pure, tasty and then BOOM! This stuff is no joke. . .tread lightly.” – Rhobert\n \nSuperman OG\n \n“Faster than a speeding bowl-hit, more powerful than locomotive, it’s Superman OG! This wax is dank. Be sure to get it while it lasts at Delta-9 Association in San Jose.” – tgigrass\n \nIncredible Hulk\n \n“Very tasty, high energy strain. Perfect morning smoke to get your day started and the creative juices flowing, but smoke any more than a bowl and it hits you like a train with an incredibly strong cerebral high. Oh, and have some snacks ready because this shit is guaranteed to give you some extreme munchies.” – absentia882\n \nChemdawg\n \n“8/10: I like this one a lot. She’s very much like an OG Kush but more leaning on the lighter side in terms of effects. She’s not gonna get ya stoned out ya brains, but what she does offer you is a nice full body high and the ability to eat 1,467,279 cheeseburgers and fries. So smile, relax, and just know everything’s gonna be just fine J” – beelzebub\n \nCinderella 99\n \n“‘I am, I am, I am Superman, and I can do anything’… are not just lyrics from the R.E.M. song, but that’s how you will feel after smoking Cinderella 99. I felt like Superman flying over Market Street in San Francisco. It was an uplifting feeling. When I came back down to earth, I got wobbly legs and a pretty bad case of paranoia, all the people on the sidewalk with their shopping bags, the street performers were making me feel dizzy. That lasted maybe five minutes, then I felt like that first time you got baked, I mean really high. Time slows down, and you feel like everyone in the world knows you’re high. Fun times. I highly recommend for absolutely eliminating anxiety, stress, and aches and pains, just don’t overdo it. Go easy with this one.” – blackhawks15\n \nWhile these strains might not make you leap over a building in a single bound, shoot lasers out of your eyes, or tear a phone book in half, they should pack a physical stimulation that encourages a sense of wellbeing that traverses the sativa/hybrid/indica continuum. Each strain is suited for a series of semi-heroic deeds that may include making a cape out of bed sheets or other household objects, jumping on a trampoline while wearing said cape, and donning a fist-forward flying motion while walking/running anywhere. Go forth, do good, and live on!\n“I’m not a prophet or a stone aged man, just a mortal with potential of a superman. I’m living on.” – David Bowie",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001722/heroes-among-us-7-cannabis-strains-that-make-you-feel-like-superm.jpg",
            "title": "Heroes Among Us: 7 Cannabis Strains That Make You Feel Like Superman",
            "urlslug": "/news/strains-products/heroes-among-us-7-cannabis-strains-that-make-you-feel-like-superm"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 27.625313283208023
        },
        {
            "name": "Arthritis",
            "score": 11.109022556390977
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 10.845864661654135
        },
        {
            "name": "PTSD",
            "score": 9.3859649122807
        },
        {
            "name": "Spinal Cord Injury",
            "score": 8.859649122807017
        }
    ],
    "description": "<p>Superman OG is a must try for cannabis connoisseurs. The product of <a href=\"http://www.leafly.com/indica/tahoe-og\">Tahoe OG</a> and <a href=\"http://www.leafly.com/indica/bubba-kush\">Bubba Kush</a>, this hardy indica is both incredibly potent and exceptionally well bred. Following a long line of kush genetics, Superman OG provides a strong heavy body sensation and will put you to sleep in a hurry. While great for pain management, muscle spasms, and insomnia, Superman OG&rsquo;s potent sedative effects make it a strictly nighttime strain. The aroma of this indica is nearly as strong as its effects. Featuring a strong skunk-like scent and piney taste, Superman OG is extremely pungent and not for the novice patient.</p>\n",
    "descriptionPlain": "Superman OG is a must try for cannabis connoisseurs. The product of Tahoe OG and Bubba Kush, this hardy indica is both incredibly potent and exceptionally well bred. Following a long line of kush genetics, Superman OG provides a strong heavy body sensation and will put you to sleep in a hurry. While great for pain management, muscle spasms, and insomnia, Superman OG&rsquo;s potent sedative effects make it a strictly nighttime strain. The aroma of this indica is nearly as strong as its effects. Featuring a strong skunk-like scent and piney taste, Superman OG is extremely pungent and not for the novice patient.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 76.14661654135338
        },
        {
            "name": "Happy",
            "score": 41.10902255639097
        },
        {
            "name": "Euphoric",
            "score": 34.75563909774436
        },
        {
            "name": "Sleepy",
            "score": 30.382205513784463
        },
        {
            "name": "Giggly",
            "score": 23.27067669172932
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 16.917293233082706
        },
        {
            "name": "Pine",
            "score": 15.463659147869674
        },
        {
            "name": "Sweet",
            "score": 11.892230576441102
        },
        {
            "name": "Skunk",
            "score": 10.839598997493734
        },
        {
            "name": "Pungent",
            "score": 8.978696741854636
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1418002,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This is an unbelievable Indica that truly delivers a crushing blow to insomnia.  A few good pulls on this and you'll be asleep in no time.   If you're an athlete who deals with severe muscle soreness, this one is for you as well.  This strain has saved me many sleepless nights and helped me recover better after insane lifting sessions.  Jiu Jitsu practitioners will love this for the same reasons:  Sleep = Recovery.  \n\nIf you're having trouble counting sheep and/or have pain, this strain will save your life.",
            "username": "Markelis"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1630593,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "prolly my fav strain rn because after I smoked it I felt like Superman. I felt rlly powerful and energetic for some reason even tho it’s an indica. My heart started pumping and I had an urge to run lol. ",
            "username": "BACKWOODSRICARDO"
        }
    ],
    "id": 424,
    "name": "Superman OG",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 13.339598997493734
        },
        {
            "name": "Dry Eyes",
            "score": 7.124060150375939
        },
        {
            "name": "Dizzy",
            "score": 4.7556390977443606
        },
        {
            "name": "Paranoid",
            "score": 1.8483709273182956
        },
        {
            "name": "Anxious",
            "score": 1.3220551378446115
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/tahoe-og",
            "category": "Hybrid",
            "name": "Tahoe OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/tahoe-og",
            "slug": "tahoe-og",
            "subtitle": null,
            "symbol": "Tok"
        },
        {
            "applink": "leafly://strain/bubba-kush",
            "category": "Indica",
            "name": "Bubba Kush",
            "permalink": "https://mobileapi.leafly.com/indica/bubba-kush",
            "slug": "bubba-kush",
            "subtitle": null,
            "symbol": "Bk"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/superman-og",
    "photoTotalCount": 46,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607989/b/superman-og__primary_e3b2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/superman-og_100x100_3d12.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607309/b/superman-og__primary_894b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/superman-og_100x100_236c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/513836/b/superman-og__primary_2305.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/superman-og_100x100_88b2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506407/b/superman-og__primary_39c5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/superman-og_100x100_093b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/493620/b/superman-og__primary_7a2a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/superman-og_100x100_3de4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/483531/b/superman-og__primary_4646.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/superman-og_100x100_9b68.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Spokane, WA",
        "Las Vegas, NV",
        "Los Angeles, CA",
        "Santa Ana, CA",
        "Seattle, WA",
        "Tacoma, WA",
        "Chandler, AZ",
        "Airway Heights, WA",
        "Bozeman, MT",
        "Bremerton, WA"
    ],
    "rating": 4.38,
    "relatedStrains": [],
    "reviewCount": 177,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "superman-og",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.37853107344633/240",
    "subtitle": null,
    "symbol": "Smg",
    "symptoms": [
        {
            "name": "Pain",
            "score": 38.72807017543859
        },
        {
            "name": "Insomnia",
            "score": 26.428571428571427
        },
        {
            "name": "Stress",
            "score": 26.29072681704261
        },
        {
            "name": "Depression",
            "score": 17.18045112781955
        },
        {
            "name": "Headaches",
            "score": 15.864661654135338
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
