{"sl_translate":"description,descriptionPlain,category","id":145,"slug":"platinum-purple-kush","name":"Platinum Purple Kush","subtitle":null,"symbol":"Ppk","category":"Indica","description":"\u003cp class=\"p1\"\u003ePlatinum Purple Kush is a great nighttime cannabis strain. If you suffer from insomnia or would like to wind down after a busy workday, this strain may be a good one to try. Unlike some other indicas, Platinum Purple Kush provides deep muscle relaxation while also allowing you to focus. Though this strain produces an almost sativa-like euphoria, you may still find yourself stuck on the couch. In true \u003ca href=\"http://www.leafly.com/indica/purple-kush\"\u003e\u003cspan class=\"s1\"\u003ePurple Kush\u003c/span\u003e\u003c/a\u003e fashion, Platinum Purple Kush features a strong musky grape aroma.\u003c/p\u003e\n","descriptionPlain":"Platinum Purple Kush is a great nighttime cannabis strain. If you suffer from insomnia or would like to wind down after a busy workday, this strain may be a good one to try. Unlike some other indicas, Platinum Purple Kush provides deep muscle relaxation while also allowing you to focus. Though this strain produces an almost sativa-like euphoria, you may still find yourself stuck on the couch. In true Purple Kush fashion, Platinum Purple Kush features a strong musky grape aroma.\n","aka":null,"rating":4.3,"highlightedReviews":[{"id":1410276,"username":"HappilyPainFree","text":"Fantastically Great for chronic insomnia. I have a small, low-dose, joint before going to bed. Releases all the muscle knots and spasms from the day. Pain just melts away with this PPK. Definitely feel wobbly and relaxed after 15 mins. \n\nAlso the time-shifty spacey-ness that helps my mind disengage, slow down, and get into the \"Time For Some Serious Shut Eye\" mode. \n\nMusic sounds awesome with this - drifting into a colourful nodding off :) definitely will get more.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1637427,"username":"kernel.cannabis","text":"indica I great for body pain it\u0027s still great","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2957","title":"Need to Kick-Start Your Appetite? Try These 10 Cannabis Strains to Help Induce Hunger","author":"Lisa Rough","category":null,"date":"\/Date(1441900800000)\/","text":"For some cannabis consumers, the “munchies,” or appetite stimulation, is an unwanted side effect that can lead to overeating, but for many medical marijuana patients, it provides necessary relief from symptoms like nausea and a lack of appetite. For those of you who consume cannabis as a natural appetite stimulant or to help calm gastrointestinal distress, here are 10 of the many strain varieties that can help kick-start the grumbles in your tummy:\n Goo\nGoo is a fairly heavy indica, so don’t test this strain unless you’re prepared for a strong dose of relaxation with your appetite boost. It also offers relief from painful muscle spasms, making it a good choice for spasticity or for those who suffer from gastrointestinal disorders.\n Monster Cookies\nAnother potent indica, Monster Cookies hails from the favored GSC (f.k.a Girl Scout Cookies) tribe and offers the same dose of euphoria and relaxation you know and love. The sleepy effects will increase over time, so keep your couch and your munchies close at hand and you’ll be set for the night.\n Maui Bubble Gift\nMaui Bubble Gift is an aromatic hybrid with roots in three distinctively fantastic medicinal strains: Bubble Gum, Maui Waui and God’s Gift. This indica-dominant strain has an unusually high CBD content, which makes it an excellent choice for pain and nausea sufferers. With the mental clarity of Maui Waui, the stomach-soothing spasm relief of Bubble Gum, and the relaxing effects of God’s Gift, this hybrid offers the best of three worlds in one.\n Sonoma Coma\nSonoma Coma is a rare sativa that hails from (where else?) Sonoma County, California. It offers energetic, uplifting effects with a mellow finish and a dash of the munchies to aid a diminished appetite.\n Platinum Purple Kush\nPurple Kush’s beefed-up older brother, Platinum Purple Kush provides deep muscle relaxation while still maintaining clarity and focus, making it one of the “lighter” indicas on our list. It has been known to make consumers “crazy hungry,” so make sure to have some noms on hand.\n Orange Skunk\nA citrus infusion with a clear-headed high, Orange Skunk relieves depression and anxiety in addition to a lack of appetite. With a myriad of effects, this strain can help relieve multiple symptoms, including inflammation, headaches, even pain and fibromyalgia.\n Gigabud\nThis indica-dominant hybrid is known to be expressly excellent for inducing an appetite, even among those with the most intense stomach symptoms. For those with nausea, weight loss, and issues with the digestive tract, Gigabud ought to be a staple for relief and to encourage a “ravenous” appetite.\n Caramelo\nThis sativa-dominant hybrid has indica origins in the Lavender family, offering an uplifting buzz without paranoia, along with potent pain and nausea relief. While Caramelo is an energetic strain useful for daytime consumption, be forewarned: the effects may be short-lived, so you may require a stronger strain for longtime symptom management.\n Pure Kush\nTrue to its name, Pure Kush is one of the purest, most potent indicas you’ll encounter. Watch out because this strain will knock you out like Mike Tyson if you’re not careful. Place your pizza orders before you dose or you may have trouble peeling yourself up off the couch to even get to the kitchen, which just seems….so far away….\n Diablo\nContrary to its name, this devilish strain is a kinder, gentler indica than many on this list. While couchlock is still a potential side effect, Diablo will allow you the focus and mental capacity to tackle day-to-day life without too much trouble, although you may need to watch out for a case of the giggles.\nStill looking for an appetite stimulant? Here are some other options to help make you hungry, calm your stomach, or reduce nausea:\nCannabis strains that make you hungry (click through for a full list):\n\nCannabis strains that calm your stomach (click through for a full list):\n\nCannabis strains that help relieve nausea (click through for a full list):","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/09/12001211/10-cannabis-strains-to-help-stimulate-your-appetite.jpg","urlslug":"/news/strains-products/10-cannabis-strains-to-help-stimulate-your-appetite"}],"reviewCount":119,"flavors":[{"name":"Earthy","score":21.518962848297214},{"name":"Tea","score":12.763157894736842},{"name":"Pungent","score":11.182275541795667},{"name":"Grape","score":10.888157894736842},{"name":"Skunk","score":10.446981424148607}],"effects":[{"name":"Relaxed","score":96.398993808049539},{"name":"Sleepy","score":55.953947368421055},{"name":"Euphoric","score":54.930340557275535},{"name":"Happy","score":54.299535603715171},{"name":"Hungry","score":37.486455108359131}],"symptoms":[{"name":"Stress","score":47.008513931888544},{"name":"Insomnia","score":41.824690402476783},{"name":"Pain","score":32.774767801857585},{"name":"Muscle Spasms","score":28.179179566563469},{"name":"Fatigue","score":22.627708978328176}],"conditions":[{"name":"Anxiety","score":28.357198142414862},{"name":"Bipolar Disorder","score":16.182275541795665},{"name":"PTSD","score":12.101393188854489},{"name":"ADD/ADHD","score":11.629256965944272},{"name":"Arthritis","score":11.366099071207431}],"negatives":[{"name":"Dry Mouth","score":32.412925696594428},{"name":"Dry Eyes","score":12.652863777089784},{"name":"Dizzy","score":6.7337461300309593},{"name":"Paranoid","score":0.73529411764705876},{"name":"Anxious","score":0.36764705882352938}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/platinum-purple-kush_100x100_75bf.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/681354/b/platinum-purple-kush__primary_75bc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/platinum-purple-kush_100x100_1a07.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/642161/b/platinum-purple-kush__primary_0b98.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/platinum-purple-kush_100x100_624a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/626384/b/platinum-purple-kush__primary_e855.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/platinum-purple-kush_100x100_8b2d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/625331/b/platinum-purple-kush__primary_487c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/platinum-purple-kush_100x100_c505.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/624108/b/platinum-purple-kush__primary_84a7.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/platinum-purple-kush_100x100_3706.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/617552/b/platinum-purple-kush__primary_0a63.jpg"}],"photoTotalCount":67,"popularCities":["Calgary, AB","Mesa, AZ","Montréal, QC","Toronto, ON","Vancouver, BC","Winnipeg, MB","Beaverton, OR","Brampton, ON","Cathedral City, CA","Detroit, MI"],"permalink":"https://mobileapi.leafly.com/indica/platinum-purple-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.30252100840336/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Purple Kush","subtitle":null,"slug":"purple-kush","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/purple-kush","symbol":"Pk","applink":"leafly://strain/purple-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
