{"sl_translate":"description,descriptionPlain,category","id":177263,"slug":"zkittlez","name":"Zkittlez","subtitle":null,"symbol":"Zlz","category":"Indica","description":"\u003cp\u003eZkittlez is an \u003ca href=\"http://www.leafly.com/explore/category-indica\"\u003eindica\u003c/a\u003e-dominant mix of \u003ca href=\"https://www.leafly.com/indica/grape-ape\"\u003eGrape Ape\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/sativa/grapefruit\"\u003eGrapefruit\u003c/a\u003e that is crossed with another undisclosed strain to produce this candy-flavored cannabis bred by 3rd Gen Family and Terp Hogz. This award-winning combination took 1st Place at the 2016 Emerald Cup and\u0026nbsp;1st Place Indica at the 2015 Cannabis Cups in San Francisco and in Michigan. The chunky \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\"\u003ecolas\u003c/a\u003e explode in a spectrum of light green hues and emit a \u003ca href=\"http://www.leafly.com/explore/flavors-sweet\"\u003esweet\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore/flavors-tropical\"\u003etropical\u003c/a\u003e blend of \u003ca href=\"http://www.leafly.com/explore/flavors-tree-fruit\"\u003efruit\u003c/a\u003e flavors. The effects of Zkittlez are surprisingly \u003ca href=\"http://www.leafly.com/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e for an indica, leaving consumers \u003ca href=\"http://www.leafly.com/explore/tags-focused\"\u003efocused\u003c/a\u003e, alert, and \u003ca href=\"http://www.leafly.com/explore/tags-happy\"\u003ehappy\u003c/a\u003e while \u003ca href=\"http://www.leafly.com/explore/tags-relaxed\"\u003erelaxing\u003c/a\u003e the body to help unwind any time of day.\u003c/p\u003e\n","descriptionPlain":"Zkittlez is an indica-dominant mix of Grape Ape and Grapefruit that is crossed with another undisclosed strain to produce this candy-flavored cannabis bred by 3rd Gen Family and Terp Hogz. This award-winning combination took 1st Place at the 2016 Emerald Cup and\u0026nbsp;1st Place Indica at the 2015 Cannabis Cups in San Francisco and in Michigan. The chunky colas explode in a spectrum of light green hues and emit a sweet, tropical blend of fruit flavors. The effects of Zkittlez are surprisingly uplifting for an indica, leaving consumers focused, alert, and happy while relaxing the body to help unwind any time of day.\n","aka":"Skittles, Skittlez, LemonZ","rating":4.58,"highlightedReviews":[{"id":1413831,"username":"John18","text":"Thank you for the investment of your time. I will try not to waste it.\nVisual Inspections:\nVarious shades of green, with slight purple, but most striking is the OFF THE CHARTS thick coat of white crystalline structures throughout the buds, all the way down the stalks. The bud structure is more like a sativa or a hybrid, with the largest cola approximately 6\"x2\", in the ounce, but most buds 2\" to 3\" size.\n\nThe Nose:\nThe odor of these flowers is truly unique for an Indica. They smell very similar to some Sativa varieties I\u0027ve experienced, like Jack Herrer or some other flowery/fruity scented buds. Most of the Indica strains I\u0027ve been lucky enough to smoke, have a hasty/earthy flavor, if derived from the kush from Afghanistan, or maybe a grapes/plum flavor, if a fine purple Indica is within your grasp; or even a,\"Blackwater\u0027s ,beautiful berry/tobacco/woodsy scent, is totally different than that of Zkiddlez. After grinding up a bud, a fruity, citrus odor stands out. A truly unique scent; a wonderful odor. Closest smell that comes to mind is a fine crop of Jack Herrer, on the Sativa end, and maybe a fresh bud of Northern Lights, on the Indica side.\n\nFlavor:\nI hand-rolled a nice joint, and brother, was it a delightful, delicious, first hit. Tastes very sweet and smooth...right now, it\u0027s the sweetest little doobie this old toker has ever enjoyed! I can taste a little citrus flavor from the grapefruit, and a lot of sweet berries and grapes. \n\nEffects:\nI smoked 1/2 the joint, as is my practice when giving reviews, and I\u0027m perplexed by some of the other ratings that give Zkiddlez low marks for strength, or as I like to term it, \"Stopping Power\", a phrase used to describe a weapons ability to take down your target with one shot.  Zkiddlez is plenty strong for,this old hombre, as I am pleasantly sedated in my body, yet mentally stimulated; enough so, that here I am, giving you this \"heads up\".\n\nConclusion:\nZkiddlez is a unique, delicious, and a very smooth smoke. I feel privileged to have the opportunity to experience its flavor and positive effects, and to be able to communicate these observations to you.\n5 Stars for Zkiddlez!\n","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1641979,"username":"jeremym27","text":"Great sex","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-52310","title":"Leafly’s Faves 2017: Flower","author":"Leafly Staff","category":null,"date":"\/Date(1513710785000)\/","text":"Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis flower products of 2017. How many have you tried? What was your favorite flower of 2017? Share with us in the comments below!\n\nChocolope by Gabriel\nAvailable in: Washington\nChocolope’s bright and dreamy sativa effects are magnified by the exceptional grow practices laid out in Gabriel’s airtight facilities. Their cultivation rooms are sealed from the outside, offering perfect environmental control that is carefully manipulated to stimulate the growth of the best quality flower.\nAlso featured in:\n\nWhat Are You Smoking? Episode 15\nWashington’s Best Tasting Strains From Fall 2017\n\nKosher Kush by Santa Cruz Veteran’s Alliance\nAvailable in: California\nThe high-THC indica Kosher Kush is the perfect strain to crush symptoms of PTSD, and the Santa Cruz Veteran’s Alliance—owned and operated by military veterans—produces this pain-relieving strain for those suffering. We love that members are offered free cannabis grown by fellow veterans in rooms meant to exude peace as the cannabis flower blooms.\nAlso featured in: The VA Can’t Provide Cannabis to Veterans With PTSD, so This Group Gives It Out for Free\nDutchberry by Artizen\nAvailable in: Washington\nWith around 27% THC to 8% CBD, the cheerful hybrid Dutchberry boasts one of the highest cannabinoid contents of all time. To house such a powerhouse strain, Artizen moves in tandem with their flower from growth to packaging—and delivers some excellent buds. We love that they slow down and take a little time with their cannabis crops from start to finish.\n\nPineapple by Fire Bros.\nAvailable in: Washington\nA Seattle favorite, Fire Bros. works with their own phenotypes to produce the most effective cannabis flower for consumers. For an uplifting hybrid strain such as Pineapple, stress-relieving characteristics are an important facet enhanced by Fire Bros.’ hand-selection process.\nHybrid Blend by Lowell Farms\nAvailable in: California\nLowell Farms, which works exclusively with flower, offers seasonal blends of their best strains, and we can’t get enough of their hybrid pre-rolls. We appreciate that they’re thinking outside the box in focusing on balanced flower mixes rather than strain-specific products. Grown in organic fertilizer free of pesticides, Lowell takes pride in their dedication to all-natural cannabis as well as in providing good wages for their workers.\nAlso featured in: What Are You Smoking? Episode 3\nZkittlez by Royal Choice Farms\nAvailable in: Arizona\nArizona does not require pesticide testing for cannabis, so it’s all the more important to find a grower you can trust. Royal Choice Farms chose to be an all-organic operation built on a whole lot of love and no pesticides. By instating natural grow methods, Royal Choice keeps our minds at ease when we’re lighting up their sweet indica Zkittles.\n\nCBD Blue Shark by Marley Natural Red\nAvailable in: California, Oregon, Washington*\nWith a full cannabis operation dedicated to Jamaica’s rich culture, Marley Natural hits it out of the park with their hand-selected flower line—notably, the anti-inflammatory and CBD-rich hybrid CBD Blue Shark. Cultivated by independent growers, we love Marley Natural’s dedication to craft cannabis, their commitment to sustainable growing practices, and their RISE UP social justice program.\nBlack Cherry Soda by Royal Tree Gardens\nAvailable in: Washington\nHaving built a facility from the ground up, Washington’s Royal Tree Gardens is a company steeped in perseverance. Licensed since 2014, Royal Tree Farms has been producing fantastic cannabis ever since, and their sativa-dominant Black Cherry Soda is no exception. We’ve been packing our bowls with this strain for its potent relief, particularly for the medical patients among us.\nDo-Si-Dos by Matrix NV\nAvailable in: Nevada\nOne of the best in medical-grade cannabis production, Nevada’s Matrix NV keeps their focus on the people who will consume their products, and that’s why we love them. Their flower, including the deliciously heavy indica Do-Si-Dos, is cared for by a team of passionate people who use purified and organic products to cultivate their hand-trimmed flower collection.\nAlso featured in: Leafly TV’s Growers: Episode 101\n\nOrange Blossom by Falcanna\nAvailable in: Washington\nA small medical operation turned Tier III licensed producer, Falcanna has seen it all when comes to cannabis—from the garden to the shop. Their dedication to the herb started as a dream between founders Bethany and Justin Rondeau and turned into a full grow facility delivering exceptional cannabis across Washington State. Their bright, floral hybrid Orange Blossom is as tasty as it is elevating and provides a perfect example of their dedication to quality flower.\nWhite Tahoe Cookies by Archive Portland\nAvailable in: Oregon\nWith multiple awards under their belt, Archive Portland boasts a team of growers with over 35 years of collective cannabis growing experience. That dedication to quality trickles down to the buds, where the exceptional indica White Tahoe Cookies takes on a smooth sedative high that keeps us coming back for more.\nLemonder by Seattle’s Private Reserve\nAvailable in: Washington\nWe save Seattle’s Private Reserve flower for special occasions; grown in a facility that is tightly sealed and meticulously controlled, the euphoric hybrid Lemonder has found its way into our stash boxes and smoke circles throughout 2017. SPR’s rigorous testing of all their cannabis products lets us consume with full peace of mind.\nLead image by Nastasic/iStock\n*Editor’s note: Leafly and Marley Natural are owned by the same parent company. Also, Marley Natural Red is available in California, Oregon, and Washington but may be a different high-CBD strain in each market.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/19103646/leafly-faves-flower.jpg","urlslug":"/news/strains-products/leaflys-faves-2017-flower"},{"id":"contentitems-3423","title":"New Strains Alert: The 2015 Michigan Cannabis Cup Winners","author":"Bailey Rahn","category":null,"date":"\/Date(1440774000000)\/","text":"Breeders and growers duked it out last weekend in Michigan for yet another High Times Cannabis Cup. The best of the best were pitted against each other, and we\u0027re curious how many of you have had the pleasure of trying these champs. Share your thoughts in a strain review or check out where to find these elite genetics at a shop near you by navigating to their strain page and clicking \"Availability.\"\nWithout further ado, here are your 2015 winners!\n \nCANNABIS FLOWER WINNERS\n\nBest Indica Flower\n1st Place: Zkittlez from 3rd Gen Family with Terphogz and The Union\n2nd Place: Strawberry Banana from Greenwolf Oregon with G.C. Rebellion Farms\n3rd Place: Deathwalker OG from Radicle Genetics in collaboration with Lenz and Valerio\n \nBest Sativa Flower\n1st Place: Strawberry Banana from Mass Genetics\n2nd Place: Tropicana from Cannabiotix\n3rd Place: Dreamy Jones from Bud White at Interlochen Alternative Health\n \nBest Hybrid Flower\n1st Place: Sunshine #4 by Bodhi Seeds from The Green Room Detroit\n2nd Place: Savant’s Grail from 710 Savant\n3rd Place: Crown OG from Crown OG with A Detroit Alternative and Moxie 71\n \nBest CBD Flower\n1st Place: Perkins Cut Cannatonic from Mota Rebel Genetics\n2nd Place: CBDee’s #1B from Pure West Compassion Club with LightSky Farms\n3rd Place: Super Sonic CBD from Radicle Genetics in collaboration with Valerio\n \nCANNABIS CONCENTRATE WINNERS\n\nBest Indica Concentrate\n1st Place: Faygo Red Pop Live Resin from 710 Savant\n2nd Place: Grape Valley Kush Live Resin from PeaceOil\n3rd Place: Moxie Goji Live Resin from A Detroit Alternative\n \nBest Sativa Concentrate\n1st Place: Clementine Live Resin from Crockett Family Farms\n2nd Place: Romulan Grenade’s Live Plant Run from LightSky Farms with NLG\n3rd Place: Tangie Live Resin from Greenwolf Oregon and Moxie Genetics\n \nBest Hybrid Concentrate\n1st Place: Strawberry Banana Lemonade from Greenwolf Oregon and Moxie 710\n2nd Place: Strawberry Banana from Loud Pack Extracts Oregon with Moxie Mix\n3rd Place: Crown OG from Moxie Genetics with ADA East\n \nBest Non-Solvent Hash\n1st Place: Goji Rosin from Moxie Seeds \u0026 Extracts with ADA East and Foundation Extracts\n2nd Place: Moxie Solventless Goji 120-micron from A Detroit Alternative\n3rd Place: 73-micron Bruce Banner #3 Freeze Dried Water Hash from Michigan Made Melts in collaboration with Kushmanjockin\n \nBest CBD Concentrate\n1st Place: CBD Cookies / Cannatonic / Cannasphere from Kannacare in collaboration with TerpTitan\n2nd Place: CBDee’s #1B Live Plant Run from Pure West Compassion Club with LightSky Farms\n3rd Place: Startonic Sap from Genotype A2 with A2 Wellness\n \nCANNABIS PRODUCT WINNERS\n\nBest Cannabis Edible\n1st Place: Kief Krispy from Budsuds with R.I. Finest and Kief Krispy\n2nd Place: Captain Kirk’s Truffle Tropicales from Captain Kirk Edibles of Ann Arbor Health Collective\n3rd Place: Got Milk? From Mindright\n \nBest CBD Cannabis Edible\n1st Place: Special Fx Labs CBD Dark Chocolate Mint from Jackson County Compassion Center\n2nd Place: Cherry Almond Sherbet Delight – CBD Special from Arborside Delights\n3rd Place: CBDee’s Strawberry Lemonade from LightSky Farms with NLG\n \nBest Cannabis Topical\n1st Place: PBO from PBOHeals.com\n2nd Place: Budsuds Purple Chem Topical Soap Bar from Budsuds with R.I. Finest and The Cali Connection\n3rd Place: Truu Hemp Infused Lotion from Mindright\n \nBest Cannabis Product\n1st Place: MOXIE | Moxie Mix\n2nd Place: Raw Papers | HBI\n3rd Place: Advanced Nutrients | Advanced Nutrients\n \nBest Glass\n1st Place: We Grow Michigan | Joe P x SD Ryno “Devil Duck Bot”\n2nd Place: Sacred Expressions | The Collector\n3rd Place: Nexus Glass | Tesla V3\n \nBest Vaporizer\n1st Place: Puff Co | Puff Co\n2nd Place: VaporZ | VaporZ\n3rd Place: WildBill’s Tobacco | Honey Pen","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/08/12002437/new-strains-alert-the-2015-michigan-cannabis-cup-winners.png","urlslug":"/news/strains-products/new-strains-alert-the-2015-michigan-cannabis-cup-winners"}],"reviewCount":174,"flavors":[{"name":"Sweet","score":35.2095085540363},{"name":"Berry","score":33.070910587519975},{"name":"Grape","score":29.540981683001974},{"name":"Grapefruit","score":22.154313997045243},{"name":"Citrus","score":15.663006704202616}],"effects":[{"name":"Relaxed","score":70.067717602131978},{"name":"Happy","score":53.059870253856559},{"name":"Euphoric","score":48.110253998787528},{"name":"Uplifted","score":38.954777299936183},{"name":"Creative","score":29.045677824929822}],"symptoms":[{"name":"Stress","score":32.155149577853912},{"name":"Depression","score":22.16066974468562},{"name":"Pain","score":20.887831276678586},{"name":"Fatigue","score":15.059077341004084},{"name":"Insomnia","score":11.392166518810347}],"conditions":[{"name":"Anxiety","score":20.901209458774755},{"name":"PTSD","score":11.08033487234281},{"name":"Arthritis","score":10.388180620569866},{"name":"ADD/ADHD","score":6.6260224753459216},{"name":"Migraines","score":4.5791606146319088}],"negatives":[{"name":"Dry Eyes","score":17.086205271981552},{"name":"Dry Mouth","score":15.938215021609542},{"name":"Headache","score":5.924001258704708},{"name":"Anxious","score":2.9161325764511994},{"name":"Dizzy","score":2.3354483602171086}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_1275.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005514/b/zkittlez__primary_d097.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_f574.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002250/b/zkittlez__primary_d8e5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_73f2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000204/b/zkittlez__primary_5c74.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_af44.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000203/b/zkittlez__primary_36ff.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_90f7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607756/b/zkittlez__primary_2af0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_ef66.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/586412/b/zkittlez__primary_85f3.jpg"}],"photoTotalCount":24,"popularCities":["Los Angeles, CA","Portland, OR","Seattle, WA","Eugene, OR","Phoenix, AZ","San Francisco, CA","Bend, OR","Hayward, CA","Oakland, CA","Oregon City, OR"],"permalink":"https://mobileapi.leafly.com/indica/zkittlez","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.58045977011494/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Grape Ape","subtitle":null,"slug":"grape-ape","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/grape-ape","symbol":"Ga","applink":"leafly://strain/grape-ape"},{"name":"Grapefruit","subtitle":null,"slug":"grapefruit","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/grapefruit","symbol":"Grf","applink":"leafly://strain/grapefruit"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":177263,"slug":"zkittlez","name":"Zkittlez","subtitle":null,"symbol":"Zlz","category":"Indica","description":"\u003cp\u003eZkittlez is an \u003ca href=\"http://www.leafly.com/explore/category-indica\"\u003eindica\u003c/a\u003e-dominant mix of \u003ca href=\"https://www.leafly.com/indica/grape-ape\"\u003eGrape Ape\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/sativa/grapefruit\"\u003eGrapefruit\u003c/a\u003e that is crossed with another undisclosed strain to produce this candy-flavored cannabis bred by 3rd Gen Family and Terp Hogz. This award-winning combination took 1st Place at the 2016 Emerald Cup and\u0026nbsp;1st Place Indica at the 2015 Cannabis Cups in San Francisco and in Michigan. The chunky \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\"\u003ecolas\u003c/a\u003e explode in a spectrum of light green hues and emit a \u003ca href=\"http://www.leafly.com/explore/flavors-sweet\"\u003esweet\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore/flavors-tropical\"\u003etropical\u003c/a\u003e blend of \u003ca href=\"http://www.leafly.com/explore/flavors-tree-fruit\"\u003efruit\u003c/a\u003e flavors. The effects of Zkittlez are surprisingly \u003ca href=\"http://www.leafly.com/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e for an indica, leaving consumers \u003ca href=\"http://www.leafly.com/explore/tags-focused\"\u003efocused\u003c/a\u003e, alert, and \u003ca href=\"http://www.leafly.com/explore/tags-happy\"\u003ehappy\u003c/a\u003e while \u003ca href=\"http://www.leafly.com/explore/tags-relaxed\"\u003erelaxing\u003c/a\u003e the body to help unwind any time of day.\u003c/p\u003e\n","descriptionPlain":"Zkittlez is an indica-dominant mix of Grape Ape and Grapefruit that is crossed with another undisclosed strain to produce this candy-flavored cannabis bred by 3rd Gen Family and Terp Hogz. This award-winning combination took 1st Place at the 2016 Emerald Cup and\u0026nbsp;1st Place Indica at the 2015 Cannabis Cups in San Francisco and in Michigan. The chunky colas explode in a spectrum of light green hues and emit a sweet, tropical blend of fruit flavors. The effects of Zkittlez are surprisingly uplifting for an indica, leaving consumers focused, alert, and happy while relaxing the body to help unwind any time of day.\n","aka":"Skittles, Skittlez, LemonZ","rating":4.58,"highlightedReviews":[{"id":1413831,"username":"John18","text":"Thank you for the investment of your time. I will try not to waste it.\nVisual Inspections:\nVarious shades of green, with slight purple, but most striking is the OFF THE CHARTS thick coat of white crystalline structures throughout the buds, all the way down the stalks. The bud structure is more like a sativa or a hybrid, with the largest cola approximately 6\"x2\", in the ounce, but most buds 2\" to 3\" size.\n\nThe Nose:\nThe odor of these flowers is truly unique for an Indica. They smell very similar to some Sativa varieties I\u0027ve experienced, like Jack Herrer or some other flowery/fruity scented buds. Most of the Indica strains I\u0027ve been lucky enough to smoke, have a hasty/earthy flavor, if derived from the kush from Afghanistan, or maybe a grapes/plum flavor, if a fine purple Indica is within your grasp; or even a,\"Blackwater\u0027s ,beautiful berry/tobacco/woodsy scent, is totally different than that of Zkiddlez. After grinding up a bud, a fruity, citrus odor stands out. A truly unique scent; a wonderful odor. Closest smell that comes to mind is a fine crop of Jack Herrer, on the Sativa end, and maybe a fresh bud of Northern Lights, on the Indica side.\n\nFlavor:\nI hand-rolled a nice joint, and brother, was it a delightful, delicious, first hit. Tastes very sweet and smooth...right now, it\u0027s the sweetest little doobie this old toker has ever enjoyed! I can taste a little citrus flavor from the grapefruit, and a lot of sweet berries and grapes. \n\nEffects:\nI smoked 1/2 the joint, as is my practice when giving reviews, and I\u0027m perplexed by some of the other ratings that give Zkiddlez low marks for strength, or as I like to term it, \"Stopping Power\", a phrase used to describe a weapons ability to take down your target with one shot.  Zkiddlez is plenty strong for,this old hombre, as I am pleasantly sedated in my body, yet mentally stimulated; enough so, that here I am, giving you this \"heads up\".\n\nConclusion:\nZkiddlez is a unique, delicious, and a very smooth smoke. I feel privileged to have the opportunity to experience its flavor and positive effects, and to be able to communicate these observations to you.\n5 Stars for Zkiddlez!\n","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1641979,"username":"jeremym27","text":"Great sex","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-52310","title":"Leafly’s Faves 2017: Flower","author":"Leafly Staff","category":null,"date":"\/Date(1513710785000)\/","text":"Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis flower products of 2017. How many have you tried? What was your favorite flower of 2017? Share with us in the comments below!\n\nChocolope by Gabriel\nAvailable in: Washington\nChocolope’s bright and dreamy sativa effects are magnified by the exceptional grow practices laid out in Gabriel’s airtight facilities. Their cultivation rooms are sealed from the outside, offering perfect environmental control that is carefully manipulated to stimulate the growth of the best quality flower.\nAlso featured in:\n\nWhat Are You Smoking? Episode 15\nWashington’s Best Tasting Strains From Fall 2017\n\nKosher Kush by Santa Cruz Veteran’s Alliance\nAvailable in: California\nThe high-THC indica Kosher Kush is the perfect strain to crush symptoms of PTSD, and the Santa Cruz Veteran’s Alliance—owned and operated by military veterans—produces this pain-relieving strain for those suffering. We love that members are offered free cannabis grown by fellow veterans in rooms meant to exude peace as the cannabis flower blooms.\nAlso featured in: The VA Can’t Provide Cannabis to Veterans With PTSD, so This Group Gives It Out for Free\nDutchberry by Artizen\nAvailable in: Washington\nWith around 27% THC to 8% CBD, the cheerful hybrid Dutchberry boasts one of the highest cannabinoid contents of all time. To house such a powerhouse strain, Artizen moves in tandem with their flower from growth to packaging—and delivers some excellent buds. We love that they slow down and take a little time with their cannabis crops from start to finish.\n\nPineapple by Fire Bros.\nAvailable in: Washington\nA Seattle favorite, Fire Bros. works with their own phenotypes to produce the most effective cannabis flower for consumers. For an uplifting hybrid strain such as Pineapple, stress-relieving characteristics are an important facet enhanced by Fire Bros.’ hand-selection process.\nHybrid Blend by Lowell Farms\nAvailable in: California\nLowell Farms, which works exclusively with flower, offers seasonal blends of their best strains, and we can’t get enough of their hybrid pre-rolls. We appreciate that they’re thinking outside the box in focusing on balanced flower mixes rather than strain-specific products. Grown in organic fertilizer free of pesticides, Lowell takes pride in their dedication to all-natural cannabis as well as in providing good wages for their workers.\nAlso featured in: What Are You Smoking? Episode 3\nZkittlez by Royal Choice Farms\nAvailable in: Arizona\nArizona does not require pesticide testing for cannabis, so it’s all the more important to find a grower you can trust. Royal Choice Farms chose to be an all-organic operation built on a whole lot of love and no pesticides. By instating natural grow methods, Royal Choice keeps our minds at ease when we’re lighting up their sweet indica Zkittles.\n\nCBD Blue Shark by Marley Natural Red\nAvailable in: California, Oregon, Washington*\nWith a full cannabis operation dedicated to Jamaica’s rich culture, Marley Natural hits it out of the park with their hand-selected flower line—notably, the anti-inflammatory and CBD-rich hybrid CBD Blue Shark. Cultivated by independent growers, we love Marley Natural’s dedication to craft cannabis, their commitment to sustainable growing practices, and their RISE UP social justice program.\nBlack Cherry Soda by Royal Tree Gardens\nAvailable in: Washington\nHaving built a facility from the ground up, Washington’s Royal Tree Gardens is a company steeped in perseverance. Licensed since 2014, Royal Tree Farms has been producing fantastic cannabis ever since, and their sativa-dominant Black Cherry Soda is no exception. We’ve been packing our bowls with this strain for its potent relief, particularly for the medical patients among us.\nDo-Si-Dos by Matrix NV\nAvailable in: Nevada\nOne of the best in medical-grade cannabis production, Nevada’s Matrix NV keeps their focus on the people who will consume their products, and that’s why we love them. Their flower, including the deliciously heavy indica Do-Si-Dos, is cared for by a team of passionate people who use purified and organic products to cultivate their hand-trimmed flower collection.\nAlso featured in: Leafly TV’s Growers: Episode 101\n\nOrange Blossom by Falcanna\nAvailable in: Washington\nA small medical operation turned Tier III licensed producer, Falcanna has seen it all when comes to cannabis—from the garden to the shop. Their dedication to the herb started as a dream between founders Bethany and Justin Rondeau and turned into a full grow facility delivering exceptional cannabis across Washington State. Their bright, floral hybrid Orange Blossom is as tasty as it is elevating and provides a perfect example of their dedication to quality flower.\nWhite Tahoe Cookies by Archive Portland\nAvailable in: Oregon\nWith multiple awards under their belt, Archive Portland boasts a team of growers with over 35 years of collective cannabis growing experience. That dedication to quality trickles down to the buds, where the exceptional indica White Tahoe Cookies takes on a smooth sedative high that keeps us coming back for more.\nLemonder by Seattle’s Private Reserve\nAvailable in: Washington\nWe save Seattle’s Private Reserve flower for special occasions; grown in a facility that is tightly sealed and meticulously controlled, the euphoric hybrid Lemonder has found its way into our stash boxes and smoke circles throughout 2017. SPR’s rigorous testing of all their cannabis products lets us consume with full peace of mind.\nLead image by Nastasic/iStock\n*Editor’s note: Leafly and Marley Natural are owned by the same parent company. Also, Marley Natural Red is available in California, Oregon, and Washington but may be a different high-CBD strain in each market.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/19103646/leafly-faves-flower.jpg","urlslug":"/news/strains-products/leaflys-faves-2017-flower"},{"id":"contentitems-3423","title":"New Strains Alert: The 2015 Michigan Cannabis Cup Winners","author":"Bailey Rahn","category":null,"date":"\/Date(1440774000000)\/","text":"Breeders and growers duked it out last weekend in Michigan for yet another High Times Cannabis Cup. The best of the best were pitted against each other, and we\u0027re curious how many of you have had the pleasure of trying these champs. Share your thoughts in a strain review or check out where to find these elite genetics at a shop near you by navigating to their strain page and clicking \"Availability.\"\nWithout further ado, here are your 2015 winners!\n \nCANNABIS FLOWER WINNERS\n\nBest Indica Flower\n1st Place: Zkittlez from 3rd Gen Family with Terphogz and The Union\n2nd Place: Strawberry Banana from Greenwolf Oregon with G.C. Rebellion Farms\n3rd Place: Deathwalker OG from Radicle Genetics in collaboration with Lenz and Valerio\n \nBest Sativa Flower\n1st Place: Strawberry Banana from Mass Genetics\n2nd Place: Tropicana from Cannabiotix\n3rd Place: Dreamy Jones from Bud White at Interlochen Alternative Health\n \nBest Hybrid Flower\n1st Place: Sunshine #4 by Bodhi Seeds from The Green Room Detroit\n2nd Place: Savant’s Grail from 710 Savant\n3rd Place: Crown OG from Crown OG with A Detroit Alternative and Moxie 71\n \nBest CBD Flower\n1st Place: Perkins Cut Cannatonic from Mota Rebel Genetics\n2nd Place: CBDee’s #1B from Pure West Compassion Club with LightSky Farms\n3rd Place: Super Sonic CBD from Radicle Genetics in collaboration with Valerio\n \nCANNABIS CONCENTRATE WINNERS\n\nBest Indica Concentrate\n1st Place: Faygo Red Pop Live Resin from 710 Savant\n2nd Place: Grape Valley Kush Live Resin from PeaceOil\n3rd Place: Moxie Goji Live Resin from A Detroit Alternative\n \nBest Sativa Concentrate\n1st Place: Clementine Live Resin from Crockett Family Farms\n2nd Place: Romulan Grenade’s Live Plant Run from LightSky Farms with NLG\n3rd Place: Tangie Live Resin from Greenwolf Oregon and Moxie Genetics\n \nBest Hybrid Concentrate\n1st Place: Strawberry Banana Lemonade from Greenwolf Oregon and Moxie 710\n2nd Place: Strawberry Banana from Loud Pack Extracts Oregon with Moxie Mix\n3rd Place: Crown OG from Moxie Genetics with ADA East\n \nBest Non-Solvent Hash\n1st Place: Goji Rosin from Moxie Seeds \u0026 Extracts with ADA East and Foundation Extracts\n2nd Place: Moxie Solventless Goji 120-micron from A Detroit Alternative\n3rd Place: 73-micron Bruce Banner #3 Freeze Dried Water Hash from Michigan Made Melts in collaboration with Kushmanjockin\n \nBest CBD Concentrate\n1st Place: CBD Cookies / Cannatonic / Cannasphere from Kannacare in collaboration with TerpTitan\n2nd Place: CBDee’s #1B Live Plant Run from Pure West Compassion Club with LightSky Farms\n3rd Place: Startonic Sap from Genotype A2 with A2 Wellness\n \nCANNABIS PRODUCT WINNERS\n\nBest Cannabis Edible\n1st Place: Kief Krispy from Budsuds with R.I. Finest and Kief Krispy\n2nd Place: Captain Kirk’s Truffle Tropicales from Captain Kirk Edibles of Ann Arbor Health Collective\n3rd Place: Got Milk? From Mindright\n \nBest CBD Cannabis Edible\n1st Place: Special Fx Labs CBD Dark Chocolate Mint from Jackson County Compassion Center\n2nd Place: Cherry Almond Sherbet Delight – CBD Special from Arborside Delights\n3rd Place: CBDee’s Strawberry Lemonade from LightSky Farms with NLG\n \nBest Cannabis Topical\n1st Place: PBO from PBOHeals.com\n2nd Place: Budsuds Purple Chem Topical Soap Bar from Budsuds with R.I. Finest and The Cali Connection\n3rd Place: Truu Hemp Infused Lotion from Mindright\n \nBest Cannabis Product\n1st Place: MOXIE | Moxie Mix\n2nd Place: Raw Papers | HBI\n3rd Place: Advanced Nutrients | Advanced Nutrients\n \nBest Glass\n1st Place: We Grow Michigan | Joe P x SD Ryno “Devil Duck Bot”\n2nd Place: Sacred Expressions | The Collector\n3rd Place: Nexus Glass | Tesla V3\n \nBest Vaporizer\n1st Place: Puff Co | Puff Co\n2nd Place: VaporZ | VaporZ\n3rd Place: WildBill’s Tobacco | Honey Pen","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/08/12002437/new-strains-alert-the-2015-michigan-cannabis-cup-winners.png","urlslug":"/news/strains-products/new-strains-alert-the-2015-michigan-cannabis-cup-winners"}],"reviewCount":174,"flavors":[{"name":"Sweet","score":35.2095085540363},{"name":"Berry","score":33.070910587519975},{"name":"Grape","score":29.540981683001974},{"name":"Grapefruit","score":22.154313997045243},{"name":"Citrus","score":15.663006704202616}],"effects":[{"name":"Relaxed","score":70.067717602131978},{"name":"Happy","score":53.059870253856559},{"name":"Euphoric","score":48.110253998787528},{"name":"Uplifted","score":38.954777299936183},{"name":"Creative","score":29.045677824929822}],"symptoms":[{"name":"Stress","score":32.155149577853912},{"name":"Depression","score":22.16066974468562},{"name":"Pain","score":20.887831276678586},{"name":"Fatigue","score":15.059077341004084},{"name":"Insomnia","score":11.392166518810347}],"conditions":[{"name":"Anxiety","score":20.901209458774755},{"name":"PTSD","score":11.08033487234281},{"name":"Arthritis","score":10.388180620569866},{"name":"ADD/ADHD","score":6.6260224753459216},{"name":"Migraines","score":4.5791606146319088}],"negatives":[{"name":"Dry Eyes","score":17.086205271981552},{"name":"Dry Mouth","score":15.938215021609542},{"name":"Headache","score":5.924001258704708},{"name":"Anxious","score":2.9161325764511994},{"name":"Dizzy","score":2.3354483602171086}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_1275.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005514/b/zkittlez__primary_d097.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_f574.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002250/b/zkittlez__primary_d8e5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_73f2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000204/b/zkittlez__primary_5c74.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_af44.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000203/b/zkittlez__primary_36ff.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_90f7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607756/b/zkittlez__primary_2af0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_ef66.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/586412/b/zkittlez__primary_85f3.jpg"}],"photoTotalCount":24,"popularCities":["Los Angeles, CA","Portland, OR","Seattle, WA","Eugene, OR","Phoenix, AZ","San Francisco, CA","Bend, OR","Hayward, CA","Oakland, CA","Oregon City, OR"],"permalink":"https://mobileapi.leafly.com/indica/zkittlez","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.58045977011494/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Grape Ape","subtitle":null,"slug":"grape-ape","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/grape-ape","symbol":"Ga","applink":"leafly://strain/grape-ape"},{"name":"Grapefruit","subtitle":null,"slug":"grapefruit","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/grapefruit","symbol":"Grf","applink":"leafly://strain/grapefruit"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":177263,"slug":"zkittlez","name":"Zkittlez","subtitle":null,"symbol":"Zlz","category":"Indica","description":"\u003cp\u003eZkittlez is an \u003ca href=\"http://www.leafly.com/explore/category-indica\"\u003eindica\u003c/a\u003e-dominant mix of \u003ca href=\"https://www.leafly.com/indica/grape-ape\"\u003eGrape Ape\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/sativa/grapefruit\"\u003eGrapefruit\u003c/a\u003e that is crossed with another undisclosed strain to produce this candy-flavored cannabis bred by 3rd Gen Family and Terp Hogz. This award-winning combination took 1st Place at the 2016 Emerald Cup and\u0026nbsp;1st Place Indica at the 2015 Cannabis Cups in San Francisco and in Michigan. The chunky \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\"\u003ecolas\u003c/a\u003e explode in a spectrum of light green hues and emit a \u003ca href=\"http://www.leafly.com/explore/flavors-sweet\"\u003esweet\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore/flavors-tropical\"\u003etropical\u003c/a\u003e blend of \u003ca href=\"http://www.leafly.com/explore/flavors-tree-fruit\"\u003efruit\u003c/a\u003e flavors. The effects of Zkittlez are surprisingly \u003ca href=\"http://www.leafly.com/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e for an indica, leaving consumers \u003ca href=\"http://www.leafly.com/explore/tags-focused\"\u003efocused\u003c/a\u003e, alert, and \u003ca href=\"http://www.leafly.com/explore/tags-happy\"\u003ehappy\u003c/a\u003e while \u003ca href=\"http://www.leafly.com/explore/tags-relaxed\"\u003erelaxing\u003c/a\u003e the body to help unwind any time of day.\u003c/p\u003e\n","descriptionPlain":"Zkittlez is an indica-dominant mix of Grape Ape and Grapefruit that is crossed with another undisclosed strain to produce this candy-flavored cannabis bred by 3rd Gen Family and Terp Hogz. This award-winning combination took 1st Place at the 2016 Emerald Cup and\u0026nbsp;1st Place Indica at the 2015 Cannabis Cups in San Francisco and in Michigan. The chunky colas explode in a spectrum of light green hues and emit a sweet, tropical blend of fruit flavors. The effects of Zkittlez are surprisingly uplifting for an indica, leaving consumers focused, alert, and happy while relaxing the body to help unwind any time of day.\n","aka":"Skittles, Skittlez, LemonZ","rating":4.58,"highlightedReviews":[{"id":1413831,"username":"John18","text":"Thank you for the investment of your time. I will try not to waste it.\nVisual Inspections:\nVarious shades of green, with slight purple, but most striking is the OFF THE CHARTS thick coat of white crystalline structures throughout the buds, all the way down the stalks. The bud structure is more like a sativa or a hybrid, with the largest cola approximately 6\"x2\", in the ounce, but most buds 2\" to 3\" size.\n\nThe Nose:\nThe odor of these flowers is truly unique for an Indica. They smell very similar to some Sativa varieties I\u0027ve experienced, like Jack Herrer or some other flowery/fruity scented buds. Most of the Indica strains I\u0027ve been lucky enough to smoke, have a hasty/earthy flavor, if derived from the kush from Afghanistan, or maybe a grapes/plum flavor, if a fine purple Indica is within your grasp; or even a,\"Blackwater\u0027s ,beautiful berry/tobacco/woodsy scent, is totally different than that of Zkiddlez. After grinding up a bud, a fruity, citrus odor stands out. A truly unique scent; a wonderful odor. Closest smell that comes to mind is a fine crop of Jack Herrer, on the Sativa end, and maybe a fresh bud of Northern Lights, on the Indica side.\n\nFlavor:\nI hand-rolled a nice joint, and brother, was it a delightful, delicious, first hit. Tastes very sweet and smooth...right now, it\u0027s the sweetest little doobie this old toker has ever enjoyed! I can taste a little citrus flavor from the grapefruit, and a lot of sweet berries and grapes. \n\nEffects:\nI smoked 1/2 the joint, as is my practice when giving reviews, and I\u0027m perplexed by some of the other ratings that give Zkiddlez low marks for strength, or as I like to term it, \"Stopping Power\", a phrase used to describe a weapons ability to take down your target with one shot.  Zkiddlez is plenty strong for,this old hombre, as I am pleasantly sedated in my body, yet mentally stimulated; enough so, that here I am, giving you this \"heads up\".\n\nConclusion:\nZkiddlez is a unique, delicious, and a very smooth smoke. I feel privileged to have the opportunity to experience its flavor and positive effects, and to be able to communicate these observations to you.\n5 Stars for Zkiddlez!\n","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1641979,"username":"jeremym27","text":"Great sex","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-52310","title":"Leafly’s Faves 2017: Flower","author":"Leafly Staff","category":null,"date":"\/Date(1513710785000)\/","text":"Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis flower products of 2017. How many have you tried? What was your favorite flower of 2017? Share with us in the comments below!\n\nChocolope by Gabriel\nAvailable in: Washington\nChocolope’s bright and dreamy sativa effects are magnified by the exceptional grow practices laid out in Gabriel’s airtight facilities. Their cultivation rooms are sealed from the outside, offering perfect environmental control that is carefully manipulated to stimulate the growth of the best quality flower.\nAlso featured in:\n\nWhat Are You Smoking? Episode 15\nWashington’s Best Tasting Strains From Fall 2017\n\nKosher Kush by Santa Cruz Veteran’s Alliance\nAvailable in: California\nThe high-THC indica Kosher Kush is the perfect strain to crush symptoms of PTSD, and the Santa Cruz Veteran’s Alliance—owned and operated by military veterans—produces this pain-relieving strain for those suffering. We love that members are offered free cannabis grown by fellow veterans in rooms meant to exude peace as the cannabis flower blooms.\nAlso featured in: The VA Can’t Provide Cannabis to Veterans With PTSD, so This Group Gives It Out for Free\nDutchberry by Artizen\nAvailable in: Washington\nWith around 27% THC to 8% CBD, the cheerful hybrid Dutchberry boasts one of the highest cannabinoid contents of all time. To house such a powerhouse strain, Artizen moves in tandem with their flower from growth to packaging—and delivers some excellent buds. We love that they slow down and take a little time with their cannabis crops from start to finish.\n\nPineapple by Fire Bros.\nAvailable in: Washington\nA Seattle favorite, Fire Bros. works with their own phenotypes to produce the most effective cannabis flower for consumers. For an uplifting hybrid strain such as Pineapple, stress-relieving characteristics are an important facet enhanced by Fire Bros.’ hand-selection process.\nHybrid Blend by Lowell Farms\nAvailable in: California\nLowell Farms, which works exclusively with flower, offers seasonal blends of their best strains, and we can’t get enough of their hybrid pre-rolls. We appreciate that they’re thinking outside the box in focusing on balanced flower mixes rather than strain-specific products. Grown in organic fertilizer free of pesticides, Lowell takes pride in their dedication to all-natural cannabis as well as in providing good wages for their workers.\nAlso featured in: What Are You Smoking? Episode 3\nZkittlez by Royal Choice Farms\nAvailable in: Arizona\nArizona does not require pesticide testing for cannabis, so it’s all the more important to find a grower you can trust. Royal Choice Farms chose to be an all-organic operation built on a whole lot of love and no pesticides. By instating natural grow methods, Royal Choice keeps our minds at ease when we’re lighting up their sweet indica Zkittles.\n\nCBD Blue Shark by Marley Natural Red\nAvailable in: California, Oregon, Washington*\nWith a full cannabis operation dedicated to Jamaica’s rich culture, Marley Natural hits it out of the park with their hand-selected flower line—notably, the anti-inflammatory and CBD-rich hybrid CBD Blue Shark. Cultivated by independent growers, we love Marley Natural’s dedication to craft cannabis, their commitment to sustainable growing practices, and their RISE UP social justice program.\nBlack Cherry Soda by Royal Tree Gardens\nAvailable in: Washington\nHaving built a facility from the ground up, Washington’s Royal Tree Gardens is a company steeped in perseverance. Licensed since 2014, Royal Tree Farms has been producing fantastic cannabis ever since, and their sativa-dominant Black Cherry Soda is no exception. We’ve been packing our bowls with this strain for its potent relief, particularly for the medical patients among us.\nDo-Si-Dos by Matrix NV\nAvailable in: Nevada\nOne of the best in medical-grade cannabis production, Nevada’s Matrix NV keeps their focus on the people who will consume their products, and that’s why we love them. Their flower, including the deliciously heavy indica Do-Si-Dos, is cared for by a team of passionate people who use purified and organic products to cultivate their hand-trimmed flower collection.\nAlso featured in: Leafly TV’s Growers: Episode 101\n\nOrange Blossom by Falcanna\nAvailable in: Washington\nA small medical operation turned Tier III licensed producer, Falcanna has seen it all when comes to cannabis—from the garden to the shop. Their dedication to the herb started as a dream between founders Bethany and Justin Rondeau and turned into a full grow facility delivering exceptional cannabis across Washington State. Their bright, floral hybrid Orange Blossom is as tasty as it is elevating and provides a perfect example of their dedication to quality flower.\nWhite Tahoe Cookies by Archive Portland\nAvailable in: Oregon\nWith multiple awards under their belt, Archive Portland boasts a team of growers with over 35 years of collective cannabis growing experience. That dedication to quality trickles down to the buds, where the exceptional indica White Tahoe Cookies takes on a smooth sedative high that keeps us coming back for more.\nLemonder by Seattle’s Private Reserve\nAvailable in: Washington\nWe save Seattle’s Private Reserve flower for special occasions; grown in a facility that is tightly sealed and meticulously controlled, the euphoric hybrid Lemonder has found its way into our stash boxes and smoke circles throughout 2017. SPR’s rigorous testing of all their cannabis products lets us consume with full peace of mind.\nLead image by Nastasic/iStock\n*Editor’s note: Leafly and Marley Natural are owned by the same parent company. Also, Marley Natural Red is available in California, Oregon, and Washington but may be a different high-CBD strain in each market.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/19103646/leafly-faves-flower.jpg","urlslug":"/news/strains-products/leaflys-faves-2017-flower"},{"id":"contentitems-3423","title":"New Strains Alert: The 2015 Michigan Cannabis Cup Winners","author":"Bailey Rahn","category":null,"date":"\/Date(1440774000000)\/","text":"Breeders and growers duked it out last weekend in Michigan for yet another High Times Cannabis Cup. The best of the best were pitted against each other, and we\u0027re curious how many of you have had the pleasure of trying these champs. Share your thoughts in a strain review or check out where to find these elite genetics at a shop near you by navigating to their strain page and clicking \"Availability.\"\nWithout further ado, here are your 2015 winners!\n \nCANNABIS FLOWER WINNERS\n\nBest Indica Flower\n1st Place: Zkittlez from 3rd Gen Family with Terphogz and The Union\n2nd Place: Strawberry Banana from Greenwolf Oregon with G.C. Rebellion Farms\n3rd Place: Deathwalker OG from Radicle Genetics in collaboration with Lenz and Valerio\n \nBest Sativa Flower\n1st Place: Strawberry Banana from Mass Genetics\n2nd Place: Tropicana from Cannabiotix\n3rd Place: Dreamy Jones from Bud White at Interlochen Alternative Health\n \nBest Hybrid Flower\n1st Place: Sunshine #4 by Bodhi Seeds from The Green Room Detroit\n2nd Place: Savant’s Grail from 710 Savant\n3rd Place: Crown OG from Crown OG with A Detroit Alternative and Moxie 71\n \nBest CBD Flower\n1st Place: Perkins Cut Cannatonic from Mota Rebel Genetics\n2nd Place: CBDee’s #1B from Pure West Compassion Club with LightSky Farms\n3rd Place: Super Sonic CBD from Radicle Genetics in collaboration with Valerio\n \nCANNABIS CONCENTRATE WINNERS\n\nBest Indica Concentrate\n1st Place: Faygo Red Pop Live Resin from 710 Savant\n2nd Place: Grape Valley Kush Live Resin from PeaceOil\n3rd Place: Moxie Goji Live Resin from A Detroit Alternative\n \nBest Sativa Concentrate\n1st Place: Clementine Live Resin from Crockett Family Farms\n2nd Place: Romulan Grenade’s Live Plant Run from LightSky Farms with NLG\n3rd Place: Tangie Live Resin from Greenwolf Oregon and Moxie Genetics\n \nBest Hybrid Concentrate\n1st Place: Strawberry Banana Lemonade from Greenwolf Oregon and Moxie 710\n2nd Place: Strawberry Banana from Loud Pack Extracts Oregon with Moxie Mix\n3rd Place: Crown OG from Moxie Genetics with ADA East\n \nBest Non-Solvent Hash\n1st Place: Goji Rosin from Moxie Seeds \u0026 Extracts with ADA East and Foundation Extracts\n2nd Place: Moxie Solventless Goji 120-micron from A Detroit Alternative\n3rd Place: 73-micron Bruce Banner #3 Freeze Dried Water Hash from Michigan Made Melts in collaboration with Kushmanjockin\n \nBest CBD Concentrate\n1st Place: CBD Cookies / Cannatonic / Cannasphere from Kannacare in collaboration with TerpTitan\n2nd Place: CBDee’s #1B Live Plant Run from Pure West Compassion Club with LightSky Farms\n3rd Place: Startonic Sap from Genotype A2 with A2 Wellness\n \nCANNABIS PRODUCT WINNERS\n\nBest Cannabis Edible\n1st Place: Kief Krispy from Budsuds with R.I. Finest and Kief Krispy\n2nd Place: Captain Kirk’s Truffle Tropicales from Captain Kirk Edibles of Ann Arbor Health Collective\n3rd Place: Got Milk? From Mindright\n \nBest CBD Cannabis Edible\n1st Place: Special Fx Labs CBD Dark Chocolate Mint from Jackson County Compassion Center\n2nd Place: Cherry Almond Sherbet Delight – CBD Special from Arborside Delights\n3rd Place: CBDee’s Strawberry Lemonade from LightSky Farms with NLG\n \nBest Cannabis Topical\n1st Place: PBO from PBOHeals.com\n2nd Place: Budsuds Purple Chem Topical Soap Bar from Budsuds with R.I. Finest and The Cali Connection\n3rd Place: Truu Hemp Infused Lotion from Mindright\n \nBest Cannabis Product\n1st Place: MOXIE | Moxie Mix\n2nd Place: Raw Papers | HBI\n3rd Place: Advanced Nutrients | Advanced Nutrients\n \nBest Glass\n1st Place: We Grow Michigan | Joe P x SD Ryno “Devil Duck Bot”\n2nd Place: Sacred Expressions | The Collector\n3rd Place: Nexus Glass | Tesla V3\n \nBest Vaporizer\n1st Place: Puff Co | Puff Co\n2nd Place: VaporZ | VaporZ\n3rd Place: WildBill’s Tobacco | Honey Pen","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/08/12002437/new-strains-alert-the-2015-michigan-cannabis-cup-winners.png","urlslug":"/news/strains-products/new-strains-alert-the-2015-michigan-cannabis-cup-winners"}],"reviewCount":174,"flavors":[{"name":"Sweet","score":35.2095085540363},{"name":"Berry","score":33.070910587519975},{"name":"Grape","score":29.540981683001974},{"name":"Grapefruit","score":22.154313997045243},{"name":"Citrus","score":15.663006704202616}],"effects":[{"name":"Relaxed","score":70.067717602131978},{"name":"Happy","score":53.059870253856559},{"name":"Euphoric","score":48.110253998787528},{"name":"Uplifted","score":38.954777299936183},{"name":"Creative","score":29.045677824929822}],"symptoms":[{"name":"Stress","score":32.155149577853912},{"name":"Depression","score":22.16066974468562},{"name":"Pain","score":20.887831276678586},{"name":"Fatigue","score":15.059077341004084},{"name":"Insomnia","score":11.392166518810347}],"conditions":[{"name":"Anxiety","score":20.901209458774755},{"name":"PTSD","score":11.08033487234281},{"name":"Arthritis","score":10.388180620569866},{"name":"ADD/ADHD","score":6.6260224753459216},{"name":"Migraines","score":4.5791606146319088}],"negatives":[{"name":"Dry Eyes","score":17.086205271981552},{"name":"Dry Mouth","score":15.938215021609542},{"name":"Headache","score":5.924001258704708},{"name":"Anxious","score":2.9161325764511994},{"name":"Dizzy","score":2.3354483602171086}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_1275.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005514/b/zkittlez__primary_d097.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_f574.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002250/b/zkittlez__primary_d8e5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_73f2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000204/b/zkittlez__primary_5c74.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_af44.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000203/b/zkittlez__primary_36ff.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_90f7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607756/b/zkittlez__primary_2af0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_ef66.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/586412/b/zkittlez__primary_85f3.jpg"}],"photoTotalCount":24,"popularCities":["Los Angeles, CA","Portland, OR","Seattle, WA","Eugene, OR","Phoenix, AZ","San Francisco, CA","Bend, OR","Hayward, CA","Oakland, CA","Oregon City, OR"],"permalink":"https://mobileapi.leafly.com/indica/zkittlez","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.58045977011494/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Grape Ape","subtitle":null,"slug":"grape-ape","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/grape-ape","symbol":"Ga","applink":"leafly://strain/grape-ape"},{"name":"Grapefruit","subtitle":null,"slug":"grapefruit","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/grapefruit","symbol":"Grf","applink":"leafly://strain/grapefruit"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":177263,"slug":"zkittlez","name":"Zkittlez","subtitle":null,"symbol":"Zlz","category":"Indica","description":"\u003cp\u003eZkittlez is an \u003ca href=\"http://www.leafly.com/explore/category-indica\"\u003eindica\u003c/a\u003e-dominant mix of \u003ca href=\"https://www.leafly.com/indica/grape-ape\"\u003eGrape Ape\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/sativa/grapefruit\"\u003eGrapefruit\u003c/a\u003e that is crossed with another undisclosed strain to produce this candy-flavored cannabis bred by 3rd Gen Family and Terp Hogz. This award-winning combination took 1st Place at the 2016 Emerald Cup and\u0026nbsp;1st Place Indica at the 2015 Cannabis Cups in San Francisco and in Michigan. The chunky \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\"\u003ecolas\u003c/a\u003e explode in a spectrum of light green hues and emit a \u003ca href=\"http://www.leafly.com/explore/flavors-sweet\"\u003esweet\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore/flavors-tropical\"\u003etropical\u003c/a\u003e blend of \u003ca href=\"http://www.leafly.com/explore/flavors-tree-fruit\"\u003efruit\u003c/a\u003e flavors. The effects of Zkittlez are surprisingly \u003ca href=\"http://www.leafly.com/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e for an indica, leaving consumers \u003ca href=\"http://www.leafly.com/explore/tags-focused\"\u003efocused\u003c/a\u003e, alert, and \u003ca href=\"http://www.leafly.com/explore/tags-happy\"\u003ehappy\u003c/a\u003e while \u003ca href=\"http://www.leafly.com/explore/tags-relaxed\"\u003erelaxing\u003c/a\u003e the body to help unwind any time of day.\u003c/p\u003e\n","descriptionPlain":"Zkittlez is an indica-dominant mix of Grape Ape and Grapefruit that is crossed with another undisclosed strain to produce this candy-flavored cannabis bred by 3rd Gen Family and Terp Hogz. This award-winning combination took 1st Place at the 2016 Emerald Cup and\u0026nbsp;1st Place Indica at the 2015 Cannabis Cups in San Francisco and in Michigan. The chunky colas explode in a spectrum of light green hues and emit a sweet, tropical blend of fruit flavors. The effects of Zkittlez are surprisingly uplifting for an indica, leaving consumers focused, alert, and happy while relaxing the body to help unwind any time of day.\n","aka":"Skittles, Skittlez, LemonZ","rating":4.58,"highlightedReviews":[{"id":1413831,"username":"John18","text":"Thank you for the investment of your time. I will try not to waste it.\nVisual Inspections:\nVarious shades of green, with slight purple, but most striking is the OFF THE CHARTS thick coat of white crystalline structures throughout the buds, all the way down the stalks. The bud structure is more like a sativa or a hybrid, with the largest cola approximately 6\"x2\", in the ounce, but most buds 2\" to 3\" size.\n\nThe Nose:\nThe odor of these flowers is truly unique for an Indica. They smell very similar to some Sativa varieties I\u0027ve experienced, like Jack Herrer or some other flowery/fruity scented buds. Most of the Indica strains I\u0027ve been lucky enough to smoke, have a hasty/earthy flavor, if derived from the kush from Afghanistan, or maybe a grapes/plum flavor, if a fine purple Indica is within your grasp; or even a,\"Blackwater\u0027s ,beautiful berry/tobacco/woodsy scent, is totally different than that of Zkiddlez. After grinding up a bud, a fruity, citrus odor stands out. A truly unique scent; a wonderful odor. Closest smell that comes to mind is a fine crop of Jack Herrer, on the Sativa end, and maybe a fresh bud of Northern Lights, on the Indica side.\n\nFlavor:\nI hand-rolled a nice joint, and brother, was it a delightful, delicious, first hit. Tastes very sweet and smooth...right now, it\u0027s the sweetest little doobie this old toker has ever enjoyed! I can taste a little citrus flavor from the grapefruit, and a lot of sweet berries and grapes. \n\nEffects:\nI smoked 1/2 the joint, as is my practice when giving reviews, and I\u0027m perplexed by some of the other ratings that give Zkiddlez low marks for strength, or as I like to term it, \"Stopping Power\", a phrase used to describe a weapons ability to take down your target with one shot.  Zkiddlez is plenty strong for,this old hombre, as I am pleasantly sedated in my body, yet mentally stimulated; enough so, that here I am, giving you this \"heads up\".\n\nConclusion:\nZkiddlez is a unique, delicious, and a very smooth smoke. I feel privileged to have the opportunity to experience its flavor and positive effects, and to be able to communicate these observations to you.\n5 Stars for Zkiddlez!\n","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1641979,"username":"jeremym27","text":"Great sex","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-52310","title":"Leafly’s Faves 2017: Flower","author":"Leafly Staff","category":null,"date":"\/Date(1513710785000)\/","text":"Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis flower products of 2017. How many have you tried? What was your favorite flower of 2017? Share with us in the comments below!\n\nChocolope by Gabriel\nAvailable in: Washington\nChocolope’s bright and dreamy sativa effects are magnified by the exceptional grow practices laid out in Gabriel’s airtight facilities. Their cultivation rooms are sealed from the outside, offering perfect environmental control that is carefully manipulated to stimulate the growth of the best quality flower.\nAlso featured in:\n\nWhat Are You Smoking? Episode 15\nWashington’s Best Tasting Strains From Fall 2017\n\nKosher Kush by Santa Cruz Veteran’s Alliance\nAvailable in: California\nThe high-THC indica Kosher Kush is the perfect strain to crush symptoms of PTSD, and the Santa Cruz Veteran’s Alliance—owned and operated by military veterans—produces this pain-relieving strain for those suffering. We love that members are offered free cannabis grown by fellow veterans in rooms meant to exude peace as the cannabis flower blooms.\nAlso featured in: The VA Can’t Provide Cannabis to Veterans With PTSD, so This Group Gives It Out for Free\nDutchberry by Artizen\nAvailable in: Washington\nWith around 27% THC to 8% CBD, the cheerful hybrid Dutchberry boasts one of the highest cannabinoid contents of all time. To house such a powerhouse strain, Artizen moves in tandem with their flower from growth to packaging—and delivers some excellent buds. We love that they slow down and take a little time with their cannabis crops from start to finish.\n\nPineapple by Fire Bros.\nAvailable in: Washington\nA Seattle favorite, Fire Bros. works with their own phenotypes to produce the most effective cannabis flower for consumers. For an uplifting hybrid strain such as Pineapple, stress-relieving characteristics are an important facet enhanced by Fire Bros.’ hand-selection process.\nHybrid Blend by Lowell Farms\nAvailable in: California\nLowell Farms, which works exclusively with flower, offers seasonal blends of their best strains, and we can’t get enough of their hybrid pre-rolls. We appreciate that they’re thinking outside the box in focusing on balanced flower mixes rather than strain-specific products. Grown in organic fertilizer free of pesticides, Lowell takes pride in their dedication to all-natural cannabis as well as in providing good wages for their workers.\nAlso featured in: What Are You Smoking? Episode 3\nZkittlez by Royal Choice Farms\nAvailable in: Arizona\nArizona does not require pesticide testing for cannabis, so it’s all the more important to find a grower you can trust. Royal Choice Farms chose to be an all-organic operation built on a whole lot of love and no pesticides. By instating natural grow methods, Royal Choice keeps our minds at ease when we’re lighting up their sweet indica Zkittles.\n\nCBD Blue Shark by Marley Natural Red\nAvailable in: California, Oregon, Washington*\nWith a full cannabis operation dedicated to Jamaica’s rich culture, Marley Natural hits it out of the park with their hand-selected flower line—notably, the anti-inflammatory and CBD-rich hybrid CBD Blue Shark. Cultivated by independent growers, we love Marley Natural’s dedication to craft cannabis, their commitment to sustainable growing practices, and their RISE UP social justice program.\nBlack Cherry Soda by Royal Tree Gardens\nAvailable in: Washington\nHaving built a facility from the ground up, Washington’s Royal Tree Gardens is a company steeped in perseverance. Licensed since 2014, Royal Tree Farms has been producing fantastic cannabis ever since, and their sativa-dominant Black Cherry Soda is no exception. We’ve been packing our bowls with this strain for its potent relief, particularly for the medical patients among us.\nDo-Si-Dos by Matrix NV\nAvailable in: Nevada\nOne of the best in medical-grade cannabis production, Nevada’s Matrix NV keeps their focus on the people who will consume their products, and that’s why we love them. Their flower, including the deliciously heavy indica Do-Si-Dos, is cared for by a team of passionate people who use purified and organic products to cultivate their hand-trimmed flower collection.\nAlso featured in: Leafly TV’s Growers: Episode 101\n\nOrange Blossom by Falcanna\nAvailable in: Washington\nA small medical operation turned Tier III licensed producer, Falcanna has seen it all when comes to cannabis—from the garden to the shop. Their dedication to the herb started as a dream between founders Bethany and Justin Rondeau and turned into a full grow facility delivering exceptional cannabis across Washington State. Their bright, floral hybrid Orange Blossom is as tasty as it is elevating and provides a perfect example of their dedication to quality flower.\nWhite Tahoe Cookies by Archive Portland\nAvailable in: Oregon\nWith multiple awards under their belt, Archive Portland boasts a team of growers with over 35 years of collective cannabis growing experience. That dedication to quality trickles down to the buds, where the exceptional indica White Tahoe Cookies takes on a smooth sedative high that keeps us coming back for more.\nLemonder by Seattle’s Private Reserve\nAvailable in: Washington\nWe save Seattle’s Private Reserve flower for special occasions; grown in a facility that is tightly sealed and meticulously controlled, the euphoric hybrid Lemonder has found its way into our stash boxes and smoke circles throughout 2017. SPR’s rigorous testing of all their cannabis products lets us consume with full peace of mind.\nLead image by Nastasic/iStock\n*Editor’s note: Leafly and Marley Natural are owned by the same parent company. Also, Marley Natural Red is available in California, Oregon, and Washington but may be a different high-CBD strain in each market.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/19103646/leafly-faves-flower.jpg","urlslug":"/news/strains-products/leaflys-faves-2017-flower"},{"id":"contentitems-3423","title":"New Strains Alert: The 2015 Michigan Cannabis Cup Winners","author":"Bailey Rahn","category":null,"date":"\/Date(1440774000000)\/","text":"Breeders and growers duked it out last weekend in Michigan for yet another High Times Cannabis Cup. The best of the best were pitted against each other, and we\u0027re curious how many of you have had the pleasure of trying these champs. Share your thoughts in a strain review or check out where to find these elite genetics at a shop near you by navigating to their strain page and clicking \"Availability.\"\nWithout further ado, here are your 2015 winners!\n \nCANNABIS FLOWER WINNERS\n\nBest Indica Flower\n1st Place: Zkittlez from 3rd Gen Family with Terphogz and The Union\n2nd Place: Strawberry Banana from Greenwolf Oregon with G.C. Rebellion Farms\n3rd Place: Deathwalker OG from Radicle Genetics in collaboration with Lenz and Valerio\n \nBest Sativa Flower\n1st Place: Strawberry Banana from Mass Genetics\n2nd Place: Tropicana from Cannabiotix\n3rd Place: Dreamy Jones from Bud White at Interlochen Alternative Health\n \nBest Hybrid Flower\n1st Place: Sunshine #4 by Bodhi Seeds from The Green Room Detroit\n2nd Place: Savant’s Grail from 710 Savant\n3rd Place: Crown OG from Crown OG with A Detroit Alternative and Moxie 71\n \nBest CBD Flower\n1st Place: Perkins Cut Cannatonic from Mota Rebel Genetics\n2nd Place: CBDee’s #1B from Pure West Compassion Club with LightSky Farms\n3rd Place: Super Sonic CBD from Radicle Genetics in collaboration with Valerio\n \nCANNABIS CONCENTRATE WINNERS\n\nBest Indica Concentrate\n1st Place: Faygo Red Pop Live Resin from 710 Savant\n2nd Place: Grape Valley Kush Live Resin from PeaceOil\n3rd Place: Moxie Goji Live Resin from A Detroit Alternative\n \nBest Sativa Concentrate\n1st Place: Clementine Live Resin from Crockett Family Farms\n2nd Place: Romulan Grenade’s Live Plant Run from LightSky Farms with NLG\n3rd Place: Tangie Live Resin from Greenwolf Oregon and Moxie Genetics\n \nBest Hybrid Concentrate\n1st Place: Strawberry Banana Lemonade from Greenwolf Oregon and Moxie 710\n2nd Place: Strawberry Banana from Loud Pack Extracts Oregon with Moxie Mix\n3rd Place: Crown OG from Moxie Genetics with ADA East\n \nBest Non-Solvent Hash\n1st Place: Goji Rosin from Moxie Seeds \u0026 Extracts with ADA East and Foundation Extracts\n2nd Place: Moxie Solventless Goji 120-micron from A Detroit Alternative\n3rd Place: 73-micron Bruce Banner #3 Freeze Dried Water Hash from Michigan Made Melts in collaboration with Kushmanjockin\n \nBest CBD Concentrate\n1st Place: CBD Cookies / Cannatonic / Cannasphere from Kannacare in collaboration with TerpTitan\n2nd Place: CBDee’s #1B Live Plant Run from Pure West Compassion Club with LightSky Farms\n3rd Place: Startonic Sap from Genotype A2 with A2 Wellness\n \nCANNABIS PRODUCT WINNERS\n\nBest Cannabis Edible\n1st Place: Kief Krispy from Budsuds with R.I. Finest and Kief Krispy\n2nd Place: Captain Kirk’s Truffle Tropicales from Captain Kirk Edibles of Ann Arbor Health Collective\n3rd Place: Got Milk? From Mindright\n \nBest CBD Cannabis Edible\n1st Place: Special Fx Labs CBD Dark Chocolate Mint from Jackson County Compassion Center\n2nd Place: Cherry Almond Sherbet Delight – CBD Special from Arborside Delights\n3rd Place: CBDee’s Strawberry Lemonade from LightSky Farms with NLG\n \nBest Cannabis Topical\n1st Place: PBO from PBOHeals.com\n2nd Place: Budsuds Purple Chem Topical Soap Bar from Budsuds with R.I. Finest and The Cali Connection\n3rd Place: Truu Hemp Infused Lotion from Mindright\n \nBest Cannabis Product\n1st Place: MOXIE | Moxie Mix\n2nd Place: Raw Papers | HBI\n3rd Place: Advanced Nutrients | Advanced Nutrients\n \nBest Glass\n1st Place: We Grow Michigan | Joe P x SD Ryno “Devil Duck Bot”\n2nd Place: Sacred Expressions | The Collector\n3rd Place: Nexus Glass | Tesla V3\n \nBest Vaporizer\n1st Place: Puff Co | Puff Co\n2nd Place: VaporZ | VaporZ\n3rd Place: WildBill’s Tobacco | Honey Pen","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/08/12002437/new-strains-alert-the-2015-michigan-cannabis-cup-winners.png","urlslug":"/news/strains-products/new-strains-alert-the-2015-michigan-cannabis-cup-winners"}],"reviewCount":174,"flavors":[{"name":"Sweet","score":35.2095085540363},{"name":"Berry","score":33.070910587519975},{"name":"Grape","score":29.540981683001974},{"name":"Grapefruit","score":22.154313997045243},{"name":"Citrus","score":15.663006704202616}],"effects":[{"name":"Relaxed","score":70.067717602131978},{"name":"Happy","score":53.059870253856559},{"name":"Euphoric","score":48.110253998787528},{"name":"Uplifted","score":38.954777299936183},{"name":"Creative","score":29.045677824929822}],"symptoms":[{"name":"Stress","score":32.155149577853912},{"name":"Depression","score":22.16066974468562},{"name":"Pain","score":20.887831276678586},{"name":"Fatigue","score":15.059077341004084},{"name":"Insomnia","score":11.392166518810347}],"conditions":[{"name":"Anxiety","score":20.901209458774755},{"name":"PTSD","score":11.08033487234281},{"name":"Arthritis","score":10.388180620569866},{"name":"ADD/ADHD","score":6.6260224753459216},{"name":"Migraines","score":4.5791606146319088}],"negatives":[{"name":"Dry Eyes","score":17.086205271981552},{"name":"Dry Mouth","score":15.938215021609542},{"name":"Headache","score":5.924001258704708},{"name":"Anxious","score":2.9161325764511994},{"name":"Dizzy","score":2.3354483602171086}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_1275.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005514/b/zkittlez__primary_d097.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_f574.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002250/b/zkittlez__primary_d8e5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_73f2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000204/b/zkittlez__primary_5c74.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_af44.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000203/b/zkittlez__primary_36ff.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_90f7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607756/b/zkittlez__primary_2af0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/zkittlez_100x100_ef66.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/586412/b/zkittlez__primary_85f3.jpg"}],"photoTotalCount":24,"popularCities":["Los Angeles, CA","Portland, OR","Seattle, WA","Eugene, OR","Phoenix, AZ","San Francisco, CA","Bend, OR","Hayward, CA","Oakland, CA","Oregon City, OR"],"permalink":"https://mobileapi.leafly.com/indica/zkittlez","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.58045977011494/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Grape Ape","subtitle":null,"slug":"grape-ape","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/grape-ape","symbol":"Ga","applink":"leafly://strain/grape-ape"},{"name":"Grapefruit","subtitle":null,"slug":"grapefruit","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/grapefruit","symbol":"Grf","applink":"leafly://strain/grapefruit"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
