{
    "aka": "m39, m 39",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1501426821000)/",
            "id": "contentitems-35532",
            "text": "One of the things that makes every cannabis strain unique is its aroma. From sweet berry and fruit to earthy, herbal, and floral, an attractive fragrance is native to most strains.\nAnd then there are those that, whether by accident or breeder’s intention, inherited flavors that truly challenge the palate. With names like “Cat Piss” and “Dog Shit,” it’s clear that no one is in denial of this odiferous reality.\nOddly enough, either by novelty or quality of effects, many of these remain staples in the cannabis community despite their strange, borderline terrible aromas.\n\n   Sour Cheese\nSour Cheese, UK Cheese, Exodus Cheese…all of these strains refer to a lineage characterized by a sour, savory aroma. Offering mellow euphoria that lifts energy and mood, Sour Cheese is a delightful hybrid strain with a funky flavor that most consumers can look past. But with a fragrance this stinky, we see polarized opinions.\nSome love it so much, it inspires poetry. Just magical:\n\n“When you open the jar and take a whiff you are greeted with a splash of pungent sour that quickly turns into a smooth cheese. The buds release a satisfying snap that throws trichomes into the air when broken from the stems.” – Neemix\n\nBut then:\n\n“[S]mells like puke.” – soop21\n\n\n   Cat Piss\nThis sativa has a pungent aroma that is reminiscent of ammonia–and thus, cat urine. But there’s a reason Cat Piss keeps getting planted, and it has something to do with the buzzy, stimulating effects considered to be worth the funk, according to many Leafly reviewers.\n\n“Besides the [wretched] taste that leaves you wanting water and a mint, soon you will be too uplifted to care! Effects are amazing and are long lasting.” –misterbest\n\nHowever, if you’re susceptible to paranoia and anxiety like this poor reviewer, maybe avoid this novelty strain altogether:\n\n“Yuck. It really does smell like cat piss. Strong, racy sativa. Made me paranoid.” –aarvind\n\n\n   Dog Shit\nSpeaking of animal waste you’d never expect to find yourself smoking, Dog Shit is yet another strain named for its foul-smelling aroma. A hybrid strain most easily acquired in Oregon, its odor doesn’t always come out smelling like sour, funky “doody pies.” But even when it does, Dog Shit retains an unexpected fan base:\n\n“My first impressions of the bud were that they were very stinky and definitely lived up to their name however once I smoked it the smell evolved into something more sweet and pleasant.” – DogeKing\n\nBut, to the shock of absolutely no one, this poopy scented strain ain’t for everyone:\n\n“I got very anxious and paranoid when taking this and it smells kinda bad.” – BONECRUSHER27\n\n\n   M-39\nBased on descriptions from Leafly users, M-39 sounds like Canadian ditchweed grown in a tar pit. And, according to reviews, its aroma is most commonly likened to just that–tar. Some say that its abundance can be attributed to its dull, lackluster aroma that made it easier to smuggle. Across the board, it seems the quality of this strain varies, as well as opinions of it:\n\n“It has a very strong smell almost a combination of paint and smelly body odor.” – StoneySundays\n\nBut I guess it isn’t always bad:\n\n“[H]as a soft smoke with notes of peanut butter and fall aroma.” – ray8753\n\nSo does it taste like tar or warm autumnal cookies? You’ll probably have to wander over to Canada’s black market to find out.\n\n   Grandpa’s Breath\nThere’s a slightly musty hint to this strain, but it’s really not as bad as it sounds. Grandpa’s Breath is more aptly named for the Granddaddy Purple genetics used to breed it, but still, expectations set by the name can shape the experience.\n\n“Real nice body high, heavy relaxed head feeling, taste isn’t amazing but isn’t unpleasant either.” – hazefordayz\n\nBut this reviewer not only loves Grandpa’s Breath – he/she “loooooves” it:\n\n“This is one of the best tasting and medicating, fragrant strains I’ve ever had. I looooove Grandpa’s Breath!” – Strandz\n\nIt’s clear that there’s a layer of subjectivity when it comes to cannabis flavors–even flavors as unusual and questionable as those explored in this roundup. Although you may never want to try any of these, they do demonstrate the vast aromatic spectrum cannabis has to offer. And that, at the very least, is kind of impressive.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/28114836/cannabis-aroma-1.jpg",
            "title": "5 Cannabis Strains With Unusual (and Arguably Terrible) Aromas",
            "urlslug": "/news/strains-products/cannabis-strains-with-unusual-aromas"
        },
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1467399600000)/",
            "id": "contentitems-3065",
            "text": " \nDid you know that many beloved cannabis strains hail from the United States' northern neighbors? In honor of Canada Day and the promising strides the country has made towards nationwide legalization, here are 11 strains with Canadian roots. Pick one up and raise a joint to celebrate the friendly Canucks up north!\n \n  Manitoba Poison\nThe Manitoba province is located at the longitudinal center of Canada, so it's only fitting that Manitoba Poison is a 50/50 hybrid (though you'll likely feel the heavy indica properties pretty quickly).\n  Sweet Tooth\nAn oldie but a goodie, Sweet Tooth won 1st Place in the 2001 High Times Cannabis Cup.\n  Mendocino Purps\nMendocino Purps, or simply \"The Purps,\" is one of a few living legends that made this list. Handed off as a clone-only cut, this plant was stabilized by BC Bud Depot and has since made its way around the world. \n  Chemo\nChemo, or UBC Chemo, is named for the university where the strain was allegedly created and for its supplementary effects on patients going through chemotherapy. This strain is an international treasure with origins that reach back to the 1970s.\n  M-39\nThe clever astronomical designation of M-39 speaks to the Northern Light #5 portion of this cross. \n  God Bud\nGod Bud is some of the finest around. This incredible indica-dominant strain lives in the pantheon of cannabis deities, but like many of the old gods, this strain is the primogenitor to many other floral demigods like Blue God and Grape God.\n  DJ Short Blueberry\nDJ Short is one of the principal breeders in the cannabis industry. With cuts like Juicy Fruit and Flo, he's left a lasting mark on the cannabis industry with exotic genetic crosses cultivated through a life of world travel and reverence for this resinous flower. DJ Short Blueberry is known as THE west coast Blueberry phenotype.\n  Blue Dynamite\nBlue Dynamite was featured as one of the top 10 strains of 2007 in High Times magazine. \n  Island Sweet Skunk\nBred by Federation Seed Company in Canada, this beautiful blend of strong landrace genetics offers a smoke that is stimulating and versatile. Known for creating considerable amounts of tertiary CBD, Island Sweet Skunk invigorates the user while still offering anti-inflammatory and analgesic effects.\n  Lowryder\nLowryder is a squat and resilient plant that is ideal for outdoor grows in less than pleasant climates, making it a seasoned fit for Canadians seeking a plant that could grow and hide in plain sight while weathering a rugged season. \n  Romulan\nRomulan is a space-age indica sent to Earth to expand our mind. And with Canada's savvy immigration policy, it's no wonder this heady smoker stopped there first.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001518/cannabis-strains-with-canadian-roots.jpg",
            "title": "11 Cannabis Strains with Canadian Roots",
            "urlslug": "/news/strains-products/cannabis-strains-with-canadian-roots"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 9.74702380952381
        },
        {
            "name": "PMS",
            "score": 4.278273809523809
        },
        {
            "name": "Migraines",
            "score": 1.7857142857142856
        },
        {
            "name": "PTSD",
            "score": 1.0044642857142858
        },
        {
            "name": "ADD/ADHD",
            "score": 0.6696428571428571
        }
    ],
    "description": "<p>The offspring of <a href=\"http://www.leafly.com/hybrid/northern-lights--5\">Northern Lights #5</a> and <a href=\"http://www.leafly.com/hybrid/skunk-1\">Skunk #1</a>, M-39 is a difficult crop to grow properly. However, when grown correctly, the M-39 marijuana strain has a fruity and lemon taste with many trichomes and very visible crystals. The buds are very compact, heavy, and dense. Flowering time is about 45 days, with the strain&#39;s THC content measuring&nbsp;up to 16.5%.&nbsp;</p>\n",
    "descriptionPlain": "The offspring of Northern Lights #5 and Skunk #1, M-39 is a difficult crop to grow properly. However, when grown correctly, the M-39 marijuana strain has a fruity and lemon taste with many trichomes and very visible crystals. The buds are very compact, heavy, and dense. Flowering time is about 45 days, with the strain&#39;s THC content measuring&nbsp;up to 16.5%.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 40.25297619047619
        },
        {
            "name": "Happy",
            "score": 36.08630952380952
        },
        {
            "name": "Hungry",
            "score": 35.863095238095234
        },
        {
            "name": "Uplifted",
            "score": 32.06845238095238
        },
        {
            "name": "Focused",
            "score": 27.901785714285715
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 57.40327380952381
        },
        {
            "name": "Pungent",
            "score": 29.50148809523809
        },
        {
            "name": "Citrus",
            "score": 26.5625
        },
        {
            "name": "Flowery",
            "score": 26.004464285714285
        },
        {
            "name": "Lemon",
            "score": 5.059523809523808
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1381643,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/0/240",
            "text": "The worst weed you can find in Montreal - it's notoriously poorly grown, has very little smell or taste, minimal trichomes and just lacks everything from strength to bag appeal. It's a very common strain here but it's really just for kids who don't have a clue and to rip off tourists. If you have a need to try our local strains Jean Guy is a nice widow/skunk cross, but frankly go west young and old potheads, go west. ",
            "username": "Anonymous"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png",
            "id": 1605017,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Got an ounce of m39 for 150 bucks.  I was expecting it to be mediocre quality but the nugs are big and frosty and the weed smells very piney with some citrus.  It has a fairly long high and a pretty nasty burn out. Its definitely not something you'd wanna smoke everyday but overall I was pleasantly surprised with this strain",
            "username": "borkedstoner"
        }
    ],
    "id": 95,
    "name": "M-39",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 37.760416666666664
        },
        {
            "name": "Dry Eyes",
            "score": 30.91517857142857
        },
        {
            "name": "Headache",
            "score": 28.348214285714285
        },
        {
            "name": "Dizzy",
            "score": 27.008928571428573
        },
        {
            "name": "Paranoid",
            "score": 2.455357142857143
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/northern-lights--5",
            "category": "Indica",
            "name": "Northern Lights #5",
            "permalink": "https://mobileapi.leafly.com/indica/northern-lights--5",
            "slug": "northern-lights--5",
            "subtitle": null,
            "symbol": "N5"
        },
        {
            "applink": "leafly://strain/skunk-1",
            "category": "Hybrid",
            "name": "Skunk #1",
            "permalink": "https://mobileapi.leafly.com/hybrid/skunk-1",
            "slug": "skunk-1",
            "subtitle": null,
            "symbol": "Sk1"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/m-39",
    "photoTotalCount": 53,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/657931/b/m-39__primary_2ac3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/m-39_100x100_5ade.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/656204/b/m-39__primary_83f6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/m-39_100x100_76cf.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/642898/b/m-39__primary_c95b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/m-39_100x100_4faf.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/642675/b/m-39__primary_d1d9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/m-39_100x100_6619.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/625515/b/m-39__primary_7e51.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/m-39_100x100_8a0c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/608146/b/m-39__primary_0da6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/m-39_100x100_dacc.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [],
    "rating": 3.17,
    "relatedStrains": [],
    "reviewCount": 168,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "m-39",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/3.17261904761905/240",
    "subtitle": null,
    "symbol": "M39",
    "symptoms": [
        {
            "name": "Stress",
            "score": 35.416666666666664
        },
        {
            "name": "Nausea",
            "score": 26.785714285714285
        },
        {
            "name": "Lack of Appetite",
            "score": 25.78125
        },
        {
            "name": "Pain",
            "score": 6.733630952380952
        },
        {
            "name": "Depression",
            "score": 6.510416666666666
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
