{
    "aka": "Hawgsbreath",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Lisa Rough",
            "category": null,
            "date": "/Date(1417562220000)/",
            "id": "contentitems-3589",
            "text": "This week is Crohn’s Disease and Colitis Awareness week. For those of you that don’t know, Crohn’s Disease and Ulcerative Colitis are gastrointestinal disorders in a group of conditions known as Inflammatory Bowel Disease.\nCrohn’s Disease is a chronic inflammation of the gastrointestinal tract that can affect any part of the GI tract, from the mouth to the rectum, although it may skip certain areas of the intestine, leaving some healthy, while other parts suffer. Ulcerative Colitis is a very similar disease in the IBD group of disorders, but it only affects the colon, affecting only the innermost lining of the colon. \nThe telltale symptoms of Crohn’s Disease:\n\nPersistent diarrhea\nRectal bleeding\nAbdominal pain and cramps\nConstipation\nUrgent need to move bowels\nSensation of incomplete evacuation or “rectal tenesmus” (Hey, you learned a new word!)\n\nOther signs that are associated with IBD:\n\nFever\nLoss of appetite\nWeight loss\nFatigue\nNight sweats\nLoss of menstrual cycle in women\n\nSounds terrible, doesn’t it? These are painful, life-altering disorders, which is why Crohn’s Disease and Colitis are specified as qualifying conditions for medical cannabis in nearly half of all medical marijuana states.\nThese symptoms can be controlled somewhat through diet, but often cannabis offers some of the best relief for the most severe symptoms – cramps, nausea, loss of appetite, etc.\nWithout further ado, in honor of Crohn’s Disease and Colitis Awareness Week, here are the top strains for your symptoms:\n 1. Jean Guy\nA fan favorite from our neighbors to the North (Canada, eh?), Jean Guy (pronounced “Jawn Gee”) is a sativa-dominant strain known for its high THC content and energizing effects. A great one to start your day cramp-free.\n 2. Hog's Breath\nHog’s Breath is a well-known indica with roots in the Kush landrace and is known for its potency against heavy pain and anxiety – a good strain to relax after a long work day.\n 3. Medicine Man\nMedicine Man lives up to its name by delivering potent pain relief with high levels of both THC and CBD. This medicinal strain is closely related to the master of the indica jungle – White Rhino.\n 4. Hash Plant\nHash Plant is known for an abundance of trichomes and a heavy body stone. This indica has a reputation for blissful euphoria, as well as easing pain and inflammation associated with Crohn’s and Colitis.\n 5. Willie Nelson\nWillie Nelson is named for the Red-Headed Stranger himself. This sativa offers a clear-headed, energetic high known to incite creativity, as well as a decent case of the munchies. \n 6. Chemo\nChemo is just as sedative as you might imagine – a heavy body high that’s perfect for chronic pain. Take note: the munchies are strong with this one. If you have stomach cramps or trouble eating, this strain will inspire your appetite.\n 7. Lemon Jack\nLemon Jack is born of the famed Jack Herer and Lemon Kush and offers strong psychoactive effects. Lemon Jack is a daytime strain as strong as a cup of coffee, but without the harsh stomach irritation. Recommended for users who suffer from fatigue.\n 8. Golden Pineapple\nGolden Pineapple is as delightful as it sounds. A hybrid cross that delivers uplifting, creative effects with a delicious fruity taste, it offers relief from stress and anxiety without causing fatigue.\n 9. Confidential Cheese\nConfidential Cheese is born of the legendary LA Confidential and Exodus Cheese. It offers powerful pain relief, as well as relief from insomnia. Great for winding down before bedtime, Confidential Cheese also subdues painful muscle spasms and cramps.\n 10. K2\nK2 is named for the world’s second highest mountain peak, which makes sense, as it comes from two of the greats – White Widow and Hindu Kush. K2 is known to increase appetite and calm nausea without any sedative sleepy effects, making it a great strain for both daytime and evening use.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/12/12002927/top-10-strains-to-combat-crohns-and-colitis.jpg",
            "title": "Top 10 Strains to Combat Crohn’s Disease and Colitis",
            "urlslug": "/news/strains-products/top-10-strains-to-combat-crohns-and-colitis"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "PTSD",
            "score": 21.996753246753244
        },
        {
            "name": "Anxiety",
            "score": 19.778138528138527
        },
        {
            "name": "Arthritis",
            "score": 7.142857142857142
        },
        {
            "name": "Multiple Sclerosis",
            "score": 7.142857142857142
        },
        {
            "name": "Spinal Cord Injury",
            "score": 7.142857142857142
        }
    ],
    "description": "<p>Winner of the 2002 Cannabis Cup for best indica, Hog's breath was bred from Hindu Kush and Afghani in Tennessee. Her buds are light and dark green with orange hairs and a healthy amount of crystals on its dense buds. The taste has been described as cheddar and provides a overall tingly mind and body high. The THC content is up to 13% and CBD up to 0.47%.</p>",
    "descriptionPlain": "Winner of the 2002 Cannabis Cup for best indica, Hog's breath was bred from Hindu Kush and Afghani in Tennessee. Her buds are light and dark green with orange hairs and a healthy amount of crystals on its dense buds. The taste has been described as cheddar and provides a overall tingly mind and body high. The THC content is up to 13% and CBD up to 0.47%.",
    "effects": [
        {
            "name": "Relaxed",
            "score": 43.47943722943723
        },
        {
            "name": "Sleepy",
            "score": 33.116883116883116
        },
        {
            "name": "Happy",
            "score": 29.951298701298697
        },
        {
            "name": "Hungry",
            "score": 18.26298701298701
        },
        {
            "name": "Focused",
            "score": 16.937229437229437
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 39.31277056277057
        },
        {
            "name": "Pungent",
            "score": 18.073593073593074
        },
        {
            "name": "Woody",
            "score": 15.61147186147186
        },
        {
            "name": "Cheese",
            "score": 9.415584415584416
        },
        {
            "name": "Flowery",
            "score": 8.08982683982684
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1398895,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I'll give this stuff somewhere between an 8.5 and a 9. \r\n\r\nWhen I heard we were picking some up two days ago, my initial reaction was a mix between curiosity and skepticism. I had never heard of 'Hog's Breath' before, and I didn't really get a, \"Wow, that sounds awesome!\", sensation from the name. Nonetheless, when it arrived, we loaded up the standard glass pipes, smoked a good three or four hits....and, slowly realized that our hands were too heavy to take the fifth.\r\n\r\nThe moment I received the bag I shoved my nose in, and was instantly overwhelmed by the perplexity Hog's Breath's smell. It didn't have the slightest whiff of skunk, rather a more pungent and wet odor... but it was more than that. A ghostly after-smell like faint hints of Springtime's orchards and fresh cut lawns lingered in my nose. The buds themselves were tight and dense. Small pockets of orange hairs littered the forest green nuggets, so covered with trichomes that they appear almost blurry on first glance. Still, many strains smell great and are far more intriguing to observe than this particular one, so, into the pipe it goes.\r\n\r\nLike I said, we smoked out of normal medium-sized glass pipes, a medium bowl pack to the head. It goes down smooth but tastes kind of funky. If I had to put a description on it I would say the flavors comparable to eating a dirt-covered plant. Certainly not the best tasting bud I've had, but, it's mellow and smooth! I took a few more hits and...\r\n \r\nIt didn't really take me long at all to notice how high I was. This strain hit me hard and fairly fast, and it continues to do so after 2 days of use. About an half hour after the initial application though inhalation, my creative senses skyrocketed. I couldn't put down my guitar even to smoke a cigarette, and as a rather 'artsy fartsy' person, one of the main qualities I search for in bud is creative enhancement. Don't consider me biased though! This herb is plenty powerful enough to satisfy any connoisseur of fine Cannabis. Make sure you watch out for the cotton-mouth, (it's vicious and persistent) and I've noticed the munchies tend to come in intense spurts. Not too bad for the only downsides if you ask me. \r\n\r\nWith all that said, I wouldn't really recommend this for an amateur toker. There's a possibility they might find it to be a little overbearing. Or, they could think its awesome and have a great time. Who knows?  It depends on the person. \r\n\r\nAnyways, Hog's Breath has completely revived my faith that there are amazingly fire strains out there. I will confidently say this stuff's worth a try. It's powerful, long-lasting, and warmly euphoric, a nice complement to anyone's stash.",
            "username": "MarijuaNaut"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1639633,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Shiver & shutter\nRecovers your mother....\nI need a peeler!\n",
            "username": "oobydo"
        }
    ],
    "id": 151,
    "name": "Hog's Breath",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 13.014069264069263
        },
        {
            "name": "Dry Eyes",
            "score": 11.877705627705627
        },
        {
            "name": "Paranoid",
            "score": 1.5151515151515151
        },
        {
            "name": "Dizzy",
            "score": 0.946969696969697
        },
        {
            "name": "Headache",
            "score": 0.7575757575757576
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/indica/hogs-breath",
    "photoTotalCount": 26,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003197/b/hog-s-breath__primary_602d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/hog-s-breath_100x100_c7bd.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001967/b/hog-s-breath__primary_5f10.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/hog-s-breath_100x100_1c55.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001964/b/hog-s-breath__primary_f16d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/hog-s-breath_100x100_c314.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636140/b/hog-s-breath__primary_378a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/hog-s-breath_100x100_8c07.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503716/b/hog-s-breath__primary_2099.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/hog-s-breath_100x100_c1b9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/421709/b/hog-s-breath__primary_d0a4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/hog-s-breath_100x100_19ff.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Bellingham, WA",
        "Detroit, MI",
        "Los Angeles, CA",
        "Des Moines, WA",
        "Los Angeles,CA",
        "Puyallup, WA"
    ],
    "rating": 4.18,
    "relatedStrains": [],
    "reviewCount": 94,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "hogs-breath",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.18085106382979/240",
    "subtitle": null,
    "symbol": "Hog",
    "symptoms": [
        {
            "name": "Stress",
            "score": 29.193722943722943
        },
        {
            "name": "Pain",
            "score": 27.11038961038961
        },
        {
            "name": "Insomnia",
            "score": 25.974025974025974
        },
        {
            "name": "Depression",
            "score": 18.64177489177489
        },
        {
            "name": "Nausea",
            "score": 17.126623376623375
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
