{"sl_translate":"description,descriptionPlain,category","id":85233,"slug":"goo","name":"Goo","subtitle":null,"symbol":"Goo","category":"Indica","description":"\u003cp\u003eGoo, not to be confused with \u003ca href=\"http://www.leafly.com/indica/afgoo\"\u003eAfgoo\u003c/a\u003e, is an 80% \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e strain that mixes a sweet-tasting \u003ca href=\"http://www.leafly.com/indica/blueberry\"\u003eBlueberry\u003c/a\u003e with the hashy, resinous \u003ca href=\"http://www.leafly.com/indica/hindu-kush\"\u003eHindu Kush\u003c/a\u003e. Deep physical\u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003e relaxation\u003c/a\u003e is coupled with slight cerebral \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergy\u003c/a\u003e, delivered alongside a \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-tree-fruit\"\u003efruity\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-blueberry\"\u003eblueberry\u003c/a\u003e flavor with \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eearthy\u003c/a\u003e and sour notes. You may begin to feel pangs of \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-hungry\"\u003ehunger\u003c/a\u003e settle in with this indica, making it a suitable medicine for those needing \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-lack-of-appetite\"\u003eappetite\u003c/a\u003e boost. Patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-insomnia\"\u003einsomnia\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-muscle-spasms\"\u003emuscle spasms\u003c/a\u003e may also find relief in the heavy, \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-sleepy\"\u003esedating\u003c/a\u003e effects Goo has to offer. Cultivators should harvest Goo after a 7 to 8 week flowering time indoors or in early October for outdoor gardens.\u003c/p\u003e\n","descriptionPlain":"Goo, not to be confused with Afgoo, is an 80% indica strain that mixes a sweet-tasting Blueberry with the hashy, resinous Hindu Kush. Deep physical relaxation is coupled with slight cerebral energy, delivered alongside a fruity, blueberry flavor with earthy and sour notes. You may begin to feel pangs of hunger settle in with this indica, making it a suitable medicine for those needing appetite boost. Patients treating insomnia, pain, and muscle spasms may also find relief in the heavy, sedating effects Goo has to offer. Cultivators should harvest Goo after a 7 to 8 week flowering time indoors or in early October for outdoor gardens.\n","aka":null,"rating":4.34,"highlightedReviews":[{"id":1411117,"username":"kris25cd","text":"Vaporized goo that I purchased at Encanto Green Cross worked great for my lower back pain. highly recommend for relaxing before bed.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"},{"id":1601830,"username":"Green_Goblin","text":"Great strain to cut stress away and help you relax.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-56321","title":"Bizarre Cannabis Strains With Unusual Growth Characteristics","author":"Trevor Hennings","category":null,"date":"\/Date(1517438911000)\/","text":"Like all plants, cannabis comes in all shapes and sizes. Generally speaking, strains will exhibit differences in resin production, coloration, stature, and shape. Other times, cannabis will express itself with features you’ve probably never seen firsthand. Below are five of the most unique and unusual genetic traits found in cannabis plants from all around the world. Whether by genetic mutation, environment, or factors unknown, these cannabis oddities are sure to stand out in any cannabis garden.\nAlbino Cannabis\n\n\n\n\n\n Couldn\u0027t resist posting another picture of this beauty showing one of the two tone buds.  This is one of our more unique plants in the outdoor garden, this plant is displaying variegation characteristics.  This anomaly occurs when the genes controlling the production of chlorophyll are not expressed correctly resulting in albino characteristics. There will be a very limited supply of this \u0026 we\u0027ll let you know which retailer will be carrying it.  #albinocannabis #whitecannabis #wanorml #norml #normllife #womengrow #fineweed #wafinestcannabis #marijuana #modernfarmer #mjfarm #pesticidefree #legalmarijuana #legalmj #i502 #cannabis #peaceloveandcannabis\nA post shared by  Washington\u0027s Finest Cannabis (@washingtons_finest_cannabis) on Oct 2, 2015 at 7:01pm PDT\n\n\n\nAlbinism is a rare genetic mutation that occurs in humans, animals, and plants such as cannabis. An albino plant is one that grows with the complete or partial absence of chlorophyll pigmentation, causing the plant to appear lighter or white in color. The plants must contain some chlorophyll to perform photosynthesis (the process by which plants covert light energy into food), so albino plants may never make it to maturity before dying.\n\nDr. Grinspoon\n\n\n\n\n\n #420Magazine #Marijuana #DrGrinspoon #its420somewhere\nA post shared by  420 Magazine (@420magazine) on May 6, 2015 at 12:19pm PDT\n\n\n\nThe spindly strain called Dr. Grinspoon was dedicated to the longtime cannabis advocate and professor at Harvard, Dr. Lester Grinspoon. In the early 60s, Dr. Grinspoon condemned the use of cannabis as its popularity grew, but came to endorse it after studying the plant. He found that the information that was being shared to the public was not supported by his research and felt that the public was being strongly misled.\nThis strain is a pure sativa heirloom that typically invites creativity, energy, and cerebral activity. Bred by Barneys Farm in Amsterdam, it grows with a bizarre stature: Instead of developing bud sites at the nodes of the branches, Dr. Grinspoon grows small buds that decorate the plant like berries on a holly plant. Because of its unconventional appearance, this strain is also a solid choice for growers seeking subtlety in their garden.\nDr. Grinspoon is not a high yielding strain and has a 14-week flowering period, making it an unpopular strain among commercial growers. But novelty-seeking cultivators raising this potent sativa will be rewarded with a truly unique product.\nPolyploid Cannabis\n\n\n\n\n\n More shots of the weird mohawk bud 👽👾 phenotype​. #mohawk #phenohunters #macro #santacruz #scfarms #pistils #calyx #trichomes #faded #polyploid #flowers #alien\nA post shared by  Santa Cruz Farms LLC (@scfarms) on Mar 5, 2017 at 1:44pm PST\n\n\n\nPolyploidy occurs in plants that contain more than two sets of chromosomes in their genetic makeup. While most cannabis plants are simply diploid (two sets of chromosomes), many growers find that polyploid cannabis plants produce larger flowers with resilience to disease and pests. While this mutation in animals is often destructive, it is generally successful in plants. Many flowering plants have picked up extra chromosomes, and this mutation has often helped them become adaptive and resilient.\nBuddha Seeds from Spain has been exploring polyploidy for a number of years now with the goal of producing more potent, high-yielding strains. The mutation is difficult to work with and difficult to clone, making polyploid cannabis plants few and far between.\n\nFrisian Duck \n\n\n\n\n\n Frisian Duck! http://tinyurl.com/Buyduckseeds #dutchpassion #dutchpassion #outdoorweedisthebest #harvesttime #frisianduckfoot #frisianduck #frisianduckfoot #frisianduckseeds #dutchpassion\nA post shared by  Dutch Passion (@dutchpassionseedcompany) on Sep 8, 2015 at 12:21pm PDT\n\n\n\nFrisian Duck, a cross between Frisian Dew and Ducksfoot, was bred by Dutch Passion out of Amsterdam. While Frisian Dew was produced as a high-yielding outdoor strain, “Ducksfoot” is a unique mutation that results in oddly shaped cannabis leaves. This cross holds on to the Ducksfoot leaf pattern while producing beautiful deep purple buds that are compact with spicy notes of citrus and pine.\nA targeted benefit of Frisian Duck is stealth. With leaves that look nothing like a normal cannabis plant, Frisian Duck became a great strain for growers seeking to raise cannabis incognito.\nBlack Haze\n\n\n\n\n\n Black Haze ☁ 🔥 #blackhaze #exoticstrain #gumdrop #shimmerandshine #dank #gas #cannabis #marijuana #herb #herblife #420 #hippylife #medicinal #legalizeit\nA post shared by  Kush Dreamz (@kush_dreamin_420) on Dec 27, 2017 at 7:37pm PST\n\n\n\nIt’s not unusual to see vibrant or dark shades of purple in cannabis, but some strains achieve hues so distinct, you’ll likely never forget them. Black Haze is one of those strains, and as the name suggests, it oftentimes produces flowers that are near-black in color. Produced by Exotic Seed in Europe, this strain is an autoflowering variety that crosses Sir Jack x Skunk Auto and Pakistani Chitral Kush.\nOther strains that sometimes express unusually dark hues include Black Lemon, Black Domina, Black Dahlia, and Black Diesel. Cannabis may also uniquely express blue, pink, and red coloration.\n\nPinkman Goo\n\n\n\n\n\n Interview about my exclusive \" Pinkman Goo \" 3way hybrid ( GDPXGrape Ape ) x northern lights 5 by @merryjane see more about plant guttation at its finest,  subscribe youtube.com/CaliCropDoc for video updates\nA post shared by  CaliCropDoc – Grower Education (@calicropdoc_) on Mar 10, 2016 at 4:10pm PST\n\n\n\nPinkman Goo is a strain developed by Twompson Prater of Cali Crop Doc. Discovered while growing a few unidentified seeds found by his sister, Pinkman Goo was named after observing little balls of goo secreted by the buds 3-4 weeks into flowering. It’s up for debate how the goo balls are created, but one theory hypothesizes that they result from nighttime “respiration” after the plant’s stomata close.\nHave you come across any unusual cannabis strains? Tell us about them, or better yet, post a photo of them in the comments section below.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/31143125/cannabis-mutants.jpg","urlslug":"/news/strains-products/bizarre-cannabis-strains-with-unusual-growth-characteristics"},{"id":"contentitems-49637","title":"The 13 Best Cannabis Strains for Parties","author":"Brett Konen","category":null,"date":"\/Date(1511383998000)\/","text":"A lot of people think of alcohol as the classic social lubricant. For some of us, it is. Alcohol can loosen us up, make us chatty and animated, and wash away social anxiety. It’s also often readily available at social occasions. Meanwhile, many people avoid cannabis use during social events—for one thing, it’s generally not served, and for another, many can recall a time cannabis made them paranoid or sleepy at a party, and don’t want to have that happen again.\n\nLuckily, with the right strains you can avoid the unwanted effects mentioned above. We used the advanced filters in Leafly’s strain explorer to get started, sorting to include strains with the happiest, most talkative highs, and to exclude any strains that make users anxious, paranoid, or sleepy. (If only alcohol’s drawbacks were so easy to filter out, am I right?)\nWe’ve curated the resultant list with our in-house expertise, vetting all suggestions against our own experiences and ensuring there’s a pick for every type of party. Attendees heading to any social occasion will find something below.\nAnd the awards for the best party cannabis strains go to…\nChocolope\nStrain type: Sativa\nBest for: All occasions.\nDNA Genetics developed Chocolope by crossing Chocolate Thai with Cannalope Haze to create their homage to the super-popular Chocolate strains of the 1980s. The hefty sativa buds give earthy, sweet coffee flavors that provide a dreamy, cerebral effect. It’s known around the Leafly office as “the party strain,” and for good reason—it’s basically impossible to be unhappy or introverted with such a feel-good high.\n\nWhite Russian\nStrain type: Hybrid\nBest for: Dinner parties.\nOriginally created by Dutch breeders Serious Seeds, White Russian is a cross of two legendary strains, White Widow and AK-47. An indica-dominant hybrid, it won the High Times Cannabis Cup “Best Overall” in 1996. White Russian is an extremely fragrant plant, and with a flavor that is smooth and spicy with undertones of skunk and earth, and its high is quite cerebral (especially for an indica-dominant strain), making it great for conversation with those around you.\nTangie\nStrain type: Sativa\nBest for: Cocktail parties.\nAnother fave among the Leafly crew, particularly for group gatherings after work, Tangie is a fantastic offering from DNA Genetics in Amsterdam. This strain is a remake of sorts of the popular version of Tangerine Dream that was sought-after in the 1990s, with genetics derived from a cross of California Orange and a Skunk hybrid. Its citrus heritage is the most evident in its refreshing tangerine aroma.\nBlue Goo\nStrain type: Hybrid\nBest for: Friends and family gatherings.\nBlue Goo is a sativa-dominant hybrid that’s a cross between the famous hybrid Blue Dream and indica Afgoo. A moderate to high potency yields uplifting effects that are standard for sativas, but not excessively energetic thanks to Afgoo’s contribution as well as the mellow nature of Blue Dream. This strain is appropriate for day or nighttime consumption and provides smooth smoke and berry flavor.\n\nSour Lemon OG\nStrain type: Hybrid\nBest for: Birthday parties.\nBred by Emerald Triangle Seeds, Sour Lemon OG is a sativa-dominant hybrid cross between California Sour and Lemon OG. This 65% sativa strain is named after its aromatic sour smell with recognizable notes of lemon, lime, and apple. Sour Lemon OG elevates the mind and body simultaneously, making this a natural go-to strain for celebrations, social engagements, or even just a busy day.\nBlue Diesel\nStrain type: Hybrid\nBest for: Happy hour.\nDaughter of indica-dominant Blueberry and sativa-dominant NYC Diesel, Blue Diesel (also known as Blue City Diesel) falls slightly on the indica side of things with a pleasant, moderate- to long-lasting body buzz (perfect if you want to extend the happy for more than an hour). Thanks to its Blueberry genetics, this flower emanates a light berry aroma that is smooth, expansive, and fast-acting. This strain is optimal for daytime use, and relaxes the consumer in social settings without putting you to sleep.\nPez\nStrain type: Indica\nBest for: Cannabis-focused parties.\nPez is an indica daughter of Afghani and Pakistani strains. These sweet, frosty buds offer the relaxation typical of indicas without the drowsiness, making the strain great for daytime use. We recommend this one as a shareable contribution to any 420-friendly gathering—it’s also on our list of the Top 100 Must-Try Strains, meaning it will be a particularly popular addition to any event with open cannabis consumption.\n\nOrange Bud\nStrain type: Hybrid\nBest for: Hosting.\nMatching plenty of social energy with a dose of subtle relaxation, this strain is perfect for gatherings where you’re in charge and want to stay upbeat and level-headed. First bred in 1980s by Dutch Passion, Orange Bud is a combination of two members of the 100% Skunk family. With bright orange hairs coating the surface, it showcases scents of orange and nectarine.\nBlueberry Headband\nStrain type: Hybrid\nBest for: Parties you don’t want to attend.\nSeveral renditions of the Blueberry Headband hybrid are known to exist, but the original Blueberry Headband from NorCal’s Emerald Triangle Seeds is the most well-known. It’s a 50/50 indica-sativa hybrid that smells of diesel, berries and pepper, and it produces a perfectly balanced high with a nice cerebral rush and relaxing body effects. This is great for staying sufficiently present while mentally floating high above any social event you wish you didn’t have to attend (think work parties, baby showers, and so on).\nBanana Kush\nStrain type: Hybrid\nBest for: Potlucks.\nThis legendary West Coast strain crosses Ghost OG and Skunk Haze to create an indica-dominant hybrid that tastes and smells like a bushel of fresh bananas (and will whet your appetite if there’s food around). Although it leans towards an indica genetically, the effects are balanced by the Haze’s mellow sativa buzz that provides a relaxed sense of euphoria. Banana Kush also help its consumers remain talkative in social settings.\n\nDurban Cookies\nStrain type: Sativa\nBest for: Loud parties.\nDurban Cookies is the Durban Poison-dominant phenotype of GSC. Known for its invigorating mental energy and body buzz, Durban Cookies offers a more energizing experience, making this sativa-dominant strain a top choice throughout the day and into the evening, particularly if you’re headed to a high-energy event where you’ll be surrounded by music, people, and movement.\nBubblegum Kush\nStrain type: Indica\nBest for: Low-key get-togethers.\nThis strain is for laid-back social situations; it’ll leave you relaxed and comfy on any given couch, but also chatty and ready to hang with whoever sits down next to you. An 80% indica strain from Bulldog Seeds in the Netherlands, Bubblegum Kush is a cross between Bubble Gum and an undisclosed Kush, and has a satisfyingly sour smell and flavor.\nStrawberry\nStrain type: Sativa\nBest for: Being a plus-one.\nOriginally bred in the Netherlands, Strawberry is a mostly sativa cannabis strain with a pungent fruity scent and uplifting effects. Consumers prone to anxiety choose Strawberry for its stress-relieving qualities without the jarring paranoia common among high-THC strains (which makes it great for small talk with people you don’t know). Comfortable and relaxing, Strawberry brings with it a hearty dose of physical and mental ease.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/22124021/best-cannabis-strains-for-parties.jpg","urlslug":"/news/strains-products/the-13-best-cannabis-strains-for-parties"}],"reviewCount":154,"flavors":[{"name":"Berry","score":49.201509872241573},{"name":"Blueberry","score":44.68641114982578},{"name":"Sweet","score":14.249419279907084},{"name":"Woody","score":6.1338559814169571},{"name":"Pine","score":3.6004645760743319}],"effects":[{"name":"Relaxed","score":64.88095238095238},{"name":"Euphoric","score":53.716608594657373},{"name":"Happy","score":52.707607433217184},{"name":"Uplifted","score":43.125725900116137},{"name":"Focused","score":38.4581881533101}],"symptoms":[{"name":"Stress","score":19.679152148664343},{"name":"Pain","score":16.536004645760745},{"name":"Lack of Appetite","score":16.173054587688732},{"name":"Insomnia","score":13.545296167247386},{"name":"Nausea","score":7.81068524970964}],"conditions":[{"name":"Anxiety","score":13.487224157955865},{"name":"Anorexia","score":7.9050522648083614},{"name":"PTSD","score":6.7436120789779324},{"name":"ADD/ADHD","score":5.9814169570267133},{"name":"Migraines","score":4.3626596980255519}],"negatives":[{"name":"Dry Mouth","score":15.164053426248548},{"name":"Dry Eyes","score":7.04849012775842},{"name":"Dizzy","score":5.9814169570267133},{"name":"Paranoid","score":3.7529036004645762},{"name":"Anxious","score":2.6858304297328686}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_7046.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/571374/b/goo__primary_ebe6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_919d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/495862/b/goo__primary_97c6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_4c1b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/490080/b/goo__primary_4c27.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_992a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/490447/b/goo__primary_d0b5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_7eb6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/476394/b/goo__primary_4c64.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_946f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/441100/b/goo__primary_a743.jpg"}],"photoTotalCount":27,"popularCities":["Toronto, ON","Barrie, ON","Berkeley, CA","Calgary, AB","Edmonton, AB","Eugene, OR","Halifax, NS","Hamilton, ON","Huntington, OR","Markham, ON"],"permalink":"https://mobileapi.leafly.com/indica/goo","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.33766233766234/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":85233,"slug":"goo","name":"Goo","subtitle":null,"symbol":"Goo","category":"Indica","description":"\u003cp\u003eGoo, not to be confused with \u003ca href=\"http://www.leafly.com/indica/afgoo\"\u003eAfgoo\u003c/a\u003e, is an 80% \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e strain that mixes a sweet-tasting \u003ca href=\"http://www.leafly.com/indica/blueberry\"\u003eBlueberry\u003c/a\u003e with the hashy, resinous \u003ca href=\"http://www.leafly.com/indica/hindu-kush\"\u003eHindu Kush\u003c/a\u003e. Deep physical\u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003e relaxation\u003c/a\u003e is coupled with slight cerebral \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergy\u003c/a\u003e, delivered alongside a \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-tree-fruit\"\u003efruity\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-blueberry\"\u003eblueberry\u003c/a\u003e flavor with \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eearthy\u003c/a\u003e and sour notes. You may begin to feel pangs of \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-hungry\"\u003ehunger\u003c/a\u003e settle in with this indica, making it a suitable medicine for those needing \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-lack-of-appetite\"\u003eappetite\u003c/a\u003e boost. Patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-insomnia\"\u003einsomnia\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-muscle-spasms\"\u003emuscle spasms\u003c/a\u003e may also find relief in the heavy, \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-sleepy\"\u003esedating\u003c/a\u003e effects Goo has to offer. Cultivators should harvest Goo after a 7 to 8 week flowering time indoors or in early October for outdoor gardens.\u003c/p\u003e\n","descriptionPlain":"Goo, not to be confused with Afgoo, is an 80% indica strain that mixes a sweet-tasting Blueberry with the hashy, resinous Hindu Kush. Deep physical relaxation is coupled with slight cerebral energy, delivered alongside a fruity, blueberry flavor with earthy and sour notes. You may begin to feel pangs of hunger settle in with this indica, making it a suitable medicine for those needing appetite boost. Patients treating insomnia, pain, and muscle spasms may also find relief in the heavy, sedating effects Goo has to offer. Cultivators should harvest Goo after a 7 to 8 week flowering time indoors or in early October for outdoor gardens.\n","aka":null,"rating":4.34,"highlightedReviews":[{"id":1411117,"username":"kris25cd","text":"Vaporized goo that I purchased at Encanto Green Cross worked great for my lower back pain. highly recommend for relaxing before bed.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"},{"id":1601830,"username":"Green_Goblin","text":"Great strain to cut stress away and help you relax.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-56321","title":"Bizarre Cannabis Strains With Unusual Growth Characteristics","author":"Trevor Hennings","category":null,"date":"\/Date(1517438911000)\/","text":"Like all plants, cannabis comes in all shapes and sizes. Generally speaking, strains will exhibit differences in resin production, coloration, stature, and shape. Other times, cannabis will express itself with features you’ve probably never seen firsthand. Below are five of the most unique and unusual genetic traits found in cannabis plants from all around the world. Whether by genetic mutation, environment, or factors unknown, these cannabis oddities are sure to stand out in any cannabis garden.\nAlbino Cannabis\n\n\n\n\n\n Couldn\u0027t resist posting another picture of this beauty showing one of the two tone buds.  This is one of our more unique plants in the outdoor garden, this plant is displaying variegation characteristics.  This anomaly occurs when the genes controlling the production of chlorophyll are not expressed correctly resulting in albino characteristics. There will be a very limited supply of this \u0026 we\u0027ll let you know which retailer will be carrying it.  #albinocannabis #whitecannabis #wanorml #norml #normllife #womengrow #fineweed #wafinestcannabis #marijuana #modernfarmer #mjfarm #pesticidefree #legalmarijuana #legalmj #i502 #cannabis #peaceloveandcannabis\nA post shared by  Washington\u0027s Finest Cannabis (@washingtons_finest_cannabis) on Oct 2, 2015 at 7:01pm PDT\n\n\n\nAlbinism is a rare genetic mutation that occurs in humans, animals, and plants such as cannabis. An albino plant is one that grows with the complete or partial absence of chlorophyll pigmentation, causing the plant to appear lighter or white in color. The plants must contain some chlorophyll to perform photosynthesis (the process by which plants covert light energy into food), so albino plants may never make it to maturity before dying.\n\nDr. Grinspoon\n\n\n\n\n\n #420Magazine #Marijuana #DrGrinspoon #its420somewhere\nA post shared by  420 Magazine (@420magazine) on May 6, 2015 at 12:19pm PDT\n\n\n\nThe spindly strain called Dr. Grinspoon was dedicated to the longtime cannabis advocate and professor at Harvard, Dr. Lester Grinspoon. In the early 60s, Dr. Grinspoon condemned the use of cannabis as its popularity grew, but came to endorse it after studying the plant. He found that the information that was being shared to the public was not supported by his research and felt that the public was being strongly misled.\nThis strain is a pure sativa heirloom that typically invites creativity, energy, and cerebral activity. Bred by Barneys Farm in Amsterdam, it grows with a bizarre stature: Instead of developing bud sites at the nodes of the branches, Dr. Grinspoon grows small buds that decorate the plant like berries on a holly plant. Because of its unconventional appearance, this strain is also a solid choice for growers seeking subtlety in their garden.\nDr. Grinspoon is not a high yielding strain and has a 14-week flowering period, making it an unpopular strain among commercial growers. But novelty-seeking cultivators raising this potent sativa will be rewarded with a truly unique product.\nPolyploid Cannabis\n\n\n\n\n\n More shots of the weird mohawk bud 👽👾 phenotype​. #mohawk #phenohunters #macro #santacruz #scfarms #pistils #calyx #trichomes #faded #polyploid #flowers #alien\nA post shared by  Santa Cruz Farms LLC (@scfarms) on Mar 5, 2017 at 1:44pm PST\n\n\n\nPolyploidy occurs in plants that contain more than two sets of chromosomes in their genetic makeup. While most cannabis plants are simply diploid (two sets of chromosomes), many growers find that polyploid cannabis plants produce larger flowers with resilience to disease and pests. While this mutation in animals is often destructive, it is generally successful in plants. Many flowering plants have picked up extra chromosomes, and this mutation has often helped them become adaptive and resilient.\nBuddha Seeds from Spain has been exploring polyploidy for a number of years now with the goal of producing more potent, high-yielding strains. The mutation is difficult to work with and difficult to clone, making polyploid cannabis plants few and far between.\n\nFrisian Duck \n\n\n\n\n\n Frisian Duck! http://tinyurl.com/Buyduckseeds #dutchpassion #dutchpassion #outdoorweedisthebest #harvesttime #frisianduckfoot #frisianduck #frisianduckfoot #frisianduckseeds #dutchpassion\nA post shared by  Dutch Passion (@dutchpassionseedcompany) on Sep 8, 2015 at 12:21pm PDT\n\n\n\nFrisian Duck, a cross between Frisian Dew and Ducksfoot, was bred by Dutch Passion out of Amsterdam. While Frisian Dew was produced as a high-yielding outdoor strain, “Ducksfoot” is a unique mutation that results in oddly shaped cannabis leaves. This cross holds on to the Ducksfoot leaf pattern while producing beautiful deep purple buds that are compact with spicy notes of citrus and pine.\nA targeted benefit of Frisian Duck is stealth. With leaves that look nothing like a normal cannabis plant, Frisian Duck became a great strain for growers seeking to raise cannabis incognito.\nBlack Haze\n\n\n\n\n\n Black Haze ☁ 🔥 #blackhaze #exoticstrain #gumdrop #shimmerandshine #dank #gas #cannabis #marijuana #herb #herblife #420 #hippylife #medicinal #legalizeit\nA post shared by  Kush Dreamz (@kush_dreamin_420) on Dec 27, 2017 at 7:37pm PST\n\n\n\nIt’s not unusual to see vibrant or dark shades of purple in cannabis, but some strains achieve hues so distinct, you’ll likely never forget them. Black Haze is one of those strains, and as the name suggests, it oftentimes produces flowers that are near-black in color. Produced by Exotic Seed in Europe, this strain is an autoflowering variety that crosses Sir Jack x Skunk Auto and Pakistani Chitral Kush.\nOther strains that sometimes express unusually dark hues include Black Lemon, Black Domina, Black Dahlia, and Black Diesel. Cannabis may also uniquely express blue, pink, and red coloration.\n\nPinkman Goo\n\n\n\n\n\n Interview about my exclusive \" Pinkman Goo \" 3way hybrid ( GDPXGrape Ape ) x northern lights 5 by @merryjane see more about plant guttation at its finest,  subscribe youtube.com/CaliCropDoc for video updates\nA post shared by  CaliCropDoc – Grower Education (@calicropdoc_) on Mar 10, 2016 at 4:10pm PST\n\n\n\nPinkman Goo is a strain developed by Twompson Prater of Cali Crop Doc. Discovered while growing a few unidentified seeds found by his sister, Pinkman Goo was named after observing little balls of goo secreted by the buds 3-4 weeks into flowering. It’s up for debate how the goo balls are created, but one theory hypothesizes that they result from nighttime “respiration” after the plant’s stomata close.\nHave you come across any unusual cannabis strains? Tell us about them, or better yet, post a photo of them in the comments section below.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/31143125/cannabis-mutants.jpg","urlslug":"/news/strains-products/bizarre-cannabis-strains-with-unusual-growth-characteristics"},{"id":"contentitems-49637","title":"The 13 Best Cannabis Strains for Parties","author":"Brett Konen","category":null,"date":"\/Date(1511383998000)\/","text":"A lot of people think of alcohol as the classic social lubricant. For some of us, it is. Alcohol can loosen us up, make us chatty and animated, and wash away social anxiety. It’s also often readily available at social occasions. Meanwhile, many people avoid cannabis use during social events—for one thing, it’s generally not served, and for another, many can recall a time cannabis made them paranoid or sleepy at a party, and don’t want to have that happen again.\n\nLuckily, with the right strains you can avoid the unwanted effects mentioned above. We used the advanced filters in Leafly’s strain explorer to get started, sorting to include strains with the happiest, most talkative highs, and to exclude any strains that make users anxious, paranoid, or sleepy. (If only alcohol’s drawbacks were so easy to filter out, am I right?)\nWe’ve curated the resultant list with our in-house expertise, vetting all suggestions against our own experiences and ensuring there’s a pick for every type of party. Attendees heading to any social occasion will find something below.\nAnd the awards for the best party cannabis strains go to…\nChocolope\nStrain type: Sativa\nBest for: All occasions.\nDNA Genetics developed Chocolope by crossing Chocolate Thai with Cannalope Haze to create their homage to the super-popular Chocolate strains of the 1980s. The hefty sativa buds give earthy, sweet coffee flavors that provide a dreamy, cerebral effect. It’s known around the Leafly office as “the party strain,” and for good reason—it’s basically impossible to be unhappy or introverted with such a feel-good high.\n\nWhite Russian\nStrain type: Hybrid\nBest for: Dinner parties.\nOriginally created by Dutch breeders Serious Seeds, White Russian is a cross of two legendary strains, White Widow and AK-47. An indica-dominant hybrid, it won the High Times Cannabis Cup “Best Overall” in 1996. White Russian is an extremely fragrant plant, and with a flavor that is smooth and spicy with undertones of skunk and earth, and its high is quite cerebral (especially for an indica-dominant strain), making it great for conversation with those around you.\nTangie\nStrain type: Sativa\nBest for: Cocktail parties.\nAnother fave among the Leafly crew, particularly for group gatherings after work, Tangie is a fantastic offering from DNA Genetics in Amsterdam. This strain is a remake of sorts of the popular version of Tangerine Dream that was sought-after in the 1990s, with genetics derived from a cross of California Orange and a Skunk hybrid. Its citrus heritage is the most evident in its refreshing tangerine aroma.\nBlue Goo\nStrain type: Hybrid\nBest for: Friends and family gatherings.\nBlue Goo is a sativa-dominant hybrid that’s a cross between the famous hybrid Blue Dream and indica Afgoo. A moderate to high potency yields uplifting effects that are standard for sativas, but not excessively energetic thanks to Afgoo’s contribution as well as the mellow nature of Blue Dream. This strain is appropriate for day or nighttime consumption and provides smooth smoke and berry flavor.\n\nSour Lemon OG\nStrain type: Hybrid\nBest for: Birthday parties.\nBred by Emerald Triangle Seeds, Sour Lemon OG is a sativa-dominant hybrid cross between California Sour and Lemon OG. This 65% sativa strain is named after its aromatic sour smell with recognizable notes of lemon, lime, and apple. Sour Lemon OG elevates the mind and body simultaneously, making this a natural go-to strain for celebrations, social engagements, or even just a busy day.\nBlue Diesel\nStrain type: Hybrid\nBest for: Happy hour.\nDaughter of indica-dominant Blueberry and sativa-dominant NYC Diesel, Blue Diesel (also known as Blue City Diesel) falls slightly on the indica side of things with a pleasant, moderate- to long-lasting body buzz (perfect if you want to extend the happy for more than an hour). Thanks to its Blueberry genetics, this flower emanates a light berry aroma that is smooth, expansive, and fast-acting. This strain is optimal for daytime use, and relaxes the consumer in social settings without putting you to sleep.\nPez\nStrain type: Indica\nBest for: Cannabis-focused parties.\nPez is an indica daughter of Afghani and Pakistani strains. These sweet, frosty buds offer the relaxation typical of indicas without the drowsiness, making the strain great for daytime use. We recommend this one as a shareable contribution to any 420-friendly gathering—it’s also on our list of the Top 100 Must-Try Strains, meaning it will be a particularly popular addition to any event with open cannabis consumption.\n\nOrange Bud\nStrain type: Hybrid\nBest for: Hosting.\nMatching plenty of social energy with a dose of subtle relaxation, this strain is perfect for gatherings where you’re in charge and want to stay upbeat and level-headed. First bred in 1980s by Dutch Passion, Orange Bud is a combination of two members of the 100% Skunk family. With bright orange hairs coating the surface, it showcases scents of orange and nectarine.\nBlueberry Headband\nStrain type: Hybrid\nBest for: Parties you don’t want to attend.\nSeveral renditions of the Blueberry Headband hybrid are known to exist, but the original Blueberry Headband from NorCal’s Emerald Triangle Seeds is the most well-known. It’s a 50/50 indica-sativa hybrid that smells of diesel, berries and pepper, and it produces a perfectly balanced high with a nice cerebral rush and relaxing body effects. This is great for staying sufficiently present while mentally floating high above any social event you wish you didn’t have to attend (think work parties, baby showers, and so on).\nBanana Kush\nStrain type: Hybrid\nBest for: Potlucks.\nThis legendary West Coast strain crosses Ghost OG and Skunk Haze to create an indica-dominant hybrid that tastes and smells like a bushel of fresh bananas (and will whet your appetite if there’s food around). Although it leans towards an indica genetically, the effects are balanced by the Haze’s mellow sativa buzz that provides a relaxed sense of euphoria. Banana Kush also help its consumers remain talkative in social settings.\n\nDurban Cookies\nStrain type: Sativa\nBest for: Loud parties.\nDurban Cookies is the Durban Poison-dominant phenotype of GSC. Known for its invigorating mental energy and body buzz, Durban Cookies offers a more energizing experience, making this sativa-dominant strain a top choice throughout the day and into the evening, particularly if you’re headed to a high-energy event where you’ll be surrounded by music, people, and movement.\nBubblegum Kush\nStrain type: Indica\nBest for: Low-key get-togethers.\nThis strain is for laid-back social situations; it’ll leave you relaxed and comfy on any given couch, but also chatty and ready to hang with whoever sits down next to you. An 80% indica strain from Bulldog Seeds in the Netherlands, Bubblegum Kush is a cross between Bubble Gum and an undisclosed Kush, and has a satisfyingly sour smell and flavor.\nStrawberry\nStrain type: Sativa\nBest for: Being a plus-one.\nOriginally bred in the Netherlands, Strawberry is a mostly sativa cannabis strain with a pungent fruity scent and uplifting effects. Consumers prone to anxiety choose Strawberry for its stress-relieving qualities without the jarring paranoia common among high-THC strains (which makes it great for small talk with people you don’t know). Comfortable and relaxing, Strawberry brings with it a hearty dose of physical and mental ease.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/22124021/best-cannabis-strains-for-parties.jpg","urlslug":"/news/strains-products/the-13-best-cannabis-strains-for-parties"}],"reviewCount":154,"flavors":[{"name":"Berry","score":49.201509872241573},{"name":"Blueberry","score":44.68641114982578},{"name":"Sweet","score":14.249419279907084},{"name":"Woody","score":6.1338559814169571},{"name":"Pine","score":3.6004645760743319}],"effects":[{"name":"Relaxed","score":64.88095238095238},{"name":"Euphoric","score":53.716608594657373},{"name":"Happy","score":52.707607433217184},{"name":"Uplifted","score":43.125725900116137},{"name":"Focused","score":38.4581881533101}],"symptoms":[{"name":"Stress","score":19.679152148664343},{"name":"Pain","score":16.536004645760745},{"name":"Lack of Appetite","score":16.173054587688732},{"name":"Insomnia","score":13.545296167247386},{"name":"Nausea","score":7.81068524970964}],"conditions":[{"name":"Anxiety","score":13.487224157955865},{"name":"Anorexia","score":7.9050522648083614},{"name":"PTSD","score":6.7436120789779324},{"name":"ADD/ADHD","score":5.9814169570267133},{"name":"Migraines","score":4.3626596980255519}],"negatives":[{"name":"Dry Mouth","score":15.164053426248548},{"name":"Dry Eyes","score":7.04849012775842},{"name":"Dizzy","score":5.9814169570267133},{"name":"Paranoid","score":3.7529036004645762},{"name":"Anxious","score":2.6858304297328686}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_7046.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/571374/b/goo__primary_ebe6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_919d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/495862/b/goo__primary_97c6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_4c1b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/490080/b/goo__primary_4c27.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_992a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/490447/b/goo__primary_d0b5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_7eb6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/476394/b/goo__primary_4c64.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_946f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/441100/b/goo__primary_a743.jpg"}],"photoTotalCount":27,"popularCities":["Toronto, ON","Barrie, ON","Berkeley, CA","Calgary, AB","Edmonton, AB","Eugene, OR","Halifax, NS","Hamilton, ON","Huntington, OR","Markham, ON"],"permalink":"https://mobileapi.leafly.com/indica/goo","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.33766233766234/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":85233,"slug":"goo","name":"Goo","subtitle":null,"symbol":"Goo","category":"Indica","description":"\u003cp\u003eGoo, not to be confused with \u003ca href=\"http://www.leafly.com/indica/afgoo\"\u003eAfgoo\u003c/a\u003e, is an 80% \u003ca href=\"http://leafly.com/indica\"\u003eindica\u003c/a\u003e strain that mixes a sweet-tasting \u003ca href=\"http://www.leafly.com/indica/blueberry\"\u003eBlueberry\u003c/a\u003e with the hashy, resinous \u003ca href=\"http://www.leafly.com/indica/hindu-kush\"\u003eHindu Kush\u003c/a\u003e. Deep physical\u003ca href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\"\u003e relaxation\u003c/a\u003e is coupled with slight cerebral \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergy\u003c/a\u003e, delivered alongside a \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-tree-fruit\"\u003efruity\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-blueberry\"\u003eblueberry\u003c/a\u003e flavor with \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eearthy\u003c/a\u003e and sour notes. You may begin to feel pangs of \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-hungry\"\u003ehunger\u003c/a\u003e settle in with this indica, making it a suitable medicine for those needing \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-lack-of-appetite\"\u003eappetite\u003c/a\u003e boost. Patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-insomnia\"\u003einsomnia\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-pain\"\u003epain\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-muscle-spasms\"\u003emuscle spasms\u003c/a\u003e may also find relief in the heavy, \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-sleepy\"\u003esedating\u003c/a\u003e effects Goo has to offer. Cultivators should harvest Goo after a 7 to 8 week flowering time indoors or in early October for outdoor gardens.\u003c/p\u003e\n","descriptionPlain":"Goo, not to be confused with Afgoo, is an 80% indica strain that mixes a sweet-tasting Blueberry with the hashy, resinous Hindu Kush. Deep physical relaxation is coupled with slight cerebral energy, delivered alongside a fruity, blueberry flavor with earthy and sour notes. You may begin to feel pangs of hunger settle in with this indica, making it a suitable medicine for those needing appetite boost. Patients treating insomnia, pain, and muscle spasms may also find relief in the heavy, sedating effects Goo has to offer. Cultivators should harvest Goo after a 7 to 8 week flowering time indoors or in early October for outdoor gardens.\n","aka":null,"rating":4.34,"highlightedReviews":[{"id":1411117,"username":"kris25cd","text":"Vaporized goo that I purchased at Encanto Green Cross worked great for my lower back pain. highly recommend for relaxing before bed.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"},{"id":1601830,"username":"Green_Goblin","text":"Great strain to cut stress away and help you relax.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-56321","title":"Bizarre Cannabis Strains With Unusual Growth Characteristics","author":"Trevor Hennings","category":null,"date":"\/Date(1517438911000)\/","text":"Like all plants, cannabis comes in all shapes and sizes. Generally speaking, strains will exhibit differences in resin production, coloration, stature, and shape. Other times, cannabis will express itself with features you’ve probably never seen firsthand. Below are five of the most unique and unusual genetic traits found in cannabis plants from all around the world. Whether by genetic mutation, environment, or factors unknown, these cannabis oddities are sure to stand out in any cannabis garden.\nAlbino Cannabis\n\n\n\n\n\n Couldn\u0027t resist posting another picture of this beauty showing one of the two tone buds.  This is one of our more unique plants in the outdoor garden, this plant is displaying variegation characteristics.  This anomaly occurs when the genes controlling the production of chlorophyll are not expressed correctly resulting in albino characteristics. There will be a very limited supply of this \u0026 we\u0027ll let you know which retailer will be carrying it.  #albinocannabis #whitecannabis #wanorml #norml #normllife #womengrow #fineweed #wafinestcannabis #marijuana #modernfarmer #mjfarm #pesticidefree #legalmarijuana #legalmj #i502 #cannabis #peaceloveandcannabis\nA post shared by  Washington\u0027s Finest Cannabis (@washingtons_finest_cannabis) on Oct 2, 2015 at 7:01pm PDT\n\n\n\nAlbinism is a rare genetic mutation that occurs in humans, animals, and plants such as cannabis. An albino plant is one that grows with the complete or partial absence of chlorophyll pigmentation, causing the plant to appear lighter or white in color. The plants must contain some chlorophyll to perform photosynthesis (the process by which plants covert light energy into food), so albino plants may never make it to maturity before dying.\n\nDr. Grinspoon\n\n\n\n\n\n #420Magazine #Marijuana #DrGrinspoon #its420somewhere\nA post shared by  420 Magazine (@420magazine) on May 6, 2015 at 12:19pm PDT\n\n\n\nThe spindly strain called Dr. Grinspoon was dedicated to the longtime cannabis advocate and professor at Harvard, Dr. Lester Grinspoon. In the early 60s, Dr. Grinspoon condemned the use of cannabis as its popularity grew, but came to endorse it after studying the plant. He found that the information that was being shared to the public was not supported by his research and felt that the public was being strongly misled.\nThis strain is a pure sativa heirloom that typically invites creativity, energy, and cerebral activity. Bred by Barneys Farm in Amsterdam, it grows with a bizarre stature: Instead of developing bud sites at the nodes of the branches, Dr. Grinspoon grows small buds that decorate the plant like berries on a holly plant. Because of its unconventional appearance, this strain is also a solid choice for growers seeking subtlety in their garden.\nDr. Grinspoon is not a high yielding strain and has a 14-week flowering period, making it an unpopular strain among commercial growers. But novelty-seeking cultivators raising this potent sativa will be rewarded with a truly unique product.\nPolyploid Cannabis\n\n\n\n\n\n More shots of the weird mohawk bud 👽👾 phenotype​. #mohawk #phenohunters #macro #santacruz #scfarms #pistils #calyx #trichomes #faded #polyploid #flowers #alien\nA post shared by  Santa Cruz Farms LLC (@scfarms) on Mar 5, 2017 at 1:44pm PST\n\n\n\nPolyploidy occurs in plants that contain more than two sets of chromosomes in their genetic makeup. While most cannabis plants are simply diploid (two sets of chromosomes), many growers find that polyploid cannabis plants produce larger flowers with resilience to disease and pests. While this mutation in animals is often destructive, it is generally successful in plants. Many flowering plants have picked up extra chromosomes, and this mutation has often helped them become adaptive and resilient.\nBuddha Seeds from Spain has been exploring polyploidy for a number of years now with the goal of producing more potent, high-yielding strains. The mutation is difficult to work with and difficult to clone, making polyploid cannabis plants few and far between.\n\nFrisian Duck \n\n\n\n\n\n Frisian Duck! http://tinyurl.com/Buyduckseeds #dutchpassion #dutchpassion #outdoorweedisthebest #harvesttime #frisianduckfoot #frisianduck #frisianduckfoot #frisianduckseeds #dutchpassion\nA post shared by  Dutch Passion (@dutchpassionseedcompany) on Sep 8, 2015 at 12:21pm PDT\n\n\n\nFrisian Duck, a cross between Frisian Dew and Ducksfoot, was bred by Dutch Passion out of Amsterdam. While Frisian Dew was produced as a high-yielding outdoor strain, “Ducksfoot” is a unique mutation that results in oddly shaped cannabis leaves. This cross holds on to the Ducksfoot leaf pattern while producing beautiful deep purple buds that are compact with spicy notes of citrus and pine.\nA targeted benefit of Frisian Duck is stealth. With leaves that look nothing like a normal cannabis plant, Frisian Duck became a great strain for growers seeking to raise cannabis incognito.\nBlack Haze\n\n\n\n\n\n Black Haze ☁ 🔥 #blackhaze #exoticstrain #gumdrop #shimmerandshine #dank #gas #cannabis #marijuana #herb #herblife #420 #hippylife #medicinal #legalizeit\nA post shared by  Kush Dreamz (@kush_dreamin_420) on Dec 27, 2017 at 7:37pm PST\n\n\n\nIt’s not unusual to see vibrant or dark shades of purple in cannabis, but some strains achieve hues so distinct, you’ll likely never forget them. Black Haze is one of those strains, and as the name suggests, it oftentimes produces flowers that are near-black in color. Produced by Exotic Seed in Europe, this strain is an autoflowering variety that crosses Sir Jack x Skunk Auto and Pakistani Chitral Kush.\nOther strains that sometimes express unusually dark hues include Black Lemon, Black Domina, Black Dahlia, and Black Diesel. Cannabis may also uniquely express blue, pink, and red coloration.\n\nPinkman Goo\n\n\n\n\n\n Interview about my exclusive \" Pinkman Goo \" 3way hybrid ( GDPXGrape Ape ) x northern lights 5 by @merryjane see more about plant guttation at its finest,  subscribe youtube.com/CaliCropDoc for video updates\nA post shared by  CaliCropDoc – Grower Education (@calicropdoc_) on Mar 10, 2016 at 4:10pm PST\n\n\n\nPinkman Goo is a strain developed by Twompson Prater of Cali Crop Doc. Discovered while growing a few unidentified seeds found by his sister, Pinkman Goo was named after observing little balls of goo secreted by the buds 3-4 weeks into flowering. It’s up for debate how the goo balls are created, but one theory hypothesizes that they result from nighttime “respiration” after the plant’s stomata close.\nHave you come across any unusual cannabis strains? Tell us about them, or better yet, post a photo of them in the comments section below.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/31143125/cannabis-mutants.jpg","urlslug":"/news/strains-products/bizarre-cannabis-strains-with-unusual-growth-characteristics"},{"id":"contentitems-49637","title":"The 13 Best Cannabis Strains for Parties","author":"Brett Konen","category":null,"date":"\/Date(1511383998000)\/","text":"A lot of people think of alcohol as the classic social lubricant. For some of us, it is. Alcohol can loosen us up, make us chatty and animated, and wash away social anxiety. It’s also often readily available at social occasions. Meanwhile, many people avoid cannabis use during social events—for one thing, it’s generally not served, and for another, many can recall a time cannabis made them paranoid or sleepy at a party, and don’t want to have that happen again.\n\nLuckily, with the right strains you can avoid the unwanted effects mentioned above. We used the advanced filters in Leafly’s strain explorer to get started, sorting to include strains with the happiest, most talkative highs, and to exclude any strains that make users anxious, paranoid, or sleepy. (If only alcohol’s drawbacks were so easy to filter out, am I right?)\nWe’ve curated the resultant list with our in-house expertise, vetting all suggestions against our own experiences and ensuring there’s a pick for every type of party. Attendees heading to any social occasion will find something below.\nAnd the awards for the best party cannabis strains go to…\nChocolope\nStrain type: Sativa\nBest for: All occasions.\nDNA Genetics developed Chocolope by crossing Chocolate Thai with Cannalope Haze to create their homage to the super-popular Chocolate strains of the 1980s. The hefty sativa buds give earthy, sweet coffee flavors that provide a dreamy, cerebral effect. It’s known around the Leafly office as “the party strain,” and for good reason—it’s basically impossible to be unhappy or introverted with such a feel-good high.\n\nWhite Russian\nStrain type: Hybrid\nBest for: Dinner parties.\nOriginally created by Dutch breeders Serious Seeds, White Russian is a cross of two legendary strains, White Widow and AK-47. An indica-dominant hybrid, it won the High Times Cannabis Cup “Best Overall” in 1996. White Russian is an extremely fragrant plant, and with a flavor that is smooth and spicy with undertones of skunk and earth, and its high is quite cerebral (especially for an indica-dominant strain), making it great for conversation with those around you.\nTangie\nStrain type: Sativa\nBest for: Cocktail parties.\nAnother fave among the Leafly crew, particularly for group gatherings after work, Tangie is a fantastic offering from DNA Genetics in Amsterdam. This strain is a remake of sorts of the popular version of Tangerine Dream that was sought-after in the 1990s, with genetics derived from a cross of California Orange and a Skunk hybrid. Its citrus heritage is the most evident in its refreshing tangerine aroma.\nBlue Goo\nStrain type: Hybrid\nBest for: Friends and family gatherings.\nBlue Goo is a sativa-dominant hybrid that’s a cross between the famous hybrid Blue Dream and indica Afgoo. A moderate to high potency yields uplifting effects that are standard for sativas, but not excessively energetic thanks to Afgoo’s contribution as well as the mellow nature of Blue Dream. This strain is appropriate for day or nighttime consumption and provides smooth smoke and berry flavor.\n\nSour Lemon OG\nStrain type: Hybrid\nBest for: Birthday parties.\nBred by Emerald Triangle Seeds, Sour Lemon OG is a sativa-dominant hybrid cross between California Sour and Lemon OG. This 65% sativa strain is named after its aromatic sour smell with recognizable notes of lemon, lime, and apple. Sour Lemon OG elevates the mind and body simultaneously, making this a natural go-to strain for celebrations, social engagements, or even just a busy day.\nBlue Diesel\nStrain type: Hybrid\nBest for: Happy hour.\nDaughter of indica-dominant Blueberry and sativa-dominant NYC Diesel, Blue Diesel (also known as Blue City Diesel) falls slightly on the indica side of things with a pleasant, moderate- to long-lasting body buzz (perfect if you want to extend the happy for more than an hour). Thanks to its Blueberry genetics, this flower emanates a light berry aroma that is smooth, expansive, and fast-acting. This strain is optimal for daytime use, and relaxes the consumer in social settings without putting you to sleep.\nPez\nStrain type: Indica\nBest for: Cannabis-focused parties.\nPez is an indica daughter of Afghani and Pakistani strains. These sweet, frosty buds offer the relaxation typical of indicas without the drowsiness, making the strain great for daytime use. We recommend this one as a shareable contribution to any 420-friendly gathering—it’s also on our list of the Top 100 Must-Try Strains, meaning it will be a particularly popular addition to any event with open cannabis consumption.\n\nOrange Bud\nStrain type: Hybrid\nBest for: Hosting.\nMatching plenty of social energy with a dose of subtle relaxation, this strain is perfect for gatherings where you’re in charge and want to stay upbeat and level-headed. First bred in 1980s by Dutch Passion, Orange Bud is a combination of two members of the 100% Skunk family. With bright orange hairs coating the surface, it showcases scents of orange and nectarine.\nBlueberry Headband\nStrain type: Hybrid\nBest for: Parties you don’t want to attend.\nSeveral renditions of the Blueberry Headband hybrid are known to exist, but the original Blueberry Headband from NorCal’s Emerald Triangle Seeds is the most well-known. It’s a 50/50 indica-sativa hybrid that smells of diesel, berries and pepper, and it produces a perfectly balanced high with a nice cerebral rush and relaxing body effects. This is great for staying sufficiently present while mentally floating high above any social event you wish you didn’t have to attend (think work parties, baby showers, and so on).\nBanana Kush\nStrain type: Hybrid\nBest for: Potlucks.\nThis legendary West Coast strain crosses Ghost OG and Skunk Haze to create an indica-dominant hybrid that tastes and smells like a bushel of fresh bananas (and will whet your appetite if there’s food around). Although it leans towards an indica genetically, the effects are balanced by the Haze’s mellow sativa buzz that provides a relaxed sense of euphoria. Banana Kush also help its consumers remain talkative in social settings.\n\nDurban Cookies\nStrain type: Sativa\nBest for: Loud parties.\nDurban Cookies is the Durban Poison-dominant phenotype of GSC. Known for its invigorating mental energy and body buzz, Durban Cookies offers a more energizing experience, making this sativa-dominant strain a top choice throughout the day and into the evening, particularly if you’re headed to a high-energy event where you’ll be surrounded by music, people, and movement.\nBubblegum Kush\nStrain type: Indica\nBest for: Low-key get-togethers.\nThis strain is for laid-back social situations; it’ll leave you relaxed and comfy on any given couch, but also chatty and ready to hang with whoever sits down next to you. An 80% indica strain from Bulldog Seeds in the Netherlands, Bubblegum Kush is a cross between Bubble Gum and an undisclosed Kush, and has a satisfyingly sour smell and flavor.\nStrawberry\nStrain type: Sativa\nBest for: Being a plus-one.\nOriginally bred in the Netherlands, Strawberry is a mostly sativa cannabis strain with a pungent fruity scent and uplifting effects. Consumers prone to anxiety choose Strawberry for its stress-relieving qualities without the jarring paranoia common among high-THC strains (which makes it great for small talk with people you don’t know). Comfortable and relaxing, Strawberry brings with it a hearty dose of physical and mental ease.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/22124021/best-cannabis-strains-for-parties.jpg","urlslug":"/news/strains-products/the-13-best-cannabis-strains-for-parties"}],"reviewCount":154,"flavors":[{"name":"Berry","score":49.201509872241573},{"name":"Blueberry","score":44.68641114982578},{"name":"Sweet","score":14.249419279907084},{"name":"Woody","score":6.1338559814169571},{"name":"Pine","score":3.6004645760743319}],"effects":[{"name":"Relaxed","score":64.88095238095238},{"name":"Euphoric","score":53.716608594657373},{"name":"Happy","score":52.707607433217184},{"name":"Uplifted","score":43.125725900116137},{"name":"Focused","score":38.4581881533101}],"symptoms":[{"name":"Stress","score":19.679152148664343},{"name":"Pain","score":16.536004645760745},{"name":"Lack of Appetite","score":16.173054587688732},{"name":"Insomnia","score":13.545296167247386},{"name":"Nausea","score":7.81068524970964}],"conditions":[{"name":"Anxiety","score":13.487224157955865},{"name":"Anorexia","score":7.9050522648083614},{"name":"PTSD","score":6.7436120789779324},{"name":"ADD/ADHD","score":5.9814169570267133},{"name":"Migraines","score":4.3626596980255519}],"negatives":[{"name":"Dry Mouth","score":15.164053426248548},{"name":"Dry Eyes","score":7.04849012775842},{"name":"Dizzy","score":5.9814169570267133},{"name":"Paranoid","score":3.7529036004645762},{"name":"Anxious","score":2.6858304297328686}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_7046.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/571374/b/goo__primary_ebe6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_919d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/495862/b/goo__primary_97c6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_4c1b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/490080/b/goo__primary_4c27.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_992a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/490447/b/goo__primary_d0b5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_7eb6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/476394/b/goo__primary_4c64.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/goo_100x100_946f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/441100/b/goo__primary_a743.jpg"}],"photoTotalCount":27,"popularCities":["Toronto, ON","Barrie, ON","Berkeley, CA","Calgary, AB","Edmonton, AB","Eugene, OR","Halifax, NS","Hamilton, ON","Huntington, OR","Markham, ON"],"permalink":"https://mobileapi.leafly.com/indica/goo","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.33766233766234/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
