{"sl_translate":"description,descriptionPlain,category","id":231,"slug":"vanilla-kush","name":"Vanilla Kush","subtitle":null,"symbol":"Van","category":"Indica","description":"\u003cp\u003e\u003cspan style=\"line-height: 20.7999992370605px;\"\u003eThis indica strain comes from Barney\u0026rsquo;s Farm in Amsterdam and clinched 2nd place overall at the 2009\u0026nbsp;\u003c/span\u003e\u003cem style=\"line-height: 20.7999992370605px;\"\u003eHigh Times\u003c/em\u003e\u003cspan style=\"line-height: 20.7999992370605px;\"\u003e\u0026nbsp;Cannabis Cup for the coffee shop and seed company. Bred from Afghan and Kashmir strains, this Kush beauty is a gift to the senses with her notes of vanilla, lavender, and a hint of citrus. Plants flower in 8 weeks and produce large, soft flowers that are light green with hints of orange. This strain has a high THC content often measuring over 20%, making it a potent choice that might be strong for new users.\u003c/span\u003e\u003c/p\u003e\n","descriptionPlain":"This indica strain comes from Barney\u0026rsquo;s Farm in Amsterdam and clinched 2nd place overall at the 2009\u0026nbsp;High Times\u0026nbsp;Cannabis Cup for the coffee shop and seed company. Bred from Afghan and Kashmir strains, this Kush beauty is a gift to the senses with her notes of vanilla, lavender, and a hint of citrus. Plants flower in 8 weeks and produce large, soft flowers that are light green with hints of orange. This strain has a high THC content often measuring over 20%, making it a potent choice that might be strong for new users.\n","aka":null,"rating":4.34,"highlightedReviews":[{"id":1414351,"username":"MegaMan","text":"This is a beautiful and strong, mostly indica kush.  My meds were grown in B.C.  I vaporized a small amount of vanilla kush and I was quickly hit with an excellent body buzz and a happy/clear headed high. I found this strain extremely relaxing.  I was able to get good pain relief without too strong of a head high. I rate the potency an 8.5/10, the overall strain I would give at least a 9.  \nI would recommend this strain to anyone wanting pain relief and a clearer/positive head high.\nI would not recommend this strain to anyone wanting only a head high, you can definitely get a good one by smoking enough, but by then your body will feel like a slice of butter, melting over a big pile of flap jacks.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"},{"id":1636317,"username":"babachman","text":"Smells so damn good! Hints of vanilla and very floral like the smell of floral tea. I got this in-house strain from my favorite new recreational dispensary (House of Green in Anchorage, Alaska) not listed on Leafly. Freshly harvested just a couple weeks ago, the buds looked perfect, nice and bushy dark green covered with tons of visible crystals (I also submitted a photo!). I bought this indica to help me sleep and it does the trick, melting my body into my bed. I am still alert enough to write this review but I feel like I could fall asleep in an instant. It also cured my minor nausea from the acidic espresso I drank earlier. The effects are very comparable to one of my favorite strains for sleeping ‘Chocolate Chunk’. Easy 5 stars for relaxing, sleeping, as well as a 5 star smell, flavor, and potency! ~19,72% bought an 1/8th for $45.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-42622","title":"Leafly Staff Picks: Cannabis Strains and Products for Cozy Fall Days","author":"Bailey Rahn","category":null,"date":"\/Date(1506033340000)\/","text":"Fall is here, and many of us are waving goodbye to summer with smiling, pumpkin spice-stained faces stuffed into scarves. The new season not only inspires a change in wardrobe, but often a change in our stash boxes. These cannabis strains and products are known to fuel the cozy feels as the days get darker, leaves turn, and rain speckles the sidewalks outside. So load up, snuggle up, and smoke up, because fall is finally here.\n1. Jack Herer\n(Leafly)\nSativa-dominant Jack Herer is a strain for all seasons, but this sweet, pine-scented bud is especially well-suited for autumn. The warm, spicy flavor fills the body with a comfy, cozy sensation throughout every limb while wrapping the mind in a blissful blanket. And for those mourning the loss of long summer days, Jack Herer offers a comforting hand to help pull you from low moods.\n\n2. Infused Syrups\n(Courtesy of Craft Elixirs)\nWhat’s better than a hot drink on a windy fall morning? Cannabis-infused hot drinks, obviously. Infused syrups are hitting the market with ferocity, blessing our mugs with the gift of enhanced flavor and effect. Add Craft Elixirs’ CBD Ginger to your green tea for feelings of clean relaxation that lets you stay productive and stress-free, or find an infused maple syrup to add to your morning latte. Or, simply make infused syrup yourself by following this recipe.\n\n3. Agent Orange\n(Leafly)\nWith an invigorating citrus flavor that warms both mind and body, Agent Orange is a versatile hybrid strain that perfectly accompanies hobbies both relaxing and active. Take Agent Orange out on an autumn hike and watch as its euphoric veil enhances the red, yellow, and orange colors around you. Puff on this one while stuck inside on a rainy day, giving yourself permission to relax with some video games or a new show. Agent Orange also brings out the best flavors in chai tea, a hot toddy, or a cinnamon hot chocolate.\n\n4. Pre-Rolled Joints\n\nFew pleasures match the feeling of walking through an orange-hued forest with a joint in-hand. Whether you never learned how to roll a joint or feel pressured to spend every available second appreciating the fleeting colors of fall, pre-rolls make a convenient mobile choice. Numerous pre-roll options await you, but my favorite remains the Saints variety pack from Seattle Green Bud. (More Leafly staff favorites can be found here.)\n\n5. Vanilla Kush\n(Leafly)\nVanilla Kush is a cozy indica staple that delivers autumn vibes with a toasty vanilla flavor that sits underneath warm, earthy overtones. Bringing a gentle euphoric hum to the mind while letting muscles sink like dead weight into blankets, use this indica to cozy up with a book or movie, or let it guide you into a well-deserved nap on a rainy weekend.\n\n6. Infused Bath Bombs\n(Julia Sumpter/Leafly)\nAs temperatures drop outside, the urge to dip into a steaming bathtub gets hard to fight. Light a few candles, turn on some relaxing music, and sink into a hot spring sizzling with cannabis. You can take a lovely cannabis-infused bath thanks to magical bath soaks like those from Cannabis Basics, Mary Jane’s Medicinals, and other favorites. Does your local dispensary not carry bath products? Just make your own bath bombs with this recipe.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/09/21132857/fall-strains-and-products.jpg","urlslug":"/news/strains-products/cannabis-products-for-fall-september-2017"},{"id":"contentitems-6233","title":"The Leafly Wine \u0026 Cannabis Pairing Guide","author":"Brett Konen","category":null,"date":"\/Date(1399564800000)\/","text":"The cannabis market is often compared to that of wine thanks to the impressive depth, complexity, and varietal diversity of both. If you have yet to pair the two, welcome to the concerto of all physiological symphonies. Tantalizing the palate with a sip of chardonnay, following with an expansive citrus pull of Lemon Pie, and relishing the beautiful chorus of aromas, flavors, and effects strung together by these two elevated delectations is an experience unlike any other. But how to go about it if you’re new to wine or cannabis pairing?\nBasic Tenets of Wine Pairing\n(gilaxia/iStock)\nA good pairing should result in an experience greater than the sum of its parts. “Steak and cabernet sauvignon is a perfect example,” says Jameson Fink, Senior Digital Editor at Wine Enthusiast. “On its own, cabernet is rich and tannic. Pair it with steak and a wonderful dance happens: the fat of the meat tames tannins and, simultaneously, the tannins cut through the fat and get you ready for the next bite.”\nFor those who are intimidated by the idea of pairings, you’re not alone. Many who are new to the process state that they feel overwhelmed by the sheer number of potential pairings out there, which is fair—between hundreds of wine varietals and thousands of cannabis strains, coupled with variations (think red blends and strain phenotypes) plus new strains hitting the market by the day, the possibilities are truly endless. Let us allay apprehension by emphasizing that in pairings, there are no wrong answers.\n\n“There are no hard and fast rules,” explains Fink. “That same steak [that works with a cabernet sauvignon] can be great with a pinot noir. And one of the best wine pairings I ever had with steak was Champagne”—an unconventional choice. The same guidance goes for pairing wine with anything else, including charcuterie, chocolate, and cannabis. Tl;dr: If you like it, it’s a good pairing.\n\nPairing Wine and Cannabis by Flavor\n(gilaxia/iStock)\nCannabis is characterized to a great extent by terpenes, a diverse class of fragrant oils that occur naturally in the plant and give strains their unique aromas and flavors. The fact that the Lavender strain truly smells like its namesake can be attributed to the presence of linalool, also commonly found in lavender flowers. Similarly, Mango Kush gets its flavor from myrcene, also present in its namesake fruit. In an effective pairing, the flavors in cannabis will either accentuate existing flavors in the wine and vice versa, or else complement them in a unique way.\nOne of the easiest place for beginners to start is with descriptively named strains, such as the tangerine-forward Tangie. Have a citrusy pinot gris on hand? Match it with Tangie to play up those flavor notes. You can also consider other flavors that would go well with tangerine, such as those found in a bright and floral chenin blanc. If you’ve played around with food and wine pairings or mixed drinks before, you’ve already got a head start: For instance, if you’d be inclined to add tangerines to a sangria with said wine, a tangerine-flavored strain is a logical bet.\n\nOnce you’ve experimented with a few easy pairings, start using your imagination to think up new combinations. “It would be interesting to explore cannabis strains with grassy, herbaceous flavors and aromas and see if they complement and/or accentuate a white and a red wine with those characteristics, [such as] sauvignon blanc and cabernet franc,” suggests Fink. We suggest working with a vaporizer suited for cannabis flower—you’ll have an easier time tasting the subtle nuances of flavor present in the vapor than you would in smoke.\nLooking for a little more guidance? Use our visual guide and flavor chart to determine which cannabis strain to pair with your favorite bottle of wine.\n(Nick Ouellette/Leafly)\nPairing Wine and Cannabis by Effects\n(franckreporter/iStock)\nOne of the elements that makes wine and cannabis pairings even more compelling than wine and food pairings is the fact that not only does the wine influence the consumer’s state of consciousness, so does the cannabis. Red wine, for instance, lends itself to a warm and cozy—even romantic—buzz. Certain strains can have similar effects (for instance, check out these 11 arousing strains).\n\nThat said, it’s important to be mindful of each individual substance’s effects as you pair. Smoking a sleepy indica and polishing off two glasses of a heavy red may leave you dozing in an armchair rather than hanging out with your guests. If you know red wine tends to make your eyelids feel heavy, opt for an energy-packed sativa or hybrid to balance things out instead, and always consume in moderation when pairing any kind of cannabis and alcohol.\nWine and Cannabis Pairings to Try\n\n\nMerlot and Blueberry: The dense mountain berry notes and underlying earthiness of this legendary strain play beautifully with the deep, dark, stonefruit flavors and velvety mouthfeel of a good merlot.\nRosé and Strawberry Cough: The sweet strawberries-and-sugar elements of Strawberry Cough accent the berry notes and residual sugars of a summery rosé wine, while the subtle skunkiness woven through the flavor profile of the strain plays out in a memorable way against the backdrop of the wine.\nRiesling and OG Kush: The lemon-laced evergreen forest flavors of OG Kush match impeccably with the subtle sweetness and minerality of an off-dry riesling; meanwhile, the body-relaxing, euphoric effects of the strain provide the perfect complement to the buzz of a glass or two.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/05/25120852/cannabis-and-wine-pairing-4.jpg","urlslug":"/news/lifestyle/wine-cannabis-pairing-guide"}],"reviewCount":451,"flavors":[{"name":"Vanilla","score":54.767857142857146},{"name":"Sweet","score":30.642857142857142},{"name":"Flowery","score":23.383928571428573},{"name":"Pungent","score":7.8482142857142856},{"name":"Spicy/Herbal","score":6.6696428571428568}],"effects":[{"name":"Relaxed","score":71.535714285714292},{"name":"Euphoric","score":61.125},{"name":"Sleepy","score":57.348214285714285},{"name":"Happy","score":53.080357142857146},{"name":"Uplifted","score":40.758928571428569}],"symptoms":[{"name":"Insomnia","score":32.428571428571431},{"name":"Pain","score":31.982142857142858},{"name":"Stress","score":26.276785714285715},{"name":"Depression","score":20.794642857142858},{"name":"Muscle Spasms","score":15.830357142857142}],"conditions":[{"name":"Anxiety","score":28.205357142857142},{"name":"PTSD","score":20.294642857142858},{"name":"Arthritis","score":11.982142857142858},{"name":"ADD/ADHD","score":9.2946428571428577},{"name":"Asthma","score":6.4017857142857144}],"negatives":[{"name":"Dry Mouth","score":45.473214285714285},{"name":"Dry Eyes","score":23.705357142857142},{"name":"Headache","score":16.714285714285715},{"name":"Dizzy","score":7.5625},{"name":"Paranoid","score":0.80357142857142849}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/indica/vanilla-kush/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/indica/vanilla-kush/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/vanilla-kush_100x100_70c9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003603/b/vanilla-kush__primary_cdf8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/vanilla-kush_100x100_137a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003602/b/vanilla-kush__primary_b7e2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/vanilla-kush_100x100_bb2f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002990/b/vanilla-kush__primary_40b8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/vanilla-kush_100x100_d371.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/671251/b/vanilla-kush__primary_88d3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/vanilla-kush_100x100_deb4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/621290/b/vanilla-kush__primary_bb11.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/vanilla-kush_100x100_70b0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/599855/b/vanilla-kush__primary_6743.jpg"}],"photoTotalCount":120,"popularCities":["Montréal, QC","Chicago, IL","Denver, CO","Detroit, MI","Eugene, OR","Everett, WA","Los Angeles, CA","Ottawa, ON","Portland, OR","Seattle, WA"],"permalink":"https://mobileapi.leafly.com/indica/vanilla-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.34146341463415/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"South Asian Indica","subtitle":null,"slug":"south-asian","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/south-asian","symbol":"Sai","applink":"leafly://strain/south-asian"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":63,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":"\n\tGood for sea of green (SOG) or screen of green (SCROG) operations\n\tStretches tall during the first 3 weeks of flowering\n\tReservoir Seeds recommends a soil pH level of 5.8 to 6.0\n\tGrows best in warm, slightly arid environments up to\u0026nbsp;88\u0026deg;F (31\u0026deg;C) and rich in CO2\n\n"}}
