{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1467399600000)/",
            "id": "contentitems-3065",
            "text": " \nDid you know that many beloved cannabis strains hail from the United States' northern neighbors? In honor of Canada Day and the promising strides the country has made towards nationwide legalization, here are 11 strains with Canadian roots. Pick one up and raise a joint to celebrate the friendly Canucks up north!\n \n  Manitoba Poison\nThe Manitoba province is located at the longitudinal center of Canada, so it's only fitting that Manitoba Poison is a 50/50 hybrid (though you'll likely feel the heavy indica properties pretty quickly).\n  Sweet Tooth\nAn oldie but a goodie, Sweet Tooth won 1st Place in the 2001 High Times Cannabis Cup.\n  Mendocino Purps\nMendocino Purps, or simply \"The Purps,\" is one of a few living legends that made this list. Handed off as a clone-only cut, this plant was stabilized by BC Bud Depot and has since made its way around the world. \n  Chemo\nChemo, or UBC Chemo, is named for the university where the strain was allegedly created and for its supplementary effects on patients going through chemotherapy. This strain is an international treasure with origins that reach back to the 1970s.\n  M-39\nThe clever astronomical designation of M-39 speaks to the Northern Light #5 portion of this cross. \n  God Bud\nGod Bud is some of the finest around. This incredible indica-dominant strain lives in the pantheon of cannabis deities, but like many of the old gods, this strain is the primogenitor to many other floral demigods like Blue God and Grape God.\n  DJ Short Blueberry\nDJ Short is one of the principal breeders in the cannabis industry. With cuts like Juicy Fruit and Flo, he's left a lasting mark on the cannabis industry with exotic genetic crosses cultivated through a life of world travel and reverence for this resinous flower. DJ Short Blueberry is known as THE west coast Blueberry phenotype.\n  Blue Dynamite\nBlue Dynamite was featured as one of the top 10 strains of 2007 in High Times magazine. \n  Island Sweet Skunk\nBred by Federation Seed Company in Canada, this beautiful blend of strong landrace genetics offers a smoke that is stimulating and versatile. Known for creating considerable amounts of tertiary CBD, Island Sweet Skunk invigorates the user while still offering anti-inflammatory and analgesic effects.\n  Lowryder\nLowryder is a squat and resilient plant that is ideal for outdoor grows in less than pleasant climates, making it a seasoned fit for Canadians seeking a plant that could grow and hide in plain sight while weathering a rugged season. \n  Romulan\nRomulan is a space-age indica sent to Earth to expand our mind. And with Canada's savvy immigration policy, it's no wonder this heady smoker stopped there first.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001518/cannabis-strains-with-canadian-roots.jpg",
            "title": "11 Cannabis Strains with Canadian Roots",
            "urlslug": "/news/strains-products/cannabis-strains-with-canadian-roots"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1429920000000)/",
            "id": "contentitems-3315",
            "text": "We've got more strains for you to explore this weekend! Not all of them are \"new\" per se (although they may be to you!) — Lashkar Gah is one of the oldest indicas still kicking today, and Jacky White's been around for a decade now. Young or old, all of these strains are in need of some user reviews, so be sure to get on that if you've tried any of these!\n \n   1. Jacky White\n\nJacky White is a 75% sativa strain bred by Paradise Seeds, who crossed the legendary Jack Herer sativa with a resinous White Widow hybrid. She introduces herself with a sweet grapefruit and citrus aroma, which leads the way into Jacky White’s well-balanced head and body effects. Lofty euphoria lifts the mind into an upbeat cerebral space, while the indica in her softens the racy sativa effects with a deep, physical calm. Since her debut in 2005, growers have cherished Jacky White for her hardiness, stability, fast flowering, and plentiful yields.\n\n \n   2. Blue Dynamite\n\nBlue Dynamite, bred by Next Generation Seeds in Canada, is an indica-dominant strain that provides heavy mind and body relaxation alongside a fruity, hashy flavor. This powerhouse indica was bred from a B.C. Grapefruit clone known as Dynamite and an Afghani–Blueberry hybrid called Avalon. Combining the flavorful qualities of Dynamite with the resinous potential Avalon enables, we are left with a potent strain that can budge even the most stubborn cases of pain, nausea, and sleeplessness. High Times recognized Blue Dynamite among its Top 10 Strains of 2007, solidifying a reputation that keeps this strain firmly set in the cannabis market.\n\n \n   3. Canna-Tsu\n\nCanna-Tsu is a hybrid cannabis strain that combines genetics from two CBD-rich parents, Cannatonic and Sour Tsunami. Sweet earthy flavors activate on the exhale, complementing the subtle citrus aroma that radiates from Canna-Tsu’s buds. Because of its high-CBD, low-THC cannabinoid profile, Canna-Tsu delivers its mellow effects with mental clarity. Strains high in CBD like Canna-Tsu are highly demanded by patients treating pain, inflammation, anxiety, and seizures.\n\n \n   4. Lashkar Gah\n\nLashkar Gah is an indica landrace strain named after its geographic origin in south Afghanistan. Like other Afghani indicas, Lashkar Gah is consistent in its delivery of powerful, sedating effects that promote rest and relaxation. Pain, insomnia, and other severe symptoms collapse under the weight of Lashkar Gah’s heavy effects, and a quick examination of its resin-caked buds explains this indica’s potency. Your body may feel pinned down by Lashkar Gah’s euphoric punch, but your mind will likely float away blissfully as the burdens of stress and anxiety dissolve.\n\nAvailable at BotanaCare Medical & Recreational in Northglenn, CO\n \n   5. Blue Magic\n\nBlue Magic is an upbeat sativa-dominant strain bred from the famous Blue Dream. Its high-energy effects are prefaced by creamy, fruity flavors reminiscent of its Blueberry ancestry. Sativa enthusiasts will appreciate the balance of potency and clarity delivered by Blue Magic, whose euphoria offers functionality and focus despite an impressive THC profile. While its initial punch is quick to hit, Blue Magic’s effects taper down gently and ease you into long-lasting relaxation that extends from the physical exterior to the deep recesses of your mind.\n\n \n   6. Birthday Cake Kush\n\nBirthday Cake Kush, or just Birthday Cake, is an indica-dominant hybrid with strong body effects and sweet cake-like flavor. As decadent as its GSC (f.k.a Girl Scout Cookies) and Cherry Pie parent strains, Birthday Cake Kush buds bloom with a crystalline icing of THC-rich resin. Like any dessert, Birthday Cake Kush is the perfect way to end your day, with deeply relaxing effects that soothe the body without sedating the mind. This indica is preferred by patients treating pain, anxiety, appetite loss, inflammation, and headaches.\n\nAvailable at BotanaCare Medical & Recreational in Northglenn, CO\n \n   7. Truth Serum\n\nTruth Serum is a hybrid strain that was originally bred in the Midwest during the summer of 2006. While exploring how to breed feminized seeds, an underground breeder in Minnesota induced stress on a single branch of G13 to create the pollen that fertilized a variety of strains growing in his garden. After narrowing his breeding projects down into two of the more potent and vigorous phenotypes, we are left with the complex combination of G13, Trinity, and Pineapple. The strain quickly made its way to the Northern California coastline where the dense buds now bloom. Truth Serum carries a sweet tropical aroma and is frosted with a thick coat of trichomes. The exhale provides a mouthful of hash-like flavor that ushers in the relaxing effects led by G13’s indica-dominant influence. It should be noted that another strain by the name Truth Serum is bred by Pisces Genetics. Their Truth Serum is a mostly indica hybrid that combines True OG and Death Star genetics.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12002159/new-strains-alert-jacky-white-blue-dynamite-canna-tsu-lashkar-gah.png",
            "title": "New Strains Alert: Jacky White, Blue Dynamite, Canna-Tsu, Lashkar Gah, and More",
            "urlslug": "/news/strains-products/new-strains-alert-jacky-white-blue-dynamite-canna-tsu-lashkar-gah"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 14.814814814814813
        },
        {
            "name": "Arthritis",
            "score": 8.796296296296296
        },
        {
            "name": "Hypertension",
            "score": 8.796296296296296
        },
        {
            "name": "PTSD",
            "score": 8.796296296296296
        },
        {
            "name": "ADD/ADHD",
            "score": 1.3888888888888888
        }
    ],
    "description": "<p>Blue Dynamite, bred by Next Generation Seeds in Canada, is an <a href=\"http://www.leafly.com/explore/category-indica\">indica</a>-dominant strain that provides heavy mind-and-body <a href=\"http://www.leafly.com/explore/tags-relaxed\">relaxation</a> alongside a <a href=\"http://www.leafly.com/explore/flavors-tree-fruit\">fruity</a>, hashy flavor. This powerhouse indica was bred from a B.C. <a href=\"https://www.leafly.com/sativa/grapefruit\">Grapefruit</a> clone known as <a href=\"https://www.leafly.com/indica/29aca226-23ba-4726-a4ab-f3bf68f2a3c4\">Dynamite</a> and an <a href=\"http://leafly.com/indica/afghani\">Afghani</a>-<a href=\"http://leafly.com/indica/blueberry\">Blueberry</a> hybrid called <a href=\"https://www.leafly.com/hybrid/avalon\">Avalon</a>. Combining the flavorful qualities of Dynamite with the resinous potential Avalon enables, we are left with a potent strain that can budge even the most stubborn cases of <a href=\"http://www.leafly.com/explore/symptoms-pain\">pain</a>, <a href=\"http://www.leafly.com/explore/symptoms-nausea\">nausea</a>, and <a href=\"http://www.leafly.com/explore/symptoms-insomnia\">sleeplessness</a>. <em>High Times </em>recognized Blue Dynamite among its Top 10 Strains of 2007, solidifying a reputation that keeps this strain firmly set in the cannabis market.</p>\n",
    "descriptionPlain": "Blue Dynamite, bred by Next Generation Seeds in Canada, is an indica-dominant strain that provides heavy mind-and-body relaxation alongside a fruity, hashy flavor. This powerhouse indica was bred from a B.C. Grapefruit clone known as Dynamite and an Afghani-Blueberry hybrid called Avalon. Combining the flavorful qualities of Dynamite with the resinous potential Avalon enables, we are left with a potent strain that can budge even the most stubborn cases of pain, nausea, and sleeplessness. High Times recognized Blue Dynamite among its Top 10 Strains of 2007, solidifying a reputation that keeps this strain firmly set in the cannabis market.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 36.111111111111114
        },
        {
            "name": "Euphoric",
            "score": 24.537037037037035
        },
        {
            "name": "Focused",
            "score": 17.129629629629626
        },
        {
            "name": "Creative",
            "score": 11.574074074074073
        },
        {
            "name": "Happy",
            "score": 9.25925925925926
        }
    ],
    "flavors": [
        {
            "name": "Berry",
            "score": 10.648148148148147
        },
        {
            "name": "Citrus",
            "score": 9.722222222222221
        },
        {
            "name": "Pine",
            "score": 9.722222222222221
        },
        {
            "name": "Pungent",
            "score": 9.259259259259258
        },
        {
            "name": "Spicy/Herbal",
            "score": 8.796296296296296
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": "Easy",
        "environment": null,
        "floweringDays": 46,
        "growNotes": "\n\tGood resistance to pests and disease\n\tHigh flower-to-leaf ratio\n\tGrowers may allow a 50-60 day flowering cycle for optimal flavor and potency\n\tYields typically fall between 400-500 grams per square meter\n\n",
        "height": "Short",
        "outdoorFinish": "Early October",
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1202284,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Got some nice Blue Dynamite shatter concentrate, a nice relaxing strain and great pain relief for my knee and back injuries. Leave you with a nice warm fuzzy feeling throughout your entire body. Definitely one of my new favorites",
            "username": "rade1111"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1484382,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This should be prescribed instead of opioids. Painkiller for sure. ",
            "username": "HulkRP"
        }
    ],
    "id": 154512,
    "name": "Blue Dynamite",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 13.425925925925924
        },
        {
            "name": "Dry Eyes",
            "score": 3.2407407407407405
        },
        {
            "name": "Paranoid",
            "score": 0.9259259259259258
        },
        {
            "name": "Dizzy",
            "score": 0.4629629629629629
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/29aca226-23ba-4726-a4ab-f3bf68f2a3c4",
            "category": "Indica",
            "name": "Dynamite",
            "permalink": "https://mobileapi.leafly.com/indica/29aca226-23ba-4726-a4ab-f3bf68f2a3c4",
            "slug": "29aca226-23ba-4726-a4ab-f3bf68f2a3c4",
            "subtitle": null,
            "symbol": "Dyn"
        },
        {
            "applink": "leafly://strain/avalon",
            "category": "Hybrid",
            "name": "Avalon",
            "permalink": "https://mobileapi.leafly.com/hybrid/avalon",
            "slug": "avalon",
            "subtitle": null,
            "symbol": "Ava"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/blue-dynamite",
    "photoTotalCount": 14,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/494183/b/blue-dynamite__primary_0654.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dynamite_100x100_ffe0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/449965/b/blue-dynamite__primary_d5ea.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dynamite_100x100_8a72.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/440011/b/blue-dynamite__primary_2c5c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dynamite_100x100_18be.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/409354/b/blue-dynamite__primary_4eb4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dynamite_100x100_b3de.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/409259/b/blue-dynamite__primary_70ae.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dynamite_100x100_5be1.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/353810/b/blue-dynamite__primary_b4f9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-dynamite_100x100_f436.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Montréal, QC",
        "Toronto, ON",
        "Vancouver, BC",
        "Calgary, AB",
        "Edmonton, AB",
        "Seattle, WA",
        "Winnipeg, MB",
        "Brampton, ON",
        "Halifax, NS",
        "Hamilton, ON"
    ],
    "rating": 4.31,
    "relatedStrains": [],
    "reviewCount": 48,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "blue-dynamite",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.3125/240",
    "subtitle": null,
    "symbol": "Bdy",
    "symptoms": [
        {
            "name": "Pain",
            "score": 24.537037037037035
        },
        {
            "name": "Stress",
            "score": 18.51851851851852
        },
        {
            "name": "Insomnia",
            "score": 12.037037037037035
        },
        {
            "name": "Depression",
            "score": 11.574074074074073
        },
        {
            "name": "Nausea",
            "score": 10.185185185185183
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
