{"sl_translate":"description,descriptionPlain,category","id":292,"slug":"blackberry-kush","name":"Blackberry Kush","subtitle":null,"symbol":"Bbk","category":"Indica","description":"\u003cp dir=\"ltr\" style=\"line-height:1.15;margin-top:0pt;margin-bottom:0pt;\"\u003eThis mostly indica strain is a mix of \u003ca href=\"http://www.leafly.com/indica/afghani\"\u003eAfghani\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/blackberry\"\u003eBlackberry\u003c/a\u003e strains and has beautiful dark purple buds with orange hairs. Plants will flower at 7-8 weeks and are not particularly high yielders, but the dense, hard nugs have crystals throughout. Blackberry Kush tends to have a hashy, jet fuel smell and taste that is balanced by sweet berries. Blackberry Kush is often recommended for the treatment of pain thanks to its strong indica body effects.\u003c/p\u003e\n\n\u003cp dir=\"ltr\" style=\"line-height:1.15;margin-top:0pt;margin-bottom:0pt;\"\u003e\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"This mostly indica strain is a mix of Afghani and Blackberry strains and has beautiful dark purple buds with orange hairs. Plants will flower at 7-8 weeks and are not particularly high yielders, but the dense, hard nugs have crystals throughout. Blackberry Kush tends to have a hashy, jet fuel smell and taste that is balanced by sweet berries. Blackberry Kush is often recommended for the treatment of pain thanks to its strong indica body effects.\n\n\u0026nbsp;\n","aka":"Black Berry Kush","rating":4.27,"highlightedReviews":[{"id":1417550,"username":"hasso","text":"If you\u0027re looking for a quick puff this is not the right strain. the reason being at first you think it will be quick little puff but then the tart and tangy flavors draw you in for a second take and before you know it...you\u0027re best friends with a squirrel.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1639255,"username":"Wahm","text":"As a new smoker, this is the first strain that I\u0027ve tried so far that knocked me flat on my ass\n\nThe flower itself is very appealing to both sight and smell\n\nThe smoke itself could be a little harsh, and I had some trouble figuring out a good dosage, but once I used a bong and that comfortable euphoria set in, damn, I knew this strain was a keeper\n\nDo note that it does cause some dryness, but nothing major if you hydrate\n\nI give it my full recommendation","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-36395","title":"Forget 5:00; 4:20 Is the New Happy Hour","author":"Brett Konen","category":null,"date":"\/Date(1501792067000)\/","text":"For anyone who regularly chooses cannabis over alcohol, 4:20 is already the de facto happy hour. Finally, the rest of the world is catching up.\n\nWhere to Find a 4:20 Happy Hour\nUpscale establishments in both LA and San Francisco have launched happy hours beginning at 4:20 p.m., a sign of cannabis’s ever-expanding place in mainstream consciousness. EdiBOL, in downtown LA, the Happy 420 Hour menu features deep-fried bites (“Munchabols”—all priced at $4.20) and cocktails named after cannabis strains (complete, we noticed during a recent visit, with strain descriptors—relaxed, uplifted, etc.—from the Leafly pages for each drink’s namesake strain). The menu runs from 4:20 to 7:00 p.m. every weekday.\n \nhttps://www.instagram.com/p/BKRx6XZA7b_/\nMore recently, in June, San Francisco’s beloved Flore—the site of the auspicious first meeting between famed cannabis activists Dennis Peron and Mary Jane “Brownie Mary” Rathbun, and a hub for revolutionary rethinking of cannabis since the 1970s—launched a CBD-and-terpene-infused cannabis cocktail/mocktail menu (supported with a selection of happy hour munchies to go with them, and augmented with CBD-infused beer on tap). The happy hour pays homage to the café’s (and more generally, the Castro neighborhood’s) rich history and significance in cannabis history. Each of the 16 drinks on the menu contains a low dose of CBD and terpenes that mimic specific cannabis strains. The menu runs from 4:20 to 7:20 p.m. on weekdays (though Flore is considering cutting the happy hour off at 7:10 in a nod to the dabbing community).\n \nhttps://www.instagram.com/p/BMqJrIZgl9S/?taken-by=ediboleats\nWhy the Shift Matters\nWhat’s notable about this evidence of a shift toward daily celebrations of 4:20 in non-cannabis establishments is that the concept of happy hour as we know it has long been associated with the most popular substances of the day. The idea of an after-work drinking occasion originated when absinthe was at the height of its popularity in Europe in the 1800s, and was originally called l’heure vert: The Green Hour (after the color of the drink congregated over). After absinthe fell out of favor, the same concept was rebranded as happy hour during the Prohibition era, and again was associated with the hot commodity of the day: alcohol more generally. Now, as cannabis consumption and acceptance of it both continue to skyrocket, cannabis’s own version of happy hour—4:20—may be the new five o’clock.\nAlthough the alcohol is still present, elements of cannabis culture as well as cannabis itself are defining this new trend. “[Before], folks were getting up from the table to go smoke a joint and we needed to solve that—how are people going to consume and enjoy their cannabis and socialize over it?” explains Aaron Silverman, one of two co-owners of Flore. “Starting with cannabis-infused cocktails help bridge that gap over to socialization and food,” agrees Terrance Alan, Flore’s other co-founder. “Menu items on the munchie menu … not only go well with our new drinks [but] resonate with the cannabis community.”\n \nhttps://www.instagram.com/p/BR93SBqFQza/?taken-by=ediboleats\nCopious dispensaries, of course, have celebrated 4:20 as a happy hour for years: Greenway Marijuana in Port Orchard, WA, for instance, offers daily specials starting at 4:20 and running until 8:00 p.m. Bud and breakfasts also get in on the fun: Maine’s utterly charming 200-year-old Laughing Grass Inn, which runs “Maine’s premier bud and breakfast event from August to September,” offers a complimentary 4:20 happy hour during the event featuring a bud bar and edibles at no extra cost. Occasionally, even bars will throw events for the 4/20 holiday itself, like Florida’s Square Grouper Bar and Grill did (sadly, no cannabis was served). But besides being a cannabis promotional tool and a novelty for those outside the industry, 4:20 has long been under-celebrated.\n \nhttps://www.instagram.com/p/BW_YalUhSSs/?taken-by=flore415sf\nHowever, with the mainstream adaptation of cannabis’s signature time as the new daily moment to kick back and hang out, cannabis offers us all something new: Not only does the herb continue to bring cannabis consumers together, cannabis culture now indirectly offers non-consumers a reason to join in and chill, with or without the flower itself.\n\nHow to 420 at Flore and ediBOL\nIf you visit either California city, both cafés are must-visits. Light, bright, laid-back ediBOL is the perfect place to hang after a smoke sesh—particularly because the $4.20 munchie menu is fantastic. Do not miss the “stoned-ground” corn pops with chipotle crema: these slightly spicy, savory-sweet fried food clouds check every box on the must-have munchie characteristics list. The spiced buttermilk fried chicken sliders are pretty amazing too, as is the ultra-rich PB\u0026J (pork belly, fig jam, and lemon gremolata)—or you can just go the route I went and order the entire menu, for less than the price than two craft cocktails anywhere else. The $6 drinks pay tribute to illustrious strains from Tangie to Blackberry Kush—we recommend diving into a lively, lightly spiced Pineapple Express, which sports a tropical flavor palate and elements of mango, lime, jinra, and ginger.\n \nhttps://www.instagram.com/p/BSwMg1ch2b-/?taken-by=flore415sf\nAt Flore, don’t miss the Blood Orange Mojito—a favorite of owner Aaron Silverman, for one—featuring mint-infused spiced rum, blood orange bitters, citrus, soda, hemp-derived CBD sourced from Canada, and cannabis-derived terpenes that mirror the profile of powerhouse sativa Jack Herer. You’ll also find CBD-infused IPA on tap (a feat of chemistry that required help from a Ph.D chemist—you won’t see this everywhere), and the zero-proof Thai Tea on Ice, paired with elements of Sour Diesel, is another (booze-free) winner. Don’t forget that munchie menu, either—buffalo-blue cheese tater tots and Cool Ranch Dorito-crusted chicken fingers aren’t going to eat themselves.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/03123344/420-happy-hour.jpg","urlslug":"/news/lifestyle/420-happy-hours"},{"id":"contentitems-31914","title":"Tips for Growing Blackberry Kush Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1498158547000)\/","text":"Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Blackberry Kush is the striking aromatic cross between Afghani and Blackberry. Known for blooming with dark purple hues and radiant orange hairs, this indica offers a fruity flavor mixed in with earthy Kush flavors. Blackberry Kush is a wonderful strain for patients seeking relief from pain and sleeplessness.\nGrow Techniques: SOG (sea of green) is the best way to get a hearty yield out of Blackberry Kush. Keep the canopy as clear as you can to prevent mold or pests from infecting the plants. Blackberry Kush is a good option for growing hydroponically if you can acquire the clones to run SOG. Increasing bud sites is the way to get a good yield on Blackberry Kush as the flowers themselves will be small.\nFlowering Time: 7 to 8 weeks\nYield: Moderate\nGrow Difficulty: Moderate\nClimate: Prefers low humidity and mild to warm climates between 68 to 80 degrees Fahrenheit.\nIndoor/Outdoor: Ideally grown indoors, Blackberry Kush can be demanding if grown outside as it is sensitive to inclement weather.\nFeeding: Consider heavy magnesium feeding throughout the grow with a focus on nitrogen as the plant is vegging to increase the development of nodes.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/22115325/bbk.jpg","urlslug":"/news/growing/how-to-grow-blackberry-kush-marijuana"}],"reviewCount":1613,"flavors":[{"name":"Berry","score":54.269231489160738},{"name":"Sweet","score":36.181577856106159},{"name":"Earthy","score":18.832809944248623},{"name":"Blueberry","score":10.813729640380584},{"name":"Pungent","score":9.215434722510194}],"effects":[{"name":"Relaxed","score":93.142199126868945},{"name":"Happy","score":65.814607954938154},{"name":"Sleepy","score":64.229822522864978},{"name":"Uplifted","score":49.804528215495196},{"name":"Euphoric","score":43.336526222729056}],"symptoms":[{"name":"Stress","score":46.721298552076853},{"name":"Insomnia","score":37.695155015320111},{"name":"Pain","score":37.210033807911167},{"name":"Depression","score":26.349681502983387},{"name":"Headaches","score":22.661494689796577}],"conditions":[{"name":"Anxiety","score":43.471527489805794},{"name":"Migraines","score":13.046635623286566},{"name":"Bipolar Disorder","score":12.100896024834704},{"name":"PTSD","score":9.2763299986177348},{"name":"ADD/ADHD","score":8.5826126834381551}],"negatives":[{"name":"Dry Mouth","score":37.8950579687608},{"name":"Dry Eyes","score":27.737162928790287},{"name":"Dizzy","score":10.25970033635128},{"name":"Headache","score":3.4992771903149262},{"name":"Paranoid","score":2.5141178266178263}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/indica/blackberry-kush/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/indica/blackberry-kush/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blackberry-kush_100x100_7078.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000405/b/blackberry-kush__primary_da3c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blackberry-kush_100x100_fb4e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000171/b/blackberry-kush__primary_3777.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blackberry-kush_100x100_ef6a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/662541/b/blackberry-kush__primary_0463.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blackberry-kush_100x100_4b49.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648587/b/blackberry-kush__primary_3994.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blackberry-kush_100x100_943e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646794/b/blackberry-kush__primary_cdef.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/blackberry-kush_100x100_722b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630480/b/blackberry-kush__primary_f774.jpg"}],"photoTotalCount":513,"popularCities":["Portland, OR","Seattle, WA","Spokane, WA","Los Angeles, CA","Eugene, OR","Everett, WA","Bend, OR","Phoenix, AZ","Las Vegas, NV","Springfield, OR"],"permalink":"https://mobileapi.leafly.com/indica/blackberry-kush","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.27154370737756/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Blackberry","subtitle":null,"slug":"blackberry","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blackberry","symbol":"Bbr","applink":"leafly://strain/blackberry"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":"Medium","averageYield":"Medium","environment":null,"growNotes":"\n\tWell suited for sea of green (SOG)\n\tYields typically reach up to 430g/m\u0026sup2;\n\tCan exhibit many different indica phenotypes\n\n"}}
