{"sl_translate":"description,descriptionPlain,category","id":21,"slug":"la-confidential","name":"LA Confidential","subtitle":null,"symbol":"La","category":"Indica","description":"\u003cp\u003eLA Confidential is known as a very popular and successful strain. Its\u0026nbsp;buds have a frosty, lime green appearance\u0026nbsp;and little purple leaves. The taste is smooth and piney, with a classic skunky aroma that does not linger for too long. Overall,\u0026nbsp;LA Confidential is a well-rounded strain that\u0026nbsp;delivers a fast-approaching sensation that is both psychedelic and super calming on the mind and body. For newer patients seeking relief,\u0026nbsp;LA Confidential can both lull you\u0026nbsp;to sleep and treat acute pain.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"LA Confidential is known as a very popular and successful strain. Its\u0026nbsp;buds have a frosty, lime green appearance\u0026nbsp;and little purple leaves. The taste is smooth and piney, with a classic skunky aroma that does not linger for too long. Overall,\u0026nbsp;LA Confidential is a well-rounded strain that\u0026nbsp;delivers a fast-approaching sensation that is both psychedelic and super calming on the mind and body. For newer patients seeking relief,\u0026nbsp;LA Confidential can both lull you\u0026nbsp;to sleep and treat acute pain.\u0026nbsp;\n","aka":null,"rating":4.28,"highlightedReviews":[{"id":1417710,"username":"kbutt","text":"This is a POWERFUL psychedelic... it\u0027s awesome!! We ended up watching Wallace \u0026 Gromit and having sex.. then passing out listening to music lol! When laying there listening... it was just WOW the images that kept coming to my head.. the creativity.. it was amazing! I felt very relaxed, but I didn\u0027t feel super tired. My husband, however, passed out quickly and fell asleep immediately! I very happily laid down just listening and imagining.. I really love this strain! The only negatives is that I got a bit hungry, but not that bad. I also have an anxiety problem and this did not give me anxiety at *all*. My #1 favorite thing about this strain is definitely the happy imagination aspect! This is the perfect strain to just sit and listen to music!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"},{"id":1639792,"username":"twosailsonasound","text":"Lovely buds that are firm enough to be impressive but loose enough to not be too sticky, with a lovely piney scent. Total Indica, with a high that comes on slow, so smokers be warned. The high is one of deep relaxation with a hint of psychedelia.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2831","title":"Netflix and \"Chill\" with These Eight Strain Pairings for November 2015","author":"Rebecca Kelley","category":null,"date":"\/Date(1446147180000)\/","text":"Who doesn’t love a good Netflix and chill sesh? Now that the days are getting shorter, the weather a little colder, and the sweatpants a little cozier, we thought we’d peruse the list of new releases coming to Netflix in November to recommend a few options that would pair well with these delectable strains. If you find yourself interested in any of these streaming offerings, try to pick up the corresponding strains to enhance your Netflix and chill experience.\n \nCOMEDIES\nMaster of None: Season 1\n\nDate Available: November 6\nThis new comedy series stars Aziz Ansari, who you may recognize as Tom Haverford from “Parks and Recreation.” His new show follows the personal and professional life of a 30-year old actor in New York City.\nStrain Pairing: Black Domina\n\nIn homage to Ansari’s Tom Haverford character and his food language, we thought a nice appetite-inducing strain like Black Domina would pair well with his new comedy series. Order up some chicky chicky parm parm and some big ol’ cookies — you wouldn’t want to laugh on an empty stomach!\n \nW/Bob \u0026 David\n\nDate Available: November 13\nThese two veteran comedians are back with another round of sketch comedy. The pair became notable for their first sketch series, Mr. Show with Bob and David, and each has enjoyed acclaim in separate television series (David Cross for “Arrested Development” and Bob Odenkirk for “Breaking Bad” and “Better Call Saul”). So pull up a chair (just ask if you can use it first) and get ready for some good laughs!\nStrain Pairing: Fire Haze\n\nThis daytime sativa will help get the giggles going for a marathon sesh of sketch comedy, and its happy, uplifting effects will ensure that you won’t lose steam while you binge-watch.\n \nDOCUMENTARIES\nLast Days in Vietnam\n\nDate Available: November 1\nThis Oscar-nominated documentary explores the chaotic final weeks of the Vietnam War, when American soldiers and diplomats were faced with the tough decision to obey White House orders to evacuate only U.S. citizens, or whether they were willing to risk treason charges in order to save South Vietnamese citizens as well.\nStrain Pairing: Dream Queen\n\nThe hybrid strain Dream Queen should help balance the sobering effects of this wartime documentary by delivering uplifting relaxation while still allowing you to focus on the film.\n \nSoaked in Bleach\n\nDate Available: November 15\nYes, it’s another Kurt Cobain documentary. You may have heard of the film “Kurt Cobain: Montage of Heck” that’s been generating attention lately, but “Soaked in Bleach” follows a private investigator who had been hired by Courtney Love and his perspective on the death of the grunge legend.\nStrain Pairing: Chemdawg\n\nThe creative Chemdawg should help you tap into your inner artist as you revisit the life of one of the 90s’ most iconic musicians.\n \nFOR THE KID IN ALL OF US\nThe SpongeBob Squarepants Movie\n\nDate Available: November 1\nSometimes a “Netflix and chill” night is best spent watching a silly children’s film, and SpongeBob Squarepants can deliver just that. Follow your favorite pineapple under the sea-dwelling creature and his pal Patrick as they attempt to track down King Neptune’s stolen crown.\n[BLURB]\nStrain Pairing: Pineapple Express\n\nNothing should put a smile on your face like a silly animated feature paired with the grin-inducing Pineapple Express. You’ll feel energetic and uplifted, plus the pineapple flavor is an all-too appropriate combination for Spongebob’s humble abode.\n \nSCI-FI/ACTION\nRobot Overlords\n\nDate Available: November 1\nOh no! Earth has been overtaken by alien robots, and it’s up to Gillian Anderson and Ben Kingsley to save the day! If you’re in the mood for a so-bad-it-might-be-good robot sci-fi film starring Gandhi and Scully, this ridiculous action/adventure offering could be right up your alley.\nStrain Pairing: Chocolope\n\nThis optimistic sativa will keep you happy long after the movie does, keeping you alert and energetic while you slog through what will either be a “guilty pleasure” or a “never again.”\n \nMarvel’s Jessica Jones: Season 1\n\nDate Available: November 20\nA superhero (the titular Jessica Jones) goes the private investigator route in this new Netflix original series based on the Marvel graphic novels. Starring a who’s who of recognizable actors, including Krysten Ritter (who you may recognize from “Breaking Bad”), David Tennant (“Dr. Who” fans should know him all too well), and Carrie-Anne Moss (aka Trinity from “The Matrix” trilogy), this show could be a fun entry into the ever-expanding Marvel universe.\nStrain Pairing: Bruce Banner\n\nWhat better pairing for a Marvel television series than this comic book character-inspired strain? The powerful Bruce Banner will settle you into a euphoric and creative state of mind, perfect for getting absorbed into the vast world of Marvel.\n \nWILDCARD SELECTION\nThe Runner\n\nDate Available: November 5\nOh, Nicolas Cage. He’s an actor so enigmatic that it’s tough to decide whether he’s good or bad. In “The Runner,” he plays a sex scandal-plagued politician during the 2010 BP oil spill. Is this a “good” Nic Cage flick or a “bad” one? Grab a strain and decide for yourself!\nStrain Pairing: LA Confidential\n\nThis potent indica has strong psychedelic effects, putting you in the perfect state of mind to fully embrace the Nic Cage experience. Whether your mind is blown or bored by this movie, you’ll feel calm and relaxed enough to easily drift off to sleep afterwards.\nImage sources: IMDb","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/10/12000405/netflix-and-chill-with-these-eight-strain-pairings-for-november-2.jpg","urlslug":"/news/lifestyle/netflix-and-chill-with-these-eight-strain-pairings-for-november-2"},{"id":"contentitems-32147","title":"Tips for Growing LA Confidential Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1498323651000)\/","text":"Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: LA Confidential is popular for its notable skunky smell and strong euphoric high. Created by DNA genetics, this multiple award-winning indica is a cross between OG LA Affie and Afghani. Its buds are small but dense and trichome-soaked, making it a great choice for growers of all skill levels.\nGrow Techniques: Increasing bud sites for LA Confidential can help increase yields. A SCROG (screen of green) setup in either soil or hydro is the best way to expose as many bud sites as possible. Keep the lower canopy free of bud sites or extra foliage, as they will detract from the quality cannabis on top.\nFlowering Time: 6-7 weeks\nYield: Moderate\nGrow Difficulty: Easy\nClimate: LA Confidential prefers temperatures between 68-80 degrees Fahrenheit, and can handle colder temperatures.\nIndoor/Outdoor: LA Confidential was developed for indoor gardens, as it prefers to be in a space where temperature and weather are consistent. It can be grown outdoors in cooler climates.\nFeeding: Heavy feedings help LA Confidential reach its full potential. When it’s flowering, make sure the plant has access to phosphorus and potassium to help the buds develop into dense, hearty nugs.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/23162838/la-confidential-cannabis.jpg","urlslug":"/news/growing/how-to-grow-la-confidential-marijuana"}],"reviewCount":1084,"flavors":[{"name":"Earthy","score":20.483661151670503},{"name":"Pine","score":18.255836583348483},{"name":"Sweet","score":15.331578367830868},{"name":"Flowery","score":9.4645861448205046},{"name":"Woody","score":8.108593611959714}],"effects":[{"name":"Relaxed","score":86.950265165385872},{"name":"Sleepy","score":60.694308226912945},{"name":"Happy","score":55.845622786554031},{"name":"Euphoric","score":53.931451354763375},{"name":"Uplifted","score":38.0452663305259}],"symptoms":[{"name":"Stress","score":44.55911613245209},{"name":"Insomnia","score":44.180791322139449},{"name":"Pain","score":35.205231094642656},{"name":"Depression","score":26.347081132157612},{"name":"Lack of Appetite","score":22.556765366404534}],"conditions":[{"name":"Anxiety","score":28.228999951345802},{"name":"ADD/ADHD","score":13.7817372622026},{"name":"PTSD","score":12.654048157414259},{"name":"Arthritis","score":11.632386795762477},{"name":"Bipolar Disorder","score":10.616499919336459}],"negatives":[{"name":"Dry Mouth","score":29.49164044034611},{"name":"Dry Eyes","score":19.26482224572419},{"name":"Dizzy","score":10.054992048879544},{"name":"Headache","score":5.5913405768339439},{"name":"Paranoid","score":4.869555531086192}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/indica/la-confidential/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/indica/la-confidential/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/la-confidential_100x100_088b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000116/b/la-confidential__primary_c056.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/la-confidential_100x100_6a5a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/706122/b/la-confidential__primary_3184.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/la-confidential_100x100_081a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/679435/b/la-confidential__primary_88ea.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/la-confidential_100x100_e396.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/672492/b/la-confidential__primary_6552.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/la-confidential_100x100_c5aa.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646098/b/la-confidential__primary_70e1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/la-confidential_100x100_bbd5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645390/b/la-confidential__primary_6147.jpg"}],"photoTotalCount":315,"popularCities":["Seattle, WA","Toronto, ON","Montréal, QC","Portland, OR","Vancouver, BC","Calgary, AB","Edmonton, AB","Los Angeles, CA","Ottawa, ON","Hamilton, ON"],"permalink":"https://mobileapi.leafly.com/indica/la-confidential","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.27859778597786/240","testGraph":"https://leafly.s3.amazonaws.com/strains/testing/Zc1LA1fZRBt3XH9al9rQ_la-confidential.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"OG LA Affie","subtitle":null,"slug":"og-la-affie","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/og-la-affie","symbol":"Ola","applink":"leafly://strain/og-la-affie"},{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":62,"outdoorFinish":null,"height":"Tall","averageYield":"High","environment":null,"growNotes":"\n\tRequires a dry outdoor climate\n\tBest results when plants are grown large and not confined to pots\n\tFour phenotypes, three of which typically express sativa influence while the fourth exhibits more indica-like characteristics\n\n"}}
