{
    "aka": null,
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1513365385000)/",
            "id": "contentitems-51835",
            "text": "A strain may have an incredible aroma, but it doesn’t always translate well to flavor. The intricacies of its aroma may fall apart under the heat of combustion. An imperfect cure, flush, or growing environment can also lead to a harsher smoke. But a well-grown flower with amazing flavor is something to truly revel in.\nThese Washington state strains exhibit flavors that can stand the test of heat, delivering well-preserved terpene profiles when smoked or vaporized. Whether you like sour strains that reek of diesel or sweet varieties that taste just like fruit medley, dig in and find the one for you.\n\nSherbet by Gabriel Cannabis\n\nVoted “Best Flavor” in this season’s Top THC-Dominant Strains in Washington, Sherbet by Gabriel Cannabis embodies a harmony of sweet-smelling terpenes. Its aroma is sugary and dessert-like but opens up into flavors of deep grape and marionberry. The exhale leaves behind an earthy, herbal taste much like spicy echinacea tea.\nFind Sherbet Nearby\nGhost Train Haze by Sweet As!\n\nGhost Train Haze is known to pack a spice rack of different flavors, which Sweet As! captures masterfully in its own rendition. Upon opening the container, your nose is immediately met with an overpowering aroma of overripe oranges, sour citrus, and pine oil cleaner. Its flavor shape-shifts into what feels like an entirely new palate of tastes, including clean mint, lavender, and rich sandalwood.\nFind Ghost Train Haze Nearby\n\nMiddlefork by Royal Tree Gardens\n\nIt should come as no surprise that the first place winner of this season’s Top THC-Dominant Strains in Washington delivered a standout experience of flavor. Royal Tree’s Middlefork carries an overwhelming diversity of fruity, dessert-like flavors that can range from lemon-blueberry muffins to vanilla chai, citrus tea, or candied oranges with a slightly sour fizz. The smooth exhale leaves these flavors lingering a moment before its dreamy, euphoric effects take the wheel.\nFind Middlefork Nearby\nChocolope by Gabriel Cannabis\n\nTraditionally, Chocolope is an earthy strain with subtle flavors of spice and coffee. Gabriel’s Chocolope, however, delivers an altogether different experience—one that is nuanced with bright flavors of lime, tropical fruit, and warm pine dancing together on the exhale. Its flavor is an undisturbed reflection of its aroma, which bursts from the jar with loud notes of sour candied citrus.\nFind Chocolope Nearby\nSour Diesel by Nebula Gardens\n\nSour Diesel has long been a household name, known by its sting of sour fuel and acrid gas. Nebula’s hand at Sour Diesel is impressive in both aroma and flavor, preserving these legacy attributes with an earthy, minty finish. Hints of rosemary and spearmint are detectable in a vaporizer, whereas smoking this strain brings more of a sweet, hashy taste like burnt sage.\nFind Sour Diesel Nearby",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/14154638/sweet-as-ghost-train-haze-macro_web.jpg",
            "title": "Washington’s Best-Tasting Strains From Fall 2017",
            "urlslug": "/news/strains-products/washingtons-best-flavored-strains-from-fall-2017"
        },
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1399564800000)/",
            "id": "contentitems-6233",
            "text": "The cannabis market is often compared to that of wine thanks to the impressive depth, complexity, and varietal diversity of both. If you have yet to pair the two, welcome to the concerto of all physiological symphonies. Tantalizing the palate with a sip of chardonnay, following with an expansive citrus pull of Lemon Pie, and relishing the beautiful chorus of aromas, flavors, and effects strung together by these two elevated delectations is an experience unlike any other. But how to go about it if you’re new to wine or cannabis pairing?\nBasic Tenets of Wine Pairing\n(gilaxia/iStock)\nA good pairing should result in an experience greater than the sum of its parts. “Steak and cabernet sauvignon is a perfect example,” says Jameson Fink, Senior Digital Editor at Wine Enthusiast. “On its own, cabernet is rich and tannic. Pair it with steak and a wonderful dance happens: the fat of the meat tames tannins and, simultaneously, the tannins cut through the fat and get you ready for the next bite.”\nFor those who are intimidated by the idea of pairings, you’re not alone. Many who are new to the process state that they feel overwhelmed by the sheer number of potential pairings out there, which is fair—between hundreds of wine varietals and thousands of cannabis strains, coupled with variations (think red blends and strain phenotypes) plus new strains hitting the market by the day, the possibilities are truly endless. Let us allay apprehension by emphasizing that in pairings, there are no wrong answers.\n\n“There are no hard and fast rules,” explains Fink. “That same steak [that works with a cabernet sauvignon] can be great with a pinot noir. And one of the best wine pairings I ever had with steak was Champagne”—an unconventional choice. The same guidance goes for pairing wine with anything else, including charcuterie, chocolate, and cannabis. Tl;dr: If you like it, it’s a good pairing.\n\nPairing Wine and Cannabis by Flavor\n(gilaxia/iStock)\nCannabis is characterized to a great extent by terpenes, a diverse class of fragrant oils that occur naturally in the plant and give strains their unique aromas and flavors. The fact that the Lavender strain truly smells like its namesake can be attributed to the presence of linalool, also commonly found in lavender flowers. Similarly, Mango Kush gets its flavor from myrcene, also present in its namesake fruit. In an effective pairing, the flavors in cannabis will either accentuate existing flavors in the wine and vice versa, or else complement them in a unique way.\nOne of the easiest place for beginners to start is with descriptively named strains, such as the tangerine-forward Tangie. Have a citrusy pinot gris on hand? Match it with Tangie to play up those flavor notes. You can also consider other flavors that would go well with tangerine, such as those found in a bright and floral chenin blanc. If you’ve played around with food and wine pairings or mixed drinks before, you’ve already got a head start: For instance, if you’d be inclined to add tangerines to a sangria with said wine, a tangerine-flavored strain is a logical bet.\n\nOnce you’ve experimented with a few easy pairings, start using your imagination to think up new combinations. “It would be interesting to explore cannabis strains with grassy, herbaceous flavors and aromas and see if they complement and/or accentuate a white and a red wine with those characteristics, [such as] sauvignon blanc and cabernet franc,” suggests Fink. We suggest working with a vaporizer suited for cannabis flower—you’ll have an easier time tasting the subtle nuances of flavor present in the vapor than you would in smoke.\nLooking for a little more guidance? Use our visual guide and flavor chart to determine which cannabis strain to pair with your favorite bottle of wine.\n(Nick Ouellette/Leafly)\nPairing Wine and Cannabis by Effects\n(franckreporter/iStock)\nOne of the elements that makes wine and cannabis pairings even more compelling than wine and food pairings is the fact that not only does the wine influence the consumer’s state of consciousness, so does the cannabis. Red wine, for instance, lends itself to a warm and cozy—even romantic—buzz. Certain strains can have similar effects (for instance, check out these 11 arousing strains).\n\nThat said, it’s important to be mindful of each individual substance’s effects as you pair. Smoking a sleepy indica and polishing off two glasses of a heavy red may leave you dozing in an armchair rather than hanging out with your guests. If you know red wine tends to make your eyelids feel heavy, opt for an energy-packed sativa or hybrid to balance things out instead, and always consume in moderation when pairing any kind of cannabis and alcohol.\nWine and Cannabis Pairings to Try\n\n\nMerlot and Blueberry: The dense mountain berry notes and underlying earthiness of this legendary strain play beautifully with the deep, dark, stonefruit flavors and velvety mouthfeel of a good merlot.\nRosé and Strawberry Cough: The sweet strawberries-and-sugar elements of Strawberry Cough accent the berry notes and residual sugars of a summery rosé wine, while the subtle skunkiness woven through the flavor profile of the strain plays out in a memorable way against the backdrop of the wine.\nRiesling and OG Kush: The lemon-laced evergreen forest flavors of OG Kush match impeccably with the subtle sweetness and minerality of an off-dry riesling; meanwhile, the body-relaxing, euphoric effects of the strain provide the perfect complement to the buzz of a glass or two.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/05/25120852/cannabis-and-wine-pairing-4.jpg",
            "title": "The Leafly Wine & Cannabis Pairing Guide",
            "urlslug": "/news/lifestyle/wine-cannabis-pairing-guide"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 36.17057124518613
        },
        {
            "name": "PTSD",
            "score": 14.017971758664954
        },
        {
            "name": "ADD/ADHD",
            "score": 8.60558408215661
        },
        {
            "name": "Migraines",
            "score": 7.287387676508343
        },
        {
            "name": "PMS",
            "score": 6.877406931964056
        }
    ],
    "description": "<p>Orange Kush was bred by Green Devil Genetics and is the child of <a href=\"http://www.leafly.com/hybrid/orange-bud\">Orange Bud</a> and <a href=\"http://www.leafly.com/hybrid/og-kush\">OG Kush</a>. It eases the body into relaxation while lifting moods with a sweet and tangy citrus flavor. This strain is resistant to most pests and mold and has long, dense buds with many orange hairs and trichome crystals.</p>\n",
    "descriptionPlain": "Orange Kush was bred by Green Devil Genetics and is the child of Orange Bud and OG Kush. It eases the body into relaxation while lifting moods with a sweet and tangy citrus flavor. This strain is resistant to most pests and mold and has long, dense buds with many orange hairs and trichome crystals.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 74.48652118100128
        },
        {
            "name": "Happy",
            "score": 56.875802310654684
        },
        {
            "name": "Euphoric",
            "score": 44.28032734274711
        },
        {
            "name": "Sleepy",
            "score": 36.294127086007705
        },
        {
            "name": "Uplifted",
            "score": 31.236360718870344
        }
    ],
    "flavors": [
        {
            "name": "Orange",
            "score": 51.85333761232349
        },
        {
            "name": "Citrus",
            "score": 47.87788831835687
        },
        {
            "name": "Sweet",
            "score": 25.62179075738126
        },
        {
            "name": "Earthy",
            "score": 18.620827984595635
        },
        {
            "name": "Pungent",
            "score": 13.276636713735558
        }
    ],
    "growInfo": {
        "averageYield": "Medium",
        "difficulty": "Moderate",
        "environment": null,
        "floweringDays": 53,
        "growNotes": "",
        "height": "Medium",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1417605,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/0/240",
            "text": "Well im pretty high. So..",
            "username": "Anonymous"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1643247,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Orange Kush, have a Beautiful bud, citrus scent like orange, quick body effect and extremely relaxing, cushions the frontal cortex.",
            "username": "CrazyHiT"
        }
    ],
    "id": 194,
    "name": "Orange Kush",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 25.43645699614891
        },
        {
            "name": "Dry Eyes",
            "score": 21.42891527599486
        },
        {
            "name": "Paranoid",
            "score": 6.555680359435173
        },
        {
            "name": "Dizzy",
            "score": 6.011713735558408
        },
        {
            "name": "Anxious",
            "score": 2.487163029525032
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/og-kush",
            "category": "Hybrid",
            "name": "OG Kush",
            "permalink": "https://mobileapi.leafly.com/hybrid/og-kush",
            "slug": "og-kush",
            "subtitle": null,
            "symbol": "Ogk"
        },
        {
            "applink": "leafly://strain/orange-bud",
            "category": "Hybrid",
            "name": "Orange Bud",
            "permalink": "https://mobileapi.leafly.com/hybrid/orange-bud",
            "slug": "orange-bud",
            "subtitle": null,
            "symbol": "Orb"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/orange-kush",
    "photoTotalCount": 231,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1006204/b/orange-kush__primary_40e6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-kush_100x100_2f83.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003213/b/orange-kush__primary_e2d8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-kush_100x100_027b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/665647/b/orange-kush__primary_157d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-kush_100x100_c847.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/634315/b/orange-kush__primary_e5fd.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-kush_100x100_1156.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/626446/b/orange-kush__primary_8214.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-kush_100x100_5fc2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/618763/b/orange-kush__primary_debe.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-kush_100x100_7f18.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Denver, CO",
        "Montréal, QC",
        "Spokane, WA",
        "Calgary, AB",
        "Colorado Springs, CO",
        "Everett, WA",
        "Toronto, ON",
        "Edmonton, AB",
        "Lynnwood, WA"
    ],
    "rating": 4.16,
    "relatedStrains": [],
    "reviewCount": 640,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "orange-kush",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.1578125/240",
    "subtitle": null,
    "symbol": "Ok",
    "symptoms": [
        {
            "name": "Stress",
            "score": 40.72288189987162
        },
        {
            "name": "Depression",
            "score": 34.41752246469833
        },
        {
            "name": "Headaches",
            "score": 22.879492939666235
        },
        {
            "name": "Insomnia",
            "score": 20.17410141206675
        },
        {
            "name": "Pain",
            "score": 15.900192554557126
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
