{
    "aka": "Plush Berry",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1513640241000)/",
            "id": "contentitems-52211",
            "text": "Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis strains of 2017. How many have you tried? What was your favorite strain of 2017? Share with us in the comments below!\n\nPlushberry\nAn introspective indica that won’t put you to sleep, Plushberry is the perfect strain for enjoying some peace and quiet. Relax with the aroma of lavender wrapped up in this cross of two more of our faves: Space Queen and Black Cherry Soda.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\n11 Unsung Cannabis Strains Worth Discovering\n\nLemonder\nFor a light, euphoric strain that offers bright flavors of lemon and pine, track down the balanced Seattle-native hybrid Lemonder. A cross between Lavender, Super Lemon Haze, and OG Kush, we love its mentally stimulating qualities that don’t overwhelm.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\nWhat Are You Smoking? Episode 18\nThe Top THC-Dominant Strains of Washington State in Fall 2017\n\nAllen Wrench\nA child of popular parents (Trainwreck and NYC Diesel), the sour sativa Allen Wrench packs a punch of upbeat energy. We love harnessing its powerful cerebral qualities and energy-boosting characteristics on busy days.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\n6 Cannabis Strains to Help You Stay Productive\nThese Cannabis Strains All Have Unique Cannabinoids\n\n\nDutchberry\nRinging in at around 8% CBD and 27% THC, the giggle-inducing hybrid Dutchberry takes on the best attributes of its Dutch Treat and DJ Short Blueberry parents. A particularly delicious strain, we can’t get enough of the berry and citrus flavors that accompany this happy high.\nAlso featured in: Smoke This, Play That Vol. 4\nSunset Sherbet\nThe potent hybrid Sunset Sherbet is a powerful, full-body strain that will take you to new heights with its cerebral stimulation. We’ve been filling our bongs with a hefty dose to melt away stress and bask in a richly euphoric high.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\nThe 10 Cannabis Strains You Must Try This Summer\nTop Trending Strains of 2015\nTips for Growing Sunset Sherbet Cannabis\n\nDark Side of the Moon\nInspired by the famous Pink Floyd album, Dark Side of The Moon is a sweet indica that we like to reserve for right before bedtime. For the perfect nightcap after a stressful day, we recommend packing your favorite pipe and slipping into an elevated slumber.\nAlso featured in: May the Fourth Be With You: The Best Strains to Celebrate the Galactic Star Wars Holiday\n\nSpace Queen\nWith sweet dessert aromas including notes of vanilla, cherry, and apple, the hybrid Space Queen helped us stay upbeat in 2017. Perfect for daytime use, Space Queen’s sativa qualities deliver a buzzy kick that will keep you going (despite its indica Romulan roots).\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\nCelebrate 10 Famous 4/20 Birthdays With These Strain Pairings\nWhich Cannabis Strain Pairs Best With your Zodiac Sign?\n7 ‘Eye Candy’ Movies to Pair With Your Favorite Strain\n\nWhite Tahoe Cookies\nThe strong indica that is White Tahoe Cookies was practically made for lazy days. With sedative effects that build with each hit, you’ll want to park somewhere comfortable and clear your schedule for a cozy day in (we’ve found White Tahoe Cookies to be very hyggelig).\nHarlequin\nThe CBD-rich sativa Harlequin delivers a stress-melting 5:2 CBD:THC ratio that expertly crushes anxiety and pain without the intoxicating effects. A Columbia Gold and Swiss landrace descendant, Harlequin is a preferred strain for those among us who are medical patients as well as the many of us who simply love CBD.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\nTips for Growing Harlequin Cannabis\n7 High-Energy Strains to Help You Get Active and Fight Fatigue\nHigh CBD Products for Medical Marijuana Patients\nWhat Are the Best Cannabis Stains for Pain?\n\n\nDancehall\nSuitable for social gatherings and celebratory occasions, the hybrid Dancehall is an aptly named energy-boosting strain. We’ve been loading up our vaporizers before concerts, parties, festivals, and all manner of exciting events.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\n11 Unsung Cannabis Strains Worth Discovering\n\nPurple Trainwreck\nBorn from the powerhouse combination of Trainwreck and Mendocino Purps, hybrid Purple Trainwreck is the go-to strain for laughing fits and cerebral stimulation. We’ve been keeping it on hand for its tasty notes of pine, lavender, and citrus.\nAlso featured in:\n\nTips for Growing Purple Trainwreck Cannabis\n10 Products to Pick Up Before 4/20\nThe 10 Cannabis Strains You Must Try This Summer\n\nLead image by Julia Sumpter/Leafly",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/18151942/leafly-faves-strains-2017.jpg",
            "title": "Leafly's Faves 2017: Strains",
            "urlslug": "/news/strains-products/leaflys-faves-2017-strains"
        },
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1511894705000)/",
            "id": "contentitems-49877",
            "text": "As we explored recently with our list of 9 Most Overhyped Cannabis Strains, a few of the best-known cannabis varieties on the market are a little overrated. Correspondingly, it’s no surprise that there are some underrated cannabis strains out there, too.\n\nThe following represent 11 varieties of cannabis that we think get less love than they deserve, based on Leafly review data, regional availability, and the personal experiences of our cannabis expert team. This is far from an exhaustive list—with thousands of strains available in the world, it’s virtually impossible to give all of them the attention we wish we could. Nevertheless, take the following as just a few recommendations of lesser-known types you should keep an eye out for—who knows? You just might find your new favorite strain among them.\nTahoe OG Kush\nStrain type: Hybrid\nParent strains: OG Kush, SFV OG Kush\nWhy it’s underrated: “Tahoe OG isn’t underrated in the traditional sense of the word. In fact, most people I know who’ve come across this select OG Kush phenotype will share their excitement for the pungent, piney sweetness and the strain’s dynamic mix of deep relaxation and profound euphoria. However, when I think of the OG family tree, the Tahoe cut doesn’t seem to get quite the same notoriety that some of its relatives. The SFV, Larry, and Fire OGs manage to capture a lot of the buzz, while other cuts, like the Ghost and WiFi OGs, have somewhat cult followings. This leaves room for Tahoe OG to stand on its own, which is OK by me. I love its dank, complex aroma and the sedating effects, so the less hype there is for Tahoe OG, the more of this delicious strain is available for me!” —Will Hyde\n\nLodi Dodi\nStrain type: Hybrid\nParent strains: Undisclosed\nWhy it’s underrated: “This strain is a mainstay in the Pacific Northwest, but still flies beneath the radar outside the region. Sativa-dominant in effect, this unknown cultivar has been propagated throughout the Evergreen State for decades. Lodi Dodi’s airy physical lightness and uplifting mental buzz allow the consumer to metaphorically levitate two inches above their problems and their pain. I personally enjoy working out after consuming this strain for its stimulating aura and a mental haze that allows me to fade into my headphones and run forever. It’s equally satisfying on the dancefloor or in the bedroom, as long as you mind your dosage. Lodi Dodi came to party—it don’t cause trouble or bother nobody.” —Jeremiah Wilhelm\nChocolope Kush\nStrain type: Hybrid\nParent strains:  Chocolope, Kosher Kush\nWhy it’s underrated: “This is, weirdly, one of the lowest-rated strains on Leafly (yep, a four-star rating is on the low end—Leafly reviewers give most cannabis pretty high marks), but riddle me this: How can a marriage of superstars like Chocolope and Kosher Kush possibly be bad? Those parent strains are two of our all-time faves (in fact, both landed on our Top 100 Strains list) and given that the apple rarely falls far from the tree, this super-low rating for Chocolate Kush is undeserved.” —Brett Konen\n\nDancehall\nStrain type: Hybrid\nParent strains: Juanita La Lagrimosa, Kalijah\nWhy it’s underrated: “Dancehall is an exceptional CBD-dominant strain that doesn’t get much recognition by comparison to CBD hallmarks like Harlequin, ACDC, Charlotte’s Web, and Cannatonic. With a near 21:1 CBD:THC ratio, Dancehall delivers soothing, easygoing effects with just enough sativa-dominant influence to elevate mood, which makes it a constant companion for consumers who like to stay level and clearheaded while enjoying cannabis. The terpene profile also offers deeper, skunkier notes than the usual grassy, hay-like aroma CBD strains are known for. Whether you’re enjoying it for what it is, or blending with your THC-dominant strains, Dancehall adds something special and drastically underappreciate to any joint or bowl.” —Jeremiah Wilhelm\nBay Dream\nStrain type: Sativa\nParent strains: Blue Dream, Bay 11\nWhy it’s underrated: “Bay Dream is an uplifting strain with sharp citrus notes and subtle earthiness. It seems to be overlooked because of its polarizing parent strain, Blue Dream, but in combination with the sweet, skunky flavors and focused headspace of Bay 11 the mix is a pleasant surprise. I appreciate that Bay Dream trades some of Blue Dream’s fruit notes for a deeper, more poignant Kush-like palate of flavors. So, if you’re in the ‘Blue Dream is overrated’ crowd, don’t shy away from Bay Dream—you might be amazed by how much this strain expresses its individuality.” —Will Hyde\n\nSour Urkle\nStrain type: Hybrid\nParent strains: Sour Diesel, Purple Urkle\nWhy it’s underrated: “Sour Urkle is the potent union of pungent, polar opposites. Created from Sour Diesel and Purple Urkle, this funky and surprisingly affordable bud packs the best of both strains into one frosty package. This strain emits an odd floral and chemical aroma that is contrasted against a latent but tangible sweetness brought forth by the fruitiness of Purple Urkle. This flavor profile can be challenging for some, but the effects are undeniably heady while draping the body in a soothing, mellow aura.” —Jeremiah Wilhelm\nPresidential Kush\nStrain type: Indica\nParent strains: Bubble Gum, OG Kush\nWhy it’s underrated: “Easily one of the more picturesque strains I’ve come across, Presidential Kush (also known as Presidential OG) expresses itself with deep green and purple hues. A thick blanket of trichomes adds another dimension to the strain’s aesthetic, but PK is so much more than just a pretty flower. It’s a potent, complex, and flavorful experience that only takes a puff or two before you feel the comforting weight of deep relaxation wash over you. The piney, diesel flavors make it hard to put down, and I still find myself embarking on epic journeys just to track down this beautiful bud. In my opinion, genetics this compelling should be easier to find and should be garnering more attention in the cannabis community, so for that reason, I’d like to encourage more growers to add this strain to their stable, and if you find it at your local dispensary as a consumer, definitely do not overlook it!” —Will Hyde\n\nDurban Poison\nStrain type: Sativa\nParent strains: African\nWhy it’s underrated: “Landrace strains, including Durban Poison, are hard to find and often faked. As such, many people have had a less-enjoyable-than-average experience with a strain they believed, mistakenly, to be the landrace advertised on the packaging. Durban Poison is a fantastic pure sativa that many people, including myself, loved at first smoke, so if Durban Poison didn’t wow you the first time around, give it another chance—that first batch might have been something else that was merely masquerading as this iconic strain.” —Brett Konen\nApple Jack\nStrain type: Hybrid\nParent strains: Jack Herer, White Widow\nWhy it’s underrated: “Apple Jack hasn’t gained much in the way of ratings on Leafly, but that doesn’t mean it’s a dud. It blends two well-known cuts together (Jack Herer x White Widow) to create something greater than the sum of its parts. Apple Jack’s initially clear-headed high relieves stress while elevating the mind and encouraging creativity. The happy effects and accessible THC concentration make it a friendly flower for consumers of all potency levels. And even though its flavor doesn’t always live up the name, Apple Jack’s sweet, earthy terpene profile still offers satisfying flavors alongside a productive buzz.” —Jeremiah Wilhelm\n\nPlushberry\nStrain type: Indica\nParent strains: Black Cherry Soda, Space Queen\nWhy it’s underrated: “Plushberry is an incredible strain that’s underrated simply because it hasn’t appeared to travel beyond the Pacific Northwest. Wrapped in beautiful lavender foliage, it smells like sweet wildflowers and mixed berries, and if you have the chance to try it while you’re in the area, Plushberry is a strain you won’t soon forget.” —Bailey Rahn\nSkunk No. 1\nStrain type: Hybrid\nParent strains: Afghani, Acapulco Gold, Colombian Gold\nWhy it’s underrated: “Even if you don’t love the flavor of the flower itself, you’ve got to respect a strain that’s given us so many of our favorites on the market—I’m talking Green Crack, Island Sweet Skunk, Amnesia, Pineapple Chunk, UK Cheese, and so many more. Skunk No. 1 is a true original among cannabis strains, and while its skunky flavor is an acquired taste, you’re smoking a piece of history with Skunk No. 1—so respect your elders.” —Brett Konen",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/28103218/most-underrated-cannabis-strains.jpg",
            "title": "11 Unsung Cannabis Strains Worth Discovering",
            "urlslug": "/news/strains-products/11-underrated-marijuana-strains"
        }
    ],
    "articlesAvailable": true,
    "category": "Indica",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 46.69287211740041
        },
        {
            "name": "ADD/ADHD",
            "score": 4.580712788259959
        },
        {
            "name": "Bipolar Disorder",
            "score": 4.030398322851153
        },
        {
            "name": "PTSD",
            "score": 3.0765199161425576
        },
        {
            "name": "PMS",
            "score": 2.851153039832285
        }
    ],
    "description": "<p>Plushberry, a cross between&nbsp;<a href=\"http://www.leafly.com/indica/black-cherry-soda\">Black Cherry Soda</a> and <a href=\"http://www.leafly.com/hybrid/space-queen\">Space Queen</a>, is an 80% <a href=\"http://www.leafly.com/indica\">indica</a> strain bred by TGA Seeds. The Black Cherry Soda lends this strain an aromatic <a href=\"http://www.leafly.com/explore/flavors-berry\">berry</a> scent, while the Space Queen genetics promote heavy resin production. Plushberry induces a deep <a href=\"http://www.leafly.com/explore/tags-relaxed\">relaxation</a> in the mind and body, with calming qualities that melt away <a href=\"http://www.leafly.com/explore/symptoms-stress\">stress</a>. There are two main&nbsp;phenotypes of Plushberry: one that grows smaller, pink-tinted plants, and another with bulkier, more indica-like formations. Plushberry flowers in 55 to 65 days with medium to heavy yields.&nbsp;</p>\n",
    "descriptionPlain": "Plushberry, a cross between&nbsp;Black Cherry Soda and Space Queen, is an 80% indica strain bred by TGA Seeds. The Black Cherry Soda lends this strain an aromatic berry scent, while the Space Queen genetics promote heavy resin production. Plushberry induces a deep relaxation in the mind and body, with calming qualities that melt away stress. There are two main&nbsp;phenotypes of Plushberry: one that grows smaller, pink-tinted plants, and another with bulkier, more indica-like formations. Plushberry flowers in 55 to 65 days with medium to heavy yields.&nbsp;\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 109.15618448637315
        },
        {
            "name": "Sleepy",
            "score": 54.62788259958071
        },
        {
            "name": "Tingly",
            "score": 43.22327044025157
        },
        {
            "name": "Happy",
            "score": 23.799790356394126
        },
        {
            "name": "Euphoric",
            "score": 20.241090146750523
        }
    ],
    "flavors": [
        {
            "name": "Berry",
            "score": 85.48218029350105
        },
        {
            "name": "Sweet",
            "score": 43.68448637316561
        },
        {
            "name": "Earthy",
            "score": 7.028301886792453
        },
        {
            "name": "Flowery",
            "score": 5.455974842767295
        },
        {
            "name": "Citrus",
            "score": 2.9297693920335433
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1417271,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I got a decent amount of this from a friend who had decided to grow some Plushberry. It's a cross of Black Cherry Soda and Space Queen, neither of which I've ever tried, but it's a pretty great combination. I was wrecked after a few hits. It has a sort of a fresh violet smell. It's pleasant, but it's not overly sweet like a blueberry strain or a Super Lemon Haze. It has that kind of smell that somebody wouldn't immediately think of marijuana unless they were familiar with it.\n\nThe high was similar to Holy Grail, though, not nearly as intense. I felt like I was floating, and eventually, I lost interest in watching anything or listening to people speak and decided to just listen to instrumental music. This would be a great strain to sit in the backyard and smoke on a cool, overcast day. Definitely one of those strains that would make you appreciate the clouds.\n\nA really great strain, and I wasn't expecting much from it since I hadn't heard too much about it. It deserves more exposure.",
            "username": "108"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1624832,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Where have you been all my life!? What a yummy strain this is. Little buds packed with berry deliciousness! The smell is sweet and fruity and tastes just as good. Within minutes you can feel your body melt its worry’s away. Great evening strain and no anxiety at all! Thank you for your service Plushberry. As you were....",
            "username": "purplturtl"
        }
    ],
    "id": 67663,
    "name": "Plushberry",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 8.68972746331237
        },
        {
            "name": "Dry Eyes",
            "score": 6.488469601677149
        },
        {
            "name": "Paranoid",
            "score": 0.628930817610063
        },
        {
            "name": "Headache",
            "score": 0.4716981132075472
        },
        {
            "name": "Dizzy",
            "score": 0.39308176100628933
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/black-cherry-soda",
            "category": "Hybrid",
            "name": "Black Cherry Soda",
            "permalink": "https://mobileapi.leafly.com/hybrid/black-cherry-soda",
            "slug": "black-cherry-soda",
            "subtitle": null,
            "symbol": "Bcs"
        },
        {
            "applink": "leafly://strain/space-queen",
            "category": "Hybrid",
            "name": "Space Queen",
            "permalink": "https://mobileapi.leafly.com/hybrid/space-queen",
            "slug": "space-queen",
            "subtitle": null,
            "symbol": "Sq"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/indica/plushberry",
    "photoTotalCount": 76,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/indica/plushberry/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/indica/plushberry/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/665579/b/plushberry__primary_dccf.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/plushberry_100x100_08c3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/657172/b/plushberry__primary_7b86.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/plushberry_100x100_3f4f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648591/b/plushberry__primary_2113.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/plushberry_100x100_74e7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639249/b/plushberry__primary_de5f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/plushberry_100x100_3065.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/577570/b/plushberry__primary_6466.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/plushberry_100x100_b930.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/576823/b/plushberry__primary_c062.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/plushberry_100x100_9088.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Portland, OR",
        "Spokane, WA",
        "Lynnwood, WA",
        "Salem, OR",
        "Bellingham, WA",
        "Eugene, OR",
        "Everett, WA",
        "Aberdeen, WA",
        "Bellevue, WA"
    ],
    "rating": 4.29,
    "relatedStrains": [],
    "reviewCount": 272,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "plushberry",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.29044117647059/240",
    "subtitle": null,
    "symbol": "Psh",
    "symptoms": [
        {
            "name": "Stress",
            "score": 18.90461215932914
        },
        {
            "name": "Pain",
            "score": 16.22117400419287
        },
        {
            "name": "Insomnia",
            "score": 13.773584905660378
        },
        {
            "name": "Depression",
            "score": 13.684486373165619
        },
        {
            "name": "Headaches",
            "score": 7.117400419287212
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
