{"sl_translate":"description,descriptionPlain,category","id":272,"slug":"lavender","name":"Lavender","subtitle":null,"symbol":"Lar","category":"Indica","description":"\u003cp\u003eBuilt from strains around the world, Lavender by Soma Seeds has its origins from Super Skunk, Big Skunk Korean and Afghani Hawaiian.\u0026nbsp;This strain, sometimes referred to as Lavender Kush, has dense buds that give off a floral and spicy aroma. It has a dark purple coloration at the ends of its leaves.\u003c/p\u003e\n","descriptionPlain":"Built from strains around the world, Lavender by Soma Seeds has its origins from Super Skunk, Big Skunk Korean and Afghani Hawaiian.\u0026nbsp;This strain, sometimes referred to as Lavender Kush, has dense buds that give off a floral and spicy aroma. It has a dark purple coloration at the ends of its leaves.\n","aka":"Lavender Kush, lavendar","rating":4.15,"highlightedReviews":[{"id":1394079,"username":"Gonff","text":"My first time getting red eyes from MMJ. It wasn\u0027t too bad, but I\u0027ve been vaping for a few months now and this is the first time. \n\nLavender totally took away my chronic back pain and inflammation (ankylosing spondylitis). Works quickly and seems to last. \n\nI was very happy, chatty and giggly. A very pleasant head experience.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"},{"id":1638323,"username":"CannaCasted","text":"I really enjoyed this strain. It wasnt to much...the cerebral experience was easy to navigate the fuzzy body high was a pleasure it slowed you down with out putting you out. For my PTSD symptoms it was right on cue.I recommend this for PTSD patients.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Pl-Y2_w7iIfXMq-susdCw64Abdk=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fZFL3vk8uSMmuki8G4w8c_old-school-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-57756","title":"The 7 Best Strains for High Movie Watching","author":"Hannah Meadows","category":null,"date":"\/Date(1518742834000)\/","text":"Whether you’re getting down with a favorite comedy or tuning in to some classic horror, finding the best cannabis strain to pair with your top flick pick can make or break a movie-watching experience. Strains steeped in creativity tend to highlight subtle messages you wouldn’t notice before a bong hit, while others can ruin a perfectly good film by making those little on-screen nuances glaringly distracting.\n\nTo find the most cerebral strains to pair with your next movie-of-choice, we dove down Leafly’s strain explorer and polished the options to bring you the best strains producing happy, giggly, creative, and focused highs that will complement a trip to the theater or lazy night in. Ditch the scrutiny with these top picks for high move-watching.\nHave a go-to strain you like to pair with your favorite film? Tell us about it in the comments. \nAlice in Wonderland\n\nStrain Type: Sativa\nBest For: Visual documentaries, heady dramas\nAlice in Wonderland is a mostly sativa strain with euphoric cerebral effects. It provides an elevated sensory experience, making it a favorite strain for creative pastimes, outdoor activities, a laid-back weekend, or daytime stress relief. Said to be a descendant of Willy’s Wonder, Alice in Wonderland opens up the mind and relaxes the body. It’s the best match for nature-filled documentaries and heady dramas that require focus with a soft, innovative edge.\nFind Alice in Wonderland Nearby\n\nLemon Larry Lavender\n\nStrain Type: Hybrid\nBest For: Comedies, creative indie films\nLemon Larry Lavender by Big Buddy Seeds is greater than the sum of its parts. The stunningly flavorful cross of Larry OG and Lavender offers sweet citrus aromas overlaid by velvety floral terpenes. Boasting loose sedative effects and an elevated state-of-mind due to a hefty dose of limonene, Lemon Larry Lavender is the perfect pairing with a night of comedy or buzzy indie films.\nFind Lemon Larry Lavender Nearby\nOG LA Affie\n\nStrain Type: Indica\nBest For: Paranormal horror\nOG LA Affie from DNA Genetics is a pure indica variety best known for parenting the famed LA Confidential. The aroma is a subtle blend of earthy and sweet, offering an unusually energetic and psychedelic buzz that holds up against scary movies and horror films. Gather your friends, load up a bowl, and try to keep yourself from hiding under the covers with this bold strain.\nFind OG LA Affie Nearby\n\nChucky’s Bride\n\nStrain Type: Hybrid\nBest For: Educational documentaries\nChucky’s Bride is a cross of Exodus Cheese and Cinderella 99 bred by Eskobar Seeds. This sativa-dominant hybrid gives off an exotic mixture of sharp flavors. Cinderella 99’s tropical aroma of sweet citrus and pineapple blend with the pungent notes of skunky cheese. The unique terpene profile leads a charge of uplifting and creative effects that stimulate the mind with an imaginative punch that’s excellent for educational documentaries. Download something new, invite over your favorite people, and discuss what you learned over a joint or two.\nFind Chucky’s Bride Nearby\nWookie\n\nStrain Type: Hybrid\nBest For: Feel-good movies, creative indie films\nWookie is a tantalizing cross of Lavender and Appalachia supposedly grown by the renowned seed bank Bodhi Seeds. This odoriferous combination blends an intensely floral aroma with sour terpenes, creating a unique fragrance that is sure to fill the room. Lavender’s happy, relaxed effects press firmly up against Appalachia’s dreamy, cerebral effects, making Wookie a whimsical escape from stress and the best choice for a night in front the TV with an original indie film on hand. This tasty strain will make you think outside the box while watching something bright and new.\nFind Wookie Nearby\n\nLaughing Buddha\n\nStrain Type: Sativa\nBest For: Light comedies\nLaughing Buddha is an award-winning sativa (2003 High Times Cannabis Cup) from Barney’s Farm that grows fast and tall. An earthy cross between Thai and Jamaican strains with a sweet, fruity smell that is broken up by hints of spice and provides a rich pungent smoke that will leave consumers feeling happy, upbeat, and giggling. These effects make it a wonderful strain to fill up a joint and press play on a fun comedy or easy, light-hearted TV shows.\nFind Laughing Buddha Nearby\nBig Bull\n\nStrain Type: Indica\nBest For: Unique dramas\nBig Bull by Kannabia Seed Company is a squat indica with award-winning medicinal properties. Winning 2nd Place for Best Indica Seed at the 2012 Treat Yourself Expo in Toronto, Canada, Big Bull (aka Kannabia Special) grows stalky plants with a tantalizing floral aroma. This nearly pure indica offers relaxing effects that are introspective and meditative, which translates to excellent dramas that are both unique and heavy.\nFind Big Bull Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/14132749/best-strains-high-movie-watching.jpg","urlslug":"/news/strains-products/best-strains-for-high-movie-watching"},{"id":"contentitems-40128","title":"Hungover? These Cannabis Strains Can Help","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1514822427000)\/","text":"For most of us in the Western hemisphere, drinking is usually the first step into the wide and varied world of intoxicants. Drinking, like cannabis, can give a person access to a wide range of sensations–but in all fairness, only one of these significantly increases your chance of barfing. And yes, I mean alcohol. Alcohol can be a lot of fun, but one of the primary deterrents for getting lit on liquor or wrecked on red wine (especially after age 30) is the fierce hangover the next day.\nHangovers can feel like a vampire drained your body of all life-giving fluids just before throwing you in front of a speeding city bus. And somehow you miraculously survived.\nEnter cannabis and its soothing cocktail of cannabinoids. These unique chemical compounds can induce pleasurable euphoria while tempering nausea, reducing inflammation, and stimulating appetite. Cannabis is not a silver bullet for removing a hangover, but it’s often a step toward recovery. Cannabis mixed with a good breakfast and the steady intake of water can revive and rejuvenate even the most wretched party monster.\n\nA cannabis oil cartridge and pen battery is my preferred cannabis consumption method following a long night of drinking. This method is convenient for a few reasons:\n\nYou don’t have to get out of bed\nThe potency and variety of cartridges are at my disposal\nNo need for extra steps like lighting a bowl\nThey are generally less harsh (i.e., you’re less likely to cough and exacerbate your current discomfort)\n\nBrowse Cannabis Vape Pens\nGoing a step further, I would recommend a CBD-dominant cartridge with a 1:1 or 3:1 CBD/THC ratio. This mixture of cannabinoids is utilized by cannabis consumers in and outside the medicinal cannabis community for its anti-inflammatory, anti-anxiety, and analgesic (pain reducing) qualities.\nI encourage you to explore and experiment with strains and products that work best for you. Some folks would rather snap off a zippy sativa to front-load their body and mind with energy. Others seek out strains that help dull the pounding headache of a hangover. My point is, there is no one way. Just be sure to supplement all cannabis consumption with plenty of water and food (and maybe a multivitamin after said food) to assist in the recovery process.\n\nExplore your local dispensary beforehand, and who knows, you might find a deal or two that prepares you for a long Saturday or Sunday of post-party recuperation.\nCannabis Strain Recommendations for Alleviating Hangovers\nHigh-CBD Cannabis Strains\n   Harlequin\nOne of the most popular, and thus, readily available CBD-dominant strains in many cannabis markets, Harlequin offers a solid CBD:THC ratio and a gentle, but noticeable mood boost. This strain’s soothing, happy buzz can work wonders after a solid holiday brunch.\nFind Harlequin Nearby\n   Sour Tsunami\nSour Tusnami is another popular CBD strain that can help tone down nausea and temper inflammation. The bouquet can be a little flat, but the overall effects (especially when mixed with food and water) are stunningly apparent and not mentally or physically cumbersome, which some THC-dominant strain can be.\nFind Sour Tsunami Nearby\n   Dancehall\nHangover or no hangover, Dancehall is curently my favorite CBD dominant flower, period. With usually less than 2% THC and upwards of 20% CBD, Dancehall hits all the right notes at the perfect pitch and volume. The terpene profile is surprisingly dank, reeking of skunk and swamp grass, but the flavor is sweet and herbaceous on the tongue. In a pipe, joint, or vaporizer, Dancehall will be your host at the after-after-after party come New Years Day.\nFind Dancehall Nearby\n   Cannatonic\nCannatonic is known for having a 3:1 CBD/THC ratio, which is perfect for consumers looking for a little headiness with their dose of wellness. This strain is also a popular concentrate, giving vapers, dabber, and other high-potency consumers a good option if smoke inhalation is too harsh. But beware of the dreaded dab cough! Uncontrollable post-hit hacking is the absolute worst with a hangover–trust me!\nFind Cannatonic Nearby\nTHC-Dominant Cannabis Strains\n   Lavender\nLavender is a natural choice for this list: 1) it is indica-dominant in effect, 2) its high concentrations of the terpene linalool should help with the discomfort caused by a hangover, 3) Lavender is sedative at a higher dose, but can be quite functional with only a hit or two. This allows consumer modulate their dosage depending on the severity of their hangover.\nFind Lavender Nearby\n   Hindu Kush\nHindu Kush is one of the more mellow options on this list. The goal is to reduce the overall physical discomfort caused by a hangover, and Hindu Kush dulls just about every sense a person could have. This isn’t a one-and-done painkiller, but consumption should lead to some degree of physical and mental relief from a hangover.\nFind Hindu Kush Nearby\n   Jillybean\nJillybean is a joyous strain with delicious flavors that can add a little pep to your step post-NYE. This strain’s sweet citrus flavor and sativa-dominant bent give the consumer a nudge toward alertness and a slight boost of energy.\nFind Jillybean Nearby\n   Chocolope\nChocolope is a spicy, nutty flower with good energy in store. This strain is pungent and invigorating, leaving the consumer with a happy feeling right between the ears. Mood elevation is a great way to stem the down-and-out feeling of a hangover. Chocolope is a great rallying call on New Years Day to bring your fellow hungover party goers out and back to life.\nFind Chocolope Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/29164217/hangover.jpg","urlslug":"/news/strains-products/best-cannabis-strains-for-hangovers"}],"reviewCount":629,"flavors":[{"name":"Lavender","score":71.825276173102267},{"name":"Flowery","score":39.275700145265361},{"name":"Sweet","score":25.828519306780176},{"name":"Earthy","score":23.591263808655114},{"name":"Woody","score":8.2362082362082365}],"effects":[{"name":"Relaxed","score":99.314212357690622},{"name":"Happy","score":77.285395763656638},{"name":"Uplifted","score":52.954292084726859},{"name":"Euphoric","score":47.287253808992944},{"name":"Focused","score":42.609202391811081}],"symptoms":[{"name":"Stress","score":52.21698591263808},{"name":"Pain","score":45.954528563224216},{"name":"Insomnia","score":36.945542380324987},{"name":"Muscle Spasms","score":34.061349278740586},{"name":"Inflammation","score":32.596871727306507}],"conditions":[{"name":"Anxiety","score":32.786054525184959},{"name":"Multiple Sclerosis","score":17.604134995439342},{"name":"PTSD","score":16.259585824803214},{"name":"ADD/ADHD","score":16.029019289888854},{"name":"Migraines","score":15.241039154082632}],"negatives":[{"name":"Dry Eyes","score":25.714502888415929},{"name":"Dry Mouth","score":25.421438464916726},{"name":"Dizzy","score":3.17472382689774},{"name":"Paranoid","score":2.9441572919833789},{"name":"Anxious","score":2.3842099929056451}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/indica/lavender/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/indica/lavender/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lavender_100x100_448d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/598742/b/lavender__primary_3831.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lavender_100x100_b4a7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/556715/b/lavender__primary_c225.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lavender_100x100_6005.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/541808/b/lavender__primary_2be2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lavender_100x100_4a4b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/524176/b/lavender__primary_ee19.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lavender_100x100_a455.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/523409/b/lavender__primary_213d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lavender_100x100_71ef.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/523284/b/lavender__primary_a829.jpg"}],"photoTotalCount":162,"popularCities":["Portland, OR","Seattle, WA","Spokane, WA","Everett, WA","Bellingham, WA","Denver, CO","Los Angeles, CA","Bothell, WA","Eugene, OR","Lynnwood, WA"],"permalink":"https://mobileapi.leafly.com/indica/lavender","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.14785373608903/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Super Skunk","subtitle":null,"slug":"super-skunk","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/super-skunk","symbol":"Ssk","applink":"leafly://strain/super-skunk"},{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"},{"name":"Hawaiian","subtitle":null,"slug":"hawaiian","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/hawaiian","symbol":"Haw","applink":"leafly://strain/hawaiian"},{"name":"South Asian Indica","subtitle":null,"slug":"south-asian","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/south-asian","symbol":"Sai","applink":"leafly://strain/south-asian"}],"growInfo":{"difficulty":"Moderate","preferredMedium":null,"floweringDays":63,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":null,"growNotes":""}}
