{"sl_translate":"description,descriptionPlain,category","id":214135,"slug":"snow-mountain","name":"Snow Mountain","subtitle":null,"symbol":"Smt","category":"Indica","description":"\u003cp\u003eBy combining the flavorful, high-yielding \u003ca href=\"https://www.leafly.com/hybrid/snowcap\"\u003eSnowcap\u003c/a\u003e with \u003ca href=\"https://www.leafly.com/indica/pure-kush\"\u003ePure Kush\u003c/a\u003e and a rare Uzbekistani line, the folks at Snow High Seeds have created a strain that modern Kush lovers are sure to enjoy. Most Snow Mountain \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\"\u003ephenotypes\u003c/a\u003e will be approximately indica-dominant and produce large resinous \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\"\u003ecolas\u003c/a\u003e that exhibit a sweet hashy aroma and \u003ca href=\"https://www.leafly.com/news/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\"\u003etrichome\u003c/a\u003e-stacked sugar leaves that hash makers will covet. \u0026nbsp;The effects are described as strongly body-focused with an uplifting head high. Its THC content is estimated to fall between 20-23%.\u003c/p\u003e\n","descriptionPlain":"By combining the flavorful, high-yielding Snowcap with Pure Kush and a rare Uzbekistani line, the folks at Snow High Seeds have created a strain that modern Kush lovers are sure to enjoy. Most Snow Mountain phenotypes will be approximately indica-dominant and produce large resinous colas that exhibit a sweet hashy aroma and trichome-stacked sugar leaves that hash makers will covet. \u0026nbsp;The effects are described as strongly body-focused with an uplifting head high. Its THC content is estimated to fall between 20-23%.\n","aka":null,"rating":4,"highlightedReviews":[{"id":1397922,"username":"drbud84","text":"Im just trying it for the first time.  It\u0027s got some amazing aromas very vibrant colors and smooth smoke.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1397922,"username":"drbud84","text":"Im just trying it for the first time.  It\u0027s got some amazing aromas very vibrant colors and smooth smoke.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3319","title":"New Strains Alert: Kaleidos Dope, Azure Haze, 24k Gold, Gutbuster, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1458355560000)\/","text":"It\u0027s time to kick off the weekend with some cannabis strains you\u0027ve maybe never tried before. We\u0027ve just added some new varieties to the Leafly Explorer — go check them out and see if any are in stock at a shop near you! Remember to leave a review if you\u0027ve tried any of these so the rest of us know what to expect!\n \n  1. Kaleidos Dope\n\nAnother banger from Snow High Seeds, Kaleidos Dope is a cross of a quick and frosty Sour LSD female with Snow High’s own OG Purple Fire Thai male, creating a delicious, potent, high yielding hybrid that is sure to impress commercial growers and connoisseurs alike. There are several excellent phenotypes to choose from, all exhibiting high THC levels of anywhere from 18-24%. Aromas and flavors include grape bubble gum, strawberry, sweet-and-sour fruit punch, and chem/fuel. Combining a euphoric body high with colorful, trippy visuals, Kaleidos Dope may be too much for the novice consumer.\n\n \n  2. Gutbuster\n\nWashington State breeders Exotic Genetix crossed two of their own strains to create Gutbuster, a 70% indica-dominant hybrid that offers the mellowing effects that indica fans love. Combining the blackberry flavors of Kimbo Kush with the vanilla ice cream and chocolate chip cookie flavors of Cookies and Cream makes Gutbuster a truly memorable strain. THC levels have been recorded as high as 25%.\n\nClick here for a list of locations currently carrying Gutbuster\n \n  3. Azure Haze\n\nLegendary breeder DJ Short is at it again, this time adding his famous Blueberry genetics to the multiple award-winning Bay Area clone Super Silver Haze to create an easy-to-grow hybrid that produces massive yields of elongated, spear-shaped flowers. Those who pay attention to lineage may say, “Wait, isn’t this just Blue Dream?”, but the Azure Haze is fathered by a male that is one step closer to the parental genetics (in this case, an f4 Blueberry) than the Blue Dream father (an f5), thus making it a distinct hybrid. Azure Haze presents a fruity palette of terpenes and an upbeat, long-lasting high that slowly gives way to deep, dreamy relaxation. Its THC content can generally be measured between 18-24%.\n\nClick here for a list of locations currently carrying Azure Haze\n \n  4. Colorado Clementines\n\nNew from La Plata Labs, Colorado Clementines is a 70% indica-dominant hybrid with odor and yields that are off the charts. By combining their own Big White with TGA Genetics’ Agent Orange, La Plata has created an orange-citrus scented monster with yields as high as 1 gram per watt and an odor that ranks at 11 on a 1-to-10 scale of intensity. With a THC content as high as 24%, beginners should take great care not to over imbibe on this potent strain.\n\n \n  5. 24k Gold\n\nAlso known as Kosher Tangie, 24k Gold is a 60% indica-dominant hybrid that combines the legendary LA strain Kosher Kush with champion sativa Tangie to create something quite unique. Growing tall in its vegetative cycle and very stretchy in flower, this one will need an experienced hand when grown indoors. Most phenotypes will exhibit a sweet orange aroma from the Tangie along with the dark coloration of the Kosher Kush, and will offer a strong citrus flavor when smoked or vaped. THC levels range from 18% to 24%; definitely not for novice users!\n\nClick here for a list of locations currently carrying 24k Gold\n \n  6. Snow Mountain\n\nBy combining the flavorful, high-yielding Snowcap with Pure Kush and a rare Uzbekistani line, the folks at Snow High Seeds have created a strain that modern Kush lovers are sure to enjoy. Most Snow Mountain phenotypes will be approximately indica-dominant and produce large resinous colas that exhibit a sweet hashy aroma and trichome-stacked sugar leaves that hash makers will covet. The effects are described as strongly body-focused with an uplifting head high. Its THC content is estimated to fall between 20-23%.\n\nClick here for a list of locations currently carrying Snow Mountain\n \n  7. Vanilluna\n\nWorld renowned Oregon breeder DJ Short used his legendary Blueberry genetics to create this 50/50 hybrid, Vanilluna. By pollinating a sativa-dominant female Blueberry with the original Blueberry indica male, he created a medium-tall, Kush-like plant with short internodal spacing, dark green foliage, and fragrant spade-shaped buds. The terpenes produced by Vanilluna give off subtle, complex aromas of creamy vanilla and honey with undertones of flowers and melon. Its high is very long-lasting, dreamy, and comfortable, especially considering it has THC levels up to 24%.\n\nClick here for a list of locations currently carrying Vanilluna\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/03/12002205/new-strains-alert-kaleidos-dope-azure-haze-24k-gold-gutbuster-and.jpg","urlslug":"/news/strains-products/new-strains-alert-kaleidos-dope-azure-haze-24k-gold-gutbuster-and"}],"reviewCount":1,"flavors":[{"name":"Flowery","score":50}],"effects":[{"name":"Uplifted","score":50},{"name":"Relaxed","score":50}],"symptoms":[],"conditions":[],"negatives":[],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/snow-mountain_100x100_47ef.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/622669/b/snow-mountain__primary_dc4f.jpg"}],"photoTotalCount":1,"popularCities":[],"permalink":"https://mobileapi.leafly.com/indica/snow-mountain","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Snowcap","subtitle":null,"slug":"snowcap","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/snowcap","symbol":"Sno","applink":"leafly://strain/snowcap"},{"name":"Pure Kush","subtitle":null,"slug":"pure-kush","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/pure-kush","symbol":"Pur","applink":"leafly://strain/pure-kush"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
