{"sl_translate":"description,descriptionPlain,category","id":297,"slug":"sweet-diesel","name":"Sweet Diesel","subtitle":null,"symbol":"Sw","category":"Sativa","description":"\u003cp class=\"p1\"\u003eSweet Diesel is an earthy cross between \u003ca href=\"http://www.leafly.com/sativa/sour-diesel\"\u003e\u003cspan class=\"s1\"\u003eSour Diesel\u003c/span\u003e\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/hybrid/og-kush\"\u003e\u003cspan class=\"s1\"\u003eOG Kush\u003c/span\u003e\u003c/a\u003e. Though this sativa is a member of the diesel family, its aroma is much lighter than typical diesels. Featuring a moderate fuel scent and earthy taste, Sweet Diesel is an easy strain for novice consumers. Like a true sativa, this strain provides a strong head-heavy sensation. Felt most in the face and eyes, this strain is great for easing stress and improving focus.\u003c/p\u003e\n","descriptionPlain":"Sweet Diesel is an earthy cross between Sour Diesel and OG Kush. Though this sativa is a member of the diesel family, its aroma is much lighter than typical diesels. Featuring a moderate fuel scent and earthy taste, Sweet Diesel is an easy strain for novice consumers. Like a true sativa, this strain provides a strong head-heavy sensation. Felt most in the face and eyes, this strain is great for easing stress and improving focus.\n","aka":null,"rating":4.13,"highlightedReviews":[{"id":1372854,"username":"mallitia95","text":"One of the nicest sativas ive ever smoked. When I take 1 bong hit of this im already giggly and uplifted. By the time ive taken my fourth im in an almost psychedelic state of mind.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1622283,"username":"WeAreTheWildThings","text":"I have this on Select Strains Elite co2 cartridge.  Taste amazing. Leaning towards the sour diesel flavor for sure. \n\nCurious to those that would know... What\u0027s the difference in Headband, Sour Al and this strain? All three are Sour Diesel x OG Kush strains. I\u0027ve always wondered how you get so many strains from crossing the same two?  Apologies in advance if that sounds like a stupid question.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/HI3k4JEQNcm-UeMtXpulAr7pycY=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2f8vGRAxmRm2hnNDo2K9kP_IMG_20180418_174717115.jpg.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2997","title":"7 Giggly Cannabis Strains for Inducing Laughing Fits","author":"Bailey Rahn","category":null,"date":"\/Date(1451342040000)\/","text":"In your experience, are there any particular cannabis strains that lead to more laughing fits than others? You might already know what your go-to giggly strain is, but we’ve got some recommendations for the next time you need a companion strain to that funny movie, comedy show, or time spent kicking back with friends. With the help of Leafly user-submitted reviews, we uncovered the strains that consumers like yourself rated as most giggly. Here are seven top contenders; you can also browse an expanded list of gut-busting strains in the Explorer.\nBlue Diesel\n \nIntroduced by strong flavors of sour blueberry, Blue Diesel is a hybrid to elevate you to an uplifted and jovial mindset. Its nimble cerebral effects make Blue Diesel a perfect daytime companion strain, and the giddy euphoria is sure to bring on spells of laughter (unfortunately to an exaggerated degree for one Leafly reviewer).\n\n“I laughed so hard that I threw up. And that made me laugh more.”\nLaughing Buddha\n \nLaughing Buddha’s effects can be understood simply by reading its name: a relaxed state of mind gives way to joyful elation. With an earthy and herbal sage aroma, this sativa helps you let go of stress and unlock a more lighthearted outlook on life. This strain is a favorite for weekend nature excursions with friends, or for getting your day started with a smile.\n\n“Made me feel like nothing could annoy me, I just laughed it off! Very giggly, and made me take myself less seriously.”\nChurch OG\n \nA serious name for a not-so-serious strain, Church OG is a heavy indica that’ll knock you into stupefied episodes of laughter (especially if friends are around to trigger it). The OG Kush descendent packs a sleepy punch in large doses, so take this one slowly if bedtime is still far off.\nChemdawg\n \nThe effects produced by Chemdawg’s high THC content can manifest in many ways, one of which is clearly fits of laughter. This one’s a personal favorite of mine for creative collaborations and chilling with close friends, since it lends both social and artistic energy. However, mind the word of caution from the Leafly reviewer below.\n\n“Prepare for laugh attacks and an extremely heavy body and head high. Everything becomes funny as hell and I legit pissed myself while laughing so hard at a Steak and Shake drive-thru.”\nSweet Diesel\n \nWith a champion heritage from OG Kush and Sour Diesel, Sweet Diesel masterfully captures everything we love about sativas: a little boost of wakefulness, creative energy, social engagement, and nonstop giggles.\nBlack Diamond\n \nSometimes the best way to unwind after a long, active week is to sit down with a sedating couch-lock strain and a Netflix comedy marathon. Black Diamond is a perfect match for lazy weekends or long bedrest recoveries that take a toll on your mood.\n\n“One of the main things I noticed when I’m on this is that the smallest things trigger the biggest laughing spell you will ever see in yourself again. I swear I saw the funniest shit ever on it, and it was the first time any strain made me laugh for more than 20 minutes straight.”\nMango Kush\n \nFirst comes that unforgettable mango flavor, and then it’s all giggles. Few strains have more to offer the flavor enthusiast and the social butterfly alike than Mango Kush. Named for its strong fruity mango aroma, this hybrid keeps you chatty and upbeat for social outings or when you’re just kicking it with best friends.\n\n“Two bowls put me and a buddy into a fit of giggles for a good 45 minutes while munching down on a bag of Cheetos. Then we got serious for a bit and had just about the most beautiful in-depth talk ever.”","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12001323/7-giggly-cannabis-strains-for-inducing-laughing-fits.jpg","urlslug":"/news/strains-products/7-giggly-cannabis-strains-for-inducing-laughing-fits"}],"reviewCount":76,"flavors":[{"name":"Sweet","score":74.126213592233015},{"name":"Diesel","score":73.155339805825236},{"name":"Earthy","score":62.184466019417478},{"name":"Pine","score":50.728155339805824},{"name":"Apricot","score":50}],"effects":[{"name":"Happy","score":128.73786407766991},{"name":"Uplifted","score":116.06796116504854},{"name":"Relaxed","score":115.8252427184466},{"name":"Energetic","score":114.12621359223301},{"name":"Euphoric","score":66.310679611650485}],"symptoms":[{"name":"Stress","score":17.28155339805825},{"name":"Pain","score":15.825242718446603},{"name":"Depression","score":14.854368932038835},{"name":"Headaches","score":13.155339805825243},{"name":"Fatigue","score":11.699029126213592}],"conditions":[{"name":"Anxiety","score":25.339805825242717},{"name":"ADD/ADHD","score":13.398058252427184},{"name":"PTSD","score":11.699029126213592},{"name":"Asthma","score":10.242718446601941},{"name":"Arthritis","score":10}],"negatives":[{"name":"Dry Mouth","score":54.368932038834949},{"name":"Headache","score":22.427184466019419},{"name":"Dizzy","score":21.456310679611651},{"name":"Paranoid","score":10.728155339805825},{"name":"Dry Eyes","score":2.6699029126213589}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-diesel_100x100_c03f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/585007/b/sweet-diesel__primary_6aa8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-diesel_100x100_c3f7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/473586/b/sweet-diesel__primary_663e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-diesel_100x100_aa1a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/400092/b/sweet-diesel__primary_833e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-diesel_100x100_cc06.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/399600/b/sweet-diesel__primary_7192.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-diesel_100x100_bc60.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/394098/b/sweet-diesel__primary_a873.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-diesel_100x100_a0c9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/393999/b/sweet-diesel__primary_b765.jpg"}],"photoTotalCount":21,"popularCities":["Portland, OR","Seattle, WA","Beaverton, OR","Denver, CO","Depoe Bay, OR","Eugene, OR","Grants Pass, OR","Lynnwood, WA","Medford, OR","Mukilteo, WA"],"permalink":"https://mobileapi.leafly.com/sativa/sweet-diesel","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.13157894736842/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
