{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1429920000000)/",
            "id": "contentitems-3315",
            "text": "We've got more strains for you to explore this weekend! Not all of them are \"new\" per se (although they may be to you!) — Lashkar Gah is one of the oldest indicas still kicking today, and Jacky White's been around for a decade now. Young or old, all of these strains are in need of some user reviews, so be sure to get on that if you've tried any of these!\n \n   1. Jacky White\n\nJacky White is a 75% sativa strain bred by Paradise Seeds, who crossed the legendary Jack Herer sativa with a resinous White Widow hybrid. She introduces herself with a sweet grapefruit and citrus aroma, which leads the way into Jacky White’s well-balanced head and body effects. Lofty euphoria lifts the mind into an upbeat cerebral space, while the indica in her softens the racy sativa effects with a deep, physical calm. Since her debut in 2005, growers have cherished Jacky White for her hardiness, stability, fast flowering, and plentiful yields.\n\n \n   2. Blue Dynamite\n\nBlue Dynamite, bred by Next Generation Seeds in Canada, is an indica-dominant strain that provides heavy mind and body relaxation alongside a fruity, hashy flavor. This powerhouse indica was bred from a B.C. Grapefruit clone known as Dynamite and an Afghani–Blueberry hybrid called Avalon. Combining the flavorful qualities of Dynamite with the resinous potential Avalon enables, we are left with a potent strain that can budge even the most stubborn cases of pain, nausea, and sleeplessness. High Times recognized Blue Dynamite among its Top 10 Strains of 2007, solidifying a reputation that keeps this strain firmly set in the cannabis market.\n\n \n   3. Canna-Tsu\n\nCanna-Tsu is a hybrid cannabis strain that combines genetics from two CBD-rich parents, Cannatonic and Sour Tsunami. Sweet earthy flavors activate on the exhale, complementing the subtle citrus aroma that radiates from Canna-Tsu’s buds. Because of its high-CBD, low-THC cannabinoid profile, Canna-Tsu delivers its mellow effects with mental clarity. Strains high in CBD like Canna-Tsu are highly demanded by patients treating pain, inflammation, anxiety, and seizures.\n\n \n   4. Lashkar Gah\n\nLashkar Gah is an indica landrace strain named after its geographic origin in south Afghanistan. Like other Afghani indicas, Lashkar Gah is consistent in its delivery of powerful, sedating effects that promote rest and relaxation. Pain, insomnia, and other severe symptoms collapse under the weight of Lashkar Gah’s heavy effects, and a quick examination of its resin-caked buds explains this indica’s potency. Your body may feel pinned down by Lashkar Gah’s euphoric punch, but your mind will likely float away blissfully as the burdens of stress and anxiety dissolve.\n\nAvailable at BotanaCare Medical & Recreational in Northglenn, CO\n \n   5. Blue Magic\n\nBlue Magic is an upbeat sativa-dominant strain bred from the famous Blue Dream. Its high-energy effects are prefaced by creamy, fruity flavors reminiscent of its Blueberry ancestry. Sativa enthusiasts will appreciate the balance of potency and clarity delivered by Blue Magic, whose euphoria offers functionality and focus despite an impressive THC profile. While its initial punch is quick to hit, Blue Magic’s effects taper down gently and ease you into long-lasting relaxation that extends from the physical exterior to the deep recesses of your mind.\n\n \n   6. Birthday Cake Kush\n\nBirthday Cake Kush, or just Birthday Cake, is an indica-dominant hybrid with strong body effects and sweet cake-like flavor. As decadent as its GSC (f.k.a Girl Scout Cookies) and Cherry Pie parent strains, Birthday Cake Kush buds bloom with a crystalline icing of THC-rich resin. Like any dessert, Birthday Cake Kush is the perfect way to end your day, with deeply relaxing effects that soothe the body without sedating the mind. This indica is preferred by patients treating pain, anxiety, appetite loss, inflammation, and headaches.\n\nAvailable at BotanaCare Medical & Recreational in Northglenn, CO\n \n   7. Truth Serum\n\nTruth Serum is a hybrid strain that was originally bred in the Midwest during the summer of 2006. While exploring how to breed feminized seeds, an underground breeder in Minnesota induced stress on a single branch of G13 to create the pollen that fertilized a variety of strains growing in his garden. After narrowing his breeding projects down into two of the more potent and vigorous phenotypes, we are left with the complex combination of G13, Trinity, and Pineapple. The strain quickly made its way to the Northern California coastline where the dense buds now bloom. Truth Serum carries a sweet tropical aroma and is frosted with a thick coat of trichomes. The exhale provides a mouthful of hash-like flavor that ushers in the relaxing effects led by G13’s indica-dominant influence. It should be noted that another strain by the name Truth Serum is bred by Pisces Genetics. Their Truth Serum is a mostly indica hybrid that combines True OG and Death Star genetics.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12002159/new-strains-alert-jacky-white-blue-dynamite-canna-tsu-lashkar-gah.png",
            "title": "New Strains Alert: Jacky White, Blue Dynamite, Canna-Tsu, Lashkar Gah, and More",
            "urlslug": "/news/strains-products/new-strains-alert-jacky-white-blue-dynamite-canna-tsu-lashkar-gah"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Asthma",
            "score": 26.38888888888889
        },
        {
            "name": "Anxiety",
            "score": 14.583333333333332
        },
        {
            "name": "ADD/ADHD",
            "score": 12.5
        },
        {
            "name": "Anorexia",
            "score": 12.5
        },
        {
            "name": "PMS",
            "score": 12.5
        }
    ],
    "description": "<p>Blue Magic is an upbeat <a href=\"http://www.leafly.com/explore/category-sativa\">sativa</a>-dominant strain bred from the famous <a href=\"http://leafly.com/hybrid/blue-dream\">Blue Dream</a>. Its <a href=\"http://www.leafly.com/explore/tags-energetic\">high-energy</a> effects are prefaced by creamy, <a href=\"http://www.leafly.com/explore/flavors-tree-fruit\">fruity</a> flavors reminiscent of its <a href=\"http://leafly.com/indica/blueberry\">Blueberry</a> ancestry. Sativa enthusiasts will appreciate the balance of potency and clarity delivered by Blue Magic, whose <a href=\"http://www.leafly.com/explore/tags-euphoric\">euphoria</a> offers functionality and <a href=\"http://www.leafly.com/explore/tags-focused\">focus</a> despite an impressive THC profile. While its initial punch is quick to hit, Blue Magic&rsquo;s effects taper down gently and ease you into long-lasting <a href=\"http://www.leafly.com/explore/tags-relaxed\">relaxation</a> that extends from the physical exterior to the deep recesses of your mind.</p>\n",
    "descriptionPlain": "Blue Magic is an upbeat sativa-dominant strain bred from the famous Blue Dream. Its high-energy effects are prefaced by creamy, fruity flavors reminiscent of its Blueberry ancestry. Sativa enthusiasts will appreciate the balance of potency and clarity delivered by Blue Magic, whose euphoria offers functionality and focus despite an impressive THC profile. While its initial punch is quick to hit, Blue Magic&rsquo;s effects taper down gently and ease you into long-lasting relaxation that extends from the physical exterior to the deep recesses of your mind.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 56.25
        },
        {
            "name": "Euphoric",
            "score": 34.02777777777778
        },
        {
            "name": "Happy",
            "score": 31.944444444444443
        },
        {
            "name": "Hungry",
            "score": 26.38888888888889
        },
        {
            "name": "Energetic",
            "score": 22.22222222222222
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 28.47222222222222
        },
        {
            "name": "Lemon",
            "score": 27.77777777777778
        },
        {
            "name": "Blueberry",
            "score": 15.277777777777779
        },
        {
            "name": "Tropical",
            "score": 14.583333333333332
        },
        {
            "name": "Lime",
            "score": 13.194444444444445
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1413744,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I had initially purchased this under the impression it was an Indica Hybrid but according to leafly this is a Sativa. No matter, I really did enjoy this one. \n\nI smoked 0.17g out of a pipe. I felt like the herb was slightly moist so this weight may be inflated a bit. \n\nThe taste was distinctly citrusy and sweet. The combusted smoke did smell a bit cheesy and unpleasant (to me) but I noted none of these flavors and the herb itself smells great.\n\nThis got me very stoned but it definitely feels more Sativa ish than anything Indica. While I did feel a body high, I didn't feel lazy or immobile. The head high is also great. You get the heady high and an intense euphoria and sense of happiness a short time after inhaling. I found that I didn't feel the intense euphoria until after I finished the bowl ( and I also smoke slowly). \n\nOverall I really like this one and it makes for a good strain to smoke for making any thing more enjoyable.",
            "username": "InnerVision42"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1551329,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I haven't smoked bud since 2009 so I thought \"oh what the hell,  one more time for old times sake\". Boy let me tell you,  it has been 3 weeks since I bought this potent gem and I STILL can't get more than 2 or 3 tokes before I am just baked to the core. It's a creeping buzz and when it hits it's like a real smooth, warm body high. And then i smelled blueberry muffins for the rest of the night. I know i seriously thought about ordering blueberry muffins from grubhub. This is well worth trying.",
            "username": "Jozett"
        }
    ],
    "id": 154514,
    "name": "Blue Magic",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 26.38888888888889
        },
        {
            "name": "Paranoid",
            "score": 26.38888888888889
        },
        {
            "name": "Dizzy",
            "score": 0.6944444444444444
        },
        {
            "name": "Dry Eyes",
            "score": 0.6944444444444444
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/blue-dream",
            "category": "Hybrid",
            "name": "Blue Dream",
            "permalink": "https://mobileapi.leafly.com/hybrid/blue-dream",
            "slug": "blue-dream",
            "subtitle": null,
            "symbol": "Bd"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/blue-magic",
    "photoTotalCount": 8,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/650443/b/blue-magic__primary_336e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-magic_100x100_e8c7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/543422/b/blue-magic__primary_61ec.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-magic_100x100_237c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/521875/b/blue-magic__primary_ba27.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-magic_100x100_22e2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/518188/b/blue-magic__primary_7c16.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-magic_100x100_e60b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/405613/b/blue-magic__primary_4200.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-magic_100x100_c94a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/384187/b/blue-magic__primary_00c7.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/blue-magic_100x100_d0ed.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Detroit, MI",
        "Las Vegas, NV"
    ],
    "rating": 4.54,
    "relatedStrains": [],
    "reviewCount": 35,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "blue-magic",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.54285714285714/240",
    "subtitle": null,
    "symbol": "Bmc",
    "symptoms": [
        {
            "name": "Pain",
            "score": 26.38888888888889
        },
        {
            "name": "Insomnia",
            "score": 12.5
        },
        {
            "name": "Depression",
            "score": 2.7777777777777777
        },
        {
            "name": "Stress",
            "score": 2.7777777777777777
        },
        {
            "name": "Fatigue",
            "score": 2.083333333333333
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
