{
    "aka": null,
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Hannah Meadows",
            "category": null,
            "date": "/Date(1484171120000)/",
            "id": "contentitems-15444",
            "text": "For every color in the rainbow there is a complementing strain ready to match each individual’s absolute favorite hue. Only drink out of blue cups? Wear a lot of purple?  Refuse to eat something that isn’t orange-tinted? Pair your number one color with a little bit of green! Below we list a strain pairing that goes hand in hand with each letter in ROYGBIV.\nRed\n\nFiery, passionate, sensual – red is a power color that tends to allure the sexes and could possibly give you a promotion. Pair this magnetic color with the “speedy and intense” Panama Red, a full sativa that will match that flash of red lipstick or vibrant watch band.\nOrange\n\nThis warm and fizzy hue can only pair best with a warm and fizzy strain. Enter Orange Crush – its sweet and tangy flavor perfectly complements its twin color.\nYellow\n\nIn the dead of winter, yellow reminisces sunny days and lemonade. Try Lemon Haze to melt the frost – it’s a citrusy sativa whose buds appear green and yellow. The lemony taste will bring back your sunny disposition through these chilly months.\nGreen\n\nWith 2017’s color of the year being “greenery,” the hybrid Green Dream is an excellent addition to any green stash.\nBlue\n\nBlue has always been a fan favorite and possibly the most popular color of the rainbow – it’s calming, tranquil, and makes one think of the sky and the sea. The hybrid ArcticBlue pairs well with this peaceful color and its anti-anxiety effects.\nHonorable mention goes to the hybrid Blue Dream, a strain that has become just as popular as the color itself.\nIndigo\n\nIndigo is the in-between of purple and blue – a deep, gorgeous hue that can only be complemented by the hybrid strain Blurple. It’s the best mix of Blue Dream and Mendocino Purps, just as indigo is the best mix of purple and blue, aka “blurple.”\nViolet\n\nA color that received its name from the violet flower, it’s only logical to pair this beautiful hue with the hybrid strain Violet Delight. It releases a strong floral flavor that will have you dreaming in shades of purple.\nIf your favorite color is outside of the rainbow spectrum, we have a couple of honorary mentions for you to pick up.\n\nPink\n\nThough pink is not technically a color of the rainbow, we couldn’t leave out this bubblegum pop favorite. Pair that Pepto-Bismol toned jacket that’s been collecting dust in your closet with the sweet and fruity indica Pink Berry.\nBlack\n\nFor those who live and breathe in waves of black, don’t pass up the indica Black Domina. It’s a strain designed for late night, so grab your best black pajamas, black slippers, black robe, and pull in this heavy strain deep into the night.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/25130741/rainbow.jpg",
            "title": "Taste the 'Strainbow' With These Colorful Cannabis Pairings",
            "urlslug": "/news/strains-products/rainbow-marijuana-strains"
        },
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1475440520000)/",
            "id": "contentitems-8229",
            "text": "Honey is an amazing substance — it’s a natural sweetener, a super-food with a nearly endless shelf life (if sealed properly), and has outstanding nutritional and medicinal benefits that can even help people adapt to local allergens (not to mention how delicious it is on baklava, peanut butter sandwiches, and in a cup of hot coffee or tea!).\nLeafly is home to over 60 specific strains that exhibit notes of honey. As your strain researcher and a passionate purveyor of fine cannabis, I’ve curated a shortlist of honey-flavored strains that will make your fingers sticky and your taste buds smile. Enjoy!\n   Panama Red\nPanama Red is best described as an old-school cannabis classic. Originating from Panama, this pure sativa rose to stardom in the late 1960’s thanks to its typical sativa effects: speedy and intense, bordering on psychedelic. As cannabis cultivation matured, Panama Red, which has a lengthy flowering time of at least 11 weeks, was left behind for faster growing strains and increased profits. However, those who fondly recall days of its prominence love its smooth medicating experience and loftily contemplate its revival. If you can get your hands on this sentimental throwback, do not hesitate to groove down memory lane and enjoy the ride.\n   Chocolate Thunder\nWhen you combine the sweet cocoa flavor of Chocolope with the strength and potency of Alaskan Thunder Fuck, you get none other than Chocolate Thunder. This clear-headed, active sativa may be all you need to inspire creativity or promote concentration, and patients will appreciate its ability to dull symptoms without fogging mental faculties. True to its name, Chocolate Thunder has a subtle sweet, earthy aroma similar to that of chocolate.\n   Thor’s Hammer\nThor’s Hammer by SnowHigh Seeds is an uplifting sativa strain that combines genetics from Vortex, Cinderella 99, and Acapulco Gold. Like a bolt of lightning commanded by the Norse god himself, Thor’s Hammer delivers an electrifying blast of cerebral energy that awakens creativity and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush fatigue and depression like the giants of Jotunheimr will likely find Thor’s Hammer to be the perfect weapon. You may also find a genetic variant of Thor’s Hammer from Alaska that instead combines God Bud and Sour Diesel in a more balanced indica-sativa hybrid cross.\n   Honey Banana\nHoney Bananas from Elemental Seeds is a heavy-handed hybrid strain bred from Strawberry Banana and Honey Boo Boo. This cannabis strain earns its name with a resinous coat as sticky as honey and an unmistakable banana aroma. She leans heavily toward the indica side of the family, providing weighty full-body effects coupled with an invigorating buzz of cerebral euphoria.\n   Lodi Dodi\nLodi Dodi is a sativa-dominant hybrid popular in Washington State. Exclusively bred by The Clone Zone, the genetic heritage of Lodi Dodi is undefined and closely guarded. Lodi Dodi carries a sweet, unique flavor of tropical fruit and fresh wildflowers. The pungent aroma leads the way towards a cerebral buzz, known to spark creativity and a boost of energy that will turn any task into a more enjoyable adventure.\n   Nebula\nThe Nebula marijuana strain was bred by Paradise Seeds in 1996. Its name means “Starcloud” and it has been known to “twinkle” with THC coating, with a head and body buzz described as intense and almost psychedelic. The buds have been known to smell and taste like honey, and flowering time is a minimum of 9 weeks. Nebula has won many awards, including 3rd place in the sativa category at the High Times Cannabis Cup in 1999 and 2nd place in 2005. It also took 3rd place at the Highlife Cup in 2004 in the Hydro category, and 1st place at the Copa La Bella Flor Spain in 2005.\n   Fortune Cookies\nFortune Cookies is a hybrid cannabis strain that combines the famed genetics of GSC (f.k.a Girl Scout Cookies) and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in GSC (f.k.a Girl Scout Cookies), but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty “couch-lock” effects typically associated with indica strains.\n   BC Sweet Tooth\nDeveloped in British Columbia by BC Bud Depot, BC Sweet tooth is an indica-dominant hybrid known for its quick flowering time and candy taste.  A hardy plant, this strain can be grown outdoors where it can flower in under 7 weeks, but it prefers the indoors where it may flower as soon as 6 weeks. The result of a cross with earlier generations of BC Sweet Tooth and classic Sweet Tooth, these sugary flowers are sure to satisfy your craving. The crystalline buds have a strong, sweet smell with a hint of citrus, and consumers report that this treat satisfies with a long-lasting, potent feeling that hits fast.\n   Danky Doodle\nOriginally named Double D as a reference to the large buds on these plants (we’ll let you make the connection there), breeder KC Brains decided to rename the strain Danky Doodle at the suggestion of some American friends in order to avoid confusion with the similarly named Double Dutch. Danky Doodle certainly isn’t a shy plant; it grows like the weed it is and will make its presence known with its pungent sweet smell. Plants flower at 9 to 11 weeks and should provide a high yield of large buds covered in a rich frost. This plant is a cross between several strains, and it’s no surprise that Big Bud is included in its lineage along with the strains Viking and the breeder’s own KC 636. The result is a strong indica that provides full body relief no matter what you call it.\n   Cream Caramel\nCream Caramel, named after its sweet caramel aroma, is a 90% indica cross between BlueBlack, Maple Leaf Indica, and White Rhino. Covered in a sugary coat of THC-rich resin, Cream Caramel delivers heavy, relaxing indica effects that soothe the mind and body. Though originally bred by Sweet Seeds in Spain, Royal Queen Seeds have also championed their own rendition called Royal Caramel. Early October is the finish line for outdoor Cream Caramel flowers, while indoor gardens should be harvested after a 7 to 8 week flowering period.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/02131126/cannabis-strains-that-taste-like-honey.jpg",
            "title": "Try These Cannabis Strains That Are as Sweet as Honey",
            "urlslug": "/news/strains-products/cannabis-strains-that-taste-like-honey"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Arthritis",
            "score": 16.278386321132782
        },
        {
            "name": "Crohn's Disease",
            "score": 10.126903553299492
        },
        {
            "name": "PTSD",
            "score": 9.92519369489714
        },
        {
            "name": "Anxiety",
            "score": 6.946299759551161
        },
        {
            "name": "ADD/ADHD",
            "score": 6.78600053433075
        }
    ],
    "description": "<p>Panama Red is best described as an old-school cannabis classic. Originating from Panama, this pure sativa rose to stardom in the late 1960&rsquo;s thanks to its typical sativa effects: speedy and intense, bordering on psychedelic. As cannabis cultivation matured, Panama Red, which has a lengthy flowering time of at least 11 weeks, was left behind for faster growing strains and increased profits. However, those who fondly recall days of its prominence love its smooth medicating experience and loftily contemplate its revival. If you can get your hands on this sentimental throwback, do not hesitate to groove down memory lane and enjoy the ride.</p>\n",
    "descriptionPlain": "Panama Red is best described as an old-school cannabis classic. Originating from Panama, this pure sativa rose to stardom in the late 1960&rsquo;s thanks to its typical sativa effects: speedy and intense, bordering on psychedelic. As cannabis cultivation matured, Panama Red, which has a lengthy flowering time of at least 11 weeks, was left behind for faster growing strains and increased profits. However, those who fondly recall days of its prominence love its smooth medicating experience and loftily contemplate its revival. If you can get your hands on this sentimental throwback, do not hesitate to groove down memory lane and enjoy the ride.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 90.0440822869356
        },
        {
            "name": "Uplifted",
            "score": 80.39139727491317
        },
        {
            "name": "Aroused",
            "score": 56.65909698103126
        },
        {
            "name": "Energetic",
            "score": 45.00133582687683
        },
        {
            "name": "Creative",
            "score": 43.35158963398343
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 50.81351856799358
        },
        {
            "name": "Pungent",
            "score": 41.142131979695435
        },
        {
            "name": "Citrus",
            "score": 16.278386321132782
        },
        {
            "name": "Spicy/Herbal",
            "score": 16.024579214533798
        },
        {
            "name": "Tea",
            "score": 13.519903820464869
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1417908,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "where to begin? my father told me growing up in the 60's PR was the best grass you could get. flash forward to today and i came across it at a shop, and had to try what my father called the best. as a 10 year smoker of modern strains, i didnt expect the high that came. stoney, talkative, relaxing, i would say this is what weed is about, your cartoony like high. ill say this, my understanding of the 1960's has drastically changed today. ",
            "username": "ced5788"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1634862,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Panama Red is a euphoric experience which will leave you anywhere between laughing hysterically at your film of choice and contemplating life from the most metaphysical plane you've ever been on. Having been a smoker for some years, this is hands down one of my favourite sativas so far. Whereas some can (often pleasingly) come on with a full-hitting head-dizzying high, Panama Red leaves plenty of space for your own personal thought and leaves a deep-seated feeling of happiness and incredibly enhanced perceptive ability. A rare sunny day here in the UK morphed into an endless parade of sunshine and beautiful landscapes. I would definitely, without a doubt, recommend this strain. The only negative is that for those used to super intense highs which prevent you from functioning, this might a little outside the norm. You can 100% get to work/get out and about/focus through this weed, ften feeling fantastic about doing so!",
            "username": "TheHolyDolphin94"
        }
    ],
    "id": 1633,
    "name": "Panama Red",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 31.828746994389526
        },
        {
            "name": "Dry Eyes",
            "score": 15.550360673256746
        },
        {
            "name": "Anxious",
            "score": 10.634517766497462
        },
        {
            "name": "Dizzy",
            "score": 3.012289607266898
        },
        {
            "name": "Headache",
            "score": 1.2690355329949239
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/central-american",
            "category": "Sativa",
            "name": "Central American",
            "permalink": "https://mobileapi.leafly.com/sativa/central-american",
            "slug": "central-american",
            "subtitle": null,
            "symbol": "Cam"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/panama-red",
    "photoTotalCount": 35,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/634317/b/panama-red__primary_0d77.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/panama-red_100x100_b54f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/533081/b/panama-red__primary_7f05.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/panama-red_100x100_c1f9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/523032/b/panama-red__primary_5f1f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/panama-red_100x100_c05b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/518957/b/panama-red__primary_b2ee.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/panama-red_100x100_27f6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/508794/b/panama-red__primary_451d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/panama-red_100x100_74cc.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/494923/b/panama-red__primary_c373.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/panama-red_100x100_4910.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Seattle, WA",
        "Spokane Valley, WA",
        "Spokane, WA",
        "Airway Heights, WA",
        "Corvallis, OR",
        "Eugene, OR",
        "Everett, WA",
        "Merlin, OR",
        "Newport, OR"
    ],
    "rating": 4.33,
    "relatedStrains": [],
    "reviewCount": 152,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "panama-red",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.32894736842105/240",
    "subtitle": null,
    "symbol": "Pam",
    "symptoms": [
        {
            "name": "Fatigue",
            "score": 20.559711461394603
        },
        {
            "name": "Stress",
            "score": 19.83168581351857
        },
        {
            "name": "Pain",
            "score": 15.423457119957254
        },
        {
            "name": "Nausea",
            "score": 14.281325140261822
        },
        {
            "name": "Depression",
            "score": 12.970878974084957
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
