{"sl_translate":"description,descriptionPlain,category","id":138,"slug":"lamb-s-bread","name":"Lamb\u0027s Bread","subtitle":null,"symbol":"Lb","category":"Sativa","description":"\u003cp\u003eAlso called \u0026quot;Lamb\u0026#39;s Breath,\u0026quot; Lamb\u0026#39;s Bread is\u0026nbsp;a bright green and sticky \u003ca href=\"http://leafly.com/sativa\"\u003esativa\u003c/a\u003e strain. The effects have been known to give mass amounts of energy and positive introspection. Stress subsides quickly from the Lamb\u0026#39;s Bread buzz, which\u0026nbsp;can help\u0026nbsp;ease depression. The origins of this plant comes from Jamaica and it has been reported that even Bob Marley himself has encountered this wonderful slice of cannabis genealogy.\u003c/p\u003e\n","descriptionPlain":"Also called \u0026quot;Lamb\u0026#39;s Breath,\u0026quot; Lamb\u0026#39;s Bread is\u0026nbsp;a bright green and sticky sativa strain. The effects have been known to give mass amounts of energy and positive introspection. Stress subsides quickly from the Lamb\u0026#39;s Bread buzz, which\u0026nbsp;can help\u0026nbsp;ease depression. The origins of this plant comes from Jamaica and it has been reported that even Bob Marley himself has encountered this wonderful slice of cannabis genealogy.\n","aka":"lambs bread, lambsbread, lambs breath, Lambsbreath","rating":4.4,"highlightedReviews":[{"id":1417778,"username":"Fritz06","text":"I just tried this strain last night it was just wonderful. I was a little worried as I prefer just Indica strains but this was heavenly it calms me down and made me happy and giddy I just loved it.  There was no jitters no panicky feelings, I have severe PTSD and chronic panic attacks and anxiety this is just what I needed even if it\u0027s just at the end of the day or the beginning of the morning. although I do recommend a Indica for the bedtime... but for those of you are struggling with severe chronic panic and stress please give this a try you will not be letdown.😌","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1642254,"username":"heattwave","text":"Great daytime weed. Stay active at the pool or be creative with music. Bob Marley approved. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59696","title":"6 International Cannabis Strains Worth Seeking Abroad","author":"David Bienenstock","category":null,"date":"\/Date(1520360124000)\/","text":"Updated 3/9/18\n“Travel is like cannabis; it broadens your perspectives…personally, culturally, and politically,” according to bestselling guidebook author and acclaimed PBS host Rick Steves. “Suddenly, the palette with which we paint the story of our lives has more colors.”\nFor a cannabis enthusiast, this idea of expanding our palettes rings especially true, because even in our current heady era of rapidly advancing legalization, many of the world’s finest and most exotic cannabis strains can only be found in their regions of origin. So if we think of each varietal of the plant as its own unique hue, then we must travel widely to truly experience the species in all its technicolored glory.\n\nMuch as your local liquor store carries wine and beer from around the world, we should be able to sample the finest cannabis available anywhere without leaving home. Another way to look at this is as an opportunity to get out and do some exploring.\nAs a longtime cannabis journalist, I’ve had the good fortune to travel widely in parts of the world where the love of this plant flourishes, and I can report back that each place comes complete with a particular cannabis strain that’s a point of local pride. Some among the finest I’ve ever sampled.\nSo what are we waiting for?\n\nCannatonic\nOrigin: Barcelona, Spain\nMuch like the coffeeshops in the Netherlands, the cannabis social clubs that have cropped up in Barcelona and elsewhere in Spain over the last decade aren’t really legal, they’re just tolerated—for the most part. Clubs have been busted by the authorities in the past, and the Spanish legal system is still grappling with how to enforce (or not) a set of cannabis laws that allow for “personal” consumption in a “private” setting, without ever defining those terms.\n\nThe city itself, of course, is one of the world’s ideal places to be stoned. Tapas is the ultimate stoner cuisine, and Gaudi is the best architect ever when you’re high. The most popular local strain when I was there some years ago was Jack Herer, an Dutch-bred varietal that most assuredly flourishes beneath a Spanish sun. But to experience a truly homegrown phenomenon, take the time to track down Cannatonic, a high-CBD strain bred by Spanish seed bank Resin Seeds.\nWith THC rarely above 7% and CBD potentially above 15%, it’s a cross of MK Ultra and G13 Haze with a “slight earthy odor and a mild, sweet, vaguely citrusy flavor.” While not providing much of a high due to its elevated CBD profile, the strain offers profound therapeutic relief for pain, inflammation, and anxiety. It’s the perfect way to unwind after a long hot day wandering La Rambla.\n\nDr. Grinspoon\nOrigin: Amsterdam, Netherlands\nAs a travel destination, Amsterdam offers up many charms, from the picturesque canals and lively nightlife to the parks and museums and a place called Febo, where you can buy deep fried cheese out of a coin-operated automat in the middle of the night. The city’s also been a refuge for cannabis consumers and cannabis itself for decades.\nNot only have Amsterdam’s famed coffeeshops attracted visitors from around the world since they opened in the 1970s, they’ve also served as a safe haven for cannabis strains from every continent to escape prohibition.\nIf you’re fortunate enough to make a visit, definitely sample some Neville’s Haze or any of its Haze cousins, and don’t miss out on the wide array of imported, traditionally made hashishes available from Morocco, Nepal, Afghanistan, and other distant lands. But if I had to recommend just one smoke in town, I’d say make an appointment with Dr. Grinspoon, a pure sativa heirloom strain bred by Barney’s Farm, a cannabis seed bank associated with one of Amsterdam’s top coffeeshops.\n\nLike all purebred sativas, the strain (named for medical cannabis advocate Dr. Lester Grinspoon) takes a long time to harvest and doesn’t yield very well—but who cares? You’re not growing it, you’re smoking it. And the soaring, cerebral, invigorating high will set you off on an adventure to remember (or forget) in one of the world’s most beautiful cities.\n\nLamb’s Bread\nOrigin: Jamaica\nJamaica has long been associated with ganja, a local word for cannabis that derives from an ancient Sanskrit word that reached the Caribbean in the mid 1800s, brought along by indentured servants freshly arrived from India. In time ganja spread to native born Jamaicans. In particular, the Indians’ use of cannabis as a spiritual sacrament would be adopted by Jamaica’s Rastafarian community.\nAdd in the global impact of reggae music, and the indelible idea of Jamaica as a cannabis paradise took root in the public’s imagination. Even though, until recently, cannabis remained highly illegal and the laws against it seriously enforced.\n\nHappily, however, that all began to change in 2015, when a new law decriminalized up to two ounces of cannabis and made personal grows legal.\nSo how best to celebrate if you happen to be lucky enough to make a pilgrimage? Well, nothing could be more appropriate than rolling up a joint of Lamb’s Bread—the definitive Jamaican cannabis strain, and purportedly Bob Marley’s favorite throughout his life. A bright, green, sticky heirloom sativa, it’s an uplifting, inspiring, energizing high that pairs nicely with a cup of local Blue Mountain coffee if you really want to get your day started right.\nMalawi Gold\nOrigin: Malawi\nRevered as a food, fiber, and medicine, cannabis flourished throughout Malawi until 1964, when the newly independent republic joined the United Nations and adopted the UN’s Single Convention on Narcotic Drugs.\n\nFifty years of mandated federal enforcement later, what the locals call chumba, and the world calls Malawi Gold, remains a vital cash crop throughout the impoverished African nation, but growers now plant their seeds in remote mountain clearings, hoping to elude the authorities. According to a 2011 report from the World Bank, Malawian farmers harvest around 150,000 pounds of remarkably potent cannabis in this manner every year, the vast majority bound for Europe. The plant remains illicit to this day, but there’s a strong movement in Malawi to legalize both cannabis and hemp.\nFamous throughout Africa for its potency, Malawi Gold is a pure sativa strain that’s slow to mature, with a flowering time of up to 120 days before it’s ready to harvest. But it’s worth the wait to smoke the long, resin-coated buds that have made the strain famous far beyond Malawi’s borders.\n\n\nCheese\nOrigin: United Kingdom\nBritain’s cannabis scene isn’t well known for producing high quality cannabis or award-winning strains, with one notable exception. An indica-dominant hybrid named for its sharply sour aroma, Cheese has been the herbal pride of the United Kingdom since the late 1980s. Local legend has it the original Cheese (sometimes called Original Cheese) descended from a Skunk #1 phenotype that was selected for future breeding based on its incredibly pungent aroma.\n\nThe most popular modern version comes from Big Buddha Seeds, and features the same pungent funky aroma plus the addition of Afghani indica genetics to increase trichome production and yield. Big Buddha’s version put Cheese on the global map when it took home top honors in the Sativa category at the 2006 Cannabis Cup and has been spreading out geographically ever since.\nBut it’s still best enjoyed at home, in Merry Old England, paired with a cup of Earl Grey and some tasty crumpets.\nIsland Sweet Skunk\nOrigin: Vancouver Island\nBritish Columbia—Canada’s westernmost province—stretches from the ocean to the Rocky Mountains. The region became a hotbed for cannabis cultivation starting back in the 1960s, when the ranks of the area’s homegrown farmers were swelled by the arrival of draft resisters from the US who began fleeing to Canada to avoid service in the Vietnam War. With Vancouver eventually earning the nickname Vansterdam for its tolerance of cannabis coffeeshops, and the entire province boasting vast stretches of remote land in which to grow cannabis, a culture of tolerance and acceptance took hold in BC even in the darkest days of Canada’s cannabis prohibition.\nAnd now that it’s set to be legalized nationwide this summer (with the recreational market functional by late summer/early fall), British Columbia will remain the ultimate Canadian cannabis travel destination, a place of natural beauty and vibrant culture. Island Sweet Skunk was originally bred on Vancouver Island, a 290-mile long, largely undeveloped stretch of coastlines and mountains just off the Pacific coast. A sativa with an electric buzz and a flavor profile that mixes classic skunky notes with ripe grapefruit undertones, the strain is a descendant of Skunk #1 and grows tall, straight, high-yielding plants.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/05153822/6-international-strains-abroad.jpg","urlslug":"/news/strains-products/6-international-cannabis-strains-worth-seeking-abroad"},{"id":"contentitems-3001","title":"7 Jamaican Cannabis Strains to Try in Honor of Bob Marley\u0027s Birthday","author":"Will Hyde","category":null,"date":"\/Date(1486400400000)\/","text":"Today we honor the birthday of Robert Nesta Marley. The Reggae legend, better known as Bob, would have turned 72 today. To celebrate the man who spent so much of his life singing the songs of universal peace, love and, of course, cannabis, we give you seven strains that were influenced by him and his home island of Jamaica.\n1. Jamaican\n\n \n \n \n \nThe Jamaican strain refers to the indigenous varieties of cannabis (or landraces) that grow natively in this region of the world. Because of Jamaica’s latitude and climate, these varieties tend to be sativa in structure and effect.\n2. Lamb’s Bread\n\n \n \n \n \nAlso called “Lamb’s Breath,” Lamb’s Bread is a bright green and sticky sativa strain. The effects have been known to give mass amounts of energy and positive introspection. Stress subsides quickly from the Lamb’s Bread buzz, which can help ease depression. The origins of this plant comes from Jamaica and it has been reported that even Bob Marley himself has encountered this wonderful slice of cannabis genealogy.\n3. Jamaican Pearl\n\n \n \n \n \nJamaican Pearl is a sweetly potent outdoor sativa strain from Dutch breeder Sensi Seeds whose presence will bring a taste of the Caribbean to cannabis consumers. Jamaica is home to sativas of astounding quality and potency, selectively bred for countless generations. This strain, a genetic cross between Marley’s Collie and Early Pearl, provides a nice breezy cerebral sensation with tropical flavors.\n4. King’s Bread\n\n \n \n \n \nSaid to be a sativa landrace from the Blue Mountains of Jamaica, King’s Bread (or King’s Breath) delivers mellowing and euphoric cerebral effects. Finger-like bulbs reach out from the citrus-scented buds wrapped in crystal trichomes. Lamb’s Bread is counted among its progeny, although King’s Bread’s lineage is not well documented. Pain relief, appetite stimulation, and stress alleviation are just a few of the therapeutic benefits King’s Bread has to offer.\n5. Jamaican Dream\n\n \n \n \n \nJamaican Dream is a 90% sativa bred by Eva Seeds using Jamaican genetics. A subtle and sweet flavor carries you through to an elevated mood and weightless euphoria. The effects are light enough to start your day with, making this strain ideal for early treatment of depression and fatigue. Jamaican Dream’s pointed, compact buds will finish their flowering cycle after 42 to 45 days indoors, or at the end of September in outdoor gardens.\n6. Marley’s Collie\n\n \n \n \n \nMarley’s Collie is an indica-dominant hybrid bred by Sensi Seeds that won the Dutch High Life Cup in 1999. These sticky, spiky buds offer a pungent sweet aroma with musky Afghani undertones, delivering effects that are strong in both physical and cerebral sensation. Indoor and outdoor grows can expect flowers between 60 and 65 days.\n7. Jamaican Lion\n\n \n \n \n \nJamaican Lion is a high-CBD sativa strain with mildly psychoactive effects that stimulate creativity and focus without the loss of functionality. Its rich genetic background combines Mountain Lion — a Rockbud and Lionheart cross — with a Jamaican sativa known as Yarders. Shadrock, Jamaican Lion’s creator, first brought the strain to California in 2007, where it was distributed to patients by Harborside. Ushered in by a sweet herbal aroma, Jamaican Lion induces mild psychoactivity that carries through despite its low THC content. Sensory perception sharpens as bad moods dull in clear-headed sensations that can be described as simultaneously uplifting and calming. Few strains compare to Jamaican Lion as it eases pain, anxiety, and inflammation without intoxication or mental cloudiness. Its CBD content is highest around week 9 of flowering, but if you’re looking for more of a 1:1 ratio of CBD and THC, Shadrock recommends harvesting at week 8 instead.\nHave you tried any of these Jamaican strains? If so, leave your review on the strain’s detail page. If these don’t sound like your kind of cannabis, use the Leafly Explorer to find the strain with the flavors and effects you are looking. Happy Birthday Bob! Stir it up!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/02/12001330/7-jamaican-strains-to-try-in-honor-of-bob-marleys-birthday.jpg","urlslug":"/news/strains-products/7-jamaican-strains-to-try-in-honor-of-bob-marleys-birthday"}],"reviewCount":717,"flavors":[{"name":"Earthy","score":39.98686663277411},{"name":"Woody","score":27.492374173868836},{"name":"Spicy/Herbal","score":23.984494153533298},{"name":"Citrus","score":12.289866124385696},{"name":"Nutty","score":12.289866124385696}],"effects":[{"name":"Happy","score":81.7467378410439},{"name":"Uplifted","score":64.09888154550076},{"name":"Energetic","score":53.570157600406709},{"name":"Euphoric","score":50.67996949669547},{"name":"Creative","score":50.41518386714116}],"symptoms":[{"name":"Stress","score":45.536773428232507},{"name":"Depression","score":34.113285883748517},{"name":"Fatigue","score":18.322741908151162},{"name":"Pain","score":18.290967632604644},{"name":"Headaches","score":14.876292153872225}],"conditions":[{"name":"Anxiety","score":46.016353160481273},{"name":"PTSD","score":20.380443992543636},{"name":"Migraines","score":13.654041687849515},{"name":"ADD/ADHD","score":12.166158278257923},{"name":"Bipolar Disorder","score":8.4782240298254532}],"negatives":[{"name":"Dry Mouth","score":26.947127605490593},{"name":"Dry Eyes","score":11.090069479749195},{"name":"Paranoid","score":6.96153194373835},{"name":"Anxious","score":6.2476698864599216},{"name":"Headache","score":1.635316048127436}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_58c8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003236/b/lamb-s-bread__primary_72da.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_151c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002972/b/lamb-s-bread__primary_a83d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_f14c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/669962/b/lamb-s-bread__primary_9739.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_9050.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648876/b/lamb-s-bread__primary_4965.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_3cd1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648397/b/lamb-s-bread__primary_809b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_b981.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/647865/b/lamb-s-bread__primary_b411.jpg"}],"photoTotalCount":109,"popularCities":["Los Angeles, CA","Portland, OR","San Francisco, CA","Seattle, WA","Toronto, ON","Ottawa, ON","Medford, OR","Denver, CO","San Diego, CA","Santa Ana, CA"],"permalink":"https://mobileapi.leafly.com/sativa/lamb-s-bread","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.4044630404463/240","testGraph":"https://leafly.s3.amazonaws.com/strains/testing/HwQvDQKxRw6lr4MCZgoL_lambsbread.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"Jamaican","subtitle":null,"slug":"jamaican","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jamaican","symbol":"Jam","applink":"leafly://strain/jamaican"}],"growInfo":{"difficulty":"Moderate ","preferredMedium":null,"floweringDays":65,"outdoorFinish":null,"height":"Medium","averageYield":"Medium","environment":null,"growNotes":"\n\tRequires a dry outdoor climate\n\tBest results when plants are grown large and not confined to pots\n\tFour phenotypes, three of which typically express sativa influence while the fourth exhibits more indica-like characteristics\n\n"}}
{"sl_translate":"description,descriptionPlain,category","id":138,"slug":"lamb-s-bread","name":"Lamb\u0027s Bread","subtitle":null,"symbol":"Lb","category":"Sativa","description":"\u003cp\u003eAlso called \u0026quot;Lamb\u0026#39;s Breath,\u0026quot; Lamb\u0026#39;s Bread is\u0026nbsp;a bright green and sticky \u003ca href=\"http://leafly.com/sativa\"\u003esativa\u003c/a\u003e strain. The effects have been known to give mass amounts of energy and positive introspection. Stress subsides quickly from the Lamb\u0026#39;s Bread buzz, which\u0026nbsp;can help\u0026nbsp;ease depression. The origins of this plant comes from Jamaica and it has been reported that even Bob Marley himself has encountered this wonderful slice of cannabis genealogy.\u003c/p\u003e\n","descriptionPlain":"Also called \u0026quot;Lamb\u0026#39;s Breath,\u0026quot; Lamb\u0026#39;s Bread is\u0026nbsp;a bright green and sticky sativa strain. The effects have been known to give mass amounts of energy and positive introspection. Stress subsides quickly from the Lamb\u0026#39;s Bread buzz, which\u0026nbsp;can help\u0026nbsp;ease depression. The origins of this plant comes from Jamaica and it has been reported that even Bob Marley himself has encountered this wonderful slice of cannabis genealogy.\n","aka":"lambs bread, lambsbread, lambs breath, Lambsbreath","rating":4.4,"highlightedReviews":[{"id":1417778,"username":"Fritz06","text":"I just tried this strain last night it was just wonderful. I was a little worried as I prefer just Indica strains but this was heavenly it calms me down and made me happy and giddy I just loved it.  There was no jitters no panicky feelings, I have severe PTSD and chronic panic attacks and anxiety this is just what I needed even if it\u0027s just at the end of the day or the beginning of the morning. although I do recommend a Indica for the bedtime... but for those of you are struggling with severe chronic panic and stress please give this a try you will not be letdown.😌","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1642254,"username":"heattwave","text":"Great daytime weed. Stay active at the pool or be creative with music. Bob Marley approved. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59696","title":"6 International Cannabis Strains Worth Seeking Abroad","author":"David Bienenstock","category":null,"date":"\/Date(1520360124000)\/","text":"Updated 3/9/18\n“Travel is like cannabis; it broadens your perspectives…personally, culturally, and politically,” according to bestselling guidebook author and acclaimed PBS host Rick Steves. “Suddenly, the palette with which we paint the story of our lives has more colors.”\nFor a cannabis enthusiast, this idea of expanding our palettes rings especially true, because even in our current heady era of rapidly advancing legalization, many of the world’s finest and most exotic cannabis strains can only be found in their regions of origin. So if we think of each varietal of the plant as its own unique hue, then we must travel widely to truly experience the species in all its technicolored glory.\n\nMuch as your local liquor store carries wine and beer from around the world, we should be able to sample the finest cannabis available anywhere without leaving home. Another way to look at this is as an opportunity to get out and do some exploring.\nAs a longtime cannabis journalist, I’ve had the good fortune to travel widely in parts of the world where the love of this plant flourishes, and I can report back that each place comes complete with a particular cannabis strain that’s a point of local pride. Some among the finest I’ve ever sampled.\nSo what are we waiting for?\n\nCannatonic\nOrigin: Barcelona, Spain\nMuch like the coffeeshops in the Netherlands, the cannabis social clubs that have cropped up in Barcelona and elsewhere in Spain over the last decade aren’t really legal, they’re just tolerated—for the most part. Clubs have been busted by the authorities in the past, and the Spanish legal system is still grappling with how to enforce (or not) a set of cannabis laws that allow for “personal” consumption in a “private” setting, without ever defining those terms.\n\nThe city itself, of course, is one of the world’s ideal places to be stoned. Tapas is the ultimate stoner cuisine, and Gaudi is the best architect ever when you’re high. The most popular local strain when I was there some years ago was Jack Herer, an Dutch-bred varietal that most assuredly flourishes beneath a Spanish sun. But to experience a truly homegrown phenomenon, take the time to track down Cannatonic, a high-CBD strain bred by Spanish seed bank Resin Seeds.\nWith THC rarely above 7% and CBD potentially above 15%, it’s a cross of MK Ultra and G13 Haze with a “slight earthy odor and a mild, sweet, vaguely citrusy flavor.” While not providing much of a high due to its elevated CBD profile, the strain offers profound therapeutic relief for pain, inflammation, and anxiety. It’s the perfect way to unwind after a long hot day wandering La Rambla.\n\nDr. Grinspoon\nOrigin: Amsterdam, Netherlands\nAs a travel destination, Amsterdam offers up many charms, from the picturesque canals and lively nightlife to the parks and museums and a place called Febo, where you can buy deep fried cheese out of a coin-operated automat in the middle of the night. The city’s also been a refuge for cannabis consumers and cannabis itself for decades.\nNot only have Amsterdam’s famed coffeeshops attracted visitors from around the world since they opened in the 1970s, they’ve also served as a safe haven for cannabis strains from every continent to escape prohibition.\nIf you’re fortunate enough to make a visit, definitely sample some Neville’s Haze or any of its Haze cousins, and don’t miss out on the wide array of imported, traditionally made hashishes available from Morocco, Nepal, Afghanistan, and other distant lands. But if I had to recommend just one smoke in town, I’d say make an appointment with Dr. Grinspoon, a pure sativa heirloom strain bred by Barney’s Farm, a cannabis seed bank associated with one of Amsterdam’s top coffeeshops.\n\nLike all purebred sativas, the strain (named for medical cannabis advocate Dr. Lester Grinspoon) takes a long time to harvest and doesn’t yield very well—but who cares? You’re not growing it, you’re smoking it. And the soaring, cerebral, invigorating high will set you off on an adventure to remember (or forget) in one of the world’s most beautiful cities.\n\nLamb’s Bread\nOrigin: Jamaica\nJamaica has long been associated with ganja, a local word for cannabis that derives from an ancient Sanskrit word that reached the Caribbean in the mid 1800s, brought along by indentured servants freshly arrived from India. In time ganja spread to native born Jamaicans. In particular, the Indians’ use of cannabis as a spiritual sacrament would be adopted by Jamaica’s Rastafarian community.\nAdd in the global impact of reggae music, and the indelible idea of Jamaica as a cannabis paradise took root in the public’s imagination. Even though, until recently, cannabis remained highly illegal and the laws against it seriously enforced.\n\nHappily, however, that all began to change in 2015, when a new law decriminalized up to two ounces of cannabis and made personal grows legal.\nSo how best to celebrate if you happen to be lucky enough to make a pilgrimage? Well, nothing could be more appropriate than rolling up a joint of Lamb’s Bread—the definitive Jamaican cannabis strain, and purportedly Bob Marley’s favorite throughout his life. A bright, green, sticky heirloom sativa, it’s an uplifting, inspiring, energizing high that pairs nicely with a cup of local Blue Mountain coffee if you really want to get your day started right.\nMalawi Gold\nOrigin: Malawi\nRevered as a food, fiber, and medicine, cannabis flourished throughout Malawi until 1964, when the newly independent republic joined the United Nations and adopted the UN’s Single Convention on Narcotic Drugs.\n\nFifty years of mandated federal enforcement later, what the locals call chumba, and the world calls Malawi Gold, remains a vital cash crop throughout the impoverished African nation, but growers now plant their seeds in remote mountain clearings, hoping to elude the authorities. According to a 2011 report from the World Bank, Malawian farmers harvest around 150,000 pounds of remarkably potent cannabis in this manner every year, the vast majority bound for Europe. The plant remains illicit to this day, but there’s a strong movement in Malawi to legalize both cannabis and hemp.\nFamous throughout Africa for its potency, Malawi Gold is a pure sativa strain that’s slow to mature, with a flowering time of up to 120 days before it’s ready to harvest. But it’s worth the wait to smoke the long, resin-coated buds that have made the strain famous far beyond Malawi’s borders.\n\n\nCheese\nOrigin: United Kingdom\nBritain’s cannabis scene isn’t well known for producing high quality cannabis or award-winning strains, with one notable exception. An indica-dominant hybrid named for its sharply sour aroma, Cheese has been the herbal pride of the United Kingdom since the late 1980s. Local legend has it the original Cheese (sometimes called Original Cheese) descended from a Skunk #1 phenotype that was selected for future breeding based on its incredibly pungent aroma.\n\nThe most popular modern version comes from Big Buddha Seeds, and features the same pungent funky aroma plus the addition of Afghani indica genetics to increase trichome production and yield. Big Buddha’s version put Cheese on the global map when it took home top honors in the Sativa category at the 2006 Cannabis Cup and has been spreading out geographically ever since.\nBut it’s still best enjoyed at home, in Merry Old England, paired with a cup of Earl Grey and some tasty crumpets.\nIsland Sweet Skunk\nOrigin: Vancouver Island\nBritish Columbia—Canada’s westernmost province—stretches from the ocean to the Rocky Mountains. The region became a hotbed for cannabis cultivation starting back in the 1960s, when the ranks of the area’s homegrown farmers were swelled by the arrival of draft resisters from the US who began fleeing to Canada to avoid service in the Vietnam War. With Vancouver eventually earning the nickname Vansterdam for its tolerance of cannabis coffeeshops, and the entire province boasting vast stretches of remote land in which to grow cannabis, a culture of tolerance and acceptance took hold in BC even in the darkest days of Canada’s cannabis prohibition.\nAnd now that it’s set to be legalized nationwide this summer (with the recreational market functional by late summer/early fall), British Columbia will remain the ultimate Canadian cannabis travel destination, a place of natural beauty and vibrant culture. Island Sweet Skunk was originally bred on Vancouver Island, a 290-mile long, largely undeveloped stretch of coastlines and mountains just off the Pacific coast. A sativa with an electric buzz and a flavor profile that mixes classic skunky notes with ripe grapefruit undertones, the strain is a descendant of Skunk #1 and grows tall, straight, high-yielding plants.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/05153822/6-international-strains-abroad.jpg","urlslug":"/news/strains-products/6-international-cannabis-strains-worth-seeking-abroad"},{"id":"contentitems-3001","title":"7 Jamaican Cannabis Strains to Try in Honor of Bob Marley\u0027s Birthday","author":"Will Hyde","category":null,"date":"\/Date(1486400400000)\/","text":"Today we honor the birthday of Robert Nesta Marley. The Reggae legend, better known as Bob, would have turned 72 today. To celebrate the man who spent so much of his life singing the songs of universal peace, love and, of course, cannabis, we give you seven strains that were influenced by him and his home island of Jamaica.\n1. Jamaican\n\n \n \n \n \nThe Jamaican strain refers to the indigenous varieties of cannabis (or landraces) that grow natively in this region of the world. Because of Jamaica’s latitude and climate, these varieties tend to be sativa in structure and effect.\n2. Lamb’s Bread\n\n \n \n \n \nAlso called “Lamb’s Breath,” Lamb’s Bread is a bright green and sticky sativa strain. The effects have been known to give mass amounts of energy and positive introspection. Stress subsides quickly from the Lamb’s Bread buzz, which can help ease depression. The origins of this plant comes from Jamaica and it has been reported that even Bob Marley himself has encountered this wonderful slice of cannabis genealogy.\n3. Jamaican Pearl\n\n \n \n \n \nJamaican Pearl is a sweetly potent outdoor sativa strain from Dutch breeder Sensi Seeds whose presence will bring a taste of the Caribbean to cannabis consumers. Jamaica is home to sativas of astounding quality and potency, selectively bred for countless generations. This strain, a genetic cross between Marley’s Collie and Early Pearl, provides a nice breezy cerebral sensation with tropical flavors.\n4. King’s Bread\n\n \n \n \n \nSaid to be a sativa landrace from the Blue Mountains of Jamaica, King’s Bread (or King’s Breath) delivers mellowing and euphoric cerebral effects. Finger-like bulbs reach out from the citrus-scented buds wrapped in crystal trichomes. Lamb’s Bread is counted among its progeny, although King’s Bread’s lineage is not well documented. Pain relief, appetite stimulation, and stress alleviation are just a few of the therapeutic benefits King’s Bread has to offer.\n5. Jamaican Dream\n\n \n \n \n \nJamaican Dream is a 90% sativa bred by Eva Seeds using Jamaican genetics. A subtle and sweet flavor carries you through to an elevated mood and weightless euphoria. The effects are light enough to start your day with, making this strain ideal for early treatment of depression and fatigue. Jamaican Dream’s pointed, compact buds will finish their flowering cycle after 42 to 45 days indoors, or at the end of September in outdoor gardens.\n6. Marley’s Collie\n\n \n \n \n \nMarley’s Collie is an indica-dominant hybrid bred by Sensi Seeds that won the Dutch High Life Cup in 1999. These sticky, spiky buds offer a pungent sweet aroma with musky Afghani undertones, delivering effects that are strong in both physical and cerebral sensation. Indoor and outdoor grows can expect flowers between 60 and 65 days.\n7. Jamaican Lion\n\n \n \n \n \nJamaican Lion is a high-CBD sativa strain with mildly psychoactive effects that stimulate creativity and focus without the loss of functionality. Its rich genetic background combines Mountain Lion — a Rockbud and Lionheart cross — with a Jamaican sativa known as Yarders. Shadrock, Jamaican Lion’s creator, first brought the strain to California in 2007, where it was distributed to patients by Harborside. Ushered in by a sweet herbal aroma, Jamaican Lion induces mild psychoactivity that carries through despite its low THC content. Sensory perception sharpens as bad moods dull in clear-headed sensations that can be described as simultaneously uplifting and calming. Few strains compare to Jamaican Lion as it eases pain, anxiety, and inflammation without intoxication or mental cloudiness. Its CBD content is highest around week 9 of flowering, but if you’re looking for more of a 1:1 ratio of CBD and THC, Shadrock recommends harvesting at week 8 instead.\nHave you tried any of these Jamaican strains? If so, leave your review on the strain’s detail page. If these don’t sound like your kind of cannabis, use the Leafly Explorer to find the strain with the flavors and effects you are looking. Happy Birthday Bob! Stir it up!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/02/12001330/7-jamaican-strains-to-try-in-honor-of-bob-marleys-birthday.jpg","urlslug":"/news/strains-products/7-jamaican-strains-to-try-in-honor-of-bob-marleys-birthday"}],"reviewCount":717,"flavors":[{"name":"Earthy","score":39.98686663277411},{"name":"Woody","score":27.492374173868836},{"name":"Spicy/Herbal","score":23.984494153533298},{"name":"Citrus","score":12.289866124385696},{"name":"Nutty","score":12.289866124385696}],"effects":[{"name":"Happy","score":81.7467378410439},{"name":"Uplifted","score":64.09888154550076},{"name":"Energetic","score":53.570157600406709},{"name":"Euphoric","score":50.67996949669547},{"name":"Creative","score":50.41518386714116}],"symptoms":[{"name":"Stress","score":45.536773428232507},{"name":"Depression","score":34.113285883748517},{"name":"Fatigue","score":18.322741908151162},{"name":"Pain","score":18.290967632604644},{"name":"Headaches","score":14.876292153872225}],"conditions":[{"name":"Anxiety","score":46.016353160481273},{"name":"PTSD","score":20.380443992543636},{"name":"Migraines","score":13.654041687849515},{"name":"ADD/ADHD","score":12.166158278257923},{"name":"Bipolar Disorder","score":8.4782240298254532}],"negatives":[{"name":"Dry Mouth","score":26.947127605490593},{"name":"Dry Eyes","score":11.090069479749195},{"name":"Paranoid","score":6.96153194373835},{"name":"Anxious","score":6.2476698864599216},{"name":"Headache","score":1.635316048127436}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_58c8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003236/b/lamb-s-bread__primary_72da.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_151c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002972/b/lamb-s-bread__primary_a83d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_f14c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/669962/b/lamb-s-bread__primary_9739.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_9050.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648876/b/lamb-s-bread__primary_4965.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_3cd1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648397/b/lamb-s-bread__primary_809b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_b981.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/647865/b/lamb-s-bread__primary_b411.jpg"}],"photoTotalCount":109,"popularCities":["Los Angeles, CA","Portland, OR","San Francisco, CA","Seattle, WA","Toronto, ON","Ottawa, ON","Medford, OR","Denver, CO","San Diego, CA","Santa Ana, CA"],"permalink":"https://mobileapi.leafly.com/sativa/lamb-s-bread","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.4044630404463/240","testGraph":"https://leafly.s3.amazonaws.com/strains/testing/HwQvDQKxRw6lr4MCZgoL_lambsbread.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"Jamaican","subtitle":null,"slug":"jamaican","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jamaican","symbol":"Jam","applink":"leafly://strain/jamaican"}],"growInfo":{"difficulty":"Moderate ","preferredMedium":null,"floweringDays":65,"outdoorFinish":null,"height":"Medium","averageYield":"Medium","environment":null,"growNotes":"\n\tRequires a dry outdoor climate\n\tBest results when plants are grown large and not confined to pots\n\tFour phenotypes, three of which typically express sativa influence while the fourth exhibits more indica-like characteristics\n\n"}}
{"sl_translate":"description,descriptionPlain,category","id":138,"slug":"lamb-s-bread","name":"Lamb\u0027s Bread","subtitle":null,"symbol":"Lb","category":"Sativa","description":"\u003cp\u003eAlso called \u0026quot;Lamb\u0026#39;s Breath,\u0026quot; Lamb\u0026#39;s Bread is\u0026nbsp;a bright green and sticky \u003ca href=\"http://leafly.com/sativa\"\u003esativa\u003c/a\u003e strain. The effects have been known to give mass amounts of energy and positive introspection. Stress subsides quickly from the Lamb\u0026#39;s Bread buzz, which\u0026nbsp;can help\u0026nbsp;ease depression. The origins of this plant comes from Jamaica and it has been reported that even Bob Marley himself has encountered this wonderful slice of cannabis genealogy.\u003c/p\u003e\n","descriptionPlain":"Also called \u0026quot;Lamb\u0026#39;s Breath,\u0026quot; Lamb\u0026#39;s Bread is\u0026nbsp;a bright green and sticky sativa strain. The effects have been known to give mass amounts of energy and positive introspection. Stress subsides quickly from the Lamb\u0026#39;s Bread buzz, which\u0026nbsp;can help\u0026nbsp;ease depression. The origins of this plant comes from Jamaica and it has been reported that even Bob Marley himself has encountered this wonderful slice of cannabis genealogy.\n","aka":"lambs bread, lambsbread, lambs breath, Lambsbreath","rating":4.4,"highlightedReviews":[{"id":1417778,"username":"Fritz06","text":"I just tried this strain last night it was just wonderful. I was a little worried as I prefer just Indica strains but this was heavenly it calms me down and made me happy and giddy I just loved it.  There was no jitters no panicky feelings, I have severe PTSD and chronic panic attacks and anxiety this is just what I needed even if it\u0027s just at the end of the day or the beginning of the morning. although I do recommend a Indica for the bedtime... but for those of you are struggling with severe chronic panic and stress please give this a try you will not be letdown.😌","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1642254,"username":"heattwave","text":"Great daytime weed. Stay active at the pool or be creative with music. Bob Marley approved. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59696","title":"6 International Cannabis Strains Worth Seeking Abroad","author":"David Bienenstock","category":null,"date":"\/Date(1520360124000)\/","text":"Updated 3/9/18\n“Travel is like cannabis; it broadens your perspectives…personally, culturally, and politically,” according to bestselling guidebook author and acclaimed PBS host Rick Steves. “Suddenly, the palette with which we paint the story of our lives has more colors.”\nFor a cannabis enthusiast, this idea of expanding our palettes rings especially true, because even in our current heady era of rapidly advancing legalization, many of the world’s finest and most exotic cannabis strains can only be found in their regions of origin. So if we think of each varietal of the plant as its own unique hue, then we must travel widely to truly experience the species in all its technicolored glory.\n\nMuch as your local liquor store carries wine and beer from around the world, we should be able to sample the finest cannabis available anywhere without leaving home. Another way to look at this is as an opportunity to get out and do some exploring.\nAs a longtime cannabis journalist, I’ve had the good fortune to travel widely in parts of the world where the love of this plant flourishes, and I can report back that each place comes complete with a particular cannabis strain that’s a point of local pride. Some among the finest I’ve ever sampled.\nSo what are we waiting for?\n\nCannatonic\nOrigin: Barcelona, Spain\nMuch like the coffeeshops in the Netherlands, the cannabis social clubs that have cropped up in Barcelona and elsewhere in Spain over the last decade aren’t really legal, they’re just tolerated—for the most part. Clubs have been busted by the authorities in the past, and the Spanish legal system is still grappling with how to enforce (or not) a set of cannabis laws that allow for “personal” consumption in a “private” setting, without ever defining those terms.\n\nThe city itself, of course, is one of the world’s ideal places to be stoned. Tapas is the ultimate stoner cuisine, and Gaudi is the best architect ever when you’re high. The most popular local strain when I was there some years ago was Jack Herer, an Dutch-bred varietal that most assuredly flourishes beneath a Spanish sun. But to experience a truly homegrown phenomenon, take the time to track down Cannatonic, a high-CBD strain bred by Spanish seed bank Resin Seeds.\nWith THC rarely above 7% and CBD potentially above 15%, it’s a cross of MK Ultra and G13 Haze with a “slight earthy odor and a mild, sweet, vaguely citrusy flavor.” While not providing much of a high due to its elevated CBD profile, the strain offers profound therapeutic relief for pain, inflammation, and anxiety. It’s the perfect way to unwind after a long hot day wandering La Rambla.\n\nDr. Grinspoon\nOrigin: Amsterdam, Netherlands\nAs a travel destination, Amsterdam offers up many charms, from the picturesque canals and lively nightlife to the parks and museums and a place called Febo, where you can buy deep fried cheese out of a coin-operated automat in the middle of the night. The city’s also been a refuge for cannabis consumers and cannabis itself for decades.\nNot only have Amsterdam’s famed coffeeshops attracted visitors from around the world since they opened in the 1970s, they’ve also served as a safe haven for cannabis strains from every continent to escape prohibition.\nIf you’re fortunate enough to make a visit, definitely sample some Neville’s Haze or any of its Haze cousins, and don’t miss out on the wide array of imported, traditionally made hashishes available from Morocco, Nepal, Afghanistan, and other distant lands. But if I had to recommend just one smoke in town, I’d say make an appointment with Dr. Grinspoon, a pure sativa heirloom strain bred by Barney’s Farm, a cannabis seed bank associated with one of Amsterdam’s top coffeeshops.\n\nLike all purebred sativas, the strain (named for medical cannabis advocate Dr. Lester Grinspoon) takes a long time to harvest and doesn’t yield very well—but who cares? You’re not growing it, you’re smoking it. And the soaring, cerebral, invigorating high will set you off on an adventure to remember (or forget) in one of the world’s most beautiful cities.\n\nLamb’s Bread\nOrigin: Jamaica\nJamaica has long been associated with ganja, a local word for cannabis that derives from an ancient Sanskrit word that reached the Caribbean in the mid 1800s, brought along by indentured servants freshly arrived from India. In time ganja spread to native born Jamaicans. In particular, the Indians’ use of cannabis as a spiritual sacrament would be adopted by Jamaica’s Rastafarian community.\nAdd in the global impact of reggae music, and the indelible idea of Jamaica as a cannabis paradise took root in the public’s imagination. Even though, until recently, cannabis remained highly illegal and the laws against it seriously enforced.\n\nHappily, however, that all began to change in 2015, when a new law decriminalized up to two ounces of cannabis and made personal grows legal.\nSo how best to celebrate if you happen to be lucky enough to make a pilgrimage? Well, nothing could be more appropriate than rolling up a joint of Lamb’s Bread—the definitive Jamaican cannabis strain, and purportedly Bob Marley’s favorite throughout his life. A bright, green, sticky heirloom sativa, it’s an uplifting, inspiring, energizing high that pairs nicely with a cup of local Blue Mountain coffee if you really want to get your day started right.\nMalawi Gold\nOrigin: Malawi\nRevered as a food, fiber, and medicine, cannabis flourished throughout Malawi until 1964, when the newly independent republic joined the United Nations and adopted the UN’s Single Convention on Narcotic Drugs.\n\nFifty years of mandated federal enforcement later, what the locals call chumba, and the world calls Malawi Gold, remains a vital cash crop throughout the impoverished African nation, but growers now plant their seeds in remote mountain clearings, hoping to elude the authorities. According to a 2011 report from the World Bank, Malawian farmers harvest around 150,000 pounds of remarkably potent cannabis in this manner every year, the vast majority bound for Europe. The plant remains illicit to this day, but there’s a strong movement in Malawi to legalize both cannabis and hemp.\nFamous throughout Africa for its potency, Malawi Gold is a pure sativa strain that’s slow to mature, with a flowering time of up to 120 days before it’s ready to harvest. But it’s worth the wait to smoke the long, resin-coated buds that have made the strain famous far beyond Malawi’s borders.\n\n\nCheese\nOrigin: United Kingdom\nBritain’s cannabis scene isn’t well known for producing high quality cannabis or award-winning strains, with one notable exception. An indica-dominant hybrid named for its sharply sour aroma, Cheese has been the herbal pride of the United Kingdom since the late 1980s. Local legend has it the original Cheese (sometimes called Original Cheese) descended from a Skunk #1 phenotype that was selected for future breeding based on its incredibly pungent aroma.\n\nThe most popular modern version comes from Big Buddha Seeds, and features the same pungent funky aroma plus the addition of Afghani indica genetics to increase trichome production and yield. Big Buddha’s version put Cheese on the global map when it took home top honors in the Sativa category at the 2006 Cannabis Cup and has been spreading out geographically ever since.\nBut it’s still best enjoyed at home, in Merry Old England, paired with a cup of Earl Grey and some tasty crumpets.\nIsland Sweet Skunk\nOrigin: Vancouver Island\nBritish Columbia—Canada’s westernmost province—stretches from the ocean to the Rocky Mountains. The region became a hotbed for cannabis cultivation starting back in the 1960s, when the ranks of the area’s homegrown farmers were swelled by the arrival of draft resisters from the US who began fleeing to Canada to avoid service in the Vietnam War. With Vancouver eventually earning the nickname Vansterdam for its tolerance of cannabis coffeeshops, and the entire province boasting vast stretches of remote land in which to grow cannabis, a culture of tolerance and acceptance took hold in BC even in the darkest days of Canada’s cannabis prohibition.\nAnd now that it’s set to be legalized nationwide this summer (with the recreational market functional by late summer/early fall), British Columbia will remain the ultimate Canadian cannabis travel destination, a place of natural beauty and vibrant culture. Island Sweet Skunk was originally bred on Vancouver Island, a 290-mile long, largely undeveloped stretch of coastlines and mountains just off the Pacific coast. A sativa with an electric buzz and a flavor profile that mixes classic skunky notes with ripe grapefruit undertones, the strain is a descendant of Skunk #1 and grows tall, straight, high-yielding plants.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/05153822/6-international-strains-abroad.jpg","urlslug":"/news/strains-products/6-international-cannabis-strains-worth-seeking-abroad"},{"id":"contentitems-3001","title":"7 Jamaican Cannabis Strains to Try in Honor of Bob Marley\u0027s Birthday","author":"Will Hyde","category":null,"date":"\/Date(1486400400000)\/","text":"Today we honor the birthday of Robert Nesta Marley. The Reggae legend, better known as Bob, would have turned 72 today. To celebrate the man who spent so much of his life singing the songs of universal peace, love and, of course, cannabis, we give you seven strains that were influenced by him and his home island of Jamaica.\n1. Jamaican\n\n \n \n \n \nThe Jamaican strain refers to the indigenous varieties of cannabis (or landraces) that grow natively in this region of the world. Because of Jamaica’s latitude and climate, these varieties tend to be sativa in structure and effect.\n2. Lamb’s Bread\n\n \n \n \n \nAlso called “Lamb’s Breath,” Lamb’s Bread is a bright green and sticky sativa strain. The effects have been known to give mass amounts of energy and positive introspection. Stress subsides quickly from the Lamb’s Bread buzz, which can help ease depression. The origins of this plant comes from Jamaica and it has been reported that even Bob Marley himself has encountered this wonderful slice of cannabis genealogy.\n3. Jamaican Pearl\n\n \n \n \n \nJamaican Pearl is a sweetly potent outdoor sativa strain from Dutch breeder Sensi Seeds whose presence will bring a taste of the Caribbean to cannabis consumers. Jamaica is home to sativas of astounding quality and potency, selectively bred for countless generations. This strain, a genetic cross between Marley’s Collie and Early Pearl, provides a nice breezy cerebral sensation with tropical flavors.\n4. King’s Bread\n\n \n \n \n \nSaid to be a sativa landrace from the Blue Mountains of Jamaica, King’s Bread (or King’s Breath) delivers mellowing and euphoric cerebral effects. Finger-like bulbs reach out from the citrus-scented buds wrapped in crystal trichomes. Lamb’s Bread is counted among its progeny, although King’s Bread’s lineage is not well documented. Pain relief, appetite stimulation, and stress alleviation are just a few of the therapeutic benefits King’s Bread has to offer.\n5. Jamaican Dream\n\n \n \n \n \nJamaican Dream is a 90% sativa bred by Eva Seeds using Jamaican genetics. A subtle and sweet flavor carries you through to an elevated mood and weightless euphoria. The effects are light enough to start your day with, making this strain ideal for early treatment of depression and fatigue. Jamaican Dream’s pointed, compact buds will finish their flowering cycle after 42 to 45 days indoors, or at the end of September in outdoor gardens.\n6. Marley’s Collie\n\n \n \n \n \nMarley’s Collie is an indica-dominant hybrid bred by Sensi Seeds that won the Dutch High Life Cup in 1999. These sticky, spiky buds offer a pungent sweet aroma with musky Afghani undertones, delivering effects that are strong in both physical and cerebral sensation. Indoor and outdoor grows can expect flowers between 60 and 65 days.\n7. Jamaican Lion\n\n \n \n \n \nJamaican Lion is a high-CBD sativa strain with mildly psychoactive effects that stimulate creativity and focus without the loss of functionality. Its rich genetic background combines Mountain Lion — a Rockbud and Lionheart cross — with a Jamaican sativa known as Yarders. Shadrock, Jamaican Lion’s creator, first brought the strain to California in 2007, where it was distributed to patients by Harborside. Ushered in by a sweet herbal aroma, Jamaican Lion induces mild psychoactivity that carries through despite its low THC content. Sensory perception sharpens as bad moods dull in clear-headed sensations that can be described as simultaneously uplifting and calming. Few strains compare to Jamaican Lion as it eases pain, anxiety, and inflammation without intoxication or mental cloudiness. Its CBD content is highest around week 9 of flowering, but if you’re looking for more of a 1:1 ratio of CBD and THC, Shadrock recommends harvesting at week 8 instead.\nHave you tried any of these Jamaican strains? If so, leave your review on the strain’s detail page. If these don’t sound like your kind of cannabis, use the Leafly Explorer to find the strain with the flavors and effects you are looking. Happy Birthday Bob! Stir it up!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/02/12001330/7-jamaican-strains-to-try-in-honor-of-bob-marleys-birthday.jpg","urlslug":"/news/strains-products/7-jamaican-strains-to-try-in-honor-of-bob-marleys-birthday"}],"reviewCount":717,"flavors":[{"name":"Earthy","score":39.98686663277411},{"name":"Woody","score":27.492374173868836},{"name":"Spicy/Herbal","score":23.984494153533298},{"name":"Citrus","score":12.289866124385696},{"name":"Nutty","score":12.289866124385696}],"effects":[{"name":"Happy","score":81.7467378410439},{"name":"Uplifted","score":64.09888154550076},{"name":"Energetic","score":53.570157600406709},{"name":"Euphoric","score":50.67996949669547},{"name":"Creative","score":50.41518386714116}],"symptoms":[{"name":"Stress","score":45.536773428232507},{"name":"Depression","score":34.113285883748517},{"name":"Fatigue","score":18.322741908151162},{"name":"Pain","score":18.290967632604644},{"name":"Headaches","score":14.876292153872225}],"conditions":[{"name":"Anxiety","score":46.016353160481273},{"name":"PTSD","score":20.380443992543636},{"name":"Migraines","score":13.654041687849515},{"name":"ADD/ADHD","score":12.166158278257923},{"name":"Bipolar Disorder","score":8.4782240298254532}],"negatives":[{"name":"Dry Mouth","score":26.947127605490593},{"name":"Dry Eyes","score":11.090069479749195},{"name":"Paranoid","score":6.96153194373835},{"name":"Anxious","score":6.2476698864599216},{"name":"Headache","score":1.635316048127436}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_58c8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003236/b/lamb-s-bread__primary_72da.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_151c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002972/b/lamb-s-bread__primary_a83d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_f14c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/669962/b/lamb-s-bread__primary_9739.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_9050.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648876/b/lamb-s-bread__primary_4965.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_3cd1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648397/b/lamb-s-bread__primary_809b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/lamb-s-bread_100x100_b981.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/647865/b/lamb-s-bread__primary_b411.jpg"}],"photoTotalCount":109,"popularCities":["Los Angeles, CA","Portland, OR","San Francisco, CA","Seattle, WA","Toronto, ON","Ottawa, ON","Medford, OR","Denver, CO","San Diego, CA","Santa Ana, CA"],"permalink":"https://mobileapi.leafly.com/sativa/lamb-s-bread","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.4044630404463/240","testGraph":"https://leafly.s3.amazonaws.com/strains/testing/HwQvDQKxRw6lr4MCZgoL_lambsbread.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"Jamaican","subtitle":null,"slug":"jamaican","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jamaican","symbol":"Jam","applink":"leafly://strain/jamaican"}],"growInfo":{"difficulty":"Moderate ","preferredMedium":null,"floweringDays":65,"outdoorFinish":null,"height":"Medium","averageYield":"Medium","environment":null,"growNotes":"\n\tRequires a dry outdoor climate\n\tBest results when plants are grown large and not confined to pots\n\tFour phenotypes, three of which typically express sativa influence while the fourth exhibits more indica-like characteristics\n\n"}}
