{"sl_translate":"description,descriptionPlain,category","id":88,"slug":"jack-the-ripper","name":"Jack the Ripper","subtitle":null,"symbol":"Jtr","category":"Sativa","description":"\u003cp\u003eJack the Ripper, or JTR, is the flagship hybrid from TGA Genetics and was created by the breeder Subcool in an attempt make his famous \u003ca href=\"https://www.leafly.com/sativa/jacks-cleaner\"\u003eJack\u0026rsquo;s Cleaner\u003c/a\u003e in seed form. Described by many as the fastest lemon \u003ca href=\"https://www.leafly.com/sativa/haze\"\u003eHaze\u003c/a\u003e available to date, it was created by crossing the Jack\u0026rsquo;s Cleaner clone with a vigorous \u003ca href=\"https://www.leafly.com/hybrid/space-queen\"\u003eSpace Queen\u003c/a\u003e male known as Space Dude. Featuring incredibly resinous triangle-shaped buds and an intense spicy, lemon-pine aroma, Jack the Ripper is a relatively short 70% sativa-dominant strain that usually tests over 20% THC. The effect is intense, visually stimulating, and can sometimes leave novice consumers disoriented and paranoid.\u003c/p\u003e\n","descriptionPlain":"Jack the Ripper, or JTR, is the flagship hybrid from TGA Genetics and was created by the breeder Subcool in an attempt make his famous Jack\u0026rsquo;s Cleaner in seed form. Described by many as the fastest lemon Haze available to date, it was created by crossing the Jack\u0026rsquo;s Cleaner clone with a vigorous Space Queen male known as Space Dude. Featuring incredibly resinous triangle-shaped buds and an intense spicy, lemon-pine aroma, Jack the Ripper is a relatively short 70% sativa-dominant strain that usually tests over 20% THC. The effect is intense, visually stimulating, and can sometimes leave novice consumers disoriented and paranoid.\n","aka":"JTR","rating":4.25,"highlightedReviews":[{"id":1412930,"username":"willir97","text":"Although this strain is an energizing sativa with happy and euphoric effects, it is still unlike many other sativas. Instead of a fast hitting, heavy head high, Jack the Ripper eases you into a powerful stone not overwhelmed by excessive head heaviness. As a person with constant medium to high levels of anxiety, I can tell you instead of producing high levels of anxiety and paranoia like a wide amount of sativa strains seem to do, this strain will sometimes relieve anxiety, other times being that it doesn\u0027t have a negative or positive effect on the anxiety.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1641626,"username":"Kakashi_The_Kush_God","text":"I Love thus Strain","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3073","title":"These Cancer Survivors Share Their Preferred Cannabis Strains","author":"Brett Konen","category":null,"date":"\/Date(1465142400000)\/","text":"The fortitude demonstrated by cancer patients and survivors is truly remarkable. With numerous reviewers on Leafly using cannabis to combat the effects of various types of cancer, chemotherapy, and related medications, we’re constantly inspired by the positivity, bravery and determination that shines through their stories.\nWe honor these individuals by sharing a small sampling of the strains that have helped cancer patients deal with the physical, emotional, and psychological effects of their condition as they fight toward joining the ranks of hundreds of thousands of cancer survivors across the nation and around the world.\n\n AK-48\n“AK-48 has helped me in so many ways with respect to my cancer. My appetite has resumed as normal, I sleep GREAT, less depression, moments of bliss, less pain and increased level of hope for survival. It is, without a doubt, my personal favorite.” –Good-juju\n Ingrid\n“The first strain I tried for chemotherapy-induced nausea, vomiting and lack of appetite. After first use I went from nearly heaving at the thought of any food to craving – and eating – Mexican food (peppers and all).” –gobby\n ACDC\n“No brain fog, no paranoia, and doesn’t make me want to eat all of the things. I am in remission from cancer and this helps with remaining painful side effects.” –kamina\n Harlequin\n“This is, by far, one of my favorite medicinal strains…there is a complimentary THC content and effect that I find helpful as opposed to purely CBD strains. Mix it with some Sour Diesel (not enough to kill the CBD effects), vape away, and it’s my ‘morning coffee’ when on chemo.” –bravo2kilo\n Blueberry Kush\n“Every time I get this strain, I specifically save it for my friend with cancer. She says it’s her favorite for the pain.” –HebiMidori\n\n Flo\n“My left breast was diagnosed a couple months ago with breast cancer. Flo has me feeling better than I have in the two months…my body is relaxed. I did not realize how much tension I have been holding. The future looks better and easier at the moment. Wow.” –dataqueen11\n Mr. Nice\n“Using this for my back pain and for my golden retriever who has cancer. Works great for both of us!” –dyeager105\n Jack the Ripper\n“Absolutely fantastic sativa! One of the best strains I’ve had in the past 10 years. The high THC content will knock your socks off and the high lasts for 3-4 hours solid. I have brain cancer so I deal with different health issues…and this strain works extremely well controlling pain, nausea, and vertigo.” –jfu5129\n Blueberry\n“Super relaxing, pain relieving, joyful, floaty. I am a cancer survivor, have fibro, serious anxiety, and advanced degenerative disc disease and 17 herniated discs in my spine paired with scoliosis, and I feel like a carefree kid.” –DabaDharma\n \n Chemo\n“My mom is going through chemotherapy…She suffers from extreme appetite loss, nausea and abdominal discomfort from the chemotherapy. She says this strain is incredible for nausea, probably the best she has ever used and induced a great appetite for her instantly. I haven’t seen her in that much relief regarding nausea in ages.” –rachels95\n Black Jack\n“This strain has been like a little miracle in my life. Cancer treatment related pain keeps me from sleeping most nights. I literally was pain free for the entire evening allowing me to finally sleep for the first time in weeks. I’m grateful for Black Jack!!!” –karmagirl\n Sour Diesel\n“I love this strain a lot. I find myself in my own little creative world, giggling, always forgetting what I was doing then remembering…zoning out to music by Soundgarden (“Black Hole Sun”)…I always smoke with my dad because he gets real funny when he’s medicated. He has cancer so it’s better seeing him happy then depressed and in pain. Speaking of, I think he is lost in the kitchen wondering about which entrée he should devour next. I’m gonna go stop him before he eats us out of house and home, or most likely, I will end up eating a tub of ice cream along side him.” –Thecode007","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001531/celebrate-cancer-survivors-day-with-real-patients-go-to-strains.jpg","urlslug":"/news/strains-products/celebrate-cancer-survivors-day-with-real-patients-go-to-strains"},{"id":"contentitems-2955","title":"10 Cannabis Strains That Won’t Make You (As) Hungry","author":"Bailey Rahn","category":null,"date":"\/Date(1455998400000)\/","text":"“There’s weed that don’t make you hungry? For real? Honey, this changes everything.”\nThat was my Lyft driver’s response when I told her not all cannabis makes your gullet an insatiable black hole. Most cannabis consumers – especially first-time experimenters – have only tried high-THC strains, so it’s no wonder that the dispelling of this common misconception comes to the surprise of many who have long associated cannabis with the inevitable “munchies” syndrome.\nThe munchies can be a beautiful thing, and I’m not just talking about the pure ecstasy that comes with dual-wielding a fried chicken leg and an ice cream sandwich once in a while. That appetite stimulation is life-changing for patients dealing with cancer, depression, and other gastrointestinal/appetite disorders. But not everyone wants uncontrollable food lust, and some will actively avoid cannabis because of this one side effect – particularly those struggling with pre-existing eating and weight issues.\nFor those of you interested in reaping the myriad of benefits cannabis has to offer without the unbridled gluttony, we hope you find this list helpful. Remember, you can click the strain to see if it’s available at a store or dispensary near you!\n\n \nHigh-CBD Strains\nIf you’ve ever tried a high-CBD strain before, you’ve probably noticed that they don’t summon the munchies monster like THC-rich varieties. A Yale study published last year found that THC – the same chemical responsible for cannabis’ euphoric high – stimulated a group of nerve cells in the hypothalamus, the area of the brain that governs instincts like hunger and arousal.\n\nWhile less is known about CBD’s influence on appetite, we do know that this non-psychoactive constituent counteracts many effects of THC and researchers have even eyed CBD as an anti-obesity treatment based on its activity in the brain. Our own anecdotal evidence leads us to recommend high-CBD, low-THC strains for the best “munchie-less” experience, but a strain with equal parts CBD and THC can also induce less hunger with the added benefit of mild euphoria.\n\n \n\nA popular strain found in many Oregon shops, Harle-Tsu is hybrid cross between two high-CBD parents, Harlequin and Sour Tsunami (which are also worth looking into for minimal munchies strains). Harle-Tsu typically expresses a high-CBD profile with very little THC, making it a perfect choice for anyone who wants the relaxing and therapeutic effects of cannabis minus the euphoria or paranoia.\n \n\nThe “Remedy” for your over-excited appetite is this indica cross between Cannatonic and Afghan Skunk. With a THC content that rarely squeaks past 1%, Remedy delivers mental tranquility and physical relief without the psychoactive burden. This Pacific Northwest strain is perfect for the patient needing to curb pain, anxiety, tension, headaches, or insomnia, but doesn’t want to interrupt their day with hourly snack breaks.\n \n\nCanna-Tsu is taking off across the U.S., discoverable in Oregon, California, Illinois, Washington, Colorado, and many other medical marijuana states. Sweet and earthy in flavor, Canna-Tsu provides a boost to both mood and focus. Though this strain may calm upset tummies, you shouldn’t feel any extra rumblings of hunger.\n \n\nFor uncompromised energy and clarity, we recommend the low-munchies sativa MediHaze. This one can sometimes exhibit equal levels of THC and CBD, but compared to high-THC, low-CBD strains, MediHaze is much better for keeping the appetite at bay.\n \n\nSimilar to the widely coveted ACDC hybrid, Cannatonic is a high-CBD strain that relaxes the body while leaving the mind free to focus. On average, Cannatonic has a 2:1 ratio of CBD:THC, meaning you probably won’t feel much in the way of a high or hunger.\n \nHigh THCV Sativa Strains\nBy now you know what THC and CBD is, but you may not be familiar with the less ubiquitous THCV, a related chemical that suppresses appetite. While most strains on the market today tend to test anywhere between 10-20% THC, what’s considered a high THCV content might only hit a high-water mark of 5%. THCV tends to be more abundant in sativa strains, and it’s possible you’ve noticed that sativas tend to provoke hunger less than indica strains. The unique metabolic effects of THCV even have researchers considering its utility in treating obesity and diabetes.\n\nWhile high-CBD strains tend to induce little to no high, these THCV-rich sativas produce high-energy, psychoactive effects. That’s good news if you like the euphoria associated with cannabis, but don’t want the raging appetite.\n \n\nWith an average THCV content that ranges between 0.2 to 1.8%, Durban Poison is the perfect weapon against overactive appetites and can be found in most major markets. Cherished for its active, upbeat high that can fuel productivity, this pure African sativa keeps you focused on what matters more than snacks.\n \n\nResist the call of the pizza with Power Plant, an electrifying sativa that descends from African landrace strains. Its spicy, peppery aroma perks up the senses, leaving you with inspiration and positivity instead of a demanding stomach. You can find Power Plant in many different markets across the U.S. and beyond, so check to see if a shop near you is carrying it.\n \n\nKill the temptation to order half Taco Bell’s menu with Jack the Ripper, a sativa strain that carries a tantalizing lemon scent. A favorite in the Pacific Northwest, this invigorating sativa is sure to summon a talkative mood long before a talkative tum.\n \n\nAnother African sativa, Red Congolese focuses all of its psychoactive energy in the head, helping creativity and focus to thrive. Among the list of activities this sativa motivates, you’ll sooner find hiking, painting, and reading more appealing than eating the entire contents of your fridge. Though most frequently found in Vancouver, BC and Ontario, you might be delightfully surprised by its occasional appearance on the West Coast and in other areas of the U.S..\n \n\nAs sweet and citrusy as this sativa might taste, Moby Dick doesn’t coerce the appetite as much as other strains. Expect instead to feel your mood and energy elevate to a place in which it’s easy to feel satisfied whether or not you treated yourself to an entire cheesecake. This sativa is lovingly embraced in Canada and Spain, although Americans have also reported sightings of the legendary Moby Dick in many markets.\nInterested in strains that do make you hungry? Try these 10!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/10173255/iStock-526148526.jpg","urlslug":"/news/strains-products/10-cannabis-strains-that-wont-make-you-as-hungry"}],"reviewCount":377,"flavors":[{"name":"Lemon","score":40.150655795817087},{"name":"Pine","score":32.646815550041353},{"name":"Citrus","score":31.86695025404703},{"name":"Earthy","score":20.503367600141793},{"name":"Woody","score":8.7675765095119935}],"effects":[{"name":"Happy","score":72.8701406120761},{"name":"Energetic","score":63.2346685572492},{"name":"Uplifted","score":59.3867422899681},{"name":"Euphoric","score":56.306865177832918},{"name":"Focused","score":53.469218953089928}],"symptoms":[{"name":"Stress","score":52.313009571074083},{"name":"Pain","score":52.2864232541652},{"name":"Depression","score":50.162471936665483},{"name":"Headaches","score":41.959706959706956},{"name":"Fatigue","score":35.020087439442278}],"conditions":[{"name":"Anxiety","score":33.034384969868839},{"name":"ADD/ADHD","score":20.933475127023513},{"name":"PTSD","score":15.042538107054236},{"name":"Migraines","score":14.873567292922132},{"name":"Bipolar Disorder","score":13.421954389696324}],"negatives":[{"name":"Dry Mouth","score":27.957580054354246},{"name":"Anxious","score":13.206900626255464},{"name":"Headache","score":8.6600496277915635},{"name":"Paranoid","score":6.8049155145929339},{"name":"Dizzy","score":4.8079877112135172}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_eb71.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003529/b/jack-the-ripper__primary_afb3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_763c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/671946/b/jack-the-ripper__primary_56db.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_6f3a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/670736/b/jack-the-ripper__primary_b3c8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_f397.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/667918/b/jack-the-ripper__primary_a96a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_9ba8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646900/b/jack-the-ripper__primary_74e2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_e283.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639025/b/jack-the-ripper__primary_cf3d.jpg"}],"photoTotalCount":117,"popularCities":["Portland, OR","Seattle, WA","Los Angeles, CA","Edmonton, AB","Eugene, OR","Grants Pass, OR","Montréal, QC","Salem, OR","San Francisco, CA","Toronto, ON"],"permalink":"https://mobileapi.leafly.com/sativa/jack-the-ripper","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.24933687002653/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Jack\u0027s Cleaner","subtitle":null,"slug":"jacks-cleaner","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jacks-cleaner","symbol":"Jkc","applink":"leafly://strain/jacks-cleaner"},{"name":"Space Queen","subtitle":null,"slug":"space-queen","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/space-queen","symbol":"Sq","applink":"leafly://strain/space-queen"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":88,"slug":"jack-the-ripper","name":"Jack the Ripper","subtitle":null,"symbol":"Jtr","category":"Sativa","description":"\u003cp\u003eJack the Ripper, or JTR, is the flagship hybrid from TGA Genetics and was created by the breeder Subcool in an attempt make his famous \u003ca href=\"https://www.leafly.com/sativa/jacks-cleaner\"\u003eJack\u0026rsquo;s Cleaner\u003c/a\u003e in seed form. Described by many as the fastest lemon \u003ca href=\"https://www.leafly.com/sativa/haze\"\u003eHaze\u003c/a\u003e available to date, it was created by crossing the Jack\u0026rsquo;s Cleaner clone with a vigorous \u003ca href=\"https://www.leafly.com/hybrid/space-queen\"\u003eSpace Queen\u003c/a\u003e male known as Space Dude. Featuring incredibly resinous triangle-shaped buds and an intense spicy, lemon-pine aroma, Jack the Ripper is a relatively short 70% sativa-dominant strain that usually tests over 20% THC. The effect is intense, visually stimulating, and can sometimes leave novice consumers disoriented and paranoid.\u003c/p\u003e\n","descriptionPlain":"Jack the Ripper, or JTR, is the flagship hybrid from TGA Genetics and was created by the breeder Subcool in an attempt make his famous Jack\u0026rsquo;s Cleaner in seed form. Described by many as the fastest lemon Haze available to date, it was created by crossing the Jack\u0026rsquo;s Cleaner clone with a vigorous Space Queen male known as Space Dude. Featuring incredibly resinous triangle-shaped buds and an intense spicy, lemon-pine aroma, Jack the Ripper is a relatively short 70% sativa-dominant strain that usually tests over 20% THC. The effect is intense, visually stimulating, and can sometimes leave novice consumers disoriented and paranoid.\n","aka":"JTR","rating":4.25,"highlightedReviews":[{"id":1412930,"username":"willir97","text":"Although this strain is an energizing sativa with happy and euphoric effects, it is still unlike many other sativas. Instead of a fast hitting, heavy head high, Jack the Ripper eases you into a powerful stone not overwhelmed by excessive head heaviness. As a person with constant medium to high levels of anxiety, I can tell you instead of producing high levels of anxiety and paranoia like a wide amount of sativa strains seem to do, this strain will sometimes relieve anxiety, other times being that it doesn\u0027t have a negative or positive effect on the anxiety.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1641626,"username":"Kakashi_The_Kush_God","text":"I Love thus Strain","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3073","title":"These Cancer Survivors Share Their Preferred Cannabis Strains","author":"Brett Konen","category":null,"date":"\/Date(1465142400000)\/","text":"The fortitude demonstrated by cancer patients and survivors is truly remarkable. With numerous reviewers on Leafly using cannabis to combat the effects of various types of cancer, chemotherapy, and related medications, we’re constantly inspired by the positivity, bravery and determination that shines through their stories.\nWe honor these individuals by sharing a small sampling of the strains that have helped cancer patients deal with the physical, emotional, and psychological effects of their condition as they fight toward joining the ranks of hundreds of thousands of cancer survivors across the nation and around the world.\n\n AK-48\n“AK-48 has helped me in so many ways with respect to my cancer. My appetite has resumed as normal, I sleep GREAT, less depression, moments of bliss, less pain and increased level of hope for survival. It is, without a doubt, my personal favorite.” –Good-juju\n Ingrid\n“The first strain I tried for chemotherapy-induced nausea, vomiting and lack of appetite. After first use I went from nearly heaving at the thought of any food to craving – and eating – Mexican food (peppers and all).” –gobby\n ACDC\n“No brain fog, no paranoia, and doesn’t make me want to eat all of the things. I am in remission from cancer and this helps with remaining painful side effects.” –kamina\n Harlequin\n“This is, by far, one of my favorite medicinal strains…there is a complimentary THC content and effect that I find helpful as opposed to purely CBD strains. Mix it with some Sour Diesel (not enough to kill the CBD effects), vape away, and it’s my ‘morning coffee’ when on chemo.” –bravo2kilo\n Blueberry Kush\n“Every time I get this strain, I specifically save it for my friend with cancer. She says it’s her favorite for the pain.” –HebiMidori\n\n Flo\n“My left breast was diagnosed a couple months ago with breast cancer. Flo has me feeling better than I have in the two months…my body is relaxed. I did not realize how much tension I have been holding. The future looks better and easier at the moment. Wow.” –dataqueen11\n Mr. Nice\n“Using this for my back pain and for my golden retriever who has cancer. Works great for both of us!” –dyeager105\n Jack the Ripper\n“Absolutely fantastic sativa! One of the best strains I’ve had in the past 10 years. The high THC content will knock your socks off and the high lasts for 3-4 hours solid. I have brain cancer so I deal with different health issues…and this strain works extremely well controlling pain, nausea, and vertigo.” –jfu5129\n Blueberry\n“Super relaxing, pain relieving, joyful, floaty. I am a cancer survivor, have fibro, serious anxiety, and advanced degenerative disc disease and 17 herniated discs in my spine paired with scoliosis, and I feel like a carefree kid.” –DabaDharma\n \n Chemo\n“My mom is going through chemotherapy…She suffers from extreme appetite loss, nausea and abdominal discomfort from the chemotherapy. She says this strain is incredible for nausea, probably the best she has ever used and induced a great appetite for her instantly. I haven’t seen her in that much relief regarding nausea in ages.” –rachels95\n Black Jack\n“This strain has been like a little miracle in my life. Cancer treatment related pain keeps me from sleeping most nights. I literally was pain free for the entire evening allowing me to finally sleep for the first time in weeks. I’m grateful for Black Jack!!!” –karmagirl\n Sour Diesel\n“I love this strain a lot. I find myself in my own little creative world, giggling, always forgetting what I was doing then remembering…zoning out to music by Soundgarden (“Black Hole Sun”)…I always smoke with my dad because he gets real funny when he’s medicated. He has cancer so it’s better seeing him happy then depressed and in pain. Speaking of, I think he is lost in the kitchen wondering about which entrée he should devour next. I’m gonna go stop him before he eats us out of house and home, or most likely, I will end up eating a tub of ice cream along side him.” –Thecode007","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001531/celebrate-cancer-survivors-day-with-real-patients-go-to-strains.jpg","urlslug":"/news/strains-products/celebrate-cancer-survivors-day-with-real-patients-go-to-strains"},{"id":"contentitems-2955","title":"10 Cannabis Strains That Won’t Make You (As) Hungry","author":"Bailey Rahn","category":null,"date":"\/Date(1455998400000)\/","text":"“There’s weed that don’t make you hungry? For real? Honey, this changes everything.”\nThat was my Lyft driver’s response when I told her not all cannabis makes your gullet an insatiable black hole. Most cannabis consumers – especially first-time experimenters – have only tried high-THC strains, so it’s no wonder that the dispelling of this common misconception comes to the surprise of many who have long associated cannabis with the inevitable “munchies” syndrome.\nThe munchies can be a beautiful thing, and I’m not just talking about the pure ecstasy that comes with dual-wielding a fried chicken leg and an ice cream sandwich once in a while. That appetite stimulation is life-changing for patients dealing with cancer, depression, and other gastrointestinal/appetite disorders. But not everyone wants uncontrollable food lust, and some will actively avoid cannabis because of this one side effect – particularly those struggling with pre-existing eating and weight issues.\nFor those of you interested in reaping the myriad of benefits cannabis has to offer without the unbridled gluttony, we hope you find this list helpful. Remember, you can click the strain to see if it’s available at a store or dispensary near you!\n\n \nHigh-CBD Strains\nIf you’ve ever tried a high-CBD strain before, you’ve probably noticed that they don’t summon the munchies monster like THC-rich varieties. A Yale study published last year found that THC – the same chemical responsible for cannabis’ euphoric high – stimulated a group of nerve cells in the hypothalamus, the area of the brain that governs instincts like hunger and arousal.\n\nWhile less is known about CBD’s influence on appetite, we do know that this non-psychoactive constituent counteracts many effects of THC and researchers have even eyed CBD as an anti-obesity treatment based on its activity in the brain. Our own anecdotal evidence leads us to recommend high-CBD, low-THC strains for the best “munchie-less” experience, but a strain with equal parts CBD and THC can also induce less hunger with the added benefit of mild euphoria.\n\n \n\nA popular strain found in many Oregon shops, Harle-Tsu is hybrid cross between two high-CBD parents, Harlequin and Sour Tsunami (which are also worth looking into for minimal munchies strains). Harle-Tsu typically expresses a high-CBD profile with very little THC, making it a perfect choice for anyone who wants the relaxing and therapeutic effects of cannabis minus the euphoria or paranoia.\n \n\nThe “Remedy” for your over-excited appetite is this indica cross between Cannatonic and Afghan Skunk. With a THC content that rarely squeaks past 1%, Remedy delivers mental tranquility and physical relief without the psychoactive burden. This Pacific Northwest strain is perfect for the patient needing to curb pain, anxiety, tension, headaches, or insomnia, but doesn’t want to interrupt their day with hourly snack breaks.\n \n\nCanna-Tsu is taking off across the U.S., discoverable in Oregon, California, Illinois, Washington, Colorado, and many other medical marijuana states. Sweet and earthy in flavor, Canna-Tsu provides a boost to both mood and focus. Though this strain may calm upset tummies, you shouldn’t feel any extra rumblings of hunger.\n \n\nFor uncompromised energy and clarity, we recommend the low-munchies sativa MediHaze. This one can sometimes exhibit equal levels of THC and CBD, but compared to high-THC, low-CBD strains, MediHaze is much better for keeping the appetite at bay.\n \n\nSimilar to the widely coveted ACDC hybrid, Cannatonic is a high-CBD strain that relaxes the body while leaving the mind free to focus. On average, Cannatonic has a 2:1 ratio of CBD:THC, meaning you probably won’t feel much in the way of a high or hunger.\n \nHigh THCV Sativa Strains\nBy now you know what THC and CBD is, but you may not be familiar with the less ubiquitous THCV, a related chemical that suppresses appetite. While most strains on the market today tend to test anywhere between 10-20% THC, what’s considered a high THCV content might only hit a high-water mark of 5%. THCV tends to be more abundant in sativa strains, and it’s possible you’ve noticed that sativas tend to provoke hunger less than indica strains. The unique metabolic effects of THCV even have researchers considering its utility in treating obesity and diabetes.\n\nWhile high-CBD strains tend to induce little to no high, these THCV-rich sativas produce high-energy, psychoactive effects. That’s good news if you like the euphoria associated with cannabis, but don’t want the raging appetite.\n \n\nWith an average THCV content that ranges between 0.2 to 1.8%, Durban Poison is the perfect weapon against overactive appetites and can be found in most major markets. Cherished for its active, upbeat high that can fuel productivity, this pure African sativa keeps you focused on what matters more than snacks.\n \n\nResist the call of the pizza with Power Plant, an electrifying sativa that descends from African landrace strains. Its spicy, peppery aroma perks up the senses, leaving you with inspiration and positivity instead of a demanding stomach. You can find Power Plant in many different markets across the U.S. and beyond, so check to see if a shop near you is carrying it.\n \n\nKill the temptation to order half Taco Bell’s menu with Jack the Ripper, a sativa strain that carries a tantalizing lemon scent. A favorite in the Pacific Northwest, this invigorating sativa is sure to summon a talkative mood long before a talkative tum.\n \n\nAnother African sativa, Red Congolese focuses all of its psychoactive energy in the head, helping creativity and focus to thrive. Among the list of activities this sativa motivates, you’ll sooner find hiking, painting, and reading more appealing than eating the entire contents of your fridge. Though most frequently found in Vancouver, BC and Ontario, you might be delightfully surprised by its occasional appearance on the West Coast and in other areas of the U.S..\n \n\nAs sweet and citrusy as this sativa might taste, Moby Dick doesn’t coerce the appetite as much as other strains. Expect instead to feel your mood and energy elevate to a place in which it’s easy to feel satisfied whether or not you treated yourself to an entire cheesecake. This sativa is lovingly embraced in Canada and Spain, although Americans have also reported sightings of the legendary Moby Dick in many markets.\nInterested in strains that do make you hungry? Try these 10!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/10173255/iStock-526148526.jpg","urlslug":"/news/strains-products/10-cannabis-strains-that-wont-make-you-as-hungry"}],"reviewCount":377,"flavors":[{"name":"Lemon","score":40.150655795817087},{"name":"Pine","score":32.646815550041353},{"name":"Citrus","score":31.86695025404703},{"name":"Earthy","score":20.503367600141793},{"name":"Woody","score":8.7675765095119935}],"effects":[{"name":"Happy","score":72.8701406120761},{"name":"Energetic","score":63.2346685572492},{"name":"Uplifted","score":59.3867422899681},{"name":"Euphoric","score":56.306865177832918},{"name":"Focused","score":53.469218953089928}],"symptoms":[{"name":"Stress","score":52.313009571074083},{"name":"Pain","score":52.2864232541652},{"name":"Depression","score":50.162471936665483},{"name":"Headaches","score":41.959706959706956},{"name":"Fatigue","score":35.020087439442278}],"conditions":[{"name":"Anxiety","score":33.034384969868839},{"name":"ADD/ADHD","score":20.933475127023513},{"name":"PTSD","score":15.042538107054236},{"name":"Migraines","score":14.873567292922132},{"name":"Bipolar Disorder","score":13.421954389696324}],"negatives":[{"name":"Dry Mouth","score":27.957580054354246},{"name":"Anxious","score":13.206900626255464},{"name":"Headache","score":8.6600496277915635},{"name":"Paranoid","score":6.8049155145929339},{"name":"Dizzy","score":4.8079877112135172}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_eb71.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003529/b/jack-the-ripper__primary_afb3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_763c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/671946/b/jack-the-ripper__primary_56db.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_6f3a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/670736/b/jack-the-ripper__primary_b3c8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_f397.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/667918/b/jack-the-ripper__primary_a96a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_9ba8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646900/b/jack-the-ripper__primary_74e2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_e283.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639025/b/jack-the-ripper__primary_cf3d.jpg"}],"photoTotalCount":117,"popularCities":["Portland, OR","Seattle, WA","Los Angeles, CA","Edmonton, AB","Eugene, OR","Grants Pass, OR","Montréal, QC","Salem, OR","San Francisco, CA","Toronto, ON"],"permalink":"https://mobileapi.leafly.com/sativa/jack-the-ripper","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.24933687002653/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Jack\u0027s Cleaner","subtitle":null,"slug":"jacks-cleaner","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jacks-cleaner","symbol":"Jkc","applink":"leafly://strain/jacks-cleaner"},{"name":"Space Queen","subtitle":null,"slug":"space-queen","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/space-queen","symbol":"Sq","applink":"leafly://strain/space-queen"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":88,"slug":"jack-the-ripper","name":"Jack the Ripper","subtitle":null,"symbol":"Jtr","category":"Sativa","description":"\u003cp\u003eJack the Ripper, or JTR, is the flagship hybrid from TGA Genetics and was created by the breeder Subcool in an attempt make his famous \u003ca href=\"https://www.leafly.com/sativa/jacks-cleaner\"\u003eJack\u0026rsquo;s Cleaner\u003c/a\u003e in seed form. Described by many as the fastest lemon \u003ca href=\"https://www.leafly.com/sativa/haze\"\u003eHaze\u003c/a\u003e available to date, it was created by crossing the Jack\u0026rsquo;s Cleaner clone with a vigorous \u003ca href=\"https://www.leafly.com/hybrid/space-queen\"\u003eSpace Queen\u003c/a\u003e male known as Space Dude. Featuring incredibly resinous triangle-shaped buds and an intense spicy, lemon-pine aroma, Jack the Ripper is a relatively short 70% sativa-dominant strain that usually tests over 20% THC. The effect is intense, visually stimulating, and can sometimes leave novice consumers disoriented and paranoid.\u003c/p\u003e\n","descriptionPlain":"Jack the Ripper, or JTR, is the flagship hybrid from TGA Genetics and was created by the breeder Subcool in an attempt make his famous Jack\u0026rsquo;s Cleaner in seed form. Described by many as the fastest lemon Haze available to date, it was created by crossing the Jack\u0026rsquo;s Cleaner clone with a vigorous Space Queen male known as Space Dude. Featuring incredibly resinous triangle-shaped buds and an intense spicy, lemon-pine aroma, Jack the Ripper is a relatively short 70% sativa-dominant strain that usually tests over 20% THC. The effect is intense, visually stimulating, and can sometimes leave novice consumers disoriented and paranoid.\n","aka":"JTR","rating":4.25,"highlightedReviews":[{"id":1412930,"username":"willir97","text":"Although this strain is an energizing sativa with happy and euphoric effects, it is still unlike many other sativas. Instead of a fast hitting, heavy head high, Jack the Ripper eases you into a powerful stone not overwhelmed by excessive head heaviness. As a person with constant medium to high levels of anxiety, I can tell you instead of producing high levels of anxiety and paranoia like a wide amount of sativa strains seem to do, this strain will sometimes relieve anxiety, other times being that it doesn\u0027t have a negative or positive effect on the anxiety.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1641626,"username":"Kakashi_The_Kush_God","text":"I Love thus Strain","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3073","title":"These Cancer Survivors Share Their Preferred Cannabis Strains","author":"Brett Konen","category":null,"date":"\/Date(1465142400000)\/","text":"The fortitude demonstrated by cancer patients and survivors is truly remarkable. With numerous reviewers on Leafly using cannabis to combat the effects of various types of cancer, chemotherapy, and related medications, we’re constantly inspired by the positivity, bravery and determination that shines through their stories.\nWe honor these individuals by sharing a small sampling of the strains that have helped cancer patients deal with the physical, emotional, and psychological effects of their condition as they fight toward joining the ranks of hundreds of thousands of cancer survivors across the nation and around the world.\n\n AK-48\n“AK-48 has helped me in so many ways with respect to my cancer. My appetite has resumed as normal, I sleep GREAT, less depression, moments of bliss, less pain and increased level of hope for survival. It is, without a doubt, my personal favorite.” –Good-juju\n Ingrid\n“The first strain I tried for chemotherapy-induced nausea, vomiting and lack of appetite. After first use I went from nearly heaving at the thought of any food to craving – and eating – Mexican food (peppers and all).” –gobby\n ACDC\n“No brain fog, no paranoia, and doesn’t make me want to eat all of the things. I am in remission from cancer and this helps with remaining painful side effects.” –kamina\n Harlequin\n“This is, by far, one of my favorite medicinal strains…there is a complimentary THC content and effect that I find helpful as opposed to purely CBD strains. Mix it with some Sour Diesel (not enough to kill the CBD effects), vape away, and it’s my ‘morning coffee’ when on chemo.” –bravo2kilo\n Blueberry Kush\n“Every time I get this strain, I specifically save it for my friend with cancer. She says it’s her favorite for the pain.” –HebiMidori\n\n Flo\n“My left breast was diagnosed a couple months ago with breast cancer. Flo has me feeling better than I have in the two months…my body is relaxed. I did not realize how much tension I have been holding. The future looks better and easier at the moment. Wow.” –dataqueen11\n Mr. Nice\n“Using this for my back pain and for my golden retriever who has cancer. Works great for both of us!” –dyeager105\n Jack the Ripper\n“Absolutely fantastic sativa! One of the best strains I’ve had in the past 10 years. The high THC content will knock your socks off and the high lasts for 3-4 hours solid. I have brain cancer so I deal with different health issues…and this strain works extremely well controlling pain, nausea, and vertigo.” –jfu5129\n Blueberry\n“Super relaxing, pain relieving, joyful, floaty. I am a cancer survivor, have fibro, serious anxiety, and advanced degenerative disc disease and 17 herniated discs in my spine paired with scoliosis, and I feel like a carefree kid.” –DabaDharma\n \n Chemo\n“My mom is going through chemotherapy…She suffers from extreme appetite loss, nausea and abdominal discomfort from the chemotherapy. She says this strain is incredible for nausea, probably the best she has ever used and induced a great appetite for her instantly. I haven’t seen her in that much relief regarding nausea in ages.” –rachels95\n Black Jack\n“This strain has been like a little miracle in my life. Cancer treatment related pain keeps me from sleeping most nights. I literally was pain free for the entire evening allowing me to finally sleep for the first time in weeks. I’m grateful for Black Jack!!!” –karmagirl\n Sour Diesel\n“I love this strain a lot. I find myself in my own little creative world, giggling, always forgetting what I was doing then remembering…zoning out to music by Soundgarden (“Black Hole Sun”)…I always smoke with my dad because he gets real funny when he’s medicated. He has cancer so it’s better seeing him happy then depressed and in pain. Speaking of, I think he is lost in the kitchen wondering about which entrée he should devour next. I’m gonna go stop him before he eats us out of house and home, or most likely, I will end up eating a tub of ice cream along side him.” –Thecode007","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001531/celebrate-cancer-survivors-day-with-real-patients-go-to-strains.jpg","urlslug":"/news/strains-products/celebrate-cancer-survivors-day-with-real-patients-go-to-strains"},{"id":"contentitems-2955","title":"10 Cannabis Strains That Won’t Make You (As) Hungry","author":"Bailey Rahn","category":null,"date":"\/Date(1455998400000)\/","text":"“There’s weed that don’t make you hungry? For real? Honey, this changes everything.”\nThat was my Lyft driver’s response when I told her not all cannabis makes your gullet an insatiable black hole. Most cannabis consumers – especially first-time experimenters – have only tried high-THC strains, so it’s no wonder that the dispelling of this common misconception comes to the surprise of many who have long associated cannabis with the inevitable “munchies” syndrome.\nThe munchies can be a beautiful thing, and I’m not just talking about the pure ecstasy that comes with dual-wielding a fried chicken leg and an ice cream sandwich once in a while. That appetite stimulation is life-changing for patients dealing with cancer, depression, and other gastrointestinal/appetite disorders. But not everyone wants uncontrollable food lust, and some will actively avoid cannabis because of this one side effect – particularly those struggling with pre-existing eating and weight issues.\nFor those of you interested in reaping the myriad of benefits cannabis has to offer without the unbridled gluttony, we hope you find this list helpful. Remember, you can click the strain to see if it’s available at a store or dispensary near you!\n\n \nHigh-CBD Strains\nIf you’ve ever tried a high-CBD strain before, you’ve probably noticed that they don’t summon the munchies monster like THC-rich varieties. A Yale study published last year found that THC – the same chemical responsible for cannabis’ euphoric high – stimulated a group of nerve cells in the hypothalamus, the area of the brain that governs instincts like hunger and arousal.\n\nWhile less is known about CBD’s influence on appetite, we do know that this non-psychoactive constituent counteracts many effects of THC and researchers have even eyed CBD as an anti-obesity treatment based on its activity in the brain. Our own anecdotal evidence leads us to recommend high-CBD, low-THC strains for the best “munchie-less” experience, but a strain with equal parts CBD and THC can also induce less hunger with the added benefit of mild euphoria.\n\n \n\nA popular strain found in many Oregon shops, Harle-Tsu is hybrid cross between two high-CBD parents, Harlequin and Sour Tsunami (which are also worth looking into for minimal munchies strains). Harle-Tsu typically expresses a high-CBD profile with very little THC, making it a perfect choice for anyone who wants the relaxing and therapeutic effects of cannabis minus the euphoria or paranoia.\n \n\nThe “Remedy” for your over-excited appetite is this indica cross between Cannatonic and Afghan Skunk. With a THC content that rarely squeaks past 1%, Remedy delivers mental tranquility and physical relief without the psychoactive burden. This Pacific Northwest strain is perfect for the patient needing to curb pain, anxiety, tension, headaches, or insomnia, but doesn’t want to interrupt their day with hourly snack breaks.\n \n\nCanna-Tsu is taking off across the U.S., discoverable in Oregon, California, Illinois, Washington, Colorado, and many other medical marijuana states. Sweet and earthy in flavor, Canna-Tsu provides a boost to both mood and focus. Though this strain may calm upset tummies, you shouldn’t feel any extra rumblings of hunger.\n \n\nFor uncompromised energy and clarity, we recommend the low-munchies sativa MediHaze. This one can sometimes exhibit equal levels of THC and CBD, but compared to high-THC, low-CBD strains, MediHaze is much better for keeping the appetite at bay.\n \n\nSimilar to the widely coveted ACDC hybrid, Cannatonic is a high-CBD strain that relaxes the body while leaving the mind free to focus. On average, Cannatonic has a 2:1 ratio of CBD:THC, meaning you probably won’t feel much in the way of a high or hunger.\n \nHigh THCV Sativa Strains\nBy now you know what THC and CBD is, but you may not be familiar with the less ubiquitous THCV, a related chemical that suppresses appetite. While most strains on the market today tend to test anywhere between 10-20% THC, what’s considered a high THCV content might only hit a high-water mark of 5%. THCV tends to be more abundant in sativa strains, and it’s possible you’ve noticed that sativas tend to provoke hunger less than indica strains. The unique metabolic effects of THCV even have researchers considering its utility in treating obesity and diabetes.\n\nWhile high-CBD strains tend to induce little to no high, these THCV-rich sativas produce high-energy, psychoactive effects. That’s good news if you like the euphoria associated with cannabis, but don’t want the raging appetite.\n \n\nWith an average THCV content that ranges between 0.2 to 1.8%, Durban Poison is the perfect weapon against overactive appetites and can be found in most major markets. Cherished for its active, upbeat high that can fuel productivity, this pure African sativa keeps you focused on what matters more than snacks.\n \n\nResist the call of the pizza with Power Plant, an electrifying sativa that descends from African landrace strains. Its spicy, peppery aroma perks up the senses, leaving you with inspiration and positivity instead of a demanding stomach. You can find Power Plant in many different markets across the U.S. and beyond, so check to see if a shop near you is carrying it.\n \n\nKill the temptation to order half Taco Bell’s menu with Jack the Ripper, a sativa strain that carries a tantalizing lemon scent. A favorite in the Pacific Northwest, this invigorating sativa is sure to summon a talkative mood long before a talkative tum.\n \n\nAnother African sativa, Red Congolese focuses all of its psychoactive energy in the head, helping creativity and focus to thrive. Among the list of activities this sativa motivates, you’ll sooner find hiking, painting, and reading more appealing than eating the entire contents of your fridge. Though most frequently found in Vancouver, BC and Ontario, you might be delightfully surprised by its occasional appearance on the West Coast and in other areas of the U.S..\n \n\nAs sweet and citrusy as this sativa might taste, Moby Dick doesn’t coerce the appetite as much as other strains. Expect instead to feel your mood and energy elevate to a place in which it’s easy to feel satisfied whether or not you treated yourself to an entire cheesecake. This sativa is lovingly embraced in Canada and Spain, although Americans have also reported sightings of the legendary Moby Dick in many markets.\nInterested in strains that do make you hungry? Try these 10!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/10173255/iStock-526148526.jpg","urlslug":"/news/strains-products/10-cannabis-strains-that-wont-make-you-as-hungry"}],"reviewCount":377,"flavors":[{"name":"Lemon","score":40.150655795817087},{"name":"Pine","score":32.646815550041353},{"name":"Citrus","score":31.86695025404703},{"name":"Earthy","score":20.503367600141793},{"name":"Woody","score":8.7675765095119935}],"effects":[{"name":"Happy","score":72.8701406120761},{"name":"Energetic","score":63.2346685572492},{"name":"Uplifted","score":59.3867422899681},{"name":"Euphoric","score":56.306865177832918},{"name":"Focused","score":53.469218953089928}],"symptoms":[{"name":"Stress","score":52.313009571074083},{"name":"Pain","score":52.2864232541652},{"name":"Depression","score":50.162471936665483},{"name":"Headaches","score":41.959706959706956},{"name":"Fatigue","score":35.020087439442278}],"conditions":[{"name":"Anxiety","score":33.034384969868839},{"name":"ADD/ADHD","score":20.933475127023513},{"name":"PTSD","score":15.042538107054236},{"name":"Migraines","score":14.873567292922132},{"name":"Bipolar Disorder","score":13.421954389696324}],"negatives":[{"name":"Dry Mouth","score":27.957580054354246},{"name":"Anxious","score":13.206900626255464},{"name":"Headache","score":8.6600496277915635},{"name":"Paranoid","score":6.8049155145929339},{"name":"Dizzy","score":4.8079877112135172}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_eb71.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003529/b/jack-the-ripper__primary_afb3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_763c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/671946/b/jack-the-ripper__primary_56db.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_6f3a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/670736/b/jack-the-ripper__primary_b3c8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_f397.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/667918/b/jack-the-ripper__primary_a96a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_9ba8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/646900/b/jack-the-ripper__primary_74e2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/jack-the-ripper_100x100_e283.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639025/b/jack-the-ripper__primary_cf3d.jpg"}],"photoTotalCount":117,"popularCities":["Portland, OR","Seattle, WA","Los Angeles, CA","Edmonton, AB","Eugene, OR","Grants Pass, OR","Montréal, QC","Salem, OR","San Francisco, CA","Toronto, ON"],"permalink":"https://mobileapi.leafly.com/sativa/jack-the-ripper","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.24933687002653/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Jack\u0027s Cleaner","subtitle":null,"slug":"jacks-cleaner","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jacks-cleaner","symbol":"Jkc","applink":"leafly://strain/jacks-cleaner"},{"name":"Space Queen","subtitle":null,"slug":"space-queen","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/space-queen","symbol":"Sq","applink":"leafly://strain/space-queen"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
