{"sl_translate":"description,descriptionPlain,category","id":6,"slug":"super-silver-haze","name":"Super Silver Haze","subtitle":null,"symbol":"Ss","category":"Sativa","description":"\u003cp\u003eSuper Silver Haze, bred by Green House Seeds, was the first prize winner at the \u003cem\u003eHigh Times\u003c/em\u003e Cannabis Cup in 1997, 1998, and 1999. It also won awards at the\u003cem\u003e High Times\u003c/em\u003e Harvest Festival. By crossing the genetics of \u003ca href=\"http://www.leafly.com/hybrid/skunk-1\"\u003eSkunk\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/indica/northern-lights\"\u003eNorthern Lights\u003c/a\u003e, and \u003ca href=\"http://leafly.com/sativa/haze\"\u003eHaze\u003c/a\u003e, we are left with a beautiful, sticky sativa\u0026nbsp;blend that boasts an \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergetic\u003c/a\u003e, long-lasting body high. The \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e effects are a great for high stress levels or when suffering from a \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-lack-of-appetite\"\u003elack of appetite\u003c/a\u003e or \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-nausea\"\u003enausea\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"Super Silver Haze, bred by Green House Seeds, was the first prize winner at the High Times Cannabis Cup in 1997, 1998, and 1999. It also won awards at the High Times Harvest Festival. By crossing the genetics of Skunk, Northern Lights, and Haze, we are left with a beautiful, sticky sativa\u0026nbsp;blend that boasts an energetic, long-lasting body high. The uplifting effects are a great for high stress levels or when suffering from a lack of appetite or nausea.\n","aka":"Ssh","rating":4.4,"highlightedReviews":[{"id":1417925,"username":"kencaryl","text":"I feel completely content and at peace with the world.  I am calm, but not sedated.  I am focused.  My mind is not racing, and I am not writing ideas on Post-It Notes.  I feel the perfect amount of creative.  \n\nI don\u0027t feel paranoid or anxious.  My mouth is not very dry.  My eyes don\u0027t feel red or dry, but they are definitely red.  I don\u0027t have couch lock, although I could see myself falling into the YouTube rabbit hole.  I can hear the little things that differentiate great music from average music.  I can get into my kid\u0027s head and enjoy playing whatever we\u0027re playing.\n\nWhen I am depressed, the world literally looks different to me.  Everything is slightly desaturated and foggy.  This strain is one of those that literally clear away the visual symptoms of my depression.  I can look people in the eye when I talk to them and finish my sentences.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png"},{"id":1641763,"username":"edoz","text":"Interesting almost berry like taste to this, but found myself every so often having some anxiety issues from it. Otherwise a good uplifting, focused, yet relaxed high when it doesn\u0027t. One of the few sativas I\u0027ve been able to smoke without a lot of anxiety. Pain is gone though.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-35762","title":"3 Strains, Products, and Pieces of Advice for Viewing the Total Solar Eclipse","author":"Brett Konen","category":null,"date":"\/Date(1501292783000)\/","text":"Summer 2017’s total solar eclipse is America’s celestial event of the century. The first eclipse to fully cross the contiguous United States since 1918, it will mobilize millions of travelers on (and to) the North American continent. Happily, the eclipse has decided to include a rec-legal state in its path of totality.\nAs many as a million visitors are expected in Oregon alone on August 21st, and a good many of them will be marveling at the solar phenomenon in an elevated state of mind. The following are three strains and three products we recommend for viewing the event, as well as three pieces of advice for getting high while the world goes dark.\n\nBest Cannabis Strains for Viewing the Eclipse\nSunset Sherbet \nThe name alone brings this one to mind right away, but its effervescent cerebral effects and feel-good full body high are what make this strain a perfect eclipse-viewing pick. The indica-leaning hybrid is potent but won’t put you under, and offers a jolt of imaginative energy that will have you in awe over everything going on up above.\nMt. Hood Magic\nAn Oregon-born hybrid cross between Durban Poison and Northern Lights #5, Mt. Hood Magic can be found in Portland, Seaside, and Bend, and begets a bubbly, euphoric, social high and a delectable dose of citrusy flavor. If you want to get extra-local, this is your pick—just be sure to check whether the dispensary you’re hitting will have it, as it’s rarer than either Sunset Sherbet or Super Silver Haze.\nSuper Silver Haze\nThis earthy sativa is the perfect way to fully appreciate the natural beauty of the eclipse—as a Haze, it’ll leave you feeling happy yet relaxed and fully at peace with the world around you. Where Mt. Hood Magic can be tricky to track down, Super Silver Haze products and pre-rolls are everywhere, so you can definitely find this strain no matter where you end up watching the event.\n\nBest Cannabis Products for the Eclipse\nD!PPER by Dipstick Vapes\nYou’ll be camped out ready to watch the eclipse for awhile (it starts coming on around 9:00 a.m. and reaches totality right about 10:20), so you’ll want something portable with a solid battery life. This concentrate vape is the way to go: It includes a unique Vapor Tip Atomizer attachment for actual dabs, or a Quartz Crystal Atomizer that can be loaded in a more traditional manner. Remember to clean it out thoroughly if you’ll be flying home—no transporting cannabis across state lines.\nWana Jewels\nThere’s a good chance you’ll be near a ton of people while you’re watching, so be considerate with smoke, vapor, and smells, particularly if you’re around families. Edibles are the most discreet way to do it. We recommend low-dose edibles so you can slowly tailor your high to the perfect level as the eclipse comes on. Wana Jewels are delicious and ideal for this kind of dosing, as they contain less than 2mg per candy.\nMary’s Medicinals Transdermal Gel Pen\nThis purchase is an investment in comfort—you’re going to be craning your neck for hours watching the sun. A transdermal topical is the perfect thing to have on hand: Rub it between your wrists for a subtle mental buzz, or massage a few pumps into your neck for localized relief and minimal psychoactive effects.\n\nAdvice for Watching the Eclipse While High\nBe wary of dry eyes.\nSmoking or vaping in particular can cause them, which won’t make for an enjoyable viewing experience. Solution: Stay hydrated, bring eye drops, and if you want to be extra-careful, close your eyes when you exhale a lungful of smoke or vapor. And speaking of eyes, don’t forget your shades—meaning eclipse viewing glasses, which you’ll need to safely look at the sky (no, regular sunglasses won’t work).\nPack a survival kit.\nInclude munchies, water, eye drops, sunscreen, an extra lighter, those eclipse viewing glasses, a camera or your phone, a blanket, a pillow—and don’t forget your cannabis. It’s far better to be over-prepared than under-prepared. Speaking of preparedness, set multiple alarms on the morning of the eclipse, and stake out your preferred viewing location in advance.\nMake a trip of it.\nWant to spend more than a day in Oregon? Good plan, because trying to arrive at a viewing location anywhere close to Monday morning is going to be your worst nightmare in terms of traffic (we’re talking standstills, not a crawl). What to do: Check out our complete Oregon cannabis road trip itinerary, which zig-zags between the state’s cannabis hubs before ending up in the path of totality in time for the eclipse. That way, if untimely clouds ruin your viewing plans, you’ll still have had a fantastic time in this beautiful state.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/28184319/solar-eclipse-guide.jpg","urlslug":"/news/strains-products/3-strains-products-and-pieces-of-advice-for-viewing-the-total-solar-eclipse"},{"id":"contentitems-31907","title":"Tips for Growing Super Silver Haze Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1498156436000)\/","text":"Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nhttps://www.youtube.com/watch?v=ktk0UV67Hyc\u0026feature=youtu.be\nStrain Overview: Super Silver Haze was created by Amsterdam’s Green House Seeds in the mid 90s by crossing Skunk, Northern Lights, and Haze. Deemed one of the best sativa-dominant strains ever bred, Super Silver Haze imbues users with a bright, euphoric high that inspires while calming the body and dampening physical pains. It has a peppery, earthy taste and a long-lasting cerebral buzz.\nGrow Techniques: Growing Super Silver Haze indoors requires training. LST (low stress training) methods and SCROG (screen of green) will help to control its growth and increase the yield. Remove the growth from the base of the plant to promote growth in the canopy. This plant is recommended for hydroponic gardens, which can allow for earlier harvests than soil gardens.\nFlowering Time: 10-11 weeks\nYield: Low to moderate\nGrow Difficulty: Moderate to hard\nClimate: Prefers a warm, humid climate and temperatures between 70 and 80 degrees Fahrenheit.\nIndoor/Outdoor:  Super Silver Haze is best grown indoors where you can train the plant to increase yields. If cultivated outdoors, this strain performs best in regions near the equator where temperatures stay warmer into the fall.\nFeeding: Sativa strains generally require less feeding than indicas. When feeding, be careful not to burn the plant with too many nutrients. Allow time between feeding and watering to let the roots take in as much oxygen as possible, promoting strong growth.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/22113226/ssh.jpg","urlslug":"/news/growing/how-to-grow-super-silver-haze-marijuana"}],"reviewCount":1778,"flavors":[{"name":"Earthy","score":26.956933677863912},{"name":"Citrus","score":23.441429801894916},{"name":"Sweet","score":22.968130921619295},{"name":"Pungent","score":9.4702842377261},{"name":"Pine","score":8.373815676141259}],"effects":[{"name":"Happy","score":72.264427217915582},{"name":"Euphoric","score":66.375107665805331},{"name":"Uplifted","score":62.092161929371237},{"name":"Energetic","score":57.630060292850985},{"name":"Relaxed","score":54.061584840654611}],"symptoms":[{"name":"Depression","score":34.811369509043921},{"name":"Stress","score":34.097329888027566},{"name":"Pain","score":28.275193798449614},{"name":"Fatigue","score":22.965977605512489},{"name":"Lack of Appetite","score":20.519379844961239}],"conditions":[{"name":"Anxiety","score":21.114125753660637},{"name":"PTSD","score":10.751507321274763},{"name":"ADD/ADHD","score":9.93712316968131},{"name":"Bipolar Disorder","score":5.7334194659776054},{"name":"Hypertension","score":5.0422049956933677}],"negatives":[{"name":"Dry Mouth","score":24.060723514211887},{"name":"Dry Eyes","score":23.004306632213606},{"name":"Headache","score":6.7416020671834627},{"name":"Dizzy","score":6.521533161068044},{"name":"Anxious","score":5.3281653746770026}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/sativa/super-silver-haze/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/sativa/super-silver-haze/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/super-silver-haze_100x100_cfd5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1006208/b/super-silver-haze__primary_478c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/super-silver-haze_100x100_59b3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005382/b/super-silver-haze__primary_fd71.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/super-silver-haze_100x100_36d1.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1005324/b/super-silver-haze__primary_7343.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/super-silver-haze_100x100_591d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/706350/b/super-silver-haze__primary_5919.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/super-silver-haze_100x100_72e2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/702826/b/super-silver-haze__primary_a02f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/super-silver-haze_100x100_4fda.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/700271/b/super-silver-haze__primary_3d1d.jpg"}],"photoTotalCount":385,"popularCities":["Los Angeles, CA","Vancouver, BC","Portland, OR","Toronto, ON","Seattle, WA","Calgary, AB","Montréal, QC","Phoenix, AZ","Edmonton, AB","Everett, WA"],"permalink":"https://mobileapi.leafly.com/sativa/super-silver-haze","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.40101237345332/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Northern Lights","subtitle":null,"slug":"northern-lights","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/northern-lights","symbol":"Nl","applink":"leafly://strain/northern-lights"},{"name":"Haze","subtitle":null,"slug":"haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/haze","symbol":"H","applink":"leafly://strain/haze"},{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":"Difficult","preferredMedium":"Hydro","floweringDays":74,"outdoorFinish":"Mid October","height":"Tall","averageYield":"Medium","environment":null,"growNotes":"\n\tGrows best outdoors in equatorial regions between 35 degrees latitude north and south.\n\tIdeal for screen of green (SCROG) and low stress training (LST) methods. Sea of green (SOG) only recommended for growers skilled in height management.\n\n"}}
