{
    "aka": "Dougs Varin",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1422986400000)/",
            "id": "contentitems-5905",
            "text": "THCV, or tetrahydrocannabivarin, is a compound in cannabis that offers a unique array of effects and medical benefits that sets it apart from other cannabinoids like THC and CBD. Whether you’re a medical marijuana patient looking for a particular type of relief or a casual consumer chasing a specific effect, we’d like to introduce you to this fascinating compound that’s sure to make major waves in the cannabis world as we discover and utilize its full potential.\nWhat are THCV’s Effects and Benefits?\nAs its name suggests, THCV is similar to THC in molecular structure and psychoactive properties, but it provides a variety of pronounced and altogether different effects. A note for vaporizer enthusiasts: THCV has a boiling point of 428 °F (220 °C), so you’ll need to turn it up higher than you would THC.\n\n\nTHCV is an appetite suppressant. In contrast to THC, THCV may dull the appetite. This may be good for consumers focused on weight loss, but THCV should be avoided by patients treating appetite loss or anorexia.\nTHCV may help with diabetes. Research shows promise in THCV’s ability to regulate blood sugar levels and reduce insulin resistance.\nTHCV may reduce panic attacks. It appears to curb anxiety attacks in PTSD patients without suppressing emotion.\nTHCV may help with Alzheimer’s. Tremors, motor control, and brain lesions associated with Alzheimer’s disease appear to be improved by THCV, but research is in progress.\nTHCV stimulates bone growth. Because it promotes the growth of new bone cells, THCV is being looked at for osteoporosis and other bone-related conditions.\n\n\nWhere Can I Find THCV?\nSo you’re looking for the effects mentioned above, but you aren’t sure where to start your search for high-THCV strains and products. Most strains only contain trace, undetectable amounts of THCV, making it difficult to achieve the desired therapeutic effect. We can assume that more THCV-rich products will be introduced alongside its growing popularity, but in the meantime, here are some useful hints for locating this rare therapeutic gem.\n\nLook for African sativas. Lab results show that THCV is most abundant in sativas, particularly landrace strains from Africa. Durban Poison is one of the more common high-THCV strains, but other options can be found in the strain list below.\nAsk about parent genetics. Having trouble finding an African sativa? Plenty of strains have hybridized African genetics that predispose it to a higher THCV potential. Cherry Pie, for example, may express a high THCV content by way of its Durban Poison parent. Look for lineage information in Leafly’s strain pages or ask your budtenders to point out their African hybrids.\nRequest test results. Genetics alone can’t promise a high-THCV content, and cannabinoid contents can vary from harvest to harvest. If possible, ask your budtender for lab-tested strains to ensure that you’re indeed getting a THCV-rich product.\n\n\nHigh THCV Cannabis Strains\nThis list is by no means comprehensive, but it includes strains best known for their tendency toward higher-than-average THCV contents. These strains can be consumed in flower form or they can be processed into extracts, oils, and edibles for a higher concentration of cannabinoids. A few of the strains below, like Doug’s Varin and Pineapple Purps, were specially bred to contain higher levels of THCV. Again, be sure to steer your choices toward African sativas as they tend to contain the most THCV.\n\n\n\n\nDoug’s Varin\n\nPineapple Purps\n\nDurban Poison\n\n\n\nPower Plant\n\nWillie Nelson\n\nRed Congolese\n\n\n\nJack the Ripper\n\nDurban Cheese\n\nSkunk #1",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/02/29195248/what-is-thcv-and-what-are-the-benefits-of-this-cannabinoid.jpg",
            "title": "What Is THCV and What Are the Benefits of This Cannabinoid?",
            "urlslug": "/news/cannabis-101/what-is-thcv-and-what-are-the-benefits-of-this-cannabinoid"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 24.51923076923077
        },
        {
            "name": "PTSD",
            "score": 14.423076923076923
        },
        {
            "name": "Crohn's Disease",
            "score": 12.5
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 12.5
        },
        {
            "name": "Migraines",
            "score": 12.5
        }
    ],
    "description": "<p>Doug&rsquo;s Varin is a rare <a href=\"http://leafly.com/sativa\">sativa</a> strain that was specially crafted to contain high amounts of the cannabinoid <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/understanding-cannabis-testing\">THCV</a>, a psychoactive cannabis compound known to relieve <a href=\"http://www.leafly.com/explore#!/explore/conditions-ptsd\">panic attacks</a>, <a href=\"http://www.leafly.com/explore#/explore/conditions-parkinsons\">Parkinson&rsquo;s</a> tremors, stimulate bone growth, and provide a burst of <a href=\"http://www.leafly.com/explore#/explore/tags-energetic\">energy</a>. Patient&rsquo;s suffering from <a href=\"http://www.leafly.com/explore#!/explore/conditions-anorexia\">anorexia</a> and <a href=\"http://www.leafly.com/explore#!/explore/symptoms-lack-of-appetite\">appetite loss</a> should steer clear of Doug&rsquo;s Varin, as THCV also suppresses hunger. With an aroma of <a href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\">earthy</a> <a href=\"http://www.leafly.com/explore#!/explore/flavors-pine\">pine</a> and <a href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\">sweet</a> <a href=\"http://www.leafly.com/explore#!/explore/flavors-citrus\">citrus</a>, Doug&rsquo;s Varin delivers a clear-headed burst of mental stimulation that doesn&rsquo;t last as long as high-THC varieties, making this strain a perfect choice for anyone seeking short-term effects.</p>\n",
    "descriptionPlain": "Doug&rsquo;s Varin is a rare sativa strain that was specially crafted to contain high amounts of the cannabinoid THCV, a psychoactive cannabis compound known to relieve panic attacks, Parkinson&rsquo;s tremors, stimulate bone growth, and provide a burst of energy. Patient&rsquo;s suffering from anorexia and appetite loss should steer clear of Doug&rsquo;s Varin, as THCV also suppresses hunger. With an aroma of earthy pine and sweet citrus, Doug&rsquo;s Varin delivers a clear-headed burst of mental stimulation that doesn&rsquo;t last as long as high-THC varieties, making this strain a perfect choice for anyone seeking short-term effects.\n",
    "effects": [
        {
            "name": "Energetic",
            "score": 30.76923076923077
        },
        {
            "name": "Focused",
            "score": 30.76923076923077
        },
        {
            "name": "Euphoric",
            "score": 28.846153846153847
        },
        {
            "name": "Uplifted",
            "score": 24.51923076923077
        },
        {
            "name": "Aroused",
            "score": 20.673076923076923
        }
    ],
    "flavors": [
        {
            "name": "Lemon",
            "score": 25
        },
        {
            "name": "Pine",
            "score": 25
        },
        {
            "name": "Woody",
            "score": 6.25
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1417154,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "NOT AVAILABLE IN MY AREA!!!?!? WTF. How can I find similar strains?  I want something that suppresses hunger and has a high creativity rating",
            "username": "fadetobrown"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1555474,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I recently tried an oil of this strain.  It was a terrific daytime, uplifting, energized, clear experience.  The effects were mainly increased sense of well being, lessened anxiety, decreased interest in food, increased interest in activity and creative output.  Perfect for when I needed to mellow out and destress while remaining functional and actively engaged... ideal for work, daytime medicating, and even balancing out the muddled effects of high amounts of THC, especially strong indicas.  I recommend it to: any sativa lover, any cannabis afficionado looking to expand their cannabinoid tool kit with something this high in THCV, someone looking for daytime relief that doesn't cloud their mental faculties, anyone seeking additional energy, someone seeking added mindfulness and habit interruption with their munchies.",
            "username": "WeRDNAandplantoils"
        }
    ],
    "id": 134351,
    "name": "Doug's Varin",
    "negatives": [],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/sativa/dougs-varin",
    "photoTotalCount": 0,
    "photos": [],
    "popularCities": [
        "China",
        "San Francisco, CA",
        "Fremont, CA",
        "Hayward, CA",
        "Oakland, CA",
        "San Jose, CA",
        "Santa Cruz, CA",
        "Weihai Shi, Shandong Sheng, China",
        "Berkeley, CA",
        "Colma, CA"
    ],
    "rating": 4.92,
    "relatedStrains": [],
    "reviewCount": 13,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "dougs-varin",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.92307692307692/240",
    "subtitle": null,
    "symbol": "Dva",
    "symptoms": [
        {
            "name": "Fatigue",
            "score": 24.51923076923077
        },
        {
            "name": "Stress",
            "score": 22.596153846153847
        },
        {
            "name": "Depression",
            "score": 16.346153846153847
        },
        {
            "name": "Inflammation",
            "score": 16.346153846153847
        },
        {
            "name": "Nausea",
            "score": 14.423076923076923
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
