{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1464998400000)/",
            "id": "contentitems-3249",
            "text": "Check out the new strains added to the Leafly database! This week’s batch hails from Colorado, bringing potency that will have you thinking you’re a mile high. Starting with his superior dankness, Chem Jong Ill, this dictatorial strain demands respect with a potency suited for pros. But if totalitarianism isn’t quite your speed, maybe tuck into some Blueberry Muffins, yielding fruit-forward fire that would make the Pillsbury Doughboy consider cannibalism. A strain named after America’s #1 single of 1976 couldn’t possibility be this potent, right? Wrong! As Afternoon Delight so aptly put it: “…Thinkin’ of you’s working up an appetite,” and then you eat the whole fridge (if you can get off the couch, that is).\nBut there’s more! Check out all our newly added strains and share your experiences in a review!\n \n   1. Chem Jong Ill\n\nThis sativa-dominant cross is for cannabis pros looking to take the top third of their head clean off! Chem Jong Ill is a powerful hybrid by Colorado Seed Inc. that was bred using Chemdawg #4 and Gupta Kush genetics. Built for potency and longevity, this strain is an excellent option for extended physical activity, offering an uplifted, airy high in the body that is easy on the joints. The aroma is thick with a chemical funk and floral notes typical to Kush varieties.\n\n \n   2. Afternoon Delight\n\nAfternoon Delight is a difficult strain to track down. Noted for its small, dense nuggets and an aroma of pine and pungent terpenes, Afternoon Delight is described as an indica-dominant hybrid with a hazy aura that engulfs the mind and body. But indulge with caution, as this hybrid has also been known for its potency.\n\n \n   3. Flo Limone\n\nFlo Limone is Colorado Seed’s twist on a cannabis classic. Flo, the 1996 Cannabis Cup winner known for its light and bright buzz, is crossed against Nina Limone (Super Lemon Haze x Rebel God Smoke) to create an outstanding, full-flavored sativa that is motivating without an aggressive raciness. The terpene profile has also been described as aroma therapeutic, with notes of citrus incense intermixed with Moroccan hash.\n\n \n   4. Blueberry Muffins\n\nBlueberry Muffins is the thoroughly baked indica-dominant hybrid of parent strains Afghani and Blueberry. The complimentary genetics make for a strong yet functional indica that exhibits a classic aroma of — you guessed it — blueberry muffins. Its fruity palate and functional body buzz helps curb anxiety, chronic pain, and nausea.\n\n \n   5. Slazerbeam\n\nA sativa-dominant hybrid of Super Lemon Haze and Gupta Kush, Slazerbeam is loaded with dense, zesty buds. This combo is sweet and lemony while exhibiting hints of OG Kush on the inhale. The flower also packs potency, with an average THC content above 20%. Count on latent Haze and Kush effects that ground this 70% sativa with functionally heavy body effects.\n\n \n   6. Bootlegger\n\nBootlegger is a potent cross of AK-47 and Rugburn OG from Rare Dankness Seeds. The front-end parentage of AK-47 offers famous potency, but the addition of Rungburn OG (Ghost OG x Rare Dankness #1) improves bud growth and structure, leading to pungent, oily colas that mature in about 8 to 9 weeks. Expect a sweet, earthy aroma with effects distinct to hybrid crosses: creative, cerebral, and mood lifting, along with the functional sedation common among many OG strains.\n\n \n   7. Big Holy Nina\n\nBig Holy Nina from Helping Hands Herbal is a sativa-dominant cross of S.A.G.E. and Nina Limone (Super Lemon Haze x Rebel God Smoke). This stout sativa blend is infused with energy and will ignite your appetite and brighten your mind.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12002021/new-strains-alert-chem-jong-ill-afternoon-delight-slazerbeam-blue.png",
            "title": "New Strains Alert: Chem Jong Ill, Afternoon Delight, Slazerbeam, Blueberry Muffins, and More",
            "urlslug": "/news/strains-products/new-strains-alert-chem-jong-ill-afternoon-delight-slazerbeam-blue"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 45.238095238095234
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 22.619047619047617
        },
        {
            "name": "Migraines",
            "score": 22.619047619047617
        },
        {
            "name": "Arthritis",
            "score": 14.285714285714285
        },
        {
            "name": "Fibromyalgia",
            "score": 14.285714285714285
        }
    ],
    "description": "<p>A sativa-dominant hybrid of <a href=\"https://www.leafly.com/sativa/super-lemon-haze\">Super Lemon Haze</a> and Gupta Kush, Slazerbeam is loaded with dense, zesty buds. This sweet combo, bred by <a href=\"https://coloradoseedinc.com/\">Colorado Seed Inc.</a>, is&nbsp;lemony while exhibiting hints of OG Kush on the inhale. The&nbsp;flower also packs potency, with an average THC content above 20%. Count on latent <a href=\"https://www.leafly.com/sativa/haze\">Haze</a> and Kush effects that ground this 70% sativa with functionally heavy body effects. &nbsp;</p>\n",
    "descriptionPlain": "A sativa-dominant hybrid of Super Lemon Haze and Gupta Kush, Slazerbeam is loaded with dense, zesty buds. This sweet combo, bred by Colorado Seed Inc., is&nbsp;lemony while exhibiting hints of OG Kush on the inhale. The&nbsp;flower also packs potency, with an average THC content above 20%. Count on latent Haze and Kush effects that ground this 70% sativa with functionally heavy body effects. &nbsp;\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 80.35714285714286
        },
        {
            "name": "Energetic",
            "score": 80.35714285714286
        },
        {
            "name": "Happy",
            "score": 80.35714285714286
        },
        {
            "name": "Euphoric",
            "score": 72.02380952380952
        },
        {
            "name": "Relaxed",
            "score": 57.738095238095234
        }
    ],
    "flavors": [
        {
            "name": "Woody",
            "score": 57.738095238095234
        },
        {
            "name": "Earthy",
            "score": 30.95238095238095
        },
        {
            "name": "Diesel",
            "score": 14.285714285714285
        },
        {
            "name": "Berry",
            "score": 14.285714285714285
        },
        {
            "name": "Blueberry",
            "score": 14.285714285714285
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1416986,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "this strain got me to complete a logo and motion graphic for the logo in an hour. very creative great taste and functional.",
            "username": "louierock"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1638530,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I want to give this strain a 4.5 I bought it from a Sweet Leaf and the buds were huge. 1/8 nugs in jar and beautiful color and smell. The smell is of some type of berries. It makes my nose tickle. The high is very nice and lasts a while. It for sure is a Sativa and is great for daytime or whenever if you want a good sativa. It gave me some anxiety so that is why it wont get 5 stars. I say get this strain if you want to get stuff done but not actually leave the house. I have stomach medical issues and have no want to eat during the mornings. This strain made let me eat a big lunch and it was awesome.",
            "username": "HMdoc420"
        }
    ],
    "id": 228847,
    "name": "Slazerbeam",
    "negatives": [
        {
            "name": "Dry Eyes",
            "score": 26.785714285714285
        },
        {
            "name": "Dry Mouth",
            "score": 22.619047619047617
        },
        {
            "name": "Paranoid",
            "score": 14.285714285714285
        },
        {
            "name": "Anxious",
            "score": 14.285714285714285
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/super-lemon-haze",
            "category": "Sativa",
            "name": "Super Lemon Haze",
            "permalink": "https://mobileapi.leafly.com/sativa/super-lemon-haze",
            "slug": "super-lemon-haze",
            "subtitle": null,
            "symbol": "Slh"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/slazerbeam",
    "photoTotalCount": 0,
    "photos": [],
    "popularCities": [
        "Denver, CO"
    ],
    "rating": 4.67,
    "relatedStrains": [],
    "reviewCount": 12,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "slazerbeam",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.66666666666667/240",
    "subtitle": null,
    "symbol": "Slb",
    "symptoms": [
        {
            "name": "Pain",
            "score": 63.69047619047619
        },
        {
            "name": "Stress",
            "score": 57.738095238095234
        },
        {
            "name": "Depression",
            "score": 43.45238095238095
        },
        {
            "name": "Fatigue",
            "score": 30.95238095238095
        },
        {
            "name": "Lack of Appetite",
            "score": 28.57142857142857
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
