{"sl_translate":"description,descriptionPlain,category","id":42,"slug":"kali-mist","name":"Kali Mist","subtitle":null,"symbol":"Km","category":"Sativa","description":"\u003cp\u003e\u003cspan style=\"line-height: 20.7999992370605px;\"\u003eKali Mist is known to deliver clear-headed,\u0026nbsp;\u003c/span\u003e\u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\" style=\"line-height: 20.7999992370605px;\"\u003eenergetic\u003c/a\u003e\u003cspan style=\"line-height: 20.7999992370605px;\"\u003e\u0026nbsp;effects that can verge on psychedelic at times. Despite having an unknown genetic history, Kali Mist is believed to have originated in the 1990s through crossing two\u0026nbsp;\u003c/span\u003e\u003ca href=\"http://www.leafly.com/sativa\" style=\"line-height: 20.7999992370605px;\"\u003esativa\u003c/a\u003e\u003cspan style=\"line-height: 20.7999992370605px;\"\u003e-dominant\u0026nbsp;\u003c/span\u003e\u003ca href=\"http://www.leafly.com/hybrid\" style=\"line-height: 20.7999992370605px;\"\u003ehybrids\u003c/a\u003e\u003cspan style=\"line-height: 20.7999992370605px;\"\u003e. This lightweight sativa is a perfect choice for consumers looking to maintain focus and productivity throughout their day.\u003c/span\u003e\u003c/p\u003e\n","descriptionPlain":"Kali Mist is known to deliver clear-headed,\u0026nbsp;energetic\u0026nbsp;effects that can verge on psychedelic at times. Despite having an unknown genetic history, Kali Mist is believed to have originated in the 1990s through crossing two\u0026nbsp;sativa-dominant\u0026nbsp;hybrids. This lightweight sativa is a perfect choice for consumers looking to maintain focus and productivity throughout their day.\n","aka":null,"rating":4.15,"highlightedReviews":[{"id":1412108,"username":"ThaPurplePrince","text":"The Mist I picked up had to be the most trichome packed buds so far this year. Mostly bright green but one of the smaller nugs had a very dark tint, almost purple. The high had me uplifted from the start but the further I dove into the bowl the more energetic and adventurous I got. Also the high made me very talkative throughout the rest of the night. Me and my friend even went down to a spot by the Mississippi river and toked on a wall in the snow. Good times... :)","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"},{"id":1631402,"username":"truffles420","text":"fucking incredible nice big buds beautiful smell very good long lasting high great smoke highly recommend  this strain ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-33797","title":"Best Cannabis Strains for Sparking Creativity","author":"Bailey Rahn","category":null,"date":"\/Date(1499899938000)\/","text":"Cannabis has long been a companion for creative minds. It has a way of expanding the imagination, enabling access to new thoughts, concepts, and ideas. For many of us, cannabis adds color to our world and allows us to appreciate small nuances that are normally filtered out by our busy brains.\nNot all strains are created equal, thanks to differences in their terpene and cannabinoid profiles. Sure, some artists couldn’t care less what strains they keep stocked alongside pens and brushes, but others swear by specific strains and rely on them for stimulating creative thought.\nThis list features strains that Leafly reviewers rate as highly creative, so consider giving them a try if you’re looking to kindle inspiration.\n\nKali Mist\n\nSometimes the only thing separating you from reaching creative flow is a lack of energy. Kali Mist, a bright and euphoric sativa strain, shakes your imagination awake and imbues it with colorful stimulation that inspires as well as motivates.\n\n“If you want to delve into some new and interesting concepts – if what you’re after is refreshing uplifting bouts of fluid confident creativity and clarity of thought, Kali Mist is where it’s at.” –KennedyBash\n\nJack Herer\n\nWith a sharp pine aroma that promotes an alert, focused mindset, Jack Herer is famous for good reason. Its mellow, even-keel high leaves the mind flexible and with room to stretch creative muscles.\n\n“Astounding creativity off this stuff, first time being high has made me feel smarter.” – itsdeliciouschi\n\n\nChemdawg\n\nChemdawg is a potent hybrid best reserved for the seasoned consumer looking to turbo boost creativity. Its high can be dizzying and cumbersome, but if you’re seeking strong euphoria that jars the senses and summons new pathways of thought, Chemdawg might be the powerhouse hybrid you’ve been waiting for.\n\n“I had many thoughts rush through my head and it was a little overwhelming but once I settled into the high it was very creative, imaginative and invigorating.” – Indaking\n\nPurple Haze\n\nA strain that seems to turn up saturation and definition like an HD movie, Purple Haze unlocks the highest potential of your senses. Lending energy and positivity to the mind, this sativa knocks down bad moods, lethargy, and anything else standing in the way between you and your next artistic project.\n\n“Good for the creative types who love to have a toke with their brush strokes or good for the student looking to cram for the exam.” – Schmo\n\nLSD\n\nNamed for its trippy, awe-inspiring high, LSD is a hybrid strain that’ll spin and twist your imagination, wringing out all of the creativity inside. Use this strain to cast a new light on conscious thought while it illuminates concepts and ideas hiding in your mind’s depths.\n\n“This strain is THE BEST when it comes to coming up with creative ideas. If you’re having creative block or writers block, I recommend this strain a lot.” – GinoMidnight\n\n\nBerry White\n\nThough most people associate sativa strains with creativity, some minds require pacifying before engaging in art or other creative escapes. Overactive minds–especially those afflicted by anxiety or PTSD–can benefit from the slow pace of Berry White’s effects. Artists experiencing debilitating pain or inflammation may also find that this indica’s soothing physical effects take their mind off the aches, allowing full immersion in the task at hand.\n\n“Berry White leaves me relaxed and helps me forget my chronic back pain. I am always given creative insights when I am about an hour into the high.” – TechDesigner\n\nTangie\n\nTangie is a sativa strain that offers many gifts: long-lasting euphoria, a sweet citrus flavor almost indiscernible from ripe tangerines, and a creative kick that expands thought. Its meditative, patient, and focusing high is perfect for settling deep into a long project, especially one that might otherwise feel long and tedious.\n\n“I felt sufficiently high, but very much in the circumstance of what was going on around me. This is a state of mind where I can be very creative, aware, and at peace all at the same time.” – Brian\n\n\nJillybean \n\nA beautiful plant that blooms with sparkling trichomes and colorful hues, Jillybean shares her vibrancy through bright, blissful euphoria. This hybrid helps you shed stress and bad moods, leaving you free to navigate your imagination without burden.\n\n“Jillybean is a nice hybrid that melts away inhibitions, creative blocks and allows for true relaxation. Like a vacation in a flower, this bud will have layers of high energy sativa that helped keep my house clean but also slowly bring on some of the best sleep I’ve had in years.” –jeahisaidit\n\nTo find more creative strains, explore others in Leafly’s strain database by clicking here.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/12150057/strains-for-sparking-creativity.jpg","urlslug":"/news/strains-products/best-cannabis-strains-for-creativity"},{"id":"contentitems-3375","title":"New Strains Alert: Purple Dog Shit, Critical Kali Mist, Pink Bubba, Afghan Cow, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1448643600000)\/","text":"Still digesting all that food from yesterday? We just added some strains to the Leafly Explorer to help you veg out. Others will motivate you to finally get up and out. Read up about each and find out if any of these are offered near you by checking the links below.\n \n   1. Critical Kali Mist\n\nCritical Kali Mist from Delicious Seeds was bred to be brilliant. Its genetics are a pairing of Critical Mass, an indica known for its growth of large sticky buds, and Kali Mist, a multi-award-winning sativa. The result is a powerful and resinous sativa that produces large, dense flowers after about 70 days. With earthy and pine flavors, this bud provides uplifting effects and endless fits of laughter.\n\nClick here for a full list of locations currently carrying Critical Kali Mist\n \n   2. Pink Bubba\n\nPink Bubba is a mostly indica strain that is said to combine genetics from Bubba Kush and Pink Kush. Earthy pine flavors lead the way with slight floral highlights that bring out this strain’s sweet notes. Perhaps best saved for evening use, Pink Bubba delivers a body-melting blast of physical relaxation alongside dreamy euphoria.\n\nClick here for a full list of locations currently carrying Pink Bubba\n \n   3. Purple Dog Shit\n\nWith a name like Purple Dog Shit, this hybrid strain sure knows how to garner attention. Its parent strain Dog Shit was named for its funky smell that some compare to dog turds, but this stain is more often described as earthy with a sweet touch of grape. Though its genetics aren’t certain, popular conjecture names Purple Urkle or another similar Purple strain as the second parent. Some Purple Dog Shit phenotypes exhibit a high level of CBD, a non-psychoactive cannabinoid known for its ability to treat pain, inflammation, and anxiety. Tranquilizing body effects ease you into deep relaxation and a good night\u0027s sleep.\n\nClick here for a full list of locations currently carrying Purple Dog Shit\n \n   4. Kali 47\n\nKali 47 is a mostly sativa strain that is characterized by sweet fruity flavors with hints of caramel. For many patients, Kali 47 may relieve an array of symptoms including depression, pain, and stress. A cross between Kali Mist and AK-47, Kali 47 delivers happy euphoric effects that allow the mind to stay agile while relaxing the body. This sativa is easy to grow, making it an ideal choice for novice cultivators.\n\n \n   5. Durga Mata\n\nDurga Mata, bred by Paradise Seeds, is an indica-driven strain. Despite being 90% indica, it acts unlike other predominately indica strains. With flavors best described as reminiscent of Turkish Delight, it offers a long-lasting relaxing body buzz without the couch potato effect. This strain has a natural resistance to pests and survives through rough treatment, which makes it a recommended choice for beginners and outdoor growers.\n\nClick here for a full list of locations currently carrying Durga Mata\n \n   6. Early Miss\n\nAn auto-flowering indica-dominant hybrid, Early Miss is a great strain for those looking for pain relief or an appetite boost. Crop King Seeds took the heavy producer Big Bud and paired it with the hard-hitting White Widow to make a moderate yielding plant with high levels of THC, and then crossed it with an auto-flowering ruderalis variety. Flowering in 50 days, this hybrid is a quick and easy grow that will not leave you disappointed.\n\nClick here for a full list of locations currently carrying Early Miss\n \n   7. Afghan Cow\n\nThis sweet-smelling and resinous sativa breed from Dr. Krippling Seeds is sure to keep you off the couch. Afghan Cow is bred from Ash, Kaya 47 (an AK-47 phenotype), and the beloved Kali Mist. The cerebral effects of this sativa are great for clear-headed daytime use. Having a high yield both indoors and out, this is an impressive plant with even more impressive effects.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12002324/new-strains-alert-purple-dog-shit-critical-kali-mist-pink-bubba-a.png","urlslug":"/news/strains-products/new-strains-alert-purple-dog-shit-critical-kali-mist-pink-bubba-a"}],"reviewCount":271,"flavors":[{"name":"Earthy","score":29.807471264367816},{"name":"Citrus","score":27.005747126436781},{"name":"Woody","score":8.862068965517242},{"name":"Spicy/Herbal","score":5.3649425287356323},{"name":"Mint","score":4.5747126436781613}],"effects":[{"name":"Creative","score":87.410919540229884},{"name":"Uplifted","score":84.991379310344826},{"name":"Happy","score":82.488505747126439},{"name":"Energetic","score":71.925287356321832},{"name":"Euphoric","score":63.913793103448278}],"symptoms":[{"name":"Stress","score":80.261494252873561},{"name":"Pain","score":50.166666666666664},{"name":"Headaches","score":46.790229885057471},{"name":"Inflammation","score":42.7183908045977},{"name":"Depression","score":35.890804597701148}],"conditions":[{"name":"Anxiety","score":52.178160919540232},{"name":"ADD/ADHD","score":27.149425287356323},{"name":"PTSD","score":25.508620689655171},{"name":"Arthritis","score":24.646551724137932},{"name":"Migraines","score":23.867816091954023}],"negatives":[{"name":"Dry Mouth","score":36.03448275862069},{"name":"Dry Eyes","score":10.454022988505749},{"name":"Anxious","score":9.0057471264367823},{"name":"Paranoid","score":3.5804597701149428},{"name":"Dizzy","score":2.7902298850574714}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/sativa/kali-mist/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/sativa/kali-mist/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kali-mist_100x100_4cdf.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/613291/b/kali-mist__primary_992b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kali-mist_100x100_35bb.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/560848/b/kali-mist__primary_5eda.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kali-mist_100x100_0520.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/517484/b/kali-mist__primary_9625.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kali-mist_100x100_150b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/508989/b/kali-mist__primary_d0cc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kali-mist_100x100_396d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/504277/b/kali-mist__primary_d94e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kali-mist_100x100_d03e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503925/b/kali-mist__primary_d474.jpg"}],"photoTotalCount":74,"popularCities":["Los Angeles, CA","Montréal, QC","San Francisco, CA","Vancouver, BC","Anaheim, CA","Brampton, ON","Calgary, AB","Edmonton, AB","Fremont, CA","Hayward, CA"],"permalink":"https://mobileapi.leafly.com/sativa/kali-mist","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.1549815498155/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":80,"outdoorFinish":null,"height":"Medium","averageYield":null,"environment":"Indoor","growNotes":""}}
