{
    "aka": "SageNsour, Sage N' Sour, Sage 'N Sour, Sage and Sour",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1519855191000)/",
            "id": "contentitems-58783",
            "text": "Pop music is a diverse and lenient genre that often accompanies many influences such as hip-hop, soul, dance, rap, and rock. The term “pop” is short for “popular,” so the recognized sound of this genre has continually shifted over time. From the 60s, when The Beatles and rock music was considered pop, to today’s landscape where you’ll find pop artists ranging from soul singers to rappers, this lively genre will always be changing and evolving as the years wane on.\n\nPop music takes many forms, which means that there’s probably an album out there that speaks solely to you. Below, explore five modern pop albums—paired with their perfect strains—for an elevating experience of our modern-day manifestation of an evolving genre.\nSeat at the Table by Solange\n(Columbia Records)\nStrain Pairing Recommendation: Dream Queen\nSolange released her third album, Seat at the Table, in 2016, and it quickly shot to the number one spot on Billboard 200. The 21-song album is an infusion of Solange’s neo-soul, r&b sound. It’s a refreshing number one album in a world of top 40 hits that often adhere to rigid, narrow hooks and phrasing. Seat at the Table has a deep, serene beauty from each calculated note to Solange’s effortlessly melodic voice. With lyrics that speak to the black American experience and touch on topics such as prejudice and racism, A Seat at the Table is poignant, meaningful, and an important contribution to the artistic landscape of our times.\n\nMore Life by Drake\n(Republic Records)\nStrain Pairing Recommendation: Sage N Sour\nMore Life, Drake’s 13th album, dropped in 2017. With over 80 minutes of music, it delivers an expressive and vibrant soundscape that is a delight to dive into. With songs such as “Madiba Riddim,” “Lose You,” “Can’t Have Everything,” and “Passionfruit,” Drake explores a wide variety of sounds that keeps it fresh and engaging throughout. Yet—despite the variety—each track contains Drake’s quintessential style, tying it together with the genuine heart he puts into his work.\nLemonade by Beyonce\n(Columbia Records)\nStrain Pairing Recommendation: Electric Lemonade\nReleased in 2016, Lemonade took the music scene by storm—and with good reason. A modern masterpiece, Lemonade is a deeply personal musical journey through romantic tribulations and black American life in the modern age. The album moves seamlessly through each song, leading the listener along a ride of emotional ups and downs. Anger, grief, joy, triumph, self-love—Lemonade has it all. Paired with the visual album, it’s easy to see why it made a major, lasting impact on the musical world.\n\nRainbow by Kesha\n(Kemosabe)\nStrain Pairing Recommendation: Cherry Thunder Fuck\nRainbow is Kesha’s first album since 2014 due to her long legal battle with producer and abuser, Dr. Luke. Having now won back the rights to her own music, Kesha’s album, Rainbow, is an anthem of freedom, triumph, and a spirit that refuses to quit. With songs such as “Praying” and “Bastard,” which directly addresses the trials Kesha went through over the last few years, the album is deeply personal. On the other end, songs such as “Boogie Shoes” and “Woman” (featuring Dap Kings) are bursting with joy and strength, making Rainbow a well-rounded, emotional hit.\nThe Pinkprint (Deluxe) by Nicki Minaj\n(Republic)\nStrain Pairing Recommendation: Boss OG\nThe Pinkprint was released in 2014, but with Minaj hinting at a new 2018 release, there’s plenty of reason to get hyped about this album all over again. With 23 songs on the roster, Pinkprint gives fans plenty to unwrap during her hiatus, and for those who only know her from the hit “Anaconda,” it’s time to take a deeper look. The Pinkprint features a wide breadth of sound; the diverse tracks range in genre from hip-hop, soul, rap, to dance. Minaj brings all her talent to the table, showing off her skills as a great rapper and soulful singer. The contrast between songs such as “Feeling Myself” and “Grand Piano” exemplify Minaj’s ability to embrace any sound she wants and she packages it all into one fire album.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28131717/pop-albums-while-high.jpg",
            "title": "5 Vibrant Pop Albums to Listen to While High",
            "urlslug": "/news/lifestyle/5-vibrant-pop-albums-to-listen-to-while-high"
        },
        {
            "author": "Hannah Meadows",
            "category": null,
            "date": "/Date(1484677341000)/",
            "id": "contentitems-15829",
            "text": "Following the lunar calendar, the 2017 Chinese New Year (also known as the Spring Festival) falls on January 28th. This year rings in the Year of the Fire Rooster (whose last appearance on the Chinese calendar dated back to 1957) and will be accompanied by two weeks of celebration flanked by firework shows and traditional lion dancing.\nThose born under the fire rooster are thought to exude an attitude of trustworthiness and responsibility while maintaining the rooster’s other positive traits: activeness, popularity, honesty, and loyalty.\nTo join in the celebrations of this Chinese New Year, we decided to pair a few strains that exude the fire rooster’s best qualities.\nMango Haze\n\nSativa Mango Haze packs a fruity punch with its cerebral buzz and mango flavor. Its uplifting qualities speak directly to the fire rooster’s “active” and “popular” traits.\nPermafrost\n\nIf this January chill has you turning blue, give the hybrid Permafrost a try. Despite the name, its only frosty elements come from its coat of crystal trichomes. Ease into this this strain for a relaxing body high that will set a joyous mood.\nSage N Sour\n\nSage is a popular “life-giving” herb commonly used in traditional Chinese medicine, so there’s no wonder why the sativa Sage N Sour made a spot on this list. Ring in the new year with a balance of euphoria and energy as you steep in this aromatic strain.\nFlowerbomb Kush\n\nThe indica Flowerbomb Kush won’t knock you out before celebrations are over. It’s “invigorating cerebral effects” balance out a floaty body high that will cruise you through the Chinese New Year’s two weeks of festivities.\nPeaches and Cream\n\nAdd a little sweetness to your celebrations with the delicious hybrid Peaches and Cream. Possessing a “heady euphoria,” this strain will keep you going through glowing nights full of fireworks.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/27164926/chinese-new-year.jpg",
            "title": "Celebrate Chinese New Year With These 5 Strains",
            "urlslug": "/news/strains-products/strains-to-celebrate-chinese-new-year"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 41.9281914893617
        },
        {
            "name": "ADD/ADHD",
            "score": 11.289893617021276
        },
        {
            "name": "Bipolar Disorder",
            "score": 4.082446808510638
        },
        {
            "name": "Arthritis",
            "score": 3.976063829787234
        },
        {
            "name": "PMS",
            "score": 3.976063829787234
        }
    ],
    "description": "<p><span style=\"line-height: 1.6em;\">Sage N Sour by T.H. Seeds is a 75%&nbsp;</span><a href=\"http://leafly.com/sativa\"><span style=\"line-height: 1.6em;\">sativa</span></a><span style=\"line-height: 1.6em;\">&nbsp;strain that unites the sharply <a href=\"http://www.leafly.com/explore#!/explore/flavors-pungent\">pungent</a></span><span style=\"line-height: 1.6em;\">&nbsp;<a href=\"http://leafly.com/sativa/sour-diesel\">Sour Diesel</a> with their <a href=\"http://www.leafly.com/hybrid/sage\">SAGE</a> <a href=\"http://leafly.com/hybrid\">hybrid</a>. With an aroma that closely matches the subtle <a href=\"http://www.leafly.com/explore#!/explore/flavors-spicyherbal\">herbal</a> notes of <a href=\"http://www.leafly.com/explore#!/explore/flavors-sage\">sage</a>, Sage N Sour delivers a perfect balance of <a href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\">euphoria</a>, <a href=\"http://www.leafly.com/explore#!/explore/tags-energetic\">energy</a>, and <a href=\"http://www.leafly.com/explore#!/explore/tags-happy\">happiness</a> to its consumer. Growers will appreciate the generous yields this sativa has to offer following its 60 to 65 day flowering cycle.</span></p>\n",
    "descriptionPlain": "Sage N Sour by T.H. Seeds is a 75%&nbsp;sativa&nbsp;strain that unites the sharply pungent&nbsp;Sour Diesel with their SAGE hybrid. With an aroma that closely matches the subtle herbal notes of sage, Sage N Sour delivers a perfect balance of euphoria, energy, and happiness to its consumer. Growers will appreciate the generous yields this sativa has to offer following its 60 to 65 day flowering cycle.\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 132.40691489361703
        },
        {
            "name": "Focused",
            "score": 93.45744680851064
        },
        {
            "name": "Happy",
            "score": 81.02393617021276
        },
        {
            "name": "Energetic",
            "score": 76.62234042553192
        },
        {
            "name": "Giggly",
            "score": 65.15957446808511
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 59.547872340425535
        },
        {
            "name": "Sage",
            "score": 39.2686170212766
        },
        {
            "name": "Spicy/Herbal",
            "score": 33.37765957446808
        },
        {
            "name": "Lemon",
            "score": 31.888297872340427
        },
        {
            "name": "Diesel",
            "score": 30.997340425531917
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 63,
        "growNotes": "\n\tHeavy nutrients\n\tGrows with many branches\n\n",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1377336,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/3/240",
            "text": "Sour Sage, often listed as Sage n’ Sour, is a combination of two potent sativa expressive hybrids, Sour Diesel and S.A.G.E.  As we saw in a previous review, Sour Diesel is much like sex.  Even when it’s bad, it’s still pretty good.  Mixing with this euphoric sativa is S.A.G.E. (Sativa Afghani Genetic Equillibrium).  S.A.G.E was bred to be the perfect 50/50 hybrid.  I feel a bit dirty messing with perfection, but the addition of Sour Diesel is simply the refining of an otherwise impeccable strain.\n\nThe buds of Sour Sage are light and airy.  My budtender had to practically shove the pop top closed, as the nuggets were overflowing the container.  They are oddly misshapen, almost pyramids, but only in the minds of the most devout cubists.  A blueish greenery is accented by topaz hairs and a fuzzy frosting of crystals.  When I dipped my nose into the jar, I was hit with the scent of herb garden greenery.  There was hardly a hint of the astringent lemon or diesel smells common of Sour Diesel.  Instead, there was an herbal tea aroma and a warm, pungent earth smell.  It was quite sweet and enjoyable, like a big bowl of mother nature.  The taste was imperceptible until the exhale.  Especially with the green hit, the smoke was sweet and organic.  There is little smoker’s fatigue, and the smoke is thin and vaporous.\n\nS.A.G.E.’s perfect equilibrium is ruined by the addition of Sour Diesel, making for a sativa to indica ratio of 3 to 1 in its genetics.  However, you will hardly feel like you have anything less than an improvement on your hands.  The high is expansive and dreamy.  There is a strong disembodiment and a disconnect from the world.  Highs like this are an experience all their own.  Slightly hallucinogenic at high doses, a blunt made me lose myself for hours at a time.  Sour Sage is a great daytime high, but save it for weekends.  It will help you escape your troubles, and any stress will simply recede.\n\nhttp://ocweedreview.wordpress.com/",
            "username": "OCWeedReview"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ceXlEezZxDEKdc4wBVE5gjirHQY=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fhUr0cy3OT6mdt8d2QOWZ_deftones_background_silhouette_singer_microphone_1798_3840x2400.jpg.png",
            "id": 1619814,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Surprised at how much I like this strain seeing how I don't really like sage, as it does have a slight smell of it however the taste is more over powered by a piney citrus flavor with an earthy appeal to it all. Very uplifting and energetic effects while still relieving stress, pain and helps with appetite when your not feeling your best. Good for daytime not so much for middle of the night as it will keep you up for a couple hours and by that time the munchies get the best of you.",
            "username": "ShotgunMcQuade"
        }
    ],
    "id": 78,
    "name": "Sage N Sour",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 7.805851063829787
        },
        {
            "name": "Paranoid",
            "score": 7.420212765957447
        },
        {
            "name": "Dizzy",
            "score": 4.1888297872340425
        },
        {
            "name": "Anxious",
            "score": 3.6569148936170213
        },
        {
            "name": "Dry Eyes",
            "score": 2.4468085106382977
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/sage",
            "category": "Hybrid",
            "name": "SAGE",
            "permalink": "https://mobileapi.leafly.com/hybrid/sage",
            "slug": "sage",
            "subtitle": null,
            "symbol": "Sg"
        },
        {
            "applink": "leafly://strain/sour-diesel",
            "category": "Sativa",
            "name": "Sour Diesel",
            "permalink": "https://mobileapi.leafly.com/sativa/sour-diesel",
            "slug": "sour-diesel",
            "subtitle": null,
            "symbol": "Sd"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/sage-n-sour",
    "photoTotalCount": 52,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/642317/b/sage-n-sour__primary_00bb.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sage-n-sour_100x100_ae82.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/588426/b/sage-n-sour__primary_2768.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sage-n-sour_100x100_8b69.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/543995/b/sage-n-sour__primary_e351.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sage-n-sour_100x100_52d6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/534685/b/sage-n-sour__primary_3669.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sage-n-sour_100x100_ded7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506839/b/sage-n-sour__primary_e0e3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sage-n-sour_100x100_6aeb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/496800/b/sage-n-sour__primary_fbcd.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sage-n-sour_100x100_68f6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Portland, OR",
        "Everett, WA",
        "Seattle, WA",
        "Vancouver, BC",
        "Aurora, CO",
        "Bellevue, WA",
        "Bellingham, WA",
        "Berkeley, CA",
        "Bothell, WA"
    ],
    "rating": 4.22,
    "relatedStrains": [],
    "reviewCount": 196,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "sage-n-sour",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.21938775510204/240",
    "subtitle": null,
    "symbol": "Sns",
    "symptoms": [
        {
            "name": "Stress",
            "score": 70.79787234042553
        },
        {
            "name": "Depression",
            "score": 46.05053191489362
        },
        {
            "name": "Pain",
            "score": 39.162234042553195
        },
        {
            "name": "Lack of Appetite",
            "score": 33.16489361702128
        },
        {
            "name": "Fatigue",
            "score": 15.904255319148936
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
