{"sl_translate":"description,descriptionPlain,category","id":500290,"slug":"electric-lemonade","name":"Electric Lemonade","subtitle":null,"symbol":"Ell","category":"Sativa","description":"\u003cp\u003eElectric Lemonade by Palomar Craft Cannabis is a cross of \u003ca href=\"https://www.leafly.com/hybrid/tahoe-og\"\u003eTahoe OG\u003c/a\u003e x \u003ca href=\"https://www.leafly.com/hybrid/blue-dream\"\u003eBlue Dream\u003c/a\u003e. This sativa-dominant strain is a PCC in-house favorite and bridges the gap between sativa and hybrid beautifully, offering energetic physical effects alongside creative mental stimulation. PCC recommends utilizing Electric Lemonade\u0026rsquo;s uplifting effects to overcome anxiety and nausea. Electric Lemonade emits a strong sour lemonade aroma and offers consumers tart lemon flavors that foretell the strain\u0026rsquo;s mood-enhancing effects.\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Electric Lemonade by Palomar Craft Cannabis is a cross of Tahoe OG x Blue Dream. This sativa-dominant strain is a PCC in-house favorite and bridges the gap between sativa and hybrid beautifully, offering energetic physical effects alongside creative mental stimulation. PCC recommends utilizing Electric Lemonade\u0026rsquo;s uplifting effects to overcome anxiety and nausea. Electric Lemonade emits a strong sour lemonade aroma and offers consumers tart lemon flavors that foretell the strain\u0026rsquo;s mood-enhancing effects.\u0026nbsp;\u0026nbsp;\n","aka":null,"rating":4.71,"highlightedReviews":[{"id":1490736,"username":"ny1984sm","text":"Very impressed. This strain\u0027s effects are exactly as described. I would recommend this to all medical users","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1614634,"username":"Zerophucks","text":"I just picked up a batch of this Electric Lemonade directly from Palomar Craft and I must say the strain directly follows the description. I suffer from severe back pain and E.L hit the spot directly. It\u0027s almost unbelievable that Palomar has spent so much time on the refinement of their strain selection. High in CBD and just the right amount of THC combine to make this strain a valid medical solution for the avid smoker who needs just enough pain relief to make it through the day. That combined with fuzzy head and body high make this a new favorite!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-58783","title":"5 Vibrant Pop Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1519855191000)\/","text":"Pop music is a diverse and lenient genre that often accompanies many influences such as hip-hop, soul, dance, rap, and rock. The term “pop” is short for “popular,” so the recognized sound of this genre has continually shifted over time. From the 60s, when The Beatles and rock music was considered pop, to today’s landscape where you’ll find pop artists ranging from soul singers to rappers, this lively genre will always be changing and evolving as the years wane on.\n\nPop music takes many forms, which means that there’s probably an album out there that speaks solely to you. Below, explore five modern pop albums—paired with their perfect strains—for an elevating experience of our modern-day manifestation of an evolving genre.\nSeat at the Table by Solange\n(Columbia Records)\nStrain Pairing Recommendation: Dream Queen\nSolange released her third album, Seat at the Table, in 2016, and it quickly shot to the number one spot on Billboard 200. The 21-song album is an infusion of Solange’s neo-soul, r\u0026b sound. It’s a refreshing number one album in a world of top 40 hits that often adhere to rigid, narrow hooks and phrasing. Seat at the Table has a deep, serene beauty from each calculated note to Solange’s effortlessly melodic voice. With lyrics that speak to the black American experience and touch on topics such as prejudice and racism, A Seat at the Table is poignant, meaningful, and an important contribution to the artistic landscape of our times.\n\nMore Life by Drake\n(Republic Records)\nStrain Pairing Recommendation: Sage N Sour\nMore Life, Drake’s 13th album, dropped in 2017. With over 80 minutes of music, it delivers an expressive and vibrant soundscape that is a delight to dive into. With songs such as “Madiba Riddim,” “Lose You,” “Can’t Have Everything,” and “Passionfruit,” Drake explores a wide variety of sounds that keeps it fresh and engaging throughout. Yet—despite the variety—each track contains Drake’s quintessential style, tying it together with the genuine heart he puts into his work.\nLemonade by Beyonce\n(Columbia Records)\nStrain Pairing Recommendation: Electric Lemonade\nReleased in 2016, Lemonade took the music scene by storm—and with good reason. A modern masterpiece, Lemonade is a deeply personal musical journey through romantic tribulations and black American life in the modern age. The album moves seamlessly through each song, leading the listener along a ride of emotional ups and downs. Anger, grief, joy, triumph, self-love—Lemonade has it all. Paired with the visual album, it’s easy to see why it made a major, lasting impact on the musical world.\n\nRainbow by Kesha\n(Kemosabe)\nStrain Pairing Recommendation: Cherry Thunder Fuck\nRainbow is Kesha’s first album since 2014 due to her long legal battle with producer and abuser, Dr. Luke. Having now won back the rights to her own music, Kesha’s album, Rainbow, is an anthem of freedom, triumph, and a spirit that refuses to quit. With songs such as “Praying” and “Bastard,” which directly addresses the trials Kesha went through over the last few years, the album is deeply personal. On the other end, songs such as “Boogie Shoes” and “Woman” (featuring Dap Kings) are bursting with joy and strength, making Rainbow a well-rounded, emotional hit.\nThe Pinkprint (Deluxe) by Nicki Minaj\n(Republic)\nStrain Pairing Recommendation: Boss OG\nThe Pinkprint was released in 2014, but with Minaj hinting at a new 2018 release, there’s plenty of reason to get hyped about this album all over again. With 23 songs on the roster, Pinkprint gives fans plenty to unwrap during her hiatus, and for those who only know her from the hit “Anaconda,” it’s time to take a deeper look. The Pinkprint features a wide breadth of sound; the diverse tracks range in genre from hip-hop, soul, rap, to dance. Minaj brings all her talent to the table, showing off her skills as a great rapper and soulful singer. The contrast between songs such as “Feeling Myself” and “Grand Piano” exemplify Minaj’s ability to embrace any sound she wants and she packages it all into one fire album.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28131717/pop-albums-while-high.jpg","urlslug":"/news/lifestyle/5-vibrant-pop-albums-to-listen-to-while-high"}],"reviewCount":7,"flavors":[{"name":"Lemon","score":72.222222222222229},{"name":"Earthy","score":61.111111111111114},{"name":"Sweet","score":55.555555555555557},{"name":"Citrus","score":55.555555555555557},{"name":"Orange","score":55.555555555555557}],"effects":[{"name":"Creative","score":127.77777777777777},{"name":"Euphoric","score":122.22222222222223},{"name":"Uplifted","score":111.11111111111111},{"name":"Energetic","score":111.11111111111111},{"name":"Talkative","score":100}],"symptoms":[{"name":"Pain","score":61.111111111111114},{"name":"Stress","score":61.111111111111114},{"name":"Depression","score":55.555555555555557},{"name":"Inflammation","score":55.555555555555557},{"name":"Muscle Spasms","score":50}],"conditions":[{"name":"ADD/ADHD","score":61.111111111111114},{"name":"Anxiety","score":55.555555555555557},{"name":"Fibromyalgia","score":55.555555555555557},{"name":"Spinal Cord Injury","score":50},{"name":"Bipolar Disorder","score":50}],"negatives":[{"name":"Dry Eyes","score":16.666666666666664},{"name":"Dry Mouth","score":11.111111111111111},{"name":"Dizzy","score":5.5555555555555554}],"articlesAvailable":true,"articleTotalCount":1,"photos":[],"photoTotalCount":0,"popularCities":["Los Angeles, CA","Calgary, AB","Mississauga, ON","Montréal, QC","Ottawa, ON","Portland, OR","Toronto, ON","Vancouver, BC","Winnipeg, MB"],"permalink":"https://mobileapi.leafly.com/sativa/electric-lemonade","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.71428571428571/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Tahoe OG Kush","subtitle":null,"slug":"tahoe-og","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/tahoe-og","symbol":"Tok","applink":"leafly://strain/tahoe-og"},{"name":"Blue Dream","subtitle":null,"slug":"blue-dream","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/blue-dream","symbol":"Bd","applink":"leafly://strain/blue-dream"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
