{"sl_translate":"description,descriptionPlain,category","id":235,"slug":"berkeley","name":"Berkeley","subtitle":null,"symbol":"Brk","category":"Sativa","description":"\u003cp\u003eBerkeley is rumored to be the super-potent botany project of a student at the prestigious California university of the same name. This strain is certainly an overachiever with its extremely high THC content and lightning fast flowering time\u0026mdash;as short as 4 weeks! Berkeley is known to give energetic, buzzy effects that are typical of sativas. This strain will stimulate your mind, but beware, it may cause anxiety for some users.\u003c/p\u003e\n","descriptionPlain":"Berkeley is rumored to be the super-potent botany project of a student at the prestigious California university of the same name. This strain is certainly an overachiever with its extremely high THC content and lightning fast flowering time\u0026mdash;as short as 4 weeks! Berkeley is known to give energetic, buzzy effects that are typical of sativas. This strain will stimulate your mind, but beware, it may cause anxiety for some users.\n","aka":null,"rating":4.32,"highlightedReviews":[{"id":1383313,"username":"wilmap47","text":"The Berkeley I have tried comes from the Portland, OR area.  I have found it to be quite potent and a very up high.  I am a long time cannabis user, so it takes something good to impress me.\r\n\r\nOne problem with these reviews is that we might not actually be talking about the same strain even though it is named the same as something we previously tried.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1434796,"username":"SkinnySkeleton","text":"Was not a fan at all. Made me very anxious and uncomfterlbe. My head was spinning and I couldn\u0027t stop looking for cops or something. Made everybody at the party tweak out a bit. Smoke with extreme caution and never baseball a rip of this stuff!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/2/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59638","title":"States Mull \u0027Sanctuary\u0027 Status for Cannabis Businesses","author":"The Associated Press","category":null,"date":"\/Date(1520273516000)\/","text":"JUNEAU, Alaska (AP) — Taking a cue from the fight over immigration, some states that have legalized marijuana are considering providing so-called sanctuary status for licensed cannabis businesses, hoping to protect the fledgling industry from a shift in federal enforcement policy.\n\nJust hours after U.S. Attorney General Jeff Sessions announced on Jan. 4 that federal prosecutors would be free to crack down on marijuana operations as they see fit, Jesse Arreguin, the mayor in Berkeley, California, summoned city councilman Ben Bartlett to his office with a novel idea.\nBerkeley was already the first city in the nation to formally declare itself a sanctuary city on immigration, barring city officials from cooperating with federal authorities. Why not do the same thing with marijuana? Last month, it did.\n“We knew we had to do something,” Bartlett said. “This is a new engine of a healthy economy.”\n\nOthers may soon follow Berkeley’s lead: Alaska, California and Massachusetts lawmakers are among those with similar bills pending, though the chances for passage is unclear.\nAlaska state Rep. Adam Wool, who owns a movie, restaurant and concert venue with a liquor license in Fairbanks, said he introduced his bill as both a statement and a precaution.\n“If the federal government wants to prosecute someone for breaking federal law, I guess they have every right to do that,” said Wool, a Democrat from one of Alaska’s major marijuana-growing areas. “I’m just saying, we will have no obligation to assist them.”\n\nSessions’ announcement invalidated a 2013 policy that allowed for legalized marijuana to flourish by limiting federal enforcement of the drug, as long as states prevented it from getting to places it was outlawed and kept it from gangs and children. His action also unsettled the industry and spooked potential marijuana industry investors. Marijuana is still illegal under federal law.\nCasey O’Neill remembers helicopter enforcement raids of grow sites in California when he was growing up in the 1980s. It was then that his parents, carpenters who grew small amounts of cannabis, became school teachers, he said.\nHe now helps run a farm that produces vegetables and marijuana for medical use near Laytonville, California, and is glad lawmakers are looking at ways to push back against the federal government.\nOver the years, enforcement “has been uneven, we’ll say, and that’s kind of one of the things about it. It just means that everybody’s always afraid, and that’s hard,” he said.\n\nDale Gieringer, director of California NORML, a marijuana advocacy group, said California has a lousy history with the federal government on marijuana enforcement.\n“I don’t think the feds care too much about marijuana in Alaska, to tell you the truth,” he said. “But marijuana has been a big industry in this state, so we’re sort of on the front lines.”\nThere’s no apparent panic in the industry over Sessions’ change in policy, given limited federal resources and prosecutors having had discretion in bringing cases all along. But there isn’t complacency, either.\n“I don’t think the federal government is going to effectively step in and wipe us out of business. I just find that hard to believe at this point. But they can make it hard for us,” said Jennifer Canfield, who co-owns a state-licensed marijuana cultivation operation and retail store in Alaska’s capital city, Juneau.\n\nPeter Mlynarik, a police chief in Soldotna, Alaska, called the Alaska bill a terrible idea. He asked what would happen if a local agency were helping the federal government on a heroin bust but also found marijuana in the house.\n“It’s crazy to put that burden on, especially, police officers that are supposed to obey federal laws,” said Mlynarik, who resigned from Alaska’s marijuana regulatory board after Sessions’ actions in January, saying it stripped the underpinning for the state’s legal marijuana industry.\nMorgan Fox, a spokesman for the Marijuana Policy Project, said he can’t see federal agents raiding businesses that are complying with state law.\n“But you can’t put it past them,” he said, adding that new U.S. attorneys have been appointed by President Donald Trump in many states. “I wouldn’t put it past at least a few of them to want to gain points with their boss. But I think, politically, it would be a disaster for them.”\n\nMassachusetts’ sanctuary-style bill was prompted by comments from that state’s U.S. attorney, Andrew Lelling, who declined to rule out prosecuting commercial marijuana businesses that are legal under state law. He later said his priority would be prosecuting opioid crimes, not marijuana.\nU.S. Department of Justice spokeswoman Lauren Ehrsam declined comment on the pending bills.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/05100905/states-mull-sanctuary-status.jpg","urlslug":"/news/politics/states-mull-sanctuary-status-for-cannabis-businesses"},{"id":"contentitems-58759","title":"California City Cuts Cannabis Taxes, Others Expected to Follow","author":"Chris Roberts","category":null,"date":"\/Date(1519419841000)\/","text":"Berkeley isn’t so different from the rest of California, at least in that the legendarily laid-back Bay Area city greeted the beginning of the state’s commercial cannabis industry like a near-limitless ATM.\nWhen the first day of adult-use sales began Jan. 1, Berkeley sported some of the highest taxes in the state: 34.25%, which included a 10% local tax on top of state sales and excise taxes. California’s state taxes on cannabis were already among the highest in the nation, and Berkeley’s rate was even higher.\n\nOnce the novelty of buying $24 grams and $75 eights wore off, retailers faced a stark reality.\nMany of their longtime medical marijuana customers were gone—buying from underground farmers market-style events or patronizing illegal delivery services rather than forking over 30% to 40% more than they’d done just a few days earlier. The illicit market—the very economy that legalization was designed to topple—was thriving.\n\nIt took just six weeks for Berkeley to cave. Citing concerns from existing marijuana businesses that they were being taxed out of existence and expressing a desire to attract new operators—including women and people of color—the Berkeley City Council voted last week to cut the local tax in half, down to 5%.\nBerkeley’s tax relief takes effect at the end of March, and experts already predict other cities will follow suit. That’s good news for consumers as well as legitimate, taxpaying cannabis merchants in California, where warnings from experts, howls from the industry, and examples of high taxes in other states defeating legalization’s purpose have been widely ignored by revenue-hungry officials.\nAll marijuana in California is subjected to state excises and sales taxes, as well as a $9.25-per-ounce cultivation tax. (Medical cannabis patients only can avoid paying state sales tax, but only if they pay up to $100 to obtain a state-issued ID card, and to date, very few patients have.) Cities and counties are also able to levy further taxes, in some cases up to 20%.\nWhen all the taxes are tallied, the effective tax on cannabis ranges from 40% to 60%, as the California Growers Association, a statewide lobby representing marijuana farmers, observed this week.\n\nBerkeley’s early move towards tax relief “reflects the comparatively high level of state and local taxes on cannabis in California,” according to a report released this week from Fitch Ratings. The current high tax rates in the state aid “the competitive position of illegal markets,” Fitch noted.\nRosy revenue projections, based on figures from Colorado and Washington, where sales of legal marijuana exceed $1 billion annually, helped sell California voters on legalization, Fitch observed. But finding the just-right level of taxation that will steer consumers toward over-the-counter sales rather than the illegal market will take some time—and some restraint on the part of cash-hungry governments.\n“We’ve been screaming at these guys for three or four years to really watch out for the tax rate, because it’ll make the difference between the success of this regulatory environment or its failure,” said Matt Kumin, a San Francisco-based cannabis business attorney. “If [Berkeley’s move] is not a trend, the black market is going to win. And the regulations will fail.”\n\nA few other states have shown more restraint. Oregon’s effective tax rate is 18%, thanks in part to a cap on local tax rates at 3%. And some other cities in California are experimenting with lower tax rates to start. Los Angeles, for example, is levying a local gross receipts tax of 2.5%. San Francisco has yet to institute a local tax.\nThat’s how it should be done, according to Pat Oglesby, a tax expert who served on a panel convened by Lt. Gov. Gavin Newsom, a legalization supporter, to study the issue.\n“Early on, to beat the black market, some cannabis taxes should start low,” he wrote on an op-ed piece published earlier this month at The Hill.\nLocalities like Berkeley also have to worry about staying competitive. Consumers won’t mind spending a little more on gasoline to save money on marijuana if it’s cheaper a few towns over, he wrote.\n\nThe tax issue is resonating among policymakers in the state Capitol. A citizens’ panel attached to the state Bureau of Cannabis Control will examine the tax issue, and policy groups including the League of California Cities have suggested that a local tax rate of between 4% and 6% is the magic number.\nCalifornia’s history with taxation is mixed. The state is home to high gasoline and cigarette taxes, but has also seen anti-tax revolts—including 1978’s notorious Prop. 13, which essentially froze property taxes, forcing local governments to search elsewhere for revenue.\nCalifornia is also in a unique position. Marijuana, albeit for medical use, has been legal in the country’s most populous state longer than anywhere else—and there is more of it here than anywhere on the planet. A study commissioned by the state found that California produces 13.5 million pounds of marijuana a year—five times more than the state’s domestic market consumes. Which is to say, the state’s cannabis sector is bustling—but local governments might tax themselves out of their share.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/23124248/berkeley-cannabis-tax.jpg","urlslug":"/news/politics/california-city-cuts-cannabis-taxes-others-expected-to-follow"}],"reviewCount":19,"flavors":[{"name":"Citrus","score":14.807692307692308},{"name":"Sweet","score":12.884615384615385},{"name":"Pungent","score":12.884615384615385},{"name":"Earthy","score":10.961538461538462},{"name":"Menthol","score":10}],"effects":[{"name":"Happy","score":127.69230769230769},{"name":"Energetic","score":118.65384615384616},{"name":"Focused","score":112.88461538461539},{"name":"Creative","score":106.73076923076923},{"name":"Euphoric","score":105.76923076923077}],"symptoms":[{"name":"Stress","score":125.76923076923077},{"name":"Depression","score":114.80769230769231},{"name":"Fatigue","score":10},{"name":"Nausea","score":5.7692307692307692},{"name":"Lack of Appetite","score":2.8846153846153846}],"conditions":[{"name":"PTSD","score":101.92307692307692},{"name":"Bipolar Disorder","score":100},{"name":"Anxiety","score":14.807692307692308},{"name":"Arthritis","score":1.9230769230769231},{"name":"Migraines","score":1.9230769230769231}],"negatives":[{"name":"Anxious","score":23.846153846153847},{"name":"Dry Eyes","score":13.846153846153847},{"name":"Dry Mouth","score":12.884615384615385},{"name":"Paranoid","score":12.884615384615385},{"name":"Headache","score":11.923076923076923}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_843b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/547854/b/berkeley__primary_01a3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_2fa6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/401102/b/berkeley__primary_8403.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_e8e4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/388975/b/berkeley__primary_79a0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_eed8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/303740/b/berkeley__primary_5cd0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_a3f3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/303954/b/berkeley__primary_a185.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_0788.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/155279/b/berkeley_825x550_9240.jpg"}],"photoTotalCount":9,"popularCities":["Seattle, WA"],"permalink":"https://mobileapi.leafly.com/sativa/berkeley","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.31578947368421/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":235,"slug":"berkeley","name":"Berkeley","subtitle":null,"symbol":"Brk","category":"Sativa","description":"\u003cp\u003eBerkeley is rumored to be the super-potent botany project of a student at the prestigious California university of the same name. This strain is certainly an overachiever with its extremely high THC content and lightning fast flowering time\u0026mdash;as short as 4 weeks! Berkeley is known to give energetic, buzzy effects that are typical of sativas. This strain will stimulate your mind, but beware, it may cause anxiety for some users.\u003c/p\u003e\n","descriptionPlain":"Berkeley is rumored to be the super-potent botany project of a student at the prestigious California university of the same name. This strain is certainly an overachiever with its extremely high THC content and lightning fast flowering time\u0026mdash;as short as 4 weeks! Berkeley is known to give energetic, buzzy effects that are typical of sativas. This strain will stimulate your mind, but beware, it may cause anxiety for some users.\n","aka":null,"rating":4.32,"highlightedReviews":[{"id":1383313,"username":"wilmap47","text":"The Berkeley I have tried comes from the Portland, OR area.  I have found it to be quite potent and a very up high.  I am a long time cannabis user, so it takes something good to impress me.\r\n\r\nOne problem with these reviews is that we might not actually be talking about the same strain even though it is named the same as something we previously tried.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1434796,"username":"SkinnySkeleton","text":"Was not a fan at all. Made me very anxious and uncomfterlbe. My head was spinning and I couldn\u0027t stop looking for cops or something. Made everybody at the party tweak out a bit. Smoke with extreme caution and never baseball a rip of this stuff!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/2/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59638","title":"States Mull \u0027Sanctuary\u0027 Status for Cannabis Businesses","author":"The Associated Press","category":null,"date":"\/Date(1520273516000)\/","text":"JUNEAU, Alaska (AP) — Taking a cue from the fight over immigration, some states that have legalized marijuana are considering providing so-called sanctuary status for licensed cannabis businesses, hoping to protect the fledgling industry from a shift in federal enforcement policy.\n\nJust hours after U.S. Attorney General Jeff Sessions announced on Jan. 4 that federal prosecutors would be free to crack down on marijuana operations as they see fit, Jesse Arreguin, the mayor in Berkeley, California, summoned city councilman Ben Bartlett to his office with a novel idea.\nBerkeley was already the first city in the nation to formally declare itself a sanctuary city on immigration, barring city officials from cooperating with federal authorities. Why not do the same thing with marijuana? Last month, it did.\n“We knew we had to do something,” Bartlett said. “This is a new engine of a healthy economy.”\n\nOthers may soon follow Berkeley’s lead: Alaska, California and Massachusetts lawmakers are among those with similar bills pending, though the chances for passage is unclear.\nAlaska state Rep. Adam Wool, who owns a movie, restaurant and concert venue with a liquor license in Fairbanks, said he introduced his bill as both a statement and a precaution.\n“If the federal government wants to prosecute someone for breaking federal law, I guess they have every right to do that,” said Wool, a Democrat from one of Alaska’s major marijuana-growing areas. “I’m just saying, we will have no obligation to assist them.”\n\nSessions’ announcement invalidated a 2013 policy that allowed for legalized marijuana to flourish by limiting federal enforcement of the drug, as long as states prevented it from getting to places it was outlawed and kept it from gangs and children. His action also unsettled the industry and spooked potential marijuana industry investors. Marijuana is still illegal under federal law.\nCasey O’Neill remembers helicopter enforcement raids of grow sites in California when he was growing up in the 1980s. It was then that his parents, carpenters who grew small amounts of cannabis, became school teachers, he said.\nHe now helps run a farm that produces vegetables and marijuana for medical use near Laytonville, California, and is glad lawmakers are looking at ways to push back against the federal government.\nOver the years, enforcement “has been uneven, we’ll say, and that’s kind of one of the things about it. It just means that everybody’s always afraid, and that’s hard,” he said.\n\nDale Gieringer, director of California NORML, a marijuana advocacy group, said California has a lousy history with the federal government on marijuana enforcement.\n“I don’t think the feds care too much about marijuana in Alaska, to tell you the truth,” he said. “But marijuana has been a big industry in this state, so we’re sort of on the front lines.”\nThere’s no apparent panic in the industry over Sessions’ change in policy, given limited federal resources and prosecutors having had discretion in bringing cases all along. But there isn’t complacency, either.\n“I don’t think the federal government is going to effectively step in and wipe us out of business. I just find that hard to believe at this point. But they can make it hard for us,” said Jennifer Canfield, who co-owns a state-licensed marijuana cultivation operation and retail store in Alaska’s capital city, Juneau.\n\nPeter Mlynarik, a police chief in Soldotna, Alaska, called the Alaska bill a terrible idea. He asked what would happen if a local agency were helping the federal government on a heroin bust but also found marijuana in the house.\n“It’s crazy to put that burden on, especially, police officers that are supposed to obey federal laws,” said Mlynarik, who resigned from Alaska’s marijuana regulatory board after Sessions’ actions in January, saying it stripped the underpinning for the state’s legal marijuana industry.\nMorgan Fox, a spokesman for the Marijuana Policy Project, said he can’t see federal agents raiding businesses that are complying with state law.\n“But you can’t put it past them,” he said, adding that new U.S. attorneys have been appointed by President Donald Trump in many states. “I wouldn’t put it past at least a few of them to want to gain points with their boss. But I think, politically, it would be a disaster for them.”\n\nMassachusetts’ sanctuary-style bill was prompted by comments from that state’s U.S. attorney, Andrew Lelling, who declined to rule out prosecuting commercial marijuana businesses that are legal under state law. He later said his priority would be prosecuting opioid crimes, not marijuana.\nU.S. Department of Justice spokeswoman Lauren Ehrsam declined comment on the pending bills.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/05100905/states-mull-sanctuary-status.jpg","urlslug":"/news/politics/states-mull-sanctuary-status-for-cannabis-businesses"},{"id":"contentitems-58759","title":"California City Cuts Cannabis Taxes, Others Expected to Follow","author":"Chris Roberts","category":null,"date":"\/Date(1519419841000)\/","text":"Berkeley isn’t so different from the rest of California, at least in that the legendarily laid-back Bay Area city greeted the beginning of the state’s commercial cannabis industry like a near-limitless ATM.\nWhen the first day of adult-use sales began Jan. 1, Berkeley sported some of the highest taxes in the state: 34.25%, which included a 10% local tax on top of state sales and excise taxes. California’s state taxes on cannabis were already among the highest in the nation, and Berkeley’s rate was even higher.\n\nOnce the novelty of buying $24 grams and $75 eights wore off, retailers faced a stark reality.\nMany of their longtime medical marijuana customers were gone—buying from underground farmers market-style events or patronizing illegal delivery services rather than forking over 30% to 40% more than they’d done just a few days earlier. The illicit market—the very economy that legalization was designed to topple—was thriving.\n\nIt took just six weeks for Berkeley to cave. Citing concerns from existing marijuana businesses that they were being taxed out of existence and expressing a desire to attract new operators—including women and people of color—the Berkeley City Council voted last week to cut the local tax in half, down to 5%.\nBerkeley’s tax relief takes effect at the end of March, and experts already predict other cities will follow suit. That’s good news for consumers as well as legitimate, taxpaying cannabis merchants in California, where warnings from experts, howls from the industry, and examples of high taxes in other states defeating legalization’s purpose have been widely ignored by revenue-hungry officials.\nAll marijuana in California is subjected to state excises and sales taxes, as well as a $9.25-per-ounce cultivation tax. (Medical cannabis patients only can avoid paying state sales tax, but only if they pay up to $100 to obtain a state-issued ID card, and to date, very few patients have.) Cities and counties are also able to levy further taxes, in some cases up to 20%.\nWhen all the taxes are tallied, the effective tax on cannabis ranges from 40% to 60%, as the California Growers Association, a statewide lobby representing marijuana farmers, observed this week.\n\nBerkeley’s early move towards tax relief “reflects the comparatively high level of state and local taxes on cannabis in California,” according to a report released this week from Fitch Ratings. The current high tax rates in the state aid “the competitive position of illegal markets,” Fitch noted.\nRosy revenue projections, based on figures from Colorado and Washington, where sales of legal marijuana exceed $1 billion annually, helped sell California voters on legalization, Fitch observed. But finding the just-right level of taxation that will steer consumers toward over-the-counter sales rather than the illegal market will take some time—and some restraint on the part of cash-hungry governments.\n“We’ve been screaming at these guys for three or four years to really watch out for the tax rate, because it’ll make the difference between the success of this regulatory environment or its failure,” said Matt Kumin, a San Francisco-based cannabis business attorney. “If [Berkeley’s move] is not a trend, the black market is going to win. And the regulations will fail.”\n\nA few other states have shown more restraint. Oregon’s effective tax rate is 18%, thanks in part to a cap on local tax rates at 3%. And some other cities in California are experimenting with lower tax rates to start. Los Angeles, for example, is levying a local gross receipts tax of 2.5%. San Francisco has yet to institute a local tax.\nThat’s how it should be done, according to Pat Oglesby, a tax expert who served on a panel convened by Lt. Gov. Gavin Newsom, a legalization supporter, to study the issue.\n“Early on, to beat the black market, some cannabis taxes should start low,” he wrote on an op-ed piece published earlier this month at The Hill.\nLocalities like Berkeley also have to worry about staying competitive. Consumers won’t mind spending a little more on gasoline to save money on marijuana if it’s cheaper a few towns over, he wrote.\n\nThe tax issue is resonating among policymakers in the state Capitol. A citizens’ panel attached to the state Bureau of Cannabis Control will examine the tax issue, and policy groups including the League of California Cities have suggested that a local tax rate of between 4% and 6% is the magic number.\nCalifornia’s history with taxation is mixed. The state is home to high gasoline and cigarette taxes, but has also seen anti-tax revolts—including 1978’s notorious Prop. 13, which essentially froze property taxes, forcing local governments to search elsewhere for revenue.\nCalifornia is also in a unique position. Marijuana, albeit for medical use, has been legal in the country’s most populous state longer than anywhere else—and there is more of it here than anywhere on the planet. A study commissioned by the state found that California produces 13.5 million pounds of marijuana a year—five times more than the state’s domestic market consumes. Which is to say, the state’s cannabis sector is bustling—but local governments might tax themselves out of their share.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/23124248/berkeley-cannabis-tax.jpg","urlslug":"/news/politics/california-city-cuts-cannabis-taxes-others-expected-to-follow"}],"reviewCount":19,"flavors":[{"name":"Citrus","score":14.807692307692308},{"name":"Sweet","score":12.884615384615385},{"name":"Pungent","score":12.884615384615385},{"name":"Earthy","score":10.961538461538462},{"name":"Menthol","score":10}],"effects":[{"name":"Happy","score":127.69230769230769},{"name":"Energetic","score":118.65384615384616},{"name":"Focused","score":112.88461538461539},{"name":"Creative","score":106.73076923076923},{"name":"Euphoric","score":105.76923076923077}],"symptoms":[{"name":"Stress","score":125.76923076923077},{"name":"Depression","score":114.80769230769231},{"name":"Fatigue","score":10},{"name":"Nausea","score":5.7692307692307692},{"name":"Lack of Appetite","score":2.8846153846153846}],"conditions":[{"name":"PTSD","score":101.92307692307692},{"name":"Bipolar Disorder","score":100},{"name":"Anxiety","score":14.807692307692308},{"name":"Arthritis","score":1.9230769230769231},{"name":"Migraines","score":1.9230769230769231}],"negatives":[{"name":"Anxious","score":23.846153846153847},{"name":"Dry Eyes","score":13.846153846153847},{"name":"Dry Mouth","score":12.884615384615385},{"name":"Paranoid","score":12.884615384615385},{"name":"Headache","score":11.923076923076923}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_843b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/547854/b/berkeley__primary_01a3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_2fa6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/401102/b/berkeley__primary_8403.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_e8e4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/388975/b/berkeley__primary_79a0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_eed8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/303740/b/berkeley__primary_5cd0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_a3f3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/303954/b/berkeley__primary_a185.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_0788.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/155279/b/berkeley_825x550_9240.jpg"}],"photoTotalCount":9,"popularCities":["Seattle, WA"],"permalink":"https://mobileapi.leafly.com/sativa/berkeley","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.31578947368421/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":235,"slug":"berkeley","name":"Berkeley","subtitle":null,"symbol":"Brk","category":"Sativa","description":"\u003cp\u003eBerkeley is rumored to be the super-potent botany project of a student at the prestigious California university of the same name. This strain is certainly an overachiever with its extremely high THC content and lightning fast flowering time\u0026mdash;as short as 4 weeks! Berkeley is known to give energetic, buzzy effects that are typical of sativas. This strain will stimulate your mind, but beware, it may cause anxiety for some users.\u003c/p\u003e\n","descriptionPlain":"Berkeley is rumored to be the super-potent botany project of a student at the prestigious California university of the same name. This strain is certainly an overachiever with its extremely high THC content and lightning fast flowering time\u0026mdash;as short as 4 weeks! Berkeley is known to give energetic, buzzy effects that are typical of sativas. This strain will stimulate your mind, but beware, it may cause anxiety for some users.\n","aka":null,"rating":4.32,"highlightedReviews":[{"id":1383313,"username":"wilmap47","text":"The Berkeley I have tried comes from the Portland, OR area.  I have found it to be quite potent and a very up high.  I am a long time cannabis user, so it takes something good to impress me.\r\n\r\nOne problem with these reviews is that we might not actually be talking about the same strain even though it is named the same as something we previously tried.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"},{"id":1434796,"username":"SkinnySkeleton","text":"Was not a fan at all. Made me very anxious and uncomfterlbe. My head was spinning and I couldn\u0027t stop looking for cops or something. Made everybody at the party tweak out a bit. Smoke with extreme caution and never baseball a rip of this stuff!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/2/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59638","title":"States Mull \u0027Sanctuary\u0027 Status for Cannabis Businesses","author":"The Associated Press","category":null,"date":"\/Date(1520273516000)\/","text":"JUNEAU, Alaska (AP) — Taking a cue from the fight over immigration, some states that have legalized marijuana are considering providing so-called sanctuary status for licensed cannabis businesses, hoping to protect the fledgling industry from a shift in federal enforcement policy.\n\nJust hours after U.S. Attorney General Jeff Sessions announced on Jan. 4 that federal prosecutors would be free to crack down on marijuana operations as they see fit, Jesse Arreguin, the mayor in Berkeley, California, summoned city councilman Ben Bartlett to his office with a novel idea.\nBerkeley was already the first city in the nation to formally declare itself a sanctuary city on immigration, barring city officials from cooperating with federal authorities. Why not do the same thing with marijuana? Last month, it did.\n“We knew we had to do something,” Bartlett said. “This is a new engine of a healthy economy.”\n\nOthers may soon follow Berkeley’s lead: Alaska, California and Massachusetts lawmakers are among those with similar bills pending, though the chances for passage is unclear.\nAlaska state Rep. Adam Wool, who owns a movie, restaurant and concert venue with a liquor license in Fairbanks, said he introduced his bill as both a statement and a precaution.\n“If the federal government wants to prosecute someone for breaking federal law, I guess they have every right to do that,” said Wool, a Democrat from one of Alaska’s major marijuana-growing areas. “I’m just saying, we will have no obligation to assist them.”\n\nSessions’ announcement invalidated a 2013 policy that allowed for legalized marijuana to flourish by limiting federal enforcement of the drug, as long as states prevented it from getting to places it was outlawed and kept it from gangs and children. His action also unsettled the industry and spooked potential marijuana industry investors. Marijuana is still illegal under federal law.\nCasey O’Neill remembers helicopter enforcement raids of grow sites in California when he was growing up in the 1980s. It was then that his parents, carpenters who grew small amounts of cannabis, became school teachers, he said.\nHe now helps run a farm that produces vegetables and marijuana for medical use near Laytonville, California, and is glad lawmakers are looking at ways to push back against the federal government.\nOver the years, enforcement “has been uneven, we’ll say, and that’s kind of one of the things about it. It just means that everybody’s always afraid, and that’s hard,” he said.\n\nDale Gieringer, director of California NORML, a marijuana advocacy group, said California has a lousy history with the federal government on marijuana enforcement.\n“I don’t think the feds care too much about marijuana in Alaska, to tell you the truth,” he said. “But marijuana has been a big industry in this state, so we’re sort of on the front lines.”\nThere’s no apparent panic in the industry over Sessions’ change in policy, given limited federal resources and prosecutors having had discretion in bringing cases all along. But there isn’t complacency, either.\n“I don’t think the federal government is going to effectively step in and wipe us out of business. I just find that hard to believe at this point. But they can make it hard for us,” said Jennifer Canfield, who co-owns a state-licensed marijuana cultivation operation and retail store in Alaska’s capital city, Juneau.\n\nPeter Mlynarik, a police chief in Soldotna, Alaska, called the Alaska bill a terrible idea. He asked what would happen if a local agency were helping the federal government on a heroin bust but also found marijuana in the house.\n“It’s crazy to put that burden on, especially, police officers that are supposed to obey federal laws,” said Mlynarik, who resigned from Alaska’s marijuana regulatory board after Sessions’ actions in January, saying it stripped the underpinning for the state’s legal marijuana industry.\nMorgan Fox, a spokesman for the Marijuana Policy Project, said he can’t see federal agents raiding businesses that are complying with state law.\n“But you can’t put it past them,” he said, adding that new U.S. attorneys have been appointed by President Donald Trump in many states. “I wouldn’t put it past at least a few of them to want to gain points with their boss. But I think, politically, it would be a disaster for them.”\n\nMassachusetts’ sanctuary-style bill was prompted by comments from that state’s U.S. attorney, Andrew Lelling, who declined to rule out prosecuting commercial marijuana businesses that are legal under state law. He later said his priority would be prosecuting opioid crimes, not marijuana.\nU.S. Department of Justice spokeswoman Lauren Ehrsam declined comment on the pending bills.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/05100905/states-mull-sanctuary-status.jpg","urlslug":"/news/politics/states-mull-sanctuary-status-for-cannabis-businesses"},{"id":"contentitems-58759","title":"California City Cuts Cannabis Taxes, Others Expected to Follow","author":"Chris Roberts","category":null,"date":"\/Date(1519419841000)\/","text":"Berkeley isn’t so different from the rest of California, at least in that the legendarily laid-back Bay Area city greeted the beginning of the state’s commercial cannabis industry like a near-limitless ATM.\nWhen the first day of adult-use sales began Jan. 1, Berkeley sported some of the highest taxes in the state: 34.25%, which included a 10% local tax on top of state sales and excise taxes. California’s state taxes on cannabis were already among the highest in the nation, and Berkeley’s rate was even higher.\n\nOnce the novelty of buying $24 grams and $75 eights wore off, retailers faced a stark reality.\nMany of their longtime medical marijuana customers were gone—buying from underground farmers market-style events or patronizing illegal delivery services rather than forking over 30% to 40% more than they’d done just a few days earlier. The illicit market—the very economy that legalization was designed to topple—was thriving.\n\nIt took just six weeks for Berkeley to cave. Citing concerns from existing marijuana businesses that they were being taxed out of existence and expressing a desire to attract new operators—including women and people of color—the Berkeley City Council voted last week to cut the local tax in half, down to 5%.\nBerkeley’s tax relief takes effect at the end of March, and experts already predict other cities will follow suit. That’s good news for consumers as well as legitimate, taxpaying cannabis merchants in California, where warnings from experts, howls from the industry, and examples of high taxes in other states defeating legalization’s purpose have been widely ignored by revenue-hungry officials.\nAll marijuana in California is subjected to state excises and sales taxes, as well as a $9.25-per-ounce cultivation tax. (Medical cannabis patients only can avoid paying state sales tax, but only if they pay up to $100 to obtain a state-issued ID card, and to date, very few patients have.) Cities and counties are also able to levy further taxes, in some cases up to 20%.\nWhen all the taxes are tallied, the effective tax on cannabis ranges from 40% to 60%, as the California Growers Association, a statewide lobby representing marijuana farmers, observed this week.\n\nBerkeley’s early move towards tax relief “reflects the comparatively high level of state and local taxes on cannabis in California,” according to a report released this week from Fitch Ratings. The current high tax rates in the state aid “the competitive position of illegal markets,” Fitch noted.\nRosy revenue projections, based on figures from Colorado and Washington, where sales of legal marijuana exceed $1 billion annually, helped sell California voters on legalization, Fitch observed. But finding the just-right level of taxation that will steer consumers toward over-the-counter sales rather than the illegal market will take some time—and some restraint on the part of cash-hungry governments.\n“We’ve been screaming at these guys for three or four years to really watch out for the tax rate, because it’ll make the difference between the success of this regulatory environment or its failure,” said Matt Kumin, a San Francisco-based cannabis business attorney. “If [Berkeley’s move] is not a trend, the black market is going to win. And the regulations will fail.”\n\nA few other states have shown more restraint. Oregon’s effective tax rate is 18%, thanks in part to a cap on local tax rates at 3%. And some other cities in California are experimenting with lower tax rates to start. Los Angeles, for example, is levying a local gross receipts tax of 2.5%. San Francisco has yet to institute a local tax.\nThat’s how it should be done, according to Pat Oglesby, a tax expert who served on a panel convened by Lt. Gov. Gavin Newsom, a legalization supporter, to study the issue.\n“Early on, to beat the black market, some cannabis taxes should start low,” he wrote on an op-ed piece published earlier this month at The Hill.\nLocalities like Berkeley also have to worry about staying competitive. Consumers won’t mind spending a little more on gasoline to save money on marijuana if it’s cheaper a few towns over, he wrote.\n\nThe tax issue is resonating among policymakers in the state Capitol. A citizens’ panel attached to the state Bureau of Cannabis Control will examine the tax issue, and policy groups including the League of California Cities have suggested that a local tax rate of between 4% and 6% is the magic number.\nCalifornia’s history with taxation is mixed. The state is home to high gasoline and cigarette taxes, but has also seen anti-tax revolts—including 1978’s notorious Prop. 13, which essentially froze property taxes, forcing local governments to search elsewhere for revenue.\nCalifornia is also in a unique position. Marijuana, albeit for medical use, has been legal in the country’s most populous state longer than anywhere else—and there is more of it here than anywhere on the planet. A study commissioned by the state found that California produces 13.5 million pounds of marijuana a year—five times more than the state’s domestic market consumes. Which is to say, the state’s cannabis sector is bustling—but local governments might tax themselves out of their share.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/23124248/berkeley-cannabis-tax.jpg","urlslug":"/news/politics/california-city-cuts-cannabis-taxes-others-expected-to-follow"}],"reviewCount":19,"flavors":[{"name":"Citrus","score":14.807692307692308},{"name":"Sweet","score":12.884615384615385},{"name":"Pungent","score":12.884615384615385},{"name":"Earthy","score":10.961538461538462},{"name":"Menthol","score":10}],"effects":[{"name":"Happy","score":127.69230769230769},{"name":"Energetic","score":118.65384615384616},{"name":"Focused","score":112.88461538461539},{"name":"Creative","score":106.73076923076923},{"name":"Euphoric","score":105.76923076923077}],"symptoms":[{"name":"Stress","score":125.76923076923077},{"name":"Depression","score":114.80769230769231},{"name":"Fatigue","score":10},{"name":"Nausea","score":5.7692307692307692},{"name":"Lack of Appetite","score":2.8846153846153846}],"conditions":[{"name":"PTSD","score":101.92307692307692},{"name":"Bipolar Disorder","score":100},{"name":"Anxiety","score":14.807692307692308},{"name":"Arthritis","score":1.9230769230769231},{"name":"Migraines","score":1.9230769230769231}],"negatives":[{"name":"Anxious","score":23.846153846153847},{"name":"Dry Eyes","score":13.846153846153847},{"name":"Dry Mouth","score":12.884615384615385},{"name":"Paranoid","score":12.884615384615385},{"name":"Headache","score":11.923076923076923}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_843b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/547854/b/berkeley__primary_01a3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_2fa6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/401102/b/berkeley__primary_8403.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_e8e4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/388975/b/berkeley__primary_79a0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_eed8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/303740/b/berkeley__primary_5cd0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_a3f3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/303954/b/berkeley__primary_a185.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/berkeley_100x100_0788.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/155279/b/berkeley_825x550_9240.jpg"}],"photoTotalCount":9,"popularCities":["Seattle, WA"],"permalink":"https://mobileapi.leafly.com/sativa/berkeley","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.31578947368421/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
