{"sl_translate":"description,descriptionPlain,category","id":231759,"slug":"bob-saget","name":"Bob Saget","subtitle":null,"symbol":"Bob","category":"Sativa","description":"\u003cp\u003eBob Saget is a stimulating sativa that won 2nd place at the 2016 Colorado Cannabis Cup. This addled comedian gets the heart pumping, stimulating the consumer to the point of agitation. But fear not, the energy subsides and settles into an uplifted, cerebral haze that is lucid, yet spacey. As this strong sativa fades, expect a stoney crash that represents Saget\u0026rsquo;s latent \u003ca href=\"https://www.leafly.com/indica/pre-98-bubba-kush\"\u003ePre-98 Bubba Kush\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/indica/afghani\"\u003eAfghani \u003c/a\u003egenetics.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Bob Saget is a stimulating sativa that won 2nd place at the 2016 Colorado Cannabis Cup. This addled comedian gets the heart pumping, stimulating the consumer to the point of agitation. But fear not, the energy subsides and settles into an uplifted, cerebral haze that is lucid, yet spacey. As this strong sativa fades, expect a stoney crash that represents Saget\u0026rsquo;s latent Pre-98 Bubba Kush and Afghani genetics.\u0026nbsp;\n","aka":"The Bob","rating":4.64,"highlightedReviews":[{"id":1359952,"username":"Michael9000","text":"My friend and I smoke this out of the bond and gave a no disappointment. Very heavy high, but not couch locked you can still be doing activities. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png"},{"id":1625767,"username":"SlabDabSquad710","text":"Grew this strain outdoor last year. Yeild was amazing crystals just covered the whole bud. It had its very own unique smell and it tasted just like it smelt. Highly recommended for anyone that grows and want something a little different","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3796","title":"New Strains Alert: Bob Saget, Don Shula, Magnum PI, and More","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1466791200000)\/","text":"This week’s New Strains Alert is a cast of unusual characters. With guest appearances by Bob Saget, Don Shula, Magnum PI, Thai Girl, and Dizzy Wright’s Dizzy OG, this alert is the type of crowd you want to start your weekend with. These distinguished strains offer a variety of effects suited, in one form or fashion, to their names. So whether you’re the father of a full house or a West Coast wunderkind dropping red-hot rhymes, these strains will light you up, chill you out, and soothe what ails you. \n \n   Bob Saget\n\nBob Saget is a stimulating sativa that won 2nd place at the 2016 Colorado Cannabis Cup. This addled comedian gets the heart pumping, stimulating the consumer to the point of agitation. But fear not, the energy subsides and settles into an uplifted, cerebral haze that is lucid, yet spacey. As this strong sativa fades, expect a stoney crash that represents Saget’s latent Pre-98 Bubba Kush and Afghani genetics.\n\n \n   Don Shula\n\nDon Shula, 3rd place winner of Best Hybrid Flower at the 2016 Colorado Cannabis Cup, crosses The White and Diagonal (True OG x East Coast Sour Diesel) to create a hybrid that sits upright in the body and mind. Exhibiting functional OG effects, this pungent strain is a comfortable middle ground for indica-dominant enthusiasts seeking an all-day strain.\n\n \n   Magnum PI\n\nMagnum PI is a sativa-dominant strain with its genetic origins cloaked in a Hawaiian shirt of pure mystery. This stimulating cross, supposedly created by Seahorse Gardens near the Puget Sound, exhibits hints of citrus and sweet earth on the nose. The effects have been described as clear-headed and stimulating, which makes this strain a perfect accompaniment for outdoor activities.\n\n \n   Thai Girl\n\nThai Girl is supposedly the result of seeds found by Gold King in Thai Stick crossed against Tres Dawg. This sativa-dominant hybrid was cultivated in the late 70’s and spread the euphoric stimulation native to Southeast Asian herb across the cannabis world. Enjoy this tropical bud in the sunshine, as it encourages physical activity without overstimulation.\n\n \n   Dizzy OG\n\nDizzy OG took 2nd place for Best Medical Hybrid Flower at the 2016 SoCal Cannabis Cup and is the official strain of Las Vegas hip-hop luminary Dizzy Wright. This strain has traditional OG qualities, including a heavy yet functional body buzz that sticks to the bones. With slightly sweeter terpenoids than traditional OG strains, this hybrid is an all-day smoke for the seasoned consumer, but can lean toward full sedation in larger doses.\n\n \n   Frank\u0027s Gift\n\nFrank’s Gift is a phenomenal phenotype of Skunk Haze that has been known to generate upwards of 20% CBD. This strain delivers a nearly mythological ratio of CBD/THC that lends itself to a variety of medical uses associated with physical discomfort, inflammation, and anxiety. Though Frank’s Gift has predominantly appeared in Oregon, it’s slowly being disseminated throughout the West Coast.   \n\n \n   Pink Sunset\n\nPink Sunset is the indica phenotype of the delicious indica-dominant hybrid Sunset Sherbet. This sugary strain has roots in GSC (f.k.a Girl Scout Cookies), but pushes the functional sedation of its OG Kush and Cherry Pie parentage into the realm of full-body relaxation. Use this strain after work to unwind or on the way to bed as a dreamy dessert that combats insomnia, chronic pain, and nausea.  \n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/16214745/new-strains-alert-bob-saget-don-shula-magnum-pi-and-more.png","urlslug":"/news/strains-products/new-strains-alert-bob-saget-don-shula-magnum-pi-and-more"}],"reviewCount":11,"flavors":[{"name":"Sage","score":34.375},{"name":"Diesel","score":28.125},{"name":"Earthy","score":25},{"name":"Chemical","score":9.375},{"name":"Sweet","score":3.125}],"effects":[{"name":"Uplifted","score":87.5},{"name":"Happy","score":87.5},{"name":"Creative","score":59.375},{"name":"Relaxed","score":59.375},{"name":"Talkative","score":56.25}],"symptoms":[{"name":"Depression","score":31.25},{"name":"Stress","score":31.25},{"name":"Fatigue","score":28.125},{"name":"Pain","score":28.125},{"name":"Cramps","score":25}],"conditions":[{"name":"Anxiety","score":28.125},{"name":"PMS","score":28.125},{"name":"ADD/ADHD","score":25},{"name":"Alzheimer\u0027s","score":25},{"name":"Crohn\u0027s Disease","score":25}],"negatives":[{"name":"Dry Mouth","score":53.125},{"name":"Dizzy","score":25}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/bob-saget_100x100_3882.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/582138/b/bob-saget__primary_cc77.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/bob-saget_100x100_2729.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/509394/b/bob-saget__primary_ce8f.jpg"}],"photoTotalCount":2,"popularCities":["Denver, CO","Mendocino,CA"],"permalink":"https://mobileapi.leafly.com/sativa/bob-saget","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.63636363636364/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"SAGE","subtitle":null,"slug":"sage","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/sage","symbol":"Sg","applink":"leafly://strain/sage"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
