{"sl_translate":"description,descriptionPlain,category","id":172592,"slug":"dance-world","name":"Dance World","subtitle":null,"symbol":"Dw","category":"Sativa","description":"\u003cp\u003eDance World is a \u003ca href=\"https://www.leafly.com/news/cannabis-101/whats-the-deal-with-these-high-cbd-strains\"\u003ehigh-CBD\u003c/a\u003e sativa strain bred by Royal Queen Seeds in Spain. A cross between \u003ca href=\"https://www.leafly.com/hybrid/dancehall\"\u003eDancehall\u003c/a\u003e and Juanita La Lagrimosa, Dance World\u0026rsquo;s heritage stems primarily from Afghani and Mexican genetics. From its Dancehall parent, Dance World inherits active, uplifting effects that motivate productivity and a positive mindset. Earthy and spicy flavors dominate the palate, but subtle fruity notes bring Dance World sweet undertones. While Dance World shows its sativa genetics in its energetic effects, Dance World plants are more indica in stature and flower after just 8 weeks.\u003c/p\u003e\n","descriptionPlain":"Dance World is a high-CBD sativa strain bred by Royal Queen Seeds in Spain. A cross between Dancehall and Juanita La Lagrimosa, Dance World\u0026rsquo;s heritage stems primarily from Afghani and Mexican genetics. From its Dancehall parent, Dance World inherits active, uplifting effects that motivate productivity and a positive mindset. Earthy and spicy flavors dominate the palate, but subtle fruity notes bring Dance World sweet undertones. While Dance World shows its sativa genetics in its energetic effects, Dance World plants are more indica in stature and flower after just 8 weeks.\n","aka":"Danceworld","rating":4.54,"highlightedReviews":[{"id":1413529,"username":"Aimeej32","text":"Dance world\u0027s lower THC and higher CBD make for a smoke that\u0027s not too stony yet it still gives a very subtle, uplifting head with a relaxed body. Good for those looking for the benefits of a high CBD strain or those who want a little high without being too stoned. Light, earthy yet sweet smell. Subtle spicy and sweet flavor.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1605168,"username":"VictoriaWallace","text":"Growing this now as we speak. Definitely sativa type, with loose budspacing (is that a word?). Lot\u0027s of variation in height from plant-to-plant. My skunk no. 1\u0027s are flowering *much* earlier, and my DW\u0027s are all over the map; most are maybe 3 weeks from finishing \u0026 one is just now showing frost. New hybrid I guess. Lavender. VERY lavender (which is nice, IMHO). Not getting the citrus \u0026c. at all actually. All seeds sprouted, but 40% of plants died within 1st 2 weeks. Hope it\u0027s worth it.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59186","title":"Which Cannabis Strains Are Highest in CBD, According to Lab Data?","author":"Bailey Rahn","category":null,"date":"\/Date(1519851079000)\/","text":"Cannabidiol, or CBD, is becoming a mainstay in consumers’ medicine cabinets as it combats pain, inflammation, anxiety, and much more. However, even as CBD strains and products become more readily available, the price tag can often make one flinch. For this reason, it’s worth knowing which products will bring the best value based on CBD abundance.\n\nLooking at data from cannabis testing labs across Washington State, we compiled a list of strains that tend to produce significant amount of CBD. These numbers are derived from the testing samples of cannabis flowers and do not include CBD concentrates.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nIn the above graph, you’ll find the average cannabinoid contents of ten popular CBD-dominant strains. You’ll notice that many of these strains contain only trace amounts of THC, while others exhibit a more balanced CBD:THC ratio (which means they will be more euphoric in effect). This graph is based on datasets from multiple reliable testing labs across Washington State. However, it’s worth noting that the datasets from each individual lab differ slightly.\nTake a look at the cannabinoid data from one lab, and notice how the numbers shift slightly.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nMost strains maintain a CBD:THC ratio similar to that in the averaged dataset. However, you’ll also see deviations, like ACDC which exhibits a more balanced CBD:THC ratio according to this lab’s individual testing results.\nNow let’s see how the dataset of Lab A compares to a different lab, also represented in the larger, averaged dataset above.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nAs you can see, the CBD levels from Lab B are much higher on average than those from Lab A. There are a number of possible explanations for this. A lab may manufacture bloated cannabinoid profiles, as we’ve seen some labs do in the past. It could also be that Lab B simply tested samples from growers who achieved higher CBD levels in their harvest.\nThe main takeaway here is this: the cannabinoid profile printed on your product depends not only on the strain’s genetics and expertise of the grower, but also on the testing methods (and ethics) of the local lab that performed the chemical analysis. The Dancehall you bought on your last trip to the dispensary is likely to reflect the cannabinoid data illustrated in the above graphs–however, if you see deviation, the reason lies in the many layers of strain and data variability.\n\nCannabis Strains With High Levels of CBD\nWith this caveat in mind, let’s look at the strains that expressed the highest levels of CBD according to the above lab data.\n\nFind Dancehall Nearby\nDancehall is an upbeat and inspiring strain meant to lift your spirits while coercing creativity. With a CBD:THC ratio of nearly 20:1 on average, this strain delivers little to no euphoric effects that might distract focus or dampen cognition in THC-sensitive consumers.\n\nFind ACDC Nearby\nKnown for its keen ability to lift anxiety of all shades, ACDC is a godsend to consumers susceptible to the side effects of THC. This strain allows you to harness many of the desirable traits of cannabis, like light-footed physical relaxation and gentle mood elevation, without the cost of a clear, calm mind.\n\nFind Suzy Q Nearby\nSuzy Q is a CBD-dominant strain with an extremely modest amount of THC, making it another mellow strain with little to no high. The mild effects of this pine-scented strain help you shed anxious or demotivating mental blocks that stood in the way of creativity and productivity.\n\nFind Ringo’s Gift Nearby\nNamed in recognition of the CBD pioneer Lawrence Ringo, Ringo’s Gift imbues the consumer with a sense of wellbeing alongside steady relief in the body. Use this strain to take the edge off pain and stress, while allowing the mind to roam free without the shackles of paranoia or distracting euphoria.\n\nFind Charlotte’s Web Nearby\nCharlotte’s Web was the first CBD strain to receive media attention, and has achieved legendary status among CBD varieties ever since. Although its reputation is built upon its success in treating epilepsy, this strain has aided patients treating many other conditions including pain, anxiety, and inflammation. Charlotte’s Web is grown by CW Pharmaceuticals in Colorado.\n\nFind Remedy Nearby\nRemedy is a high-CBD strain that quietly ushers in easy relaxation without mental fog. For consumers seeking something a little more relaxing than a cup of tea, Remedy offers a solution with effects that rid the mind of anxiety while soothing aches, pains, and inflammation.\n\nFind Sour Tsunami Nearby\nSour Tsunami has become a household name among high-CBD strains. This variety tends to produce less than 1-2% of THC, so you can reap its medicinal benefits without the high. Sour Tsunami is fairly prolific, so keep an eye out for this strain at your next dispensary visit if you’re looking to quell pain or anxiety symptoms without the interference of THC.\n\nFind Hawaiian Dream Nearby\nIf you’re looking to harness the benefits of THC and CBD but wary of getting too high, Hawaiian Dream is the strain for you. With a THC content of around 5% and a CBD profile stretching between 5-10%, Hawaiian Dream can help abate symptoms with only mild, gentle euphoria. As an added bonus, this strain throws in a little tropical flavor to sweeten the experience.\n\nFind Dance World Nearby\nDance World is a CBD-dominant strain that almost achieves a balanced CBD:THC ratio, making it especially appropriate for consumers struggling with pain, depression, and lack of appetite. This synergy of THC and CBD helps to inspire positivity and more vibrant moods by handing you subdued euphoria on a leash.\n\nFind Nordle Nearby\nNordle offers a balanced abundance of both THC and CBD that makes it especially suitable for patients dealing with pain, insomnia, muscle spasms, and anxiety. If your symptoms are keeping you up at night, Nordle is a great nightcap solution for dialing down pain and worries so you can spend less time tossing and turning.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28121936/high-cbd-strains.jpg","urlslug":"/news/strains-products/high-cbd-marijuana-strains-according-to-lab-data"},{"id":"contentitems-3357","title":"New Strains Alert: Pearl Scout Cookies, Jenny Kush, NightFire OG, Ken\u0027s Kush and More","author":"Bailey Rahn","category":null,"date":"\/Date(1437763020000)\/","text":"More strains were just added to the Leafly strain database, and based on the number of requests we\u0027ve gotten for these, we know at least some of you have given them a try. Go leave a strain review if you\u0027ve run into any of these in your strain hunting!\nDid one of these catch your eye? Check if it\u0027s carried at a nearby shop or dispensary by navigating to the strain page and clicking the \"Availability\" tab.\n 1. Pearl Scout Cookies\n\nPearl Scout Cookies, a GSC (f.k.a Girl Scout Cookies) hybrid, is a cannabis strain developed by Fireline for recreational shops in Washington State. With a THC content that tends to push past 23%, Pearl Scout Cookies is best suited for consumers with a high tolerance. Its dense, chunky buds take on a zesty citrus aroma that brings to mind fresh lemons and oranges. Uplifting euphoria floods the mind and provides a boost of cerebral energy to fuel creativity and happiness.\n\n \n 2. Sweet and Sour Widow\n\nBred by CBD Crew, Sweet and Sour Widow is a 70/30 indica-dominant cannabis strain with a 1:1 CBD-THC ratio and a subtle sweet onion aroma. Because of its balanced cannabinoid profile, Sweet and Sour Widow’s psychoactive effects are mild, making this strain suitable for novice consumers and patients needing to medicate without a foggy head. Sweet and Sour Widow is derived from White Widow genetics and an unnamed sativa-hybrid to accentuate its CBD profile.\n\n \n 3. NightFire OG\n\nNightFire OG by Sin City Seeds is a sativa-dominant hybrid that descends from parent strains White Fire OG and White Nightmare. With strong roots in the White family, you can depend on this cannabis strain to deliver a disorienting dose of euphoria that lets you forget life’s stressors as relaxation takes over mind and body. Earthy pine, sharp lemon, and sweet berry aromas radiate from NightFire OG’s crystal-coated buds, inviting you to indulge in this hard-hitting hybrid.\n\n \n 4. Jenny Kush\n\nJenny Kush is a hybrid cannabis strain named in memory of Jenny Monson, a cannabis activist who passed away in 2013. The strain was originally bred by Rare Dankness Seeds with all proceeds going toward the Jenny Kush Foundation, a charity established to help support her children. This hybrid introduces herself with a sweet earthy aroma cut with the sharp zesty sweetness of citrus and lemon. Amnesia Haze and Rare Dankness #2 are believed to have parented Jenny Kush, giving this strain a balance of sativa and indica effects. Providing soothing relaxation with an uplifting burst, Jenny Kush is suitable for use any time of the day.\n\n \n 5. Dance World\n\nDance World is a high-CBD sativa strain bred by Royal Queen Seeds in Spain. A cross between Dancehall and Juanita La Lagrimosa, Dance World’s heritage stems primarily from Afghani and Mexican genetics. From its Dancehall parent, Dance World inherits active, uplifting effects that motivate productivity and a positive mindset. Earthy and spicy flavors dominate the palate, but subtle fruity notes bring Dance World sweet undertones. While Dance World shows its sativa genetics in its energetic effects, Dance World plants are more indica in stature and flower after just 8 weeks.\n\n \n 6. Chemdawg Sour Diesel\n\nChemdawg Sour Diesel (or Chem Sour) from Reservoir Seeds is a sativa-dominant hybrid cannabis strain that combines champion genetics from Chemdawg D and Sour Diesel. With a sharp sour bite, Chemdawg Sour Diesel has a funky fuel and earthy pine aroma that stuns the senses. Its buzzing euphoria leaves you feeling elevated and uplifted, but anxiety-prone individuals should tread carefully with this high-flying sativa.\n\n \n 7. Ken\u0027s Kush\n\nKen’s Kush is a potent hybrid cannabis strain bred by Ken Estes that crosses his famous Granddaddy Purple with the equally esteemed OG Kush and Sour Diesel. Together these parents pass on a flavor profile of sweet berries, sour skunk, and grassy earth. Dreamy relaxation pours over the mind and body, helping you feel serene without the sedation typically associated with heavy indica varieties.\n\nClick on the image to check out other new strains recently added to the Leafly Explorer!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/07/12002258/new-strains-alert-pearl-scout-cookies-jenny-kush-nightfire-og-ken.jpg","urlslug":"/news/strains-products/new-strains-alert-pearl-scout-cookies-jenny-kush-nightfire-og-ken"}],"reviewCount":28,"flavors":[{"name":"Lavender","score":50},{"name":"Citrus","score":25},{"name":"Spicy/Herbal","score":15.725806451612904},{"name":"Flowery","score":14.919354838709678},{"name":"Earthy","score":14.112903225806452}],"effects":[{"name":"Happy","score":33.870967741935488},{"name":"Relaxed","score":33.870967741935488},{"name":"Uplifted","score":30.64516129032258},{"name":"Focused","score":18.951612903225808},{"name":"Creative","score":17.338709677419356}],"symptoms":[{"name":"Stress","score":44.758064516129032},{"name":"Pain","score":33.064516129032256},{"name":"Depression","score":27.419354838709676},{"name":"Inflammation","score":27.419354838709676},{"name":"Headaches","score":15.725806451612904}],"conditions":[{"name":"Arthritis","score":25.806451612903224},{"name":"Fibromyalgia","score":25.806451612903224},{"name":"PTSD","score":25.806451612903224},{"name":"Anxiety","score":17.338709677419356},{"name":"Bipolar Disorder","score":12.5}],"negatives":[{"name":"Dry Mouth","score":1.6129032258064515},{"name":"Headache","score":0.80645161290322576}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dance-world_100x100_4129.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/383804/b/dance-world__primary_1935.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dance-world_100x100_f3da.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/378609/b/dance-world__primary_4ad3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/dance-world_100x100_68ad.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/369516/b/dance-world__primary_e78a.jpg"}],"photoTotalCount":3,"popularCities":["Seattle, WA","Calgary, AB","Chicago, IL","Edmonton, AB","Halifax, NS","Highland Park, IL","Homewood, IL","Litchfield, IL","Mokena, IL","Morris, IL"],"permalink":"https://mobileapi.leafly.com/sativa/dance-world","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.53571428571429/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Dancehall","subtitle":null,"slug":"dancehall","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/dancehall","symbol":"Dhl","applink":"leafly://strain/dancehall"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":56,"outdoorFinish":"Early October","height":"Short","averageYield":null,"environment":null,"growNotes":"\n\tYields about 400 to 450 grams per plant\n\n"}}
