{
    "aka": "Lester Grinspoon, Doctor Grinspoon, Dr Grinspoon, Grinspoon, Dr. Grinspoon Haze, Grinspoon Haze",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "David Bienenstock",
            "category": null,
            "date": "/Date(1520360124000)/",
            "id": "contentitems-59696",
            "text": "Updated 3/9/18\n“Travel is like cannabis; it broadens your perspectives…personally, culturally, and politically,” according to bestselling guidebook author and acclaimed PBS host Rick Steves. “Suddenly, the palette with which we paint the story of our lives has more colors.”\nFor a cannabis enthusiast, this idea of expanding our palettes rings especially true, because even in our current heady era of rapidly advancing legalization, many of the world’s finest and most exotic cannabis strains can only be found in their regions of origin. So if we think of each varietal of the plant as its own unique hue, then we must travel widely to truly experience the species in all its technicolored glory.\n\nMuch as your local liquor store carries wine and beer from around the world, we should be able to sample the finest cannabis available anywhere without leaving home. Another way to look at this is as an opportunity to get out and do some exploring.\nAs a longtime cannabis journalist, I’ve had the good fortune to travel widely in parts of the world where the love of this plant flourishes, and I can report back that each place comes complete with a particular cannabis strain that’s a point of local pride. Some among the finest I’ve ever sampled.\nSo what are we waiting for?\n\nCannatonic\nOrigin: Barcelona, Spain\nMuch like the coffeeshops in the Netherlands, the cannabis social clubs that have cropped up in Barcelona and elsewhere in Spain over the last decade aren’t really legal, they’re just tolerated—for the most part. Clubs have been busted by the authorities in the past, and the Spanish legal system is still grappling with how to enforce (or not) a set of cannabis laws that allow for “personal” consumption in a “private” setting, without ever defining those terms.\n\nThe city itself, of course, is one of the world’s ideal places to be stoned. Tapas is the ultimate stoner cuisine, and Gaudi is the best architect ever when you’re high. The most popular local strain when I was there some years ago was Jack Herer, an Dutch-bred varietal that most assuredly flourishes beneath a Spanish sun. But to experience a truly homegrown phenomenon, take the time to track down Cannatonic, a high-CBD strain bred by Spanish seed bank Resin Seeds.\nWith THC rarely above 7% and CBD potentially above 15%, it’s a cross of MK Ultra and G13 Haze with a “slight earthy odor and a mild, sweet, vaguely citrusy flavor.” While not providing much of a high due to its elevated CBD profile, the strain offers profound therapeutic relief for pain, inflammation, and anxiety. It’s the perfect way to unwind after a long hot day wandering La Rambla.\n\nDr. Grinspoon\nOrigin: Amsterdam, Netherlands\nAs a travel destination, Amsterdam offers up many charms, from the picturesque canals and lively nightlife to the parks and museums and a place called Febo, where you can buy deep fried cheese out of a coin-operated automat in the middle of the night. The city’s also been a refuge for cannabis consumers and cannabis itself for decades.\nNot only have Amsterdam’s famed coffeeshops attracted visitors from around the world since they opened in the 1970s, they’ve also served as a safe haven for cannabis strains from every continent to escape prohibition.\nIf you’re fortunate enough to make a visit, definitely sample some Neville’s Haze or any of its Haze cousins, and don’t miss out on the wide array of imported, traditionally made hashishes available from Morocco, Nepal, Afghanistan, and other distant lands. But if I had to recommend just one smoke in town, I’d say make an appointment with Dr. Grinspoon, a pure sativa heirloom strain bred by Barney’s Farm, a cannabis seed bank associated with one of Amsterdam’s top coffeeshops.\n\nLike all purebred sativas, the strain (named for medical cannabis advocate Dr. Lester Grinspoon) takes a long time to harvest and doesn’t yield very well—but who cares? You’re not growing it, you’re smoking it. And the soaring, cerebral, invigorating high will set you off on an adventure to remember (or forget) in one of the world’s most beautiful cities.\n\nLamb’s Bread\nOrigin: Jamaica\nJamaica has long been associated with ganja, a local word for cannabis that derives from an ancient Sanskrit word that reached the Caribbean in the mid 1800s, brought along by indentured servants freshly arrived from India. In time ganja spread to native born Jamaicans. In particular, the Indians’ use of cannabis as a spiritual sacrament would be adopted by Jamaica’s Rastafarian community.\nAdd in the global impact of reggae music, and the indelible idea of Jamaica as a cannabis paradise took root in the public’s imagination. Even though, until recently, cannabis remained highly illegal and the laws against it seriously enforced.\n\nHappily, however, that all began to change in 2015, when a new law decriminalized up to two ounces of cannabis and made personal grows legal.\nSo how best to celebrate if you happen to be lucky enough to make a pilgrimage? Well, nothing could be more appropriate than rolling up a joint of Lamb’s Bread—the definitive Jamaican cannabis strain, and purportedly Bob Marley’s favorite throughout his life. A bright, green, sticky heirloom sativa, it’s an uplifting, inspiring, energizing high that pairs nicely with a cup of local Blue Mountain coffee if you really want to get your day started right.\nMalawi Gold\nOrigin: Malawi\nRevered as a food, fiber, and medicine, cannabis flourished throughout Malawi until 1964, when the newly independent republic joined the United Nations and adopted the UN’s Single Convention on Narcotic Drugs.\n\nFifty years of mandated federal enforcement later, what the locals call chumba, and the world calls Malawi Gold, remains a vital cash crop throughout the impoverished African nation, but growers now plant their seeds in remote mountain clearings, hoping to elude the authorities. According to a 2011 report from the World Bank, Malawian farmers harvest around 150,000 pounds of remarkably potent cannabis in this manner every year, the vast majority bound for Europe. The plant remains illicit to this day, but there’s a strong movement in Malawi to legalize both cannabis and hemp.\nFamous throughout Africa for its potency, Malawi Gold is a pure sativa strain that’s slow to mature, with a flowering time of up to 120 days before it’s ready to harvest. But it’s worth the wait to smoke the long, resin-coated buds that have made the strain famous far beyond Malawi’s borders.\n\n\nCheese\nOrigin: United Kingdom\nBritain’s cannabis scene isn’t well known for producing high quality cannabis or award-winning strains, with one notable exception. An indica-dominant hybrid named for its sharply sour aroma, Cheese has been the herbal pride of the United Kingdom since the late 1980s. Local legend has it the original Cheese (sometimes called Original Cheese) descended from a Skunk #1 phenotype that was selected for future breeding based on its incredibly pungent aroma.\n\nThe most popular modern version comes from Big Buddha Seeds, and features the same pungent funky aroma plus the addition of Afghani indica genetics to increase trichome production and yield. Big Buddha’s version put Cheese on the global map when it took home top honors in the Sativa category at the 2006 Cannabis Cup and has been spreading out geographically ever since.\nBut it’s still best enjoyed at home, in Merry Old England, paired with a cup of Earl Grey and some tasty crumpets.\nIsland Sweet Skunk\nOrigin: Vancouver Island\nBritish Columbia—Canada’s westernmost province—stretches from the ocean to the Rocky Mountains. The region became a hotbed for cannabis cultivation starting back in the 1960s, when the ranks of the area’s homegrown farmers were swelled by the arrival of draft resisters from the US who began fleeing to Canada to avoid service in the Vietnam War. With Vancouver eventually earning the nickname Vansterdam for its tolerance of cannabis coffeeshops, and the entire province boasting vast stretches of remote land in which to grow cannabis, a culture of tolerance and acceptance took hold in BC even in the darkest days of Canada’s cannabis prohibition.\nAnd now that it’s set to be legalized nationwide this summer (with the recreational market functional by late summer/early fall), British Columbia will remain the ultimate Canadian cannabis travel destination, a place of natural beauty and vibrant culture. Island Sweet Skunk was originally bred on Vancouver Island, a 290-mile long, largely undeveloped stretch of coastlines and mountains just off the Pacific coast. A sativa with an electric buzz and a flavor profile that mixes classic skunky notes with ripe grapefruit undertones, the strain is a descendant of Skunk #1 and grows tall, straight, high-yielding plants.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/05153822/6-international-strains-abroad.jpg",
            "title": "6 International Cannabis Strains Worth Seeking Abroad",
            "urlslug": "/news/strains-products/6-international-cannabis-strains-worth-seeking-abroad"
        },
        {
            "author": "Trevor Hennings",
            "category": null,
            "date": "/Date(1517438911000)/",
            "id": "contentitems-56321",
            "text": "Like all plants, cannabis comes in all shapes and sizes. Generally speaking, strains will exhibit differences in resin production, coloration, stature, and shape. Other times, cannabis will express itself with features you’ve probably never seen firsthand. Below are five of the most unique and unusual genetic traits found in cannabis plants from all around the world. Whether by genetic mutation, environment, or factors unknown, these cannabis oddities are sure to stand out in any cannabis garden.\nAlbino Cannabis\n\n\n\n\n\n Couldn't resist posting another picture of this beauty showing one of the two tone buds.  This is one of our more unique plants in the outdoor garden, this plant is displaying variegation characteristics.  This anomaly occurs when the genes controlling the production of chlorophyll are not expressed correctly resulting in albino characteristics. There will be a very limited supply of this & we'll let you know which retailer will be carrying it.  #albinocannabis #whitecannabis #wanorml #norml #normllife #womengrow #fineweed #wafinestcannabis #marijuana #modernfarmer #mjfarm #pesticidefree #legalmarijuana #legalmj #i502 #cannabis #peaceloveandcannabis\nA post shared by  Washington's Finest Cannabis (@washingtons_finest_cannabis) on Oct 2, 2015 at 7:01pm PDT\n\n\n\nAlbinism is a rare genetic mutation that occurs in humans, animals, and plants such as cannabis. An albino plant is one that grows with the complete or partial absence of chlorophyll pigmentation, causing the plant to appear lighter or white in color. The plants must contain some chlorophyll to perform photosynthesis (the process by which plants covert light energy into food), so albino plants may never make it to maturity before dying.\n\nDr. Grinspoon\n\n\n\n\n\n #420Magazine #Marijuana #DrGrinspoon #its420somewhere\nA post shared by  420 Magazine (@420magazine) on May 6, 2015 at 12:19pm PDT\n\n\n\nThe spindly strain called Dr. Grinspoon was dedicated to the longtime cannabis advocate and professor at Harvard, Dr. Lester Grinspoon. In the early 60s, Dr. Grinspoon condemned the use of cannabis as its popularity grew, but came to endorse it after studying the plant. He found that the information that was being shared to the public was not supported by his research and felt that the public was being strongly misled.\nThis strain is a pure sativa heirloom that typically invites creativity, energy, and cerebral activity. Bred by Barneys Farm in Amsterdam, it grows with a bizarre stature: Instead of developing bud sites at the nodes of the branches, Dr. Grinspoon grows small buds that decorate the plant like berries on a holly plant. Because of its unconventional appearance, this strain is also a solid choice for growers seeking subtlety in their garden.\nDr. Grinspoon is not a high yielding strain and has a 14-week flowering period, making it an unpopular strain among commercial growers. But novelty-seeking cultivators raising this potent sativa will be rewarded with a truly unique product.\nPolyploid Cannabis\n\n\n\n\n\n More shots of the weird mohawk bud 👽👾 phenotype​. #mohawk #phenohunters #macro #santacruz #scfarms #pistils #calyx #trichomes #faded #polyploid #flowers #alien\nA post shared by  Santa Cruz Farms LLC (@scfarms) on Mar 5, 2017 at 1:44pm PST\n\n\n\nPolyploidy occurs in plants that contain more than two sets of chromosomes in their genetic makeup. While most cannabis plants are simply diploid (two sets of chromosomes), many growers find that polyploid cannabis plants produce larger flowers with resilience to disease and pests. While this mutation in animals is often destructive, it is generally successful in plants. Many flowering plants have picked up extra chromosomes, and this mutation has often helped them become adaptive and resilient.\nBuddha Seeds from Spain has been exploring polyploidy for a number of years now with the goal of producing more potent, high-yielding strains. The mutation is difficult to work with and difficult to clone, making polyploid cannabis plants few and far between.\n\nFrisian Duck \n\n\n\n\n\n Frisian Duck! http://tinyurl.com/Buyduckseeds #dutchpassion #dutchpassion #outdoorweedisthebest #harvesttime #frisianduckfoot #frisianduck #frisianduckfoot #frisianduckseeds #dutchpassion\nA post shared by  Dutch Passion (@dutchpassionseedcompany) on Sep 8, 2015 at 12:21pm PDT\n\n\n\nFrisian Duck, a cross between Frisian Dew and Ducksfoot, was bred by Dutch Passion out of Amsterdam. While Frisian Dew was produced as a high-yielding outdoor strain, “Ducksfoot” is a unique mutation that results in oddly shaped cannabis leaves. This cross holds on to the Ducksfoot leaf pattern while producing beautiful deep purple buds that are compact with spicy notes of citrus and pine.\nA targeted benefit of Frisian Duck is stealth. With leaves that look nothing like a normal cannabis plant, Frisian Duck became a great strain for growers seeking to raise cannabis incognito.\nBlack Haze\n\n\n\n\n\n Black Haze ☁ 🔥 #blackhaze #exoticstrain #gumdrop #shimmerandshine #dank #gas #cannabis #marijuana #herb #herblife #420 #hippylife #medicinal #legalizeit\nA post shared by  Kush Dreamz (@kush_dreamin_420) on Dec 27, 2017 at 7:37pm PST\n\n\n\nIt’s not unusual to see vibrant or dark shades of purple in cannabis, but some strains achieve hues so distinct, you’ll likely never forget them. Black Haze is one of those strains, and as the name suggests, it oftentimes produces flowers that are near-black in color. Produced by Exotic Seed in Europe, this strain is an autoflowering variety that crosses Sir Jack x Skunk Auto and Pakistani Chitral Kush.\nOther strains that sometimes express unusually dark hues include Black Lemon, Black Domina, Black Dahlia, and Black Diesel. Cannabis may also uniquely express blue, pink, and red coloration.\n\nPinkman Goo\n\n\n\n\n\n Interview about my exclusive \" Pinkman Goo \" 3way hybrid ( GDPXGrape Ape ) x northern lights 5 by @merryjane see more about plant guttation at its finest,  subscribe youtube.com/CaliCropDoc for video updates\nA post shared by  CaliCropDoc – Grower Education (@calicropdoc_) on Mar 10, 2016 at 4:10pm PST\n\n\n\nPinkman Goo is a strain developed by Twompson Prater of Cali Crop Doc. Discovered while growing a few unidentified seeds found by his sister, Pinkman Goo was named after observing little balls of goo secreted by the buds 3-4 weeks into flowering. It’s up for debate how the goo balls are created, but one theory hypothesizes that they result from nighttime “respiration” after the plant’s stomata close.\nHave you come across any unusual cannabis strains? Tell us about them, or better yet, post a photo of them in the comments section below.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/31143125/cannabis-mutants.jpg",
            "title": "Bizarre Cannabis Strains With Unusual Growth Characteristics",
            "urlslug": "/news/strains-products/bizarre-cannabis-strains-with-unusual-growth-characteristics"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 34.80769230769231
        },
        {
            "name": "PTSD",
            "score": 31.923076923076923
        },
        {
            "name": "ADD/ADHD",
            "score": 26.602564102564102
        },
        {
            "name": "PMS",
            "score": 5.6410256410256405
        },
        {
            "name": "Muscular Dystrophy",
            "score": 5
        }
    ],
    "description": "<p>Dr. Grinspoon, a pure sativa heirloom bred by Barney&rsquo;s Farm in Amsterdam, is a strain destined for connoisseurs and intellectuals alike. In honor of the Harvard professor and cannabis advocate, this strain was named after Lester Grinspoon, who set out to correct misinformed science in the 1970s. As if channeling the brilliance of Dr. Grinspoon himself, this sativa is a top choice for creative, introspective thinkers as it induces heightened cerebral activity and sensory awareness. Dr. Grinspoon buds, imbued with rich earthy and honey flavors, grow like berries on twig stalks in unusually gapped popcorn formations. Because of its structure, Dr. Grinspoon typically delivers smaller harvests after a 13-14 week flowering time. This indoor preferred strain requires time and patience, but few cannabis varieties can impress connoisseurs like these frost coated gems. Patients with mood disorders, attention deficit, and chronic pain may find relief in the euphoric and invigorating experience that defines this legendary sativa.</p>\n",
    "descriptionPlain": "Dr. Grinspoon, a pure sativa heirloom bred by Barney&rsquo;s Farm in Amsterdam, is a strain destined for connoisseurs and intellectuals alike. In honor of the Harvard professor and cannabis advocate, this strain was named after Lester Grinspoon, who set out to correct misinformed science in the 1970s. As if channeling the brilliance of Dr. Grinspoon himself, this sativa is a top choice for creative, introspective thinkers as it induces heightened cerebral activity and sensory awareness. Dr. Grinspoon buds, imbued with rich earthy and honey flavors, grow like berries on twig stalks in unusually gapped popcorn formations. Because of its structure, Dr. Grinspoon typically delivers smaller harvests after a 13-14 week flowering time. This indoor preferred strain requires time and patience, but few cannabis varieties can impress connoisseurs like these frost coated gems. Patients with mood disorders, attention deficit, and chronic pain may find relief in the euphoric and invigorating experience that defines this legendary sativa.\n",
    "effects": [
        {
            "name": "Energetic",
            "score": 86.53846153846153
        },
        {
            "name": "Happy",
            "score": 84.93589743589743
        },
        {
            "name": "Uplifted",
            "score": 80.25641025641025
        },
        {
            "name": "Euphoric",
            "score": 77.6923076923077
        },
        {
            "name": "Creative",
            "score": 67.6923076923077
        }
    ],
    "flavors": [
        {
            "name": "Spicy/Herbal",
            "score": 50.96153846153846
        },
        {
            "name": "Woody",
            "score": 27.564102564102562
        },
        {
            "name": "Pine",
            "score": 27.243589743589745
        },
        {
            "name": "Tea",
            "score": 25.32051282051282
        },
        {
            "name": "Diesel",
            "score": 25
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1413366,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Dr. Grinspoon from Barney's Coffeeshop (Amsterdam), also known as Quaze Haze from Grey Area (Amsterdam) is by far the strongest sativa out there, hands down. Its a strain that looks like no other, growns like a weeping willow, clocks in at over 25% THC, almost no CBD, and smells like extreme citrus bathroom cleaner. I'm a  migraine and IBS sufferer, but would NOT recommend Grinspoon for migraines - this strain is 100% motivation power, like caffeine with the shakes or stomach problems. The trip is intense and long. I once smoked a serious joint of this stuff before boarding my flight at Schipol and had inner eye trails while up in the sky - super psychadelic stuff. NOT advised (AT ALL) for people with anxiety problems, but likely great for people with glaucoma and blood vessel restrictions as it makes your heart pump like a healthy oil rig. Expensive, hard to grow (18 - 22 weeks flower) but mighty worthy of the strongest sativa claim.",
            "username": "daShank"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1601075,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Very strong and clear high, like nothing else really. Feeling of super awareness and heightened senses. It’s completely cerebral, my favorite Sativa so far! Also flavorful, spicy & herby to smoke.",
            "username": "DodgyOG"
        }
    ],
    "id": 63855,
    "name": "Dr. Grinspoon",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 39.48717948717949
        },
        {
            "name": "Dry Eyes",
            "score": 6.602564102564102
        },
        {
            "name": "Dizzy",
            "score": 1.282051282051282
        },
        {
            "name": "Paranoid",
            "score": 0.641025641025641
        },
        {
            "name": "Headache",
            "score": 0.3205128205128205
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/sativa/dr-grinspoon",
    "photoTotalCount": 8,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645584/b/dr--grinspoon__primary_c875.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dr--grinspoon_100x100_5de8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/519626/b/dr--grinspoon__primary_220f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dr--grinspoon_100x100_a8d2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/494188/b/dr--grinspoon__primary_7add.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dr--grinspoon_100x100_3f2b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/423118/b/dr--grinspoon__primary_12f8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dr--grinspoon_100x100_e356.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/421245/b/dr--grinspoon__primary_d530.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dr--grinspoon_100x100_1d38.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/378781/b/dr--grinspoon__primary_034f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/dr--grinspoon_100x100_0146.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Soldotna, AK"
    ],
    "rating": 4.8,
    "relatedStrains": [],
    "reviewCount": 59,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "dr-grinspoon",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.79661016949153/240",
    "subtitle": null,
    "symbol": "Drg",
    "symptoms": [
        {
            "name": "Muscle Spasms",
            "score": 30.641025641025642
        },
        {
            "name": "Depression",
            "score": 14.807692307692308
        },
        {
            "name": "Stress",
            "score": 13.525641025641026
        },
        {
            "name": "Fatigue",
            "score": 12.243589743589745
        },
        {
            "name": "Headaches",
            "score": 5.961538461538462
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
