{"sl_translate":"description,descriptionPlain,category","id":10064,"slug":"malawi","name":"Malawi","subtitle":null,"symbol":"Mal","category":"Sativa","description":"\u003cp\u003eMalawi is a pure sativa strain that comes from the Salima region of Malawi in southeast Africa. \u0026nbsp;This strain has an extremely long flowering time, sometimes up to 120 days. \u0026nbsp;Always worth the wait, Malawi produces long and resin-coated buds, a great smoke for any\u0026nbsp;occasion.\u003c/p\u003e\n","descriptionPlain":"Malawi is a pure sativa strain that comes from the Salima region of Malawi in southeast Africa. \u0026nbsp;This strain has an extremely long flowering time, sometimes up to 120 days. \u0026nbsp;Always worth the wait, Malawi produces long and resin-coated buds, a great smoke for any\u0026nbsp;occasion.\n","aka":"malawi gold","rating":4.42,"highlightedReviews":[{"id":1410904,"username":"Deetom","text":"I grew African Buzz (a special selection of Malawi Gold) and all I\u0027ve got to say is... I really, really, really like this stuff. It grew easily. Had a mildew problem. This plant resisted better than any of the other strains growing. While flowering, the smell wasn\u0027t too strong, pretty easy to conceal if you just had one or two growing at home. It smelled like lemon Pledge and Bazooka Joe bubblegum... it\u0027s a weird combo, imagine smelling freshly cut lemongrass while chewing on that powdery pink gum you\u0027d find in packs of hockey/baseball cards... that\u0027s very close. Not really my favourite smell but I can see how some would probably like this a lot. \n\nOverall, probably among the best weed I\u0027ve smoked. No skunk/cat pee smell in here at all. Very easy smell to conceal if you\u0027d have to try. Very sativa effect after about 10 minutes what feels like nothing. At first, you don\u0027t feel very high... but it guilds and builds. I feel pressure behind the eyes and a dry mouth. Energized but also relaxed (not sleepy). This stuff actually does a good job waking you up... like espresso coffee. I do feel my heart beating kinda faster but it isn\u0027t bad at all and it eases-up after another 10 minutes. No paranoia. This stuff always brings me to a wonderful place. Makes me feel so empathetic, happy, a little silly, playful and giggly. There is lots of euphoria in this high... feels like I could burst out laughing if someone would do something silly. This stuff will put a grin on your face and it will leave you functional... but I know I probably couldn\u0027t drive while on this. People around you will probably notice you are high when you\u0027re on this magical stuff. This weed doesn\u0027t make me hungry nor does it make me horny HOWEVER I just know that things like eating would feel good... so would listening to music... dancing would feel quite nice when on this. As for sex, this stuff makes me feel sensual rather than horny. Yeah... makes you want to have that \"tantric\" sort of sex. Generally speaking... this stuff accentuates pleasure, whatever that pleasure may be. \n\nOne thing I wish this didn\u0027t do so well is destroy short-term memory. It\u0027s a very \"having your keys in your hand while you\u0027re looking for them... all while forgetting what you were looking for in the first place\" kinda weed. Amazing!!!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png"},{"id":1559532,"username":"blueshifter","text":"I HAVE FOUND MY STRAIN! I consider Malawi not so much a recreational herb as My Spiritual Ally From the Plant Kingdom.\n\nMalawi is everything you hope cannabis will be. Music sounds good, food tastes great, your bodily senses come alive and ordinary routines like stretching, massaging your feet and washing your face feel AMAZING. At the same time, your mind sparkles with curiosity and clarity; my first time out I was able to absorb myself in a creative project that I had been putting off for a while because I just wasn’t “feeling it,” but which I now was able to connect with emotionally and aesthetically. \n\nMalawi takes you to a place of 100% honesty with yourself — a place where you can look at your life without fear, shame or wishful thinking, and see clearly what improvements can be made.  Malawi gives me the freedom of mind to dream big about my future, while at the same time giving me the clarity to plan, in zero-bullshit terms, how I can achieve those dreams. This is definitely a problem-solver’s strain (and probably also great for playing games of strategy like chess or go, if that\u0027s your thing.)\n\nThe odor of this flower is wild, strong, earthy, mythic.  Definitely smells like something that would grow in Middle Earth, Wakanda or in the magical forest of Princess Mononoke. One whiff of it and you know your nose is plugging directly into some serious Ancient Vegetable Intelligence. \n\nA very smooth, pleasant launch. While some strains might make you feel like you’ve been shot out of a cannon, Malawi lifts you up gently. After vaping a tiny amount, I felt like I was taking off in a solar-powered glider, easing out onto warm thermal updrafts lofting me up into a wide and welcoming blue sky. \n\nShortly thereafter I had a vision of a female pixie - who looked like young BernNadette Stanis, (the actor who played Thelma on the 70s sitcom Good Times, whom as a kid I had a celebrity crush on) dressed in an amazing green furry faery costume, fluttering around me on emerald green butterfly wings, urging me to smile and relax. And I certainly did! I was suffused with a sense of warm, happy arousal which, as a person living with Depression, I feel rarely, and was most welcome.\n\nAt the risk of sounding like a hippie cliche: I live in an apartment overlooking a park, and at a certain point around sunset I looked out at all the people jogging, strolling, walking their dogs, and I felt a crazy Walt Whitman-esque love for EVERYBODY. Cynics may snort at this, but if you’ve been there, you know what I’m talking about. The human brain contains many programs, and one of those programs is a feeling of familial love for ALL your fellow humans. You don’t need cannabis to launch this program, but if you’re stuck in day-to-day stress loops, it certainly helps.\n\nNegatives: Cottonmouth comes on strong, so have some water or a tasty beverage close at hand. Your balance will be off so don’t try riding a bicycle or “bouldering” at the rock climbing gym. \n\nIncredibly, this was $10 a gram (the lowest price point) at my local dispensary. I purchased a few other “top shelf” strains (Golden Goat, Holy Grail) for more than double the price, but they did not compare to this humble yet mighty Malawi. Apparently it’s not an easy flower to keep in stock, so if your local dispensary has it, do yourself a favor and snatch some up!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-66794","title":"Next Level Wake \u0027n\u0027 Bake With Coffee-ish Strains","author":"Hannah Meadows","category":null,"date":"\/Date(1527115215000)\/","text":"A relaxing wake and bake is my go-to weekend morning ritual. If you’re like me, you love pairing a particularly buzzy strain with a strong cup of coffee to get the most out of this classic stoney day starter. But if you’re cutting caffeine or just want to double up on the scent of a freshly brewed mug, fragrant cannabis can be the answer to your coffee cravings.\n\nBelow, some tips on pairing certain cannabis scents with your favorite coffee aroma. Now you too can take your regularly scheduled wake and bake to the next level.\nFind a Dispensary Nearby\nChocolate Thai\n\nA coffee and cannabis lover’s dream lies in the uplifting Chocolate Thai strain. With a strong mix of coffee and chocolate flavors, pungent nugs of this classic landrace firmly puts the “bake” in “wake and bake.” Load up a bong, crush those coffee beans, pet your dog, and spend the morning making your favorite breakfast to celebrate a much needed day off. \nFind Chocolate Thai Nearby\nMalawi\n\nMalawi wears a coat of resin that, when smoked, produces extra energetic effects. A strain that’s truly spirited, this flower-forward number will enhance your exercise routine or give you that extra pop of intensity for crushing work assignments. A touch of coffee follows the finish to end your wake and bake on a high note.\nFind Malawi Nearby\n\nChocolope\n\nStress is no match for the earthy and delicious Chocolope. With sweet coffee notes imbedded in its make-up, roll up a joint with this vivid and cerebral strain for a day packed with creativity, focus, and charm. You may find Chocolope’s optimistic effects lingering throughout the day for hours of cheery relaxation.\nFind Chocolope Nearby\nCaramel Candy Kush\n\nSkip the sugar-high mochas and reach for Caramel Candy Kush to start your day on the sweet side—or treat yo’self and go for both! Notes of caramel and fruit hit your senses first, and a light coffee finish carries you off before tackling the remainder of the day.\nFind Caramel Candy Kush Nearby\n\nTangilope\n\nJust like a strong cup of coffee, Tangilope will leave you bursting with energy and ready to take on the day. It’s a great choice for weekends spent running errands, doing chores, and getting back on track. A hint of coffee accompanies heavy citrus flavors for a truly buzzy taste. Keep this strain in your repertoire for particularly busy days.\nFind Tangilope Nearby\nBubba Kush\n\nBubba Kush offers a mouthwatering blend of chocolate and coffee in its sweeter notes. Light this strain up for an extra-chill morning and bask in euphoric mentals and a relaxing body ease. Leafly users love this tasty classic and its penchant for delivering dreamy bliss. \nFind Bubba Kush Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/05/23144021/coffee-and-cannabis.jpg","urlslug":"/news/strains-products/next-level-wake-bake-coffee-strains"},{"id":"contentitems-39132","title":"5 Reggae Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1503703122000)\/","text":"Born in 1960s Jamaica, reggae was an evolution of its predecessors: ska and rocksteady. The genre quickly took on a life of its own and eventually made its way to the United States, where it became a staple of 1960s culture. It also carved a special niche in the cannabis world, since reggae’s penchant for political lyrics did not shy away from the topic of legalization.\n\nIt’s a genre that is powerful in both its unique sound and inherently political roots. It is music that uplifts the spirit and rallies the heart. The era of reggae produced a plethora of iconic artists such as Bob Marley, Bunny Wailer, Peter Tosh, The Abyssinians, and Toots \u0026 The Maytals—the latter of whom actually coined the term ‘reggae’ with the 1968 single, “Do The Reggay.”\nTo better understand and appreciate the genre, pack a pipe, grab your friends, and explore the soulful reggae music below—each album we suggest is an ideal match for the right cannabis strain.\nStony Hill by Damian Marley\n\nStrain Pairing Recommendation: King’s Bread\nYoungest son of the legendary Bob Marley, Damian Marley continues his father’s legacy in reggae with his own fresh sound. Stony Hill is Marley’s newest album—released in July of this year, it combines modern electronic elements with classic reggae beats. Stony Hill feels like the next modern step in a continuously growing genre that refuses to lose its heart along the way.\nIn true reggae style, Marley’s lyrics do not shy away from telling honest and human stories. From wondering what the future will bring on one track, while impeccable backup vocals chime “believe in your dreams” on another, the album explores the depth of human character.\nThis 18-track album also features the song “Medication” featuring Marley’s brother and guest artist, Stephen Marley. The song is an ode to Marley’s love of “Mary Jane” and the medicinal power of cannabis. You’ll be singing along to the lyrics, “And I say to myself, what a wonderful herb.”\n\nSevana EP by Sevana\n\nStrain Pairing Recommendation: Purple Bud\nHailing from Kingston, Jamaica, Sevana burst onto the scene last year with her first EP album, where she delivers stunning, expert vocals and impactful reggae beats. The album begins with the softer ballad “Carry You” before launching into the groovy “Bit Too Shy,” which sets the tone for the rest of the collection.\nThe EP’s music will get you moving to the rhythm, while Sevana’s energetic and heartfelt vocals delight across the soundscape with perfect control and beautiful clarity. Sevana captures the heart of reggae in her music, vocals, and lyrics for a complete immersion in classic reggae via a modern recording artist. Sevana’s debut album proves she’s an artist to watch and gives us high hopes of more great albums to come.\nEqual Rights by Peter Tosh\n\nStrain Pairing Recommendation: Jah Kush\nAlong with Bob Marley and Bunny Wailer, Peter Tosh got his start as part of The Wailers. Afterwards, he went on to become his own successful solo artist and produced many iconic albums, including Equal Rights in 1977.\nEqual Rights opens with the familiar song, “Get Up, Stand Up,” performed with Tosh’s unique style and sound. The album contains classics such as “Downpressor Man” and “Stepping Razor,” and features Tosh’s punctuated and mellow vocals accompanied by melodies that are rich, vibrant, and smooth.\nAs a whole, Equal Rights is an iconic reggae album that encapsulates the heart and soul of reggae as it was at the time of its initial emergence onto the popular scene. For this reason, it will always reign as a powerful memento of reggae’s roots.\n\nAfrican Holocaust by Steel Pulse\n\nStrain Pairing Recommendation: Malawi\nReleased in 2004, African Holocaust is the latest in a long line of albums produced by Steel Pulse. Though over a decade old, it remains relevant today both musically as well as lyrically, touching on topics such as global warming, corruption in government and religion, and the ramifications of slavery.\nFormed in 1975 in Birmingham, England, Steel Pulse has had a somewhat rotating cast of players over the years, but always with lead singer David Hinds at the forefront holding down vocals and rhythm guitar.\nAfrican Holocaust is no exception, with Hinds’s fierce voice leading the upbeat reggae melodies that encourage dance and reflection all at once. It is this combination of poignant lyrics and stunningly composed music full of drums and horns that makes African Holocaust such a noteworthy album.\nRebirth by Jimmy Cliff\n\nStrain Pairing Recommendation: Lamb’s Bread\nRebirth was released in 2012 as part of what Jimmy Cliff said was “a rebirth of my career at this time.” It was the first album Cliff had released in eight years, and went on to win a Grammy for Best Reggae Album. Cliff has been producing reggae music since the 1960s and is one of the few original artists who still produces new music today while touring or appearing at festivals (such as Lockn’ in 2015).\nRebirth manages to encapsulate Cliff’s classic reggae feel while shining anew with crisp, fresh, updated sounds. The 13-track album features new, original music as well as some covers—all of it exceedingly lively, joyful, and brimming with energy.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/25110707/best-reggae-albums-header.jpg","urlslug":"/news/lifestyle/reggae-albums-listen-high"}],"reviewCount":67,"flavors":[{"name":"Flowery","score":53.964912280701753},{"name":"Woody","score":53.964912280701753},{"name":"Chemical","score":51.333333333333336},{"name":"Tree Fruit","score":50},{"name":"Earthy","score":12.894736842105264}],"effects":[{"name":"Energetic","score":78.122807017543849},{"name":"Focused","score":67.859649122807014},{"name":"Euphoric","score":65.561403508771932},{"name":"Tingly","score":54.631578947368418},{"name":"Uplifted","score":26.789473684210527}],"symptoms":[{"name":"Depression","score":72.456140350877192},{"name":"Stress","score":70.824561403508767},{"name":"Nausea","score":57.263157894736842},{"name":"Muscle Spasms","score":51},{"name":"Cramps","score":50}],"conditions":[{"name":"Anxiety","score":60.263157894736842},{"name":"Gastrointestinal Disorder","score":52.631578947368418},{"name":"ADD/ADHD","score":7.9298245614035086},{"name":"Migraines","score":5.2982456140350873},{"name":"PTSD","score":3.6315789473684208}],"negatives":[{"name":"Dry Mouth","score":62.89473684210526},{"name":"Dizzy","score":51.666666666666664},{"name":"Paranoid","score":51.333333333333336},{"name":"Anxious","score":50.666666666666664},{"name":"Headache","score":50.333333333333336}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/malawi_100x100_b6d9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002117/b/malawi__primary_8f62.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/malawi_100x100_451a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/590538/b/malawi__primary_55f8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/malawi_100x100_78f5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506511/b/malawi__primary_cb9f.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/malawi_100x100_3f53.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/391287/b/malawi__primary_9345.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/malawi_100x100_78d3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/377953/b/malawi__primary_3437.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/malawi_100x100_d19d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/168275/b/malawi_825x550_437d.jpg"}],"photoTotalCount":10,"popularCities":["Portland, OR","Everett, WA","Albuquerque, NM","Ann Arbor, MI","Beaverton, OR","Bellevue, WA","Bellingham, WA","Burlington, WA","Eugene, OR","Granite Falls, WA"],"permalink":"https://mobileapi.leafly.com/sativa/malawi","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.41791044776119/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"African","subtitle":null,"slug":"african","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/african","symbol":"Afr","applink":"leafly://strain/african"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
