{
    "aka": "Tangalope, Tangelope",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Hannah Meadows",
            "category": null,
            "date": "/Date(1527115215000)/",
            "id": "contentitems-66794",
            "text": "A relaxing wake and bake is my go-to weekend morning ritual. If you’re like me, you love pairing a particularly buzzy strain with a strong cup of coffee to get the most out of this classic stoney day starter. But if you’re cutting caffeine or just want to double up on the scent of a freshly brewed mug, fragrant cannabis can be the answer to your coffee cravings.\n\nBelow, some tips on pairing certain cannabis scents with your favorite coffee aroma. Now you too can take your regularly scheduled wake and bake to the next level.\nFind a Dispensary Nearby\nChocolate Thai\n\nA coffee and cannabis lover’s dream lies in the uplifting Chocolate Thai strain. With a strong mix of coffee and chocolate flavors, pungent nugs of this classic landrace firmly puts the “bake” in “wake and bake.” Load up a bong, crush those coffee beans, pet your dog, and spend the morning making your favorite breakfast to celebrate a much needed day off. \nFind Chocolate Thai Nearby\nMalawi\n\nMalawi wears a coat of resin that, when smoked, produces extra energetic effects. A strain that’s truly spirited, this flower-forward number will enhance your exercise routine or give you that extra pop of intensity for crushing work assignments. A touch of coffee follows the finish to end your wake and bake on a high note.\nFind Malawi Nearby\n\nChocolope\n\nStress is no match for the earthy and delicious Chocolope. With sweet coffee notes imbedded in its make-up, roll up a joint with this vivid and cerebral strain for a day packed with creativity, focus, and charm. You may find Chocolope’s optimistic effects lingering throughout the day for hours of cheery relaxation.\nFind Chocolope Nearby\nCaramel Candy Kush\n\nSkip the sugar-high mochas and reach for Caramel Candy Kush to start your day on the sweet side—or treat yo’self and go for both! Notes of caramel and fruit hit your senses first, and a light coffee finish carries you off before tackling the remainder of the day.\nFind Caramel Candy Kush Nearby\n\nTangilope\n\nJust like a strong cup of coffee, Tangilope will leave you bursting with energy and ready to take on the day. It’s a great choice for weekends spent running errands, doing chores, and getting back on track. A hint of coffee accompanies heavy citrus flavors for a truly buzzy taste. Keep this strain in your repertoire for particularly busy days.\nFind Tangilope Nearby\nBubba Kush\n\nBubba Kush offers a mouthwatering blend of chocolate and coffee in its sweeter notes. Light this strain up for an extra-chill morning and bask in euphoric mentals and a relaxing body ease. Leafly users love this tasty classic and its penchant for delivering dreamy bliss. \nFind Bubba Kush Nearby",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/05/23144021/coffee-and-cannabis.jpg",
            "title": "Next Level Wake 'n' Bake With Coffee-ish Strains",
            "urlslug": "/news/strains-products/next-level-wake-bake-coffee-strains"
        },
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1506976615000)/",
            "id": "contentitems-43694",
            "text": "Dating back to the 18th century, bluegrass sits at the intersection of traditional Scottish, Irish, and English folk music. Settlers brought their ballads, dance music, and fiddles to the Appalachian Mountains in North America, where their individual melodies mixed together to create an uplifting sound that has been passed down from musician to musician for generations.\n\nBluegrass may be a cousin to folk, traditional, and Americana music, but at its heart it exists as one of the most distinct and noteworthy individual genres of our time. It is music that weaves stories and moves the soul—it’s a rich and colorful genre that can excite and invigorate the senses, especially with a little cannabis nearby.\nBelow, explore five bluegrass bands with your favorite pre-roll in hand—preferably on a rocking chair, soaking in the soulful tunes.\nLaws of Gravity by The Infamous Stringdusters\n\nStrain Pairing Recommendation: Tangilope\nThe Infamous Stringdusters’ latest album, Laws of Gravity, wastes no time as it bursts into life with their first track, “Freedom,” instantly immersing listeners in a rich and invigorating sound. The album, released this year, packs a powerful punch that is vibrant, complex and uniquely its own.\nLaws of Gravity manages to encapsulate the traditions of bluegrass while merging it with modern grooves and instrumentation. The bright movements of Jeremy Garrett’s fiddle and Chris Pandolfi’s banjo sing across the soundscape of bass, dobro, and guitar for a symphony that shines with and without the engaging and lively lyrics.\nWhen the lyrics do fade away, listeners enjoy the intricate improvisational jamming that is a hallmark of The Infamous Stringdusters. Laws of Gravity has a life of its own that proves once again why the band continues to be a resounding favorite across the genre’s fanbase.\nThe Muscle Shoals Recordings by The Steeldrivers\n\nStrain Pairing Recommendation: Blueberry Headband\nThe Muscle Shoals Recordings starts with light, happy banjo on the track “Long Way Down,” setting the tone for an album that combines the essence of bluegrass with rich complexity. Gary Nichols’ distinct and powerful voice, often accompanied by beautiful backing vocals, cruises effortlessly across the instrumentation and inspires with its authenticity and depth.\nThe Steeldrivers feature banjo, mandolin, guitar, bass, and fiddle for a full and delightfully classic bluegrass feel. The Muscle Shoals Recordings, produced in 2015, is the band’s fourth album and earned them a Grammy in the Best Bluegrass category.\nFrom the first track to the last, this is a spirited album that uplifts the mind and moves the body with energetic sound.\n\nThief by Keller & The Keels\n\nStrain Pairing Recommendation: Lodi Dodi\nWith a distinctly joyful beat, Thief picks you up and whisks you off into a dance of folky bluegrass with Keller William’s playful vocals leading the way. Williams is joined by Jenny Keel on upright bass and flat picker Larry Keel. Together, the three bring a decidedly full sound to their latest acoustic album.\nKeller & The Keels have never shied away from creative covers, and Thief, released in 2010, is no exception. Unlike their first album, Grass (released in 2006), Thief does not feature any original songs, focusing solely on covers. The album’s title is an ode to this decision.\nBluegrass versions of Amy Winehouse’s “Rehab” and Marcy Playground’s “Sex and Candy” are among the familiar but undeniably fresh covers. The tracks allow the listener to immediately jump in and sing along while still being immersed in new tunes and feelings.\nWilliams’ knack for composing solo music lends expertise to the composition of his trio, and as such, Thief has an intricacy that is impressive for such a small acoustic group.\nFriends of Fall by Crooked Still\n\nStrain Pairing Recommendation: Lemon Drop\nCrooked Still offers a unique bluegrass element that is light, airy, and melodic. Lead singer Aoife O’Donovan’s voice carries across the backdrop of banjo, bass, cello, and fiddle like a shooting star.\nFriends of Fall, released in 2011, brings an ethereal beauty and complexity to the genre of bluegrass. Songs such as “Pretty Bird” will stir emotion, while “It’ll End Too Soon” inspires and invigorates. Often described as ‘progressive bluegrass’ due to innovative acoustics, Crooked Still’s high-energy sound encourages engagement from the first note to the last thanks to its unique instrumentation.\nFriends of Fall is refreshing and wholly uplifting, carrying the spirit of bluegrass as it soars to new and delightful heights.\n\nLove. Ain’t Love  by Yonder Mountain String Band\n\nStrain Pairing Recommendation: Afgooey\nLove. Ain’t Love, released this year, is the latest from Yonder Mountain String Band, encompassing a full thirteen tracks of rich and engaging rhythms that will keep you on your toes.\nFeaturing five band members on banjo, bass, fiddle, guitar, and mandolin, Yonder Mountain String Band also has the distinction of all five members acting as vocalists, which allows them to create beautifully layered and rich harmonies.\nOn the other hand, Love. Ain’t Love does not shy away from fully instrumental tracks, such as “Fall Outta Line,” which showcases the band’s innovation in its tune. This ability to embrace the full merits of their instrumentation has won YMSB fans across various genres, including those in the jam band scene. When listening to Love. Ain’t Love, one can get lost in the music as it paints stories with and without lyrics.\nLove. Ain’t Love provides a playful, energetic, and creative soundscape. The passion and vibrancy in every note of the album act as joyful reminders that Yonder Mountain String Band continues to inspire and be inspired by bluegrass, even 18 years after the release of their first album.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/10/02124702/bluegrass-albums-while-high.jpg",
            "title": "5 Bold Bluegrass Albums to Listen to While High",
            "urlslug": "/news/lifestyle/bluegrass-albums-listen-high"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 20.213651498335185
        },
        {
            "name": "PTSD",
            "score": 19.797447280799112
        },
        {
            "name": "Migraines",
            "score": 15.149833518312986
        },
        {
            "name": "Bipolar Disorder",
            "score": 13.915094339622641
        },
        {
            "name": "Tinnitus",
            "score": 12.5
        }
    ],
    "description": "<p>Tangilope is a chocolatey, <a href=\"http://www.leafly.com/explore#!/explore/flavors-citrus\">citrus</a> blend of <a href=\"http://www.leafly.com/sativa/tangie\">Tangie</a> and <a href=\"http://www.leafly.com/sativa/chocolope\">Chocolope</a>, two of DNA Genetics&rsquo; best <a href=\"http://www.leafly.com/sativa\">sativas</a>. It is best known for its intense <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/terpenes-the-flavors-of-cannabis-aromatherapy\">terpene</a> profile and exotic smell. The cerebral effects evoke <a href=\"http://www.leafly.com/explore#!/explore/tags-happy\">happiness</a>, <a href=\"http://www.leafly.com/explore#!/explore/tags-giggly\">giggles</a>, and can stimulate <a href=\"http://www.leafly.com/explore#!/explore/tags-creative\">creativity</a>.</p>\n",
    "descriptionPlain": "Tangilope is a chocolatey, citrus blend of Tangie and Chocolope, two of DNA Genetics&rsquo; best sativas. It is best known for its intense terpene profile and exotic smell. The cerebral effects evoke happiness, giggles, and can stimulate creativity.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 93.11875693673697
        },
        {
            "name": "Uplifted",
            "score": 64.99722530521642
        },
        {
            "name": "Energetic",
            "score": 54.57824639289679
        },
        {
            "name": "Creative",
            "score": 52.16426193118757
        },
        {
            "name": "Focused",
            "score": 47.57214206437292
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 44.07602663706992
        },
        {
            "name": "Orange",
            "score": 39.71975582685905
        },
        {
            "name": "Earthy",
            "score": 15.857380688124307
        },
        {
            "name": "Tropical",
            "score": 8.47669256381798
        },
        {
            "name": "Sweet",
            "score": 6.950610432852386
        }
    ],
    "growInfo": {
        "averageYield": "Medium",
        "difficulty": "Easy",
        "environment": null,
        "floweringDays": 64,
        "growNotes": "\n\tAbove average yield\n\tEasy to grow with a forgiving nature\n\n",
        "height": "Tall",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png",
            "id": 1397959,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Oh... My.... LANTA!!!\nOk... want something to erase your foul mood? Turn that frown upside down?  Tan-GEEEEEE-lope, YO.\nOk.  Have you ever had one of those days where you couldn't hate your ex-husband AND ex-boyfriend MORE? You have reached the limit... you are FULL of hate. \nNothing could get you to smile. EXCEPT!!!\nYES.  Tan-GEEEEEE-lope, YO.\nTonight before I lay me down to sleep, I will fold my hands as I close my eyes and bow my head.... I will ask GOD with all the love and goodness one girl's heart could share to PLEASE GOD... Do those guys a favor... knock some fucking sense into their teeny weeny little pee- HEADS.\nSEE... I even have a sense of humor!!!\nHEEEEEEEEEEEEEEE.\nOh... no migraine after 3 relentless days, while I had some very good bud but did not touch the pain.\nTan-GEEEEEE-lope, YO.",
            "username": "CheebaArriba"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/cT1eApDlIdbWJE0EM4wOcvgBrGo=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2fLQdqXsuQEv8rEDDEM_kUqJgtUl8%3d%2f120x120%2fhttps%253A%252F%252Fs3.amazonaws.com%252Fleafly%252Fbin%252FRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1623671,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I use this one for stress and depression.  It helps a lot. I am able to use it in about 2 hour cycles.  It gives me a kick of energy and I am able to get some chores done.  Then I take a rest and come down a bit and decide if I want to do any more.",
            "username": "carsond17"
        }
    ],
    "id": 112271,
    "name": "Tangilope",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 23.154827968923417
        },
        {
            "name": "Anxious",
            "score": 12.5
        },
        {
            "name": "Dry Eyes",
            "score": 3.4128745837957823
        },
        {
            "name": "Paranoid",
            "score": 1.179245283018868
        },
        {
            "name": "Dizzy",
            "score": 0.4716981132075472
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/tangie",
            "category": "Sativa",
            "name": "Tangie",
            "permalink": "https://mobileapi.leafly.com/sativa/tangie",
            "slug": "tangie",
            "subtitle": null,
            "symbol": "Tg"
        },
        {
            "applink": "leafly://strain/chocolope",
            "category": "Sativa",
            "name": "Chocolope",
            "permalink": "https://mobileapi.leafly.com/sativa/chocolope",
            "slug": "chocolope",
            "subtitle": null,
            "symbol": "Chc"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/tangilope",
    "photoTotalCount": 25,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639210/b/tangilope__primary_6bc6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tangilope_100x100_9701.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/606890/b/tangilope__primary_31a2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tangilope_100x100_13c8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/589391/b/tangilope__primary_b58d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tangilope_100x100_c078.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/557612/b/tangilope__primary_a521.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tangilope_100x100_e371.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/521453/b/tangilope__primary_8d72.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tangilope_100x100_dd6b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/521167/b/tangilope__primary_7f4c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/tangilope_100x100_08fb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Bellingham, WA",
        "Glendale, AZ",
        "Las Vegas, NV",
        "Portland, OR",
        "Renton, WA",
        "Anchorage, AK",
        "Bozeman, MT",
        "Carson City, NV",
        "Flagstaff, AZ",
        "Gold Bar, WA"
    ],
    "rating": 4.54,
    "relatedStrains": [],
    "reviewCount": 115,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "tangilope",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.53913043478261/240",
    "subtitle": null,
    "symbol": "Tlp",
    "symptoms": [
        {
            "name": "Stress",
            "score": 37.832963374028864
        },
        {
            "name": "Depression",
            "score": 37.06992230854606
        },
        {
            "name": "Pain",
            "score": 27.12264150943396
        },
        {
            "name": "Lack of Appetite",
            "score": 15.149833518312986
        },
        {
            "name": "Nausea",
            "score": 14.678135405105438
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
