{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Dante Jordan",
            "category": null,
            "date": "/Date(1504357217000)/",
            "id": "contentitems-40272",
            "text": "Vegas sucks. You know it; I know it; everyone knows it. Vegas is a booze-soaked money grab that if you’ve done once, you’ve done a million times. Yet every time the season rolls around, we all find ourselves booking that room at The Cosmopolitan (best beds of all time) as if we expect it to be different this time around.\nSpoiler alert: This time around it will be different. Because there’s legal weed to be had. Now that Nevada has legalized recreational cannabis use for adults 21 and up, switch your cocktails for cannabinoids and learn how to actually have fun in this city.\nStep one: Hit a dispensary. There are many. I was able to check out two solid ones during my recent visit:\n\nThe Apothecary Shoppe. Product suggestions: Big Smooth (flower), Las Vegas Haze (pre-roll), Chocolate Chip Cookies (edibles).\nEssence Vegas. Product suggestions: Power Plant (pre-roll), Travel Joint (pre-roll), Cadillac Purple (flower).\n\nStep two: Find a place to consume. I’d strongly advise against smoking in your hotel room (unless you’re staying in one of these ones). Of course, public consumption remains illegal, so I’d also strongly advise against that too. However, I will say that there may or may not be a staircase behind Mandalay Bay that no one EVER walks by or through. I will also say that it may OR MAY NOT be the most perfect spot in all of Vegas to enjoy the flowers of your labor. But, you know, that’s only if it exists, which it may or may not.\nStep three: Indulge in one of the following activities. In no particular order, we give you the best things to do as a high cannabis tourist in Las Vegas.\nEat at Nacho Daddy\nIf you do nothing else, make sure to eat at Nacho Daddy. My boy Sutton put me on game and it was the greatest decision I made that whole weekend. $15 won’t get you much in Vegas, but at Nacho Daddy it gets you a big-ass plate of filet mignon (cause I’m fancy like that) nachos that’ll have you feeling like maybe calories aren’t such a bad thing.\nWander Old Vegas and Fremont Street\n(Jacek_Sopotnicki/iStock)\nUp until this last trip, I’d never been to the famous “Old Vegas” that I’d heard so much about. Oh boy is it an experience. It’s the only place I’ve ever been where, within a 437-step distance, you can see a near-naked man dressed as a baby, followed by two white dudes with dreads battle rapping, followed by a bum dropping a deuce by the sunglasses kiosk like the world is his oyster. If you’re planning to a trip to Las Vegas, do yourself a favor, and take a trip downtown for the most Bruh, I’m Way Too High For This Shit experience that the city has to offer.\nWalk the Vegas Strip\nObviously, right? If you touch Vegas and don’t wander aimlessly down the Strip (and then realize it’s actually a lot longer than it looks and now you’re so far from your hotel that you need to catch a Lyft back because your thighs are on fire), then did you really touch Vegas?\nGet high and go on a walk down this street and you’ll find ample bright lights, photo opportunities, and enough street entertainment to keep you busy all night long. Plus there’s hella trash food for you to stop and grab, which is all my happiness requires.\nBacchanal Buffet at Caesars Palace\n(Cybernesco/iStock)\nSpeaking of food, eat at a buffet. Every hotel has one, but if you want the best one? Bacchanal Buffet in Caesars Palace is the answer, my pals.\nThe bad news is that it’ll cost you 50 whole entire dollars, but the good news is they have lobster eggs Benedict and mac and cheese AT THE SAME DAMN TIME. And chicken and waffles. And an entire dessert station. They have it all. Get high, hit BB, and don’t stop eating until you feel $50 of satisfaction in your stomach. I saw a guy take off his shoes and get comfortable because he was full, but hadn’t recouped his money in food yet. Be like that American hero.\nPool Party\nEncore reigns supreme, but honestly, each pool party or beach club offers the same experience: overpriced drinks that never hit because the sun is killing your buzz, and pools of water that are probably half chlorine and half gonorrhea.\nBut hey, at least whatever DJ they booked is playing an excessive amount of UNTZ UNTZ UNTZ, right? RIGHT?! Wrong, but the reason these make the list is because they’re excellent for getting high and people-watching. Trust me.\nDrais Nightclub\n(gruizza/iStock)\nThis is the one club that I’ll absolutely swear by in Vegas. So many artists have residencies here that on any given night you might catch Trey Songz or somebody in concert for the lowest Vegas price possible ($40 for women, $70 for men). I saw Tory Lanez there, and he put on one of the best live shows I’ve ever seen. A friend of mine saw Jeezy there. Last time, I was supposed to go see T.I. but ended up getting too high and passing out. Shout out to Cadillac Purple.\nSee a Show\nVegas shows will hit you for a grip, but in all fairness, so will everything else. At least with these you get some kind of worthwhile return on investment, in the form of a live performance and new experience.\nI’ve only seen the Jabbawockeez and the Blue Man Group, but I can promise you that both of these shows are worth the high, ESPECIALLY the Blue Man Group. They don’t talk, they just make noise and do physical humor. Perfect stoner activity.\nGo Skydiving\n(Rene_Keller/iStock)\nEver gotten super-stoned, then dropped out of a plane with another man strapped to your back? I have. It’s fun as hell too. Vegas offers multiple skydiving spots on the Strip, but the real deal is Skydive Las Vegas, which is about 20–30 minutes from the Strip. According to the company, they’ll take you higher than any other skydiving spot out there … and getting higher is what we’re all about.\nBellagio Water Show\nThe Fountains of Bellagio are pretty cool to see, especially at night. It’s the perfect thing to settle in and stare at indefinitely after you hit a pre-roll or vape pen. It’s also one of the only things in Vegas that’ll leave you like, “Wow, fam, that was mad beautiful and touching.” Mainly because you’ll be so high that everything gets you in your feelings.\nGamble and Ruin Your Life\n(Sezeryadigar/iStock)\nIt’s a monster that you run and run and run from, but eventually it’ll catch you. And once it does, say goodbye to any budget you thought you had. It’s so easy to be walking through a casino lobby and accidentally end up in front of the War table with a stack of $5 chips and a mind full of, “Someone has to win; why not me?” It’s even easier to walk away from that table six minutes later with 200 less dollars than you had. Being high won’t ease the pain of losing money on some dumb shit, but it WILL make it a lot easier for you to say, “Fuck it. At least those nachos were fire.”",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/09/01161530/las-vegas-7.jpg",
            "title": "10 Best Things to Do in Las Vegas While You’re High",
            "urlslug": "/news/lifestyle/best-things-to-do-in-las-vegas-while-high"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1455998400000)/",
            "id": "contentitems-2955",
            "text": "“There’s weed that don’t make you hungry? For real? Honey, this changes everything.”\nThat was my Lyft driver’s response when I told her not all cannabis makes your gullet an insatiable black hole. Most cannabis consumers – especially first-time experimenters – have only tried high-THC strains, so it’s no wonder that the dispelling of this common misconception comes to the surprise of many who have long associated cannabis with the inevitable “munchies” syndrome.\nThe munchies can be a beautiful thing, and I’m not just talking about the pure ecstasy that comes with dual-wielding a fried chicken leg and an ice cream sandwich once in a while. That appetite stimulation is life-changing for patients dealing with cancer, depression, and other gastrointestinal/appetite disorders. But not everyone wants uncontrollable food lust, and some will actively avoid cannabis because of this one side effect – particularly those struggling with pre-existing eating and weight issues.\nFor those of you interested in reaping the myriad of benefits cannabis has to offer without the unbridled gluttony, we hope you find this list helpful. Remember, you can click the strain to see if it’s available at a store or dispensary near you!\n\n \nHigh-CBD Strains\nIf you’ve ever tried a high-CBD strain before, you’ve probably noticed that they don’t summon the munchies monster like THC-rich varieties. A Yale study published last year found that THC – the same chemical responsible for cannabis’ euphoric high – stimulated a group of nerve cells in the hypothalamus, the area of the brain that governs instincts like hunger and arousal.\n\nWhile less is known about CBD’s influence on appetite, we do know that this non-psychoactive constituent counteracts many effects of THC and researchers have even eyed CBD as an anti-obesity treatment based on its activity in the brain. Our own anecdotal evidence leads us to recommend high-CBD, low-THC strains for the best “munchie-less” experience, but a strain with equal parts CBD and THC can also induce less hunger with the added benefit of mild euphoria.\n\n \n\nA popular strain found in many Oregon shops, Harle-Tsu is hybrid cross between two high-CBD parents, Harlequin and Sour Tsunami (which are also worth looking into for minimal munchies strains). Harle-Tsu typically expresses a high-CBD profile with very little THC, making it a perfect choice for anyone who wants the relaxing and therapeutic effects of cannabis minus the euphoria or paranoia.\n \n\nThe “Remedy” for your over-excited appetite is this indica cross between Cannatonic and Afghan Skunk. With a THC content that rarely squeaks past 1%, Remedy delivers mental tranquility and physical relief without the psychoactive burden. This Pacific Northwest strain is perfect for the patient needing to curb pain, anxiety, tension, headaches, or insomnia, but doesn’t want to interrupt their day with hourly snack breaks.\n \n\nCanna-Tsu is taking off across the U.S., discoverable in Oregon, California, Illinois, Washington, Colorado, and many other medical marijuana states. Sweet and earthy in flavor, Canna-Tsu provides a boost to both mood and focus. Though this strain may calm upset tummies, you shouldn’t feel any extra rumblings of hunger.\n \n\nFor uncompromised energy and clarity, we recommend the low-munchies sativa MediHaze. This one can sometimes exhibit equal levels of THC and CBD, but compared to high-THC, low-CBD strains, MediHaze is much better for keeping the appetite at bay.\n \n\nSimilar to the widely coveted ACDC hybrid, Cannatonic is a high-CBD strain that relaxes the body while leaving the mind free to focus. On average, Cannatonic has a 2:1 ratio of CBD:THC, meaning you probably won’t feel much in the way of a high or hunger.\n \nHigh THCV Sativa Strains\nBy now you know what THC and CBD is, but you may not be familiar with the less ubiquitous THCV, a related chemical that suppresses appetite. While most strains on the market today tend to test anywhere between 10-20% THC, what’s considered a high THCV content might only hit a high-water mark of 5%. THCV tends to be more abundant in sativa strains, and it’s possible you’ve noticed that sativas tend to provoke hunger less than indica strains. The unique metabolic effects of THCV even have researchers considering its utility in treating obesity and diabetes.\n\nWhile high-CBD strains tend to induce little to no high, these THCV-rich sativas produce high-energy, psychoactive effects. That’s good news if you like the euphoria associated with cannabis, but don’t want the raging appetite.\n \n\nWith an average THCV content that ranges between 0.2 to 1.8%, Durban Poison is the perfect weapon against overactive appetites and can be found in most major markets. Cherished for its active, upbeat high that can fuel productivity, this pure African sativa keeps you focused on what matters more than snacks.\n \n\nResist the call of the pizza with Power Plant, an electrifying sativa that descends from African landrace strains. Its spicy, peppery aroma perks up the senses, leaving you with inspiration and positivity instead of a demanding stomach. You can find Power Plant in many different markets across the U.S. and beyond, so check to see if a shop near you is carrying it.\n \n\nKill the temptation to order half Taco Bell’s menu with Jack the Ripper, a sativa strain that carries a tantalizing lemon scent. A favorite in the Pacific Northwest, this invigorating sativa is sure to summon a talkative mood long before a talkative tum.\n \n\nAnother African sativa, Red Congolese focuses all of its psychoactive energy in the head, helping creativity and focus to thrive. Among the list of activities this sativa motivates, you’ll sooner find hiking, painting, and reading more appealing than eating the entire contents of your fridge. Though most frequently found in Vancouver, BC and Ontario, you might be delightfully surprised by its occasional appearance on the West Coast and in other areas of the U.S..\n \n\nAs sweet and citrusy as this sativa might taste, Moby Dick doesn’t coerce the appetite as much as other strains. Expect instead to feel your mood and energy elevate to a place in which it’s easy to feel satisfied whether or not you treated yourself to an entire cheesecake. This sativa is lovingly embraced in Canada and Spain, although Americans have also reported sightings of the legendary Moby Dick in many markets.\nInterested in strains that do make you hungry? Try these 10!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/10173255/iStock-526148526.jpg",
            "title": "10 Cannabis Strains That Won’t Make You (As) Hungry",
            "urlslug": "/news/strains-products/10-cannabis-strains-that-wont-make-you-as-hungry"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 36.01899220371672
        },
        {
            "name": "Migraines",
            "score": 11.393142975445247
        },
        {
            "name": "Arthritis",
            "score": 9.04758402388463
        },
        {
            "name": "ADD/ADHD",
            "score": 7.969806427711402
        },
        {
            "name": "Bipolar Disorder",
            "score": 7.337618292662993
        }
    ],
    "description": "<p>Power Plant comes from Dutch Passion Seed Company and is derived from powerful South African sativa strains. Thanks to this, these plants have a fast growing time compared to most sativas and will produce either many medium-sized flowers or a few very large buds with smaller &ldquo;popcorn&rdquo; buds&nbsp;between 7 and 9 weeks. These plants are troopers and will do well in almost any grow environment, but its woody, earthy scent is pungent,&nbsp;so indoor growers will have to prepare. Power Plant has a sharp, peppery taste. While many sativas are good choices for a clear-headed buzz, this plant&rsquo;s high THC content makes it powerful. It makes some users happy and creative, though effects may verge on too intoxicating&nbsp;for some.</p>\n",
    "descriptionPlain": "Power Plant comes from Dutch Passion Seed Company and is derived from powerful South African sativa strains. Thanks to this, these plants have a fast growing time compared to most sativas and will produce either many medium-sized flowers or a few very large buds with smaller &ldquo;popcorn&rdquo; buds&nbsp;between 7 and 9 weeks. These plants are troopers and will do well in almost any grow environment, but its woody, earthy scent is pungent,&nbsp;so indoor growers will have to prepare. Power Plant has a sharp, peppery taste. While many sativas are good choices for a clear-headed buzz, this plant&rsquo;s high THC content makes it powerful. It makes some users happy and creative, though effects may verge on too intoxicating&nbsp;for some.\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 83.29560498831374
        },
        {
            "name": "Euphoric",
            "score": 81.58563925709211
        },
        {
            "name": "Happy",
            "score": 73.66459365074176
        },
        {
            "name": "Energetic",
            "score": 73.61242774409014
        },
        {
            "name": "Talkative",
            "score": 60.81618532380999
        }
    ],
    "flavors": [
        {
            "name": "Pepper",
            "score": 38.55435060937406
        },
        {
            "name": "Woody",
            "score": 32.98226903987491
        },
        {
            "name": "Earthy",
            "score": 30.575418553083917
        },
        {
            "name": "Citrus",
            "score": 28.404608578635674
        },
        {
            "name": "Spicy/Herbal",
            "score": 22.12631231987099
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 56,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1410870,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Power Plant is my favorite daytime use.  I have extreme chronic pain from fibromalgia and it allows me to stay clear headed and reduced my pain significantly.  I also feel energized from both the strain and reduction in pain.  What amazed me about this strain is how clear headed it is and how clear my vision becomes.  It has been the best strain for me.  I can be in 7-9 level pain and feel an immediate and significant reduction in pain.  \r\n\r\nDownsides.  You end up gabbing like a 13 year old juinior highschool girl.  Which can be good or bad depending on the work environment.  Other than that, focus tends to float from task to task and is helpful to use todo lists, etc. when on the strain to help with focus.  ",
            "username": "MuddyWaters"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/8AEOnyObscLzPEdm7ERjYOUx4RU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fP4YFTRznSDCEVP7Fycg7_nerd-red.png",
            "id": 1638863,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Definitely one of the most powerful sativas I've ever tried. so when  you're new to the world of weed I for sure won't recommend trying this strain. if you're not used it u could totally get a couchlock that let's u drift off your mind for hours and hours. if you are somebody like me who suffers from an chronic illness and have almost constant pain... I recommend the power plant. it treats your pain perfectly such as an indica would do. you will get very talkative and feel super focused when doing something. awesome strain that I would definitely smoke again ✌",
            "username": "tschindari"
        }
    ],
    "id": 333,
    "name": "Power Plant",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 54.58072503800075
        },
        {
            "name": "Dry Eyes",
            "score": 35.31277751445118
        },
        {
            "name": "Paranoid",
            "score": 16.173337909767962
        },
        {
            "name": "Dizzy",
            "score": 15.424287247546975
        },
        {
            "name": "Anxious",
            "score": 14.463372178546326
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/african",
            "category": "Sativa",
            "name": "African",
            "permalink": "https://mobileapi.leafly.com/sativa/african",
            "slug": "african",
            "subtitle": null,
            "symbol": "Afr"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/power-plant",
    "photoTotalCount": 87,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/627946/b/power-plant__primary_a3db.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-plant_100x100_4814.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/622928/b/power-plant__primary_f084.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-plant_100x100_2d3f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/586923/b/power-plant__primary_78be.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-plant_100x100_bd28.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/567194/b/power-plant__primary_f69f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-plant_100x100_b29f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/562289/b/power-plant__primary_f2aa.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-plant_100x100_edc4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/556970/b/power-plant__primary_2980.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/power-plant_100x100_35e8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "San Francisco, CA",
        "Calgary, AB",
        "Montréal, QC",
        "Portland, OR",
        "Toronto, ON",
        "Corvallis, OR",
        "Denver, CO",
        "Edmonton, AB",
        "Eugene, OR",
        "Halifax, NS"
    ],
    "rating": 4.2,
    "relatedStrains": [],
    "reviewCount": 301,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "power-plant",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.20265780730897/240",
    "subtitle": null,
    "symbol": "Pwp",
    "symptoms": [
        {
            "name": "Depression",
            "score": 32.89319200867343
        },
        {
            "name": "Stress",
            "score": 31.729742466589304
        },
        {
            "name": "Pain",
            "score": 26.14833096339397
        },
        {
            "name": "Headaches",
            "score": 20.9501277588001
        },
        {
            "name": "Fatigue",
            "score": 15.915232444742275
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
