{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1422986400000)/",
            "id": "contentitems-5905",
            "text": "THCV, or tetrahydrocannabivarin, is a compound in cannabis that offers a unique array of effects and medical benefits that sets it apart from other cannabinoids like THC and CBD. Whether you’re a medical marijuana patient looking for a particular type of relief or a casual consumer chasing a specific effect, we’d like to introduce you to this fascinating compound that’s sure to make major waves in the cannabis world as we discover and utilize its full potential.\nWhat are THCV’s Effects and Benefits?\nAs its name suggests, THCV is similar to THC in molecular structure and psychoactive properties, but it provides a variety of pronounced and altogether different effects. A note for vaporizer enthusiasts: THCV has a boiling point of 428 °F (220 °C), so you’ll need to turn it up higher than you would THC.\n\n\nTHCV is an appetite suppressant. In contrast to THC, THCV may dull the appetite. This may be good for consumers focused on weight loss, but THCV should be avoided by patients treating appetite loss or anorexia.\nTHCV may help with diabetes. Research shows promise in THCV’s ability to regulate blood sugar levels and reduce insulin resistance.\nTHCV may reduce panic attacks. It appears to curb anxiety attacks in PTSD patients without suppressing emotion.\nTHCV may help with Alzheimer’s. Tremors, motor control, and brain lesions associated with Alzheimer’s disease appear to be improved by THCV, but research is in progress.\nTHCV stimulates bone growth. Because it promotes the growth of new bone cells, THCV is being looked at for osteoporosis and other bone-related conditions.\n\n\nWhere Can I Find THCV?\nSo you’re looking for the effects mentioned above, but you aren’t sure where to start your search for high-THCV strains and products. Most strains only contain trace, undetectable amounts of THCV, making it difficult to achieve the desired therapeutic effect. We can assume that more THCV-rich products will be introduced alongside its growing popularity, but in the meantime, here are some useful hints for locating this rare therapeutic gem.\n\nLook for African sativas. Lab results show that THCV is most abundant in sativas, particularly landrace strains from Africa. Durban Poison is one of the more common high-THCV strains, but other options can be found in the strain list below.\nAsk about parent genetics. Having trouble finding an African sativa? Plenty of strains have hybridized African genetics that predispose it to a higher THCV potential. Cherry Pie, for example, may express a high THCV content by way of its Durban Poison parent. Look for lineage information in Leafly’s strain pages or ask your budtenders to point out their African hybrids.\nRequest test results. Genetics alone can’t promise a high-THCV content, and cannabinoid contents can vary from harvest to harvest. If possible, ask your budtender for lab-tested strains to ensure that you’re indeed getting a THCV-rich product.\n\n\nHigh THCV Cannabis Strains\nThis list is by no means comprehensive, but it includes strains best known for their tendency toward higher-than-average THCV contents. These strains can be consumed in flower form or they can be processed into extracts, oils, and edibles for a higher concentration of cannabinoids. A few of the strains below, like Doug’s Varin and Pineapple Purps, were specially bred to contain higher levels of THCV. Again, be sure to steer your choices toward African sativas as they tend to contain the most THCV.\n\n\n\n\nDoug’s Varin\n\nPineapple Purps\n\nDurban Poison\n\n\n\nPower Plant\n\nWillie Nelson\n\nRed Congolese\n\n\n\nJack the Ripper\n\nDurban Cheese\n\nSkunk #1",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/02/29195248/what-is-thcv-and-what-are-the-benefits-of-this-cannabinoid.jpg",
            "title": "What Is THCV and What Are the Benefits of This Cannabinoid?",
            "urlslug": "/news/cannabis-101/what-is-thcv-and-what-are-the-benefits-of-this-cannabinoid"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1422723600000)/",
            "id": "contentitems-3263",
            "text": "Lots of new strains are waiting for you in the Leafly Explorer, but we'd like to highlight five of our favorite newcomers this week. With names based on Breaking Bad puns and overpriced fashion accessories, maybe a few of these varieties will pique your interest. Already had a chance to test drive one of these fine specimens? Review, review, review. We're dying to know what you thought!\n   1. Dank Schrader\nCharacteristics of Dank Schrader:\n\nDank Schrader is the house strain at The Healing Center in Vancouver, BC. The strain was developed during the final season of Breaking Bad and is named after DEA Agent Hank Schrader, a character on the show. Dank Schrader crosses Rockstar Kush with Bubba Kush to create a potent and relaxing indica-driven hybrid that has tested out as high as 27% THC according to dispensary’s lab results, performed by Hedron Analytical.\n\n   2. Pineapple Purps\nCharacteristics of Pineapple Purps:\n\nPineapple Purps is a sativa-dominant strain that is rarely found but always cherished by those looking for strains with a high THCV cannabinoid profile. THCV, a compound known to block panic attacks, reduce Parkinson’s tremors, and suppress the appetite, is typically only found in trace amounts in most cannabis, but Pineapple Purps is a special variety that can express a THC:THCV ratio of 3:1. This strain is highly psychoactive and energetic, but its effects generally won’t last as long as low-THCV varieties. \n\n   3. Gucci OG\nCharacteristics of Gucci OG:\n\nGucci OG is an OG Kush variant named with the lavish cannabis connoisseur in mind. Hailing from southern California like so many of its OG relatives, Gucci OG takes on the family’s signature aroma of pine and lemon, but with a unique hint of sweet berry. This hybrid’s effect can vary with different doses; small amounts may provide a spark of energy and creativity, while larger doses tend to give way to heavy sedation or dizzying euphoria. \n\n   4. White Fire 43\nCharacteristics of White Fire 43:\n\nWhite Fire 43 is a select phenotype of White Fire OG grown by TLC Collective in Los Angeles, CA. Number 43 was the standout phenotype in a lot of over 500 White Fire OG seeds, originally bred by OG Raskal. White Fire 43 is known for its exceptional cannabinoid production, with claims of test results regularly nearing 30%. The strong medicinal and pain-fighting effects are ushered in with a pungent earthy aroma that is amplified by flavors of lemons and sour citrus. White Fire 43 is an indica-dominant hybrid that is great before bedtime, helping you relax, decompress, and find sleep.\n\n   5. Orange Cookies\nCharacteristics of Orange Cookies:\n\nOrange Cookies bred by Franchise Genetics is a hybrid that combines Orange Juice with the renowned GSC (f.k.a Girl Scout Cookies). A flavor-packed strain, Orange Cookies expresses itself with a strong aroma of sweet citrus that closely resembles a fresh tangerine. The flavors of Orange Cookies gives way to deep calming body effects that mingle with a euphoric cerebral buzz to leave you happy and relaxed.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/01/12002042/new-strains-alert-dank-schrader-pineapple-purps-gucci-og-white-fi.png",
            "title": "New Strains Alert: Dank Schrader, Pineapple Purps, Gucci OG, White Fire 43, and Orange Cookies",
            "urlslug": "/news/strains-products/new-strains-alert-dank-schrader-pineapple-purps-gucci-og-white-fi"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 4.6875
        },
        {
            "name": "ADD/ADHD",
            "score": 3.125
        },
        {
            "name": "Arthritis",
            "score": 3.125
        },
        {
            "name": "Cancer",
            "score": 3.125
        },
        {
            "name": "PTSD",
            "score": 3.125
        }
    ],
    "description": "<p>Pineapple Purps is a <a href=\"http://leafly.com/sativa\">sativa</a>-dominant strain that is rarely found but always cherished by those looking for strains with a high <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/understanding-cannabis-testing\">THCV</a> cannabinoid profile. THCV, a compound known to block <a href=\"http://www.leafly.com/explore#!/explore/conditions-ptsd\">panic attacks</a>, reduce <a href=\"http://www.leafly.com/explore#/explore/conditions-parkinsons\">Parkinson&rsquo;s</a> tremors, and suppress the appetite, is typically only found in trace amounts in most cannabis, but Pineapple Purps is a special variety that can express a THC:THCV ratio of 3:1. This strain is highly psychoactive and <a href=\"http://www.leafly.com/explore#/explore/tags-energetic\">energetic</a>, but its effects generally won&rsquo;t last as long as low-THCV varieties.&nbsp;</p>\n",
    "descriptionPlain": "Pineapple Purps is a sativa-dominant strain that is rarely found but always cherished by those looking for strains with a high THCV cannabinoid profile. THCV, a compound known to block panic attacks, reduce Parkinson&rsquo;s tremors, and suppress the appetite, is typically only found in trace amounts in most cannabis, but Pineapple Purps is a special variety that can express a THC:THCV ratio of 3:1. This strain is highly psychoactive and energetic, but its effects generally won&rsquo;t last as long as low-THCV varieties.&nbsp;\n",
    "effects": [
        {
            "name": "Creative",
            "score": 36.45833333333333
        },
        {
            "name": "Uplifted",
            "score": 24.479166666666664
        },
        {
            "name": "Relaxed",
            "score": 24.479166666666664
        },
        {
            "name": "Euphoric",
            "score": 21.354166666666664
        },
        {
            "name": "Energetic",
            "score": 19.791666666666664
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 22.916666666666664
        },
        {
            "name": "Pineapple",
            "score": 21.354166666666664
        },
        {
            "name": "Berry",
            "score": 19.791666666666664
        },
        {
            "name": "Sweet",
            "score": 6.25
        },
        {
            "name": "Pungent",
            "score": 3.125
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1395838,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "It's verrry different from anything that I have ever had. It behaves like an indica hybrid, but at the same time I notice waves of cbd clarity every few seconds. I picked this up from a friends father who suffers from hard pain and anxiety attacks. Its a unique strain for sure put has a nice berry smell along with textures of it but after a while tastes like wood and stale pungent-ness. This has nice creative sides to this and will put it on a must list to grow, so much better than Panama red in my opinion. Would do this strain to the moon and back great for really unwinding all the way and not holding a dam thing back absolute bliss for this strain 5stars! Its a very day dream, but instant reality check too.",
            "username": "Chill_Panda"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1479901,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "The bud itself is one of the coolest looking I've ever seen. Some of the nugs were completely black! The smell reminds me of berries and is unique to this strain. \n\nThe high itself had me making great jokes and super giggly. Great high if you're going to a party or looking to spark some  conversation with friends.",
            "username": "sick_as_clique"
        }
    ],
    "id": 134383,
    "name": "Pineapple Purps",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 19.791666666666664
        },
        {
            "name": "Anxious",
            "score": 1.5625
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/sativa/pineapple-purps",
    "photoTotalCount": 6,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/422325/b/pineapple-purps__primary_ce41.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-purps_100x100_c5b1.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/319500/b/pineapple-purps__primary_a566.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-purps_100x100_a0b2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/319061/b/pineapple-purps__primary_576a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-purps_100x100_b95c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/318930/b/pineapple-purps__primary_0be5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-purps_100x100_0feb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/294678/b/pineapple-purps__primary_02ac.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-purps_100x100_b273.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/267696/b/pineapple-purps__primary_3cae.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pineapple-purps_100x100_6e43.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [],
    "rating": 4.41,
    "relatedStrains": [],
    "reviewCount": 17,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "pineapple-purps",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.41176470588235/240",
    "subtitle": null,
    "symbol": "Pnp",
    "symptoms": [
        {
            "name": "Inflammation",
            "score": 3.125
        },
        {
            "name": "Depression",
            "score": 1.5625
        },
        {
            "name": "Eye Pressure",
            "score": 1.5625
        },
        {
            "name": "Fatigue",
            "score": 1.5625
        },
        {
            "name": "Headaches",
            "score": 1.5625
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
