{
    "aka": null,
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1501426821000)/",
            "id": "contentitems-35532",
            "text": "One of the things that makes every cannabis strain unique is its aroma. From sweet berry and fruit to earthy, herbal, and floral, an attractive fragrance is native to most strains.\nAnd then there are those that, whether by accident or breeder’s intention, inherited flavors that truly challenge the palate. With names like “Cat Piss” and “Dog Shit,” it’s clear that no one is in denial of this odiferous reality.\nOddly enough, either by novelty or quality of effects, many of these remain staples in the cannabis community despite their strange, borderline terrible aromas.\n\n   Sour Cheese\nSour Cheese, UK Cheese, Exodus Cheese…all of these strains refer to a lineage characterized by a sour, savory aroma. Offering mellow euphoria that lifts energy and mood, Sour Cheese is a delightful hybrid strain with a funky flavor that most consumers can look past. But with a fragrance this stinky, we see polarized opinions.\nSome love it so much, it inspires poetry. Just magical:\n\n“When you open the jar and take a whiff you are greeted with a splash of pungent sour that quickly turns into a smooth cheese. The buds release a satisfying snap that throws trichomes into the air when broken from the stems.” – Neemix\n\nBut then:\n\n“[S]mells like puke.” – soop21\n\n\n   Cat Piss\nThis sativa has a pungent aroma that is reminiscent of ammonia–and thus, cat urine. But there’s a reason Cat Piss keeps getting planted, and it has something to do with the buzzy, stimulating effects considered to be worth the funk, according to many Leafly reviewers.\n\n“Besides the [wretched] taste that leaves you wanting water and a mint, soon you will be too uplifted to care! Effects are amazing and are long lasting.” –misterbest\n\nHowever, if you’re susceptible to paranoia and anxiety like this poor reviewer, maybe avoid this novelty strain altogether:\n\n“Yuck. It really does smell like cat piss. Strong, racy sativa. Made me paranoid.” –aarvind\n\n\n   Dog Shit\nSpeaking of animal waste you’d never expect to find yourself smoking, Dog Shit is yet another strain named for its foul-smelling aroma. A hybrid strain most easily acquired in Oregon, its odor doesn’t always come out smelling like sour, funky “doody pies.” But even when it does, Dog Shit retains an unexpected fan base:\n\n“My first impressions of the bud were that they were very stinky and definitely lived up to their name however once I smoked it the smell evolved into something more sweet and pleasant.” – DogeKing\n\nBut, to the shock of absolutely no one, this poopy scented strain ain’t for everyone:\n\n“I got very anxious and paranoid when taking this and it smells kinda bad.” – BONECRUSHER27\n\n\n   M-39\nBased on descriptions from Leafly users, M-39 sounds like Canadian ditchweed grown in a tar pit. And, according to reviews, its aroma is most commonly likened to just that–tar. Some say that its abundance can be attributed to its dull, lackluster aroma that made it easier to smuggle. Across the board, it seems the quality of this strain varies, as well as opinions of it:\n\n“It has a very strong smell almost a combination of paint and smelly body odor.” – StoneySundays\n\nBut I guess it isn’t always bad:\n\n“[H]as a soft smoke with notes of peanut butter and fall aroma.” – ray8753\n\nSo does it taste like tar or warm autumnal cookies? You’ll probably have to wander over to Canada’s black market to find out.\n\n   Grandpa’s Breath\nThere’s a slightly musty hint to this strain, but it’s really not as bad as it sounds. Grandpa’s Breath is more aptly named for the Granddaddy Purple genetics used to breed it, but still, expectations set by the name can shape the experience.\n\n“Real nice body high, heavy relaxed head feeling, taste isn’t amazing but isn’t unpleasant either.” – hazefordayz\n\nBut this reviewer not only loves Grandpa’s Breath – he/she “loooooves” it:\n\n“This is one of the best tasting and medicating, fragrant strains I’ve ever had. I looooove Grandpa’s Breath!” – Strandz\n\nIt’s clear that there’s a layer of subjectivity when it comes to cannabis flavors–even flavors as unusual and questionable as those explored in this roundup. Although you may never want to try any of these, they do demonstrate the vast aromatic spectrum cannabis has to offer. And that, at the very least, is kind of impressive.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/07/28114836/cannabis-aroma-1.jpg",
            "title": "5 Cannabis Strains With Unusual (and Arguably Terrible) Aromas",
            "urlslug": "/news/strains-products/cannabis-strains-with-unusual-aromas"
        },
        {
            "author": "Rebecca Kelley",
            "category": null,
            "date": "/Date(1434816000000)/",
            "id": "contentitems-4263",
            "text": "(Other than a cat, of course. And a skunk.)\nThe maned wolf looks more like a fox/dog hybrid than something you'd see CGI'd into Game of Thrones, but its urine scent has given it the nickname of yet another mammal that's often used to describe the odor of a certain plant.\nAlso known as the \"skunk wolf,\" the maned wolf's urine contains pyrazines, a combination of carbon, nitrogen, and hydrogen that separates from its urine and brings a pungent, familiar smell to the air. Indeed, this lanky mammal's pee stink bears an uncanny resemblance to the scent of cannabis, so much so that in 2006, police were called to the Rotterdam Zoo to investigate complaints of a patron who was smoking cannabis while checking out the animals on display. Instead, they realized that the offending odor was actually originating from a maned wolf's bathroom break. Whoops.\nWhat I want to know is how long will it take for a grower to come up with a potent batch of Maned Wolf? I could see it being a cross between Red Haze and Cat Piss, both of which are pungent, skunky sativa strains. Any takers?",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/06/23200855/weekend-weirdness-which-animals-pee-smells-like-cannabis.jpg",
            "title": "Weekend Weirdness: Which Animal's Pee Smells Like Cannabis?",
            "urlslug": "/news/politics/weekend-weirdness-which-animals-pee-smells-like-cannabis"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 27.855731225296445
        },
        {
            "name": "Arthritis",
            "score": 20.49715909090909
        },
        {
            "name": "ADD/ADHD",
            "score": 13.878458498023717
        },
        {
            "name": "PMS",
            "score": 13.23925395256917
        },
        {
            "name": "Migraines",
            "score": 11.917613636363637
        }
    ],
    "description": "<p>Originally a clone-only <a href=\"https://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\">phenotype</a> of <a href=\"https://www.leafly.com/sativa/super-silver-haze\">Super Silver Haze</a>, Cat Piss is a sativa-dominant strain that has a uniquely pungent ammonia-like stench reminiscent of its name. It has been crossed with other strains to create seed lines with varying phenotypes including indica-dominant varieties, however it is generally considered to be more of a sativa. The flavors are sweet with undertones of pine, and the high is uplifting and cerebral with a nice relaxing body feel that makes it a good option for daytime use.</p>\n",
    "descriptionPlain": "Originally a clone-only phenotype of Super Silver Haze, Cat Piss is a sativa-dominant strain that has a uniquely pungent ammonia-like stench reminiscent of its name. It has been crossed with other strains to create seed lines with varying phenotypes including indica-dominant varieties, however it is generally considered to be more of a sativa. The flavors are sweet with undertones of pine, and the high is uplifting and cerebral with a nice relaxing body feel that makes it a good option for daytime use.\n",
    "effects": [
        {
            "name": "Energetic",
            "score": 54.06744071146245
        },
        {
            "name": "Happy",
            "score": 46.12709980237154
        },
        {
            "name": "Creative",
            "score": 36.76445158102767
        },
        {
            "name": "Uplifted",
            "score": 31.2110918972332
        },
        {
            "name": "Hungry",
            "score": 29.788784584980235
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 31.323493083003953
        },
        {
            "name": "Ammonia",
            "score": 22.361042490118578
        },
        {
            "name": "Pungent",
            "score": 20.001852766798418
        },
        {
            "name": "Woody",
            "score": 15.41316699604743
        },
        {
            "name": "Pine",
            "score": 13.52334486166008
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1381696,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/0/240",
            "text": "What an interesting strain. Based off the reviews,I was not pleased to be receiving my batch. Half of a hit later, I am happy I made this choice. The smell is not as bad as people exaggerated, nor is the taste. It has a strong dank smell but not something to worry you. I would call this a pro strain because one hit and life is feeling really good. First hit was harsh and I coughed for a while but it was smooth sailing afterwards. People say this is a social strain. Yes! Yes it is. Prepare to want to talk a lot and want to make friends with the world! The high lasted about an hour for me which is impressive. Not sure yet, but I feel this strain might beat out Maui Waui for top dog. ",
            "username": "L0v3"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1634460,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "The first high grade Cannabis I even experienced at a kid was a no name strain that held the strong alien cat piss aroma and flavor.  It always reminded me of that floating green island level of Tomb Raider 2.    I thought high grade strains were overhyped until that point.  I still like the basic skunk, spice, hash, sugar, cedar flavors of reggie, but why settle?  When there's cat piss to be grown,  go for the good stuff!  \n\nAnd if thus smell turns you off, why the hell are you smoking weed?  Lol.  It doesn't smell like cat urine it smells like plenty of plants and trees in nature that remind you of cat piss.  Seriously,  weed flavors are the good versions of all the world's bad biosynthesis smells.  Mango and Silver haze are right there rubbing elbows with Cat Piss, in the converging sliding bars Cannabis aromas. Its not that far off,lol. Dont be so weak minded.  The best weed smell like 'baby poop' or 'dirty armpit' or other bacterial biologic smells. Why would anyone enjoy that? Gain some experience and stop being so placeboed.  Cannabis is a naturally gmo plant; horizontal gene transfer mediated by agrobacterium.  Its literally a fermented plant.  If you cant accept that,  then stop smoking weed please I'm sick of all the soccer mom opinions changing the face of Cannabis. ",
            "username": "SnowjobKush"
        }
    ],
    "id": 670,
    "name": "Cat Piss",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 18.512228260869563
        },
        {
            "name": "Dizzy",
            "score": 16.407485177865613
        },
        {
            "name": "Anxious",
            "score": 10.639204545454545
        },
        {
            "name": "Dry Eyes",
            "score": 7.898962450592885
        },
        {
            "name": "Paranoid",
            "score": 4.162549407114624
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/super-silver-haze",
            "category": "Sativa",
            "name": "Super Silver Haze",
            "permalink": "https://mobileapi.leafly.com/sativa/super-silver-haze",
            "slug": "super-silver-haze",
            "subtitle": null,
            "symbol": "Ss"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/cat-piss",
    "photoTotalCount": 80,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001380/b/cat-piss__primary_c4fd.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cat-piss_100x100_88e2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/630670/b/cat-piss__primary_6cfb.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cat-piss_100x100_9d75.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/534093/b/cat-piss__primary_4579.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cat-piss_100x100_e205.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/522570/b/cat-piss__primary_fa1d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cat-piss_100x100_2cd8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/519089/b/cat-piss__primary_c7fe.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cat-piss_100x100_5ac7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/519120/b/cat-piss__primary_9a82.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/cat-piss_100x100_928e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Detroit, MI",
        "Seattle, WA",
        "Caguas, Caguas, Puerto Rico",
        "Everett, WA",
        "Mountlake Terrace, WA",
        "Bend, OR",
        "Covington, WA",
        "De Beque, CO",
        "Kirkland, WA",
        "Lansing, MI"
    ],
    "rating": 3.92,
    "relatedStrains": [],
    "reviewCount": 249,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "cat-piss",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/3.91566265060241/240",
    "subtitle": null,
    "symbol": "Cat",
    "symptoms": [
        {
            "name": "Stress",
            "score": 37.687747035573125
        },
        {
            "name": "Pain",
            "score": 27.401803359683797
        },
        {
            "name": "Nausea",
            "score": 21.917613636363637
        },
        {
            "name": "Depression",
            "score": 18.964303359683793
        },
        {
            "name": "Headaches",
            "score": 16.052371541501977
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
