{"sl_translate":"description,descriptionPlain,category","id":194257,"slug":"incredible-hulk","name":"Incredible Hulk","subtitle":null,"symbol":"Inc","category":"Sativa","description":"\u003cp\u003eIncredible Hulk is a sativa strain that harnesses the active and stimulating effects of its parent strains, \u003ca href=\"https://www.leafly.com/sativa/green-crack\"\u003eGreen Crack\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/sativa/jack-herer\"\u003eJack Herer\u003c/a\u003e. Creativity and social energy get a boost while blueberry, pineapple, and earthy flavors overwhelm the palate. This high-energy sativa is preferred as a daytime remedy for minor aches and pains.\u003c/p\u003e\n","descriptionPlain":"Incredible Hulk is a sativa strain that harnesses the active and stimulating effects of its parent strains, Green Crack and Jack Herer. Creativity and social energy get a boost while blueberry, pineapple, and earthy flavors overwhelm the palate. This high-energy sativa is preferred as a daytime remedy for minor aches and pains.\n","aka":null,"rating":4.54,"highlightedReviews":[{"id":1386580,"username":"TheBigGreenGiant","text":"Man this strain is chronic! Smoke this and it instantly hits you like a brick wall! Got hold of a sample so didn\u0027t have too much and ended up sharing one joints worth between 3 of us - and it\u0027s a good job too. Fried the lot of us and safe to assume you don\u0027t need much of this to feel the full effects. Was a smooth smoke which took me by surprise but nevertheless a bonus.  At first I was in a heavy body high state, but after about half an hour or so I was in the mood to get up and be active, resulting in me jogging in the rain to the shop.  Honestly this is one hell of a strain!  If there\u0027s an opportunity to get hold of this then take it with both hands.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1636054,"username":"RandomStoner18","text":"On cloud nine and didn\u0027t even finish the bowl. I\u0027ve cut down my usage from being stoned 24/7 to a couple bowls a day. Weed is weed, and high is high, but when you\u0027ve grown a tolerance the high it becomes more comfortable than exciting. This weed takes me on different roller-coaster rides each time I smoke it.  Right now my mind is thinking about a thousand different things at once, yet it\u0027s not overwhelming or stressful. I\u0027m distant, yet focused. My stress, anxiety, and sadness are all gone. I\u0027m suddenly hopeful and motivated. \n\nThe smell is pungent and wonderful. If I close my eyes and smell it I think of a rain forest shrouded in tall pine trees. In the distance is a shallow river surrounded with rocks enveloped in moss.\n\nThe taste is fantastic in my pipe. Very earthy and bold, but smooth. I bet this would be amazing in a nice bong.\n\nDry mouth is only really evident when talking for a long period of time. \n\nIf you\u0027re keeping yourself occupied the munchies are tamable. If you\u0027re being lazy you\u0027ll eat enough food for 3 people and still want to order a pizza. Not even because you\u0027re hungry, but because there\u0027s so many tasty flavors out there.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3071","title":"Catch These 7 Cannabis Strains for Your Next Pokémon GO Session","author":"Gage Peake","category":null,"date":"\/Date(1468301400000)\/","text":"Have you noticed more people walking around your neighborhood swiping on their cell phone in an almost zombie-like-state recently? Chances are, that person is trying to catch ‘em all on the new gaming app Pokémon GO, which his already been installed more times in its first week than the dating app Tinder in its five years of existence. After a few of us here at Leafly were wandering around the office trying to capture a creature, we figured we’d give our tired legs a break and come up with a list of the best cannabis strains to pair with your next Pokémon GO session.\nPick up one of these strain options before you get back out there and start playing right Meowth.\n  Fire OG\nFire OG is an ideal choice for the next time you and your friends are out trying to catch the fire-breathing Charizard. Powerful in its own right, Charizard’s flame is so hot, it can melt boulders, making it the perfect match for the strongest of the OG strains that sports red hairs (which gives this hybrid its “Fire” name).\n“Fire OG is NOT to be underestimated. As a super- sativa afficanado [sic] I’m usually somewhat [relatively] underwhelmed by decent, but dime a dozen “OG’s.” This however, is a kick in the face and a ripping sativa one at that. Fire OG and its crosses Firewalker (fire x skywalker) and Fire King (x king louis) are all superior, (while I believe the latter to be the strongest) this is fucking intense and uplifting until you start to feel your eyes seal. Once that happens (an hour thirty in) you ARE going to relax… fetally. 10/10.” – Jackboothe\n  Durban Poison\nFeeling a little sleepy while on your walk? Don’t end up feeling like a Snorlax The pure sativa Durban Poison will be the perfect strain to help you stay in tune with your surroundings.\n“Does not get any better than this,exactly what you would expect from a sativa, energizing uplifting and a very tasty sweet pine and citrus flavor, definitely one of my top 5 favorite strains.” – RiPpEdCiTy\n  707 Headband\nAnother strain that can help treat some tension and anxiety you might face when trying to catch ‘em all, Headband 707 brings a strong hybrid high that leaves consumers feeling “heady” and creative rather than sleepy.\n“With its strong, sweet aroma, headband is a sensation for even the most critical of cannabis pundits. I enjoy the creative/anxiolytic effects that come up, makes my dreams appear as if I am a young Pokemon master. The old Pokemon, not this new crap.” – Dwarren\n  Poison Haze\nWhile out trying to catch the poison/ground type Nidoqueen, this Poison Haze strain with its sweet, citrus aroma will help you take her and her powerful tail down in battle. Its energetic and happy high will help any adult Pokémon fan through his or her voyage in catching the characters.\n“This is an extremely potent strain with a intense powerful high. The high was similar to the high from durban poison, except it lasted a hell of a lot longer. It was a very enjoyable high. Got rushes of energy and these wierd phycadelic [sic] -like experiences which were coming and going as i was smoking the blunt. I wouldnt say i was tripping, as that is impossible from consuming marijaunna [sic], but it was just odd. great and extremely enjoyable, but odd. the only downside to this bud is the high didnt last that long, and wore off after about an hour or so. On the positive side there was no burnout, and the bud had a nice fruity lemony taste to it. I would definately [sic] recommend this bud. the high it provided me with was very unique and pleasant. This is not for new smokers. This bud also made me very active but, due to the short duration of the high, could be smoked before bed.” – patrickbasler\n  Super Silver Haze\nAre you at the point in your Pokémon GO journey where all you want to do is get blasted with Blastoise? The four-time High Times Cannabis Cup winner Super Silver Haze will do the job with its energetic, long-lasting body high.\n“The strongest sativa. Especially from a skilled grower, it lives up to and exceeds high expectations. Incredible mood-enhancement, legendary taste and smell.” – nolovedeepweb\n  Agent Orange\nFeeling a bit crabby on your walk to capture Pokémon? Don’t end up like Krabby! Instead, try the hybrid Agent Orange strain to help bring an uplifting, happy high to your journey.\n“pretty potent strain have a munch pack ready( I spent 10 bucks Worth of muchies [sic] it smelled just like sunny d to me(x this strain had me very talkative, had me going through so many detailed stories I’d say this is a good strain for anyone going through depression, as it is very high in euphoria” – happy0102\n  Incredible Hulk\nNeed a little extra kick on your final push in finding Pokémon characters? The Incredible Hulk sativa will help you not end up like Slowpoke, giving a creative and social energy boost while the blueberry, pineapple, and earthy flavors overwhelm the palate.\n“good sativa. smokes smooth and makes you feel really euphoric and uplifted. gives a very energetic and doesn’t make you tired as most strains will. This is a great sativa but you’ll always want an indica or hybrid around for the nighttime full body relaxation.” – MahoneyMcLeaf","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001528/catch-these-7-cannabis-strains-for-your-next-pokemon-go-session.jpg","urlslug":"/news/strains-products/catch-these-7-cannabis-strains-for-your-next-pokemon-go-session"},{"id":"contentitems-3135","title":"Heroes Among Us: 7 Cannabis Strains That Make You Feel Like Superman","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1465740000000)\/","text":"It’s important to celebrate our heroes. Real or imaginary, these men and women help us define our ideal selves. Sometimes these heroes are imbued with superhuman abilities, like the power of flight or telepathy, but much of the time, the attributes that make a superhero are inherently human. Heroes are characters that stand up for the weak and defenseless. They go beyond the call to raise up their fellow man. Heroes are not indestructible, but simply willing to give more of themselves without the need of thanks or admiration.\nYes, heroes are among us and within us, and on this day devoted to Superman, the Übermensch, I’ve curated a shortlist of strains that will imbue you with superhuman sensations that will hopefully enable you to do something heroic…or at least conquer the villainous forces of laziness and depression. Up, up, and away!\n \nAllen Wrench\n \n“This strain is pow!!! Gets you a super uplifting high with a great taste and smooth smoke not very harsh at all even when the bowl is almost ass and still tastes good and the smell is unbelievable super earthy citrus and could smell it from across my house, great strain won’t regret.” – sillbillybro\n \nMaui\n \n“Beautiful strain came on subtle and took over my whole body for a wonderful ride. I have permanent nerve damage due to an IED this stuff makes me feel like superman.” – Dungy51\n \nKryptonite\n\n“Yup. So that’s what Superman feels like when he is flying. I got a top shelf, frosty, extra strength dose of this stuff. I hit in a vape… Pure, tasty and then BOOM! This stuff is no joke. . .tread lightly.” – Rhobert\n \nSuperman OG\n \n“Faster than a speeding bowl-hit, more powerful than locomotive, it’s Superman OG! This wax is dank. Be sure to get it while it lasts at Delta-9 Association in San Jose.” – tgigrass\n \nIncredible Hulk\n \n“Very tasty, high energy strain. Perfect morning smoke to get your day started and the creative juices flowing, but smoke any more than a bowl and it hits you like a train with an incredibly strong cerebral high. Oh, and have some snacks ready because this shit is guaranteed to give you some extreme munchies.” – absentia882\n \nChemdawg\n \n“8/10: I like this one a lot. She’s very much like an OG Kush but more leaning on the lighter side in terms of effects. She’s not gonna get ya stoned out ya brains, but what she does offer you is a nice full body high and the ability to eat 1,467,279 cheeseburgers and fries. So smile, relax, and just know everything’s gonna be just fine J” – beelzebub\n \nCinderella 99\n \n“‘I am, I am, I am Superman, and I can do anything’… are not just lyrics from the R.E.M. song, but that’s how you will feel after smoking Cinderella 99. I felt like Superman flying over Market Street in San Francisco. It was an uplifting feeling. When I came back down to earth, I got wobbly legs and a pretty bad case of paranoia, all the people on the sidewalk with their shopping bags, the street performers were making me feel dizzy. That lasted maybe five minutes, then I felt like that first time you got baked, I mean really high. Time slows down, and you feel like everyone in the world knows you’re high. Fun times. I highly recommend for absolutely eliminating anxiety, stress, and aches and pains, just don’t overdo it. Go easy with this one.” – blackhawks15\n \nWhile these strains might not make you leap over a building in a single bound, shoot lasers out of your eyes, or tear a phone book in half, they should pack a physical stimulation that encourages a sense of wellbeing that traverses the sativa/hybrid/indica continuum. Each strain is suited for a series of semi-heroic deeds that may include making a cape out of bed sheets or other household objects, jumping on a trampoline while wearing said cape, and donning a fist-forward flying motion while walking/running anywhere. Go forth, do good, and live on!\n“I’m not a prophet or a stone aged man, just a mortal with potential of a superman. I’m living on.” – David Bowie","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001722/heroes-among-us-7-cannabis-strains-that-make-you-feel-like-superm.jpg","urlslug":"/news/strains-products/heroes-among-us-7-cannabis-strains-that-make-you-feel-like-superm"}],"reviewCount":68,"flavors":[{"name":"Earthy","score":21.3258480649785},{"name":"Blueberry","score":18.38270425226947},{"name":"Citrus","score":17.998088867654086},{"name":"Honey","score":16.84424271380793},{"name":"Skunk","score":15.824175824175823}],"effects":[{"name":"Happy","score":84.01576684185379},{"name":"Uplifted","score":81.457238413760152},{"name":"Euphoric","score":75.838509316770185},{"name":"Energetic","score":75.320114667940757},{"name":"Creative","score":57.071189679885329}],"symptoms":[{"name":"Stress","score":23.248924988055425},{"name":"Depression","score":7.4247491638795982},{"name":"Pain","score":5.6354515050167224},{"name":"Lack of Appetite","score":5.2508361204013383},{"name":"Fatigue","score":4.8662207357859533}],"conditions":[{"name":"ADD/ADHD","score":23.115145723841373},{"name":"Anxiety","score":20.556617295747731},{"name":"Fibromyalgia","score":16.459627329192546},{"name":"Hypertension","score":14.67032967032967},{"name":"Bipolar Disorder","score":5.88628762541806}],"negatives":[{"name":"Dry Eyes","score":46.569517439082652},{"name":"Dry Mouth","score":13.695652173913043},{"name":"Dizzy","score":1.9230769230769231},{"name":"Headache","score":1.153846153846154},{"name":"Paranoid","score":1.153846153846154}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_22ad.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002185/b/incredible-hulk__primary_5951.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_3e58.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001963/b/incredible-hulk__primary_e7cd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_bd88.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636367/b/incredible-hulk__primary_a903.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_918b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/625291/b/incredible-hulk__primary_a0ea.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_078f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/605740/b/incredible-hulk__primary_25fe.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_264d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/590548/b/incredible-hulk__primary_4733.jpg"}],"photoTotalCount":23,"popularCities":["Spokane, WA","Toronto, ON","Bay City, MI","Detroit, MI","Santa Ana, CA","Wenatchee, WA"],"permalink":"https://mobileapi.leafly.com/sativa/incredible-hulk","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.54411764705882/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Green Crack","subtitle":null,"slug":"green-crack","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/green-crack","symbol":"Gc","applink":"leafly://strain/green-crack"},{"name":"Jack Herer","subtitle":null,"slug":"jack-herer","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jack-herer","symbol":"Jh","applink":"leafly://strain/jack-herer"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":194257,"slug":"incredible-hulk","name":"Incredible Hulk","subtitle":null,"symbol":"Inc","category":"Sativa","description":"\u003cp\u003eIncredible Hulk is a sativa strain that harnesses the active and stimulating effects of its parent strains, \u003ca href=\"https://www.leafly.com/sativa/green-crack\"\u003eGreen Crack\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/sativa/jack-herer\"\u003eJack Herer\u003c/a\u003e. Creativity and social energy get a boost while blueberry, pineapple, and earthy flavors overwhelm the palate. This high-energy sativa is preferred as a daytime remedy for minor aches and pains.\u003c/p\u003e\n","descriptionPlain":"Incredible Hulk is a sativa strain that harnesses the active and stimulating effects of its parent strains, Green Crack and Jack Herer. Creativity and social energy get a boost while blueberry, pineapple, and earthy flavors overwhelm the palate. This high-energy sativa is preferred as a daytime remedy for minor aches and pains.\n","aka":null,"rating":4.54,"highlightedReviews":[{"id":1386580,"username":"TheBigGreenGiant","text":"Man this strain is chronic! Smoke this and it instantly hits you like a brick wall! Got hold of a sample so didn\u0027t have too much and ended up sharing one joints worth between 3 of us - and it\u0027s a good job too. Fried the lot of us and safe to assume you don\u0027t need much of this to feel the full effects. Was a smooth smoke which took me by surprise but nevertheless a bonus.  At first I was in a heavy body high state, but after about half an hour or so I was in the mood to get up and be active, resulting in me jogging in the rain to the shop.  Honestly this is one hell of a strain!  If there\u0027s an opportunity to get hold of this then take it with both hands.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1636054,"username":"RandomStoner18","text":"On cloud nine and didn\u0027t even finish the bowl. I\u0027ve cut down my usage from being stoned 24/7 to a couple bowls a day. Weed is weed, and high is high, but when you\u0027ve grown a tolerance the high it becomes more comfortable than exciting. This weed takes me on different roller-coaster rides each time I smoke it.  Right now my mind is thinking about a thousand different things at once, yet it\u0027s not overwhelming or stressful. I\u0027m distant, yet focused. My stress, anxiety, and sadness are all gone. I\u0027m suddenly hopeful and motivated. \n\nThe smell is pungent and wonderful. If I close my eyes and smell it I think of a rain forest shrouded in tall pine trees. In the distance is a shallow river surrounded with rocks enveloped in moss.\n\nThe taste is fantastic in my pipe. Very earthy and bold, but smooth. I bet this would be amazing in a nice bong.\n\nDry mouth is only really evident when talking for a long period of time. \n\nIf you\u0027re keeping yourself occupied the munchies are tamable. If you\u0027re being lazy you\u0027ll eat enough food for 3 people and still want to order a pizza. Not even because you\u0027re hungry, but because there\u0027s so many tasty flavors out there.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3071","title":"Catch These 7 Cannabis Strains for Your Next Pokémon GO Session","author":"Gage Peake","category":null,"date":"\/Date(1468301400000)\/","text":"Have you noticed more people walking around your neighborhood swiping on their cell phone in an almost zombie-like-state recently? Chances are, that person is trying to catch ‘em all on the new gaming app Pokémon GO, which his already been installed more times in its first week than the dating app Tinder in its five years of existence. After a few of us here at Leafly were wandering around the office trying to capture a creature, we figured we’d give our tired legs a break and come up with a list of the best cannabis strains to pair with your next Pokémon GO session.\nPick up one of these strain options before you get back out there and start playing right Meowth.\n  Fire OG\nFire OG is an ideal choice for the next time you and your friends are out trying to catch the fire-breathing Charizard. Powerful in its own right, Charizard’s flame is so hot, it can melt boulders, making it the perfect match for the strongest of the OG strains that sports red hairs (which gives this hybrid its “Fire” name).\n“Fire OG is NOT to be underestimated. As a super- sativa afficanado [sic] I’m usually somewhat [relatively] underwhelmed by decent, but dime a dozen “OG’s.” This however, is a kick in the face and a ripping sativa one at that. Fire OG and its crosses Firewalker (fire x skywalker) and Fire King (x king louis) are all superior, (while I believe the latter to be the strongest) this is fucking intense and uplifting until you start to feel your eyes seal. Once that happens (an hour thirty in) you ARE going to relax… fetally. 10/10.” – Jackboothe\n  Durban Poison\nFeeling a little sleepy while on your walk? Don’t end up feeling like a Snorlax The pure sativa Durban Poison will be the perfect strain to help you stay in tune with your surroundings.\n“Does not get any better than this,exactly what you would expect from a sativa, energizing uplifting and a very tasty sweet pine and citrus flavor, definitely one of my top 5 favorite strains.” – RiPpEdCiTy\n  707 Headband\nAnother strain that can help treat some tension and anxiety you might face when trying to catch ‘em all, Headband 707 brings a strong hybrid high that leaves consumers feeling “heady” and creative rather than sleepy.\n“With its strong, sweet aroma, headband is a sensation for even the most critical of cannabis pundits. I enjoy the creative/anxiolytic effects that come up, makes my dreams appear as if I am a young Pokemon master. The old Pokemon, not this new crap.” – Dwarren\n  Poison Haze\nWhile out trying to catch the poison/ground type Nidoqueen, this Poison Haze strain with its sweet, citrus aroma will help you take her and her powerful tail down in battle. Its energetic and happy high will help any adult Pokémon fan through his or her voyage in catching the characters.\n“This is an extremely potent strain with a intense powerful high. The high was similar to the high from durban poison, except it lasted a hell of a lot longer. It was a very enjoyable high. Got rushes of energy and these wierd phycadelic [sic] -like experiences which were coming and going as i was smoking the blunt. I wouldnt say i was tripping, as that is impossible from consuming marijaunna [sic], but it was just odd. great and extremely enjoyable, but odd. the only downside to this bud is the high didnt last that long, and wore off after about an hour or so. On the positive side there was no burnout, and the bud had a nice fruity lemony taste to it. I would definately [sic] recommend this bud. the high it provided me with was very unique and pleasant. This is not for new smokers. This bud also made me very active but, due to the short duration of the high, could be smoked before bed.” – patrickbasler\n  Super Silver Haze\nAre you at the point in your Pokémon GO journey where all you want to do is get blasted with Blastoise? The four-time High Times Cannabis Cup winner Super Silver Haze will do the job with its energetic, long-lasting body high.\n“The strongest sativa. Especially from a skilled grower, it lives up to and exceeds high expectations. Incredible mood-enhancement, legendary taste and smell.” – nolovedeepweb\n  Agent Orange\nFeeling a bit crabby on your walk to capture Pokémon? Don’t end up like Krabby! Instead, try the hybrid Agent Orange strain to help bring an uplifting, happy high to your journey.\n“pretty potent strain have a munch pack ready( I spent 10 bucks Worth of muchies [sic] it smelled just like sunny d to me(x this strain had me very talkative, had me going through so many detailed stories I’d say this is a good strain for anyone going through depression, as it is very high in euphoria” – happy0102\n  Incredible Hulk\nNeed a little extra kick on your final push in finding Pokémon characters? The Incredible Hulk sativa will help you not end up like Slowpoke, giving a creative and social energy boost while the blueberry, pineapple, and earthy flavors overwhelm the palate.\n“good sativa. smokes smooth and makes you feel really euphoric and uplifted. gives a very energetic and doesn’t make you tired as most strains will. This is a great sativa but you’ll always want an indica or hybrid around for the nighttime full body relaxation.” – MahoneyMcLeaf","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001528/catch-these-7-cannabis-strains-for-your-next-pokemon-go-session.jpg","urlslug":"/news/strains-products/catch-these-7-cannabis-strains-for-your-next-pokemon-go-session"},{"id":"contentitems-3135","title":"Heroes Among Us: 7 Cannabis Strains That Make You Feel Like Superman","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1465740000000)\/","text":"It’s important to celebrate our heroes. Real or imaginary, these men and women help us define our ideal selves. Sometimes these heroes are imbued with superhuman abilities, like the power of flight or telepathy, but much of the time, the attributes that make a superhero are inherently human. Heroes are characters that stand up for the weak and defenseless. They go beyond the call to raise up their fellow man. Heroes are not indestructible, but simply willing to give more of themselves without the need of thanks or admiration.\nYes, heroes are among us and within us, and on this day devoted to Superman, the Übermensch, I’ve curated a shortlist of strains that will imbue you with superhuman sensations that will hopefully enable you to do something heroic…or at least conquer the villainous forces of laziness and depression. Up, up, and away!\n \nAllen Wrench\n \n“This strain is pow!!! Gets you a super uplifting high with a great taste and smooth smoke not very harsh at all even when the bowl is almost ass and still tastes good and the smell is unbelievable super earthy citrus and could smell it from across my house, great strain won’t regret.” – sillbillybro\n \nMaui\n \n“Beautiful strain came on subtle and took over my whole body for a wonderful ride. I have permanent nerve damage due to an IED this stuff makes me feel like superman.” – Dungy51\n \nKryptonite\n\n“Yup. So that’s what Superman feels like when he is flying. I got a top shelf, frosty, extra strength dose of this stuff. I hit in a vape… Pure, tasty and then BOOM! This stuff is no joke. . .tread lightly.” – Rhobert\n \nSuperman OG\n \n“Faster than a speeding bowl-hit, more powerful than locomotive, it’s Superman OG! This wax is dank. Be sure to get it while it lasts at Delta-9 Association in San Jose.” – tgigrass\n \nIncredible Hulk\n \n“Very tasty, high energy strain. Perfect morning smoke to get your day started and the creative juices flowing, but smoke any more than a bowl and it hits you like a train with an incredibly strong cerebral high. Oh, and have some snacks ready because this shit is guaranteed to give you some extreme munchies.” – absentia882\n \nChemdawg\n \n“8/10: I like this one a lot. She’s very much like an OG Kush but more leaning on the lighter side in terms of effects. She’s not gonna get ya stoned out ya brains, but what she does offer you is a nice full body high and the ability to eat 1,467,279 cheeseburgers and fries. So smile, relax, and just know everything’s gonna be just fine J” – beelzebub\n \nCinderella 99\n \n“‘I am, I am, I am Superman, and I can do anything’… are not just lyrics from the R.E.M. song, but that’s how you will feel after smoking Cinderella 99. I felt like Superman flying over Market Street in San Francisco. It was an uplifting feeling. When I came back down to earth, I got wobbly legs and a pretty bad case of paranoia, all the people on the sidewalk with their shopping bags, the street performers were making me feel dizzy. That lasted maybe five minutes, then I felt like that first time you got baked, I mean really high. Time slows down, and you feel like everyone in the world knows you’re high. Fun times. I highly recommend for absolutely eliminating anxiety, stress, and aches and pains, just don’t overdo it. Go easy with this one.” – blackhawks15\n \nWhile these strains might not make you leap over a building in a single bound, shoot lasers out of your eyes, or tear a phone book in half, they should pack a physical stimulation that encourages a sense of wellbeing that traverses the sativa/hybrid/indica continuum. Each strain is suited for a series of semi-heroic deeds that may include making a cape out of bed sheets or other household objects, jumping on a trampoline while wearing said cape, and donning a fist-forward flying motion while walking/running anywhere. Go forth, do good, and live on!\n“I’m not a prophet or a stone aged man, just a mortal with potential of a superman. I’m living on.” – David Bowie","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001722/heroes-among-us-7-cannabis-strains-that-make-you-feel-like-superm.jpg","urlslug":"/news/strains-products/heroes-among-us-7-cannabis-strains-that-make-you-feel-like-superm"}],"reviewCount":68,"flavors":[{"name":"Earthy","score":21.3258480649785},{"name":"Blueberry","score":18.38270425226947},{"name":"Citrus","score":17.998088867654086},{"name":"Honey","score":16.84424271380793},{"name":"Skunk","score":15.824175824175823}],"effects":[{"name":"Happy","score":84.01576684185379},{"name":"Uplifted","score":81.457238413760152},{"name":"Euphoric","score":75.838509316770185},{"name":"Energetic","score":75.320114667940757},{"name":"Creative","score":57.071189679885329}],"symptoms":[{"name":"Stress","score":23.248924988055425},{"name":"Depression","score":7.4247491638795982},{"name":"Pain","score":5.6354515050167224},{"name":"Lack of Appetite","score":5.2508361204013383},{"name":"Fatigue","score":4.8662207357859533}],"conditions":[{"name":"ADD/ADHD","score":23.115145723841373},{"name":"Anxiety","score":20.556617295747731},{"name":"Fibromyalgia","score":16.459627329192546},{"name":"Hypertension","score":14.67032967032967},{"name":"Bipolar Disorder","score":5.88628762541806}],"negatives":[{"name":"Dry Eyes","score":46.569517439082652},{"name":"Dry Mouth","score":13.695652173913043},{"name":"Dizzy","score":1.9230769230769231},{"name":"Headache","score":1.153846153846154},{"name":"Paranoid","score":1.153846153846154}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_22ad.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002185/b/incredible-hulk__primary_5951.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_3e58.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001963/b/incredible-hulk__primary_e7cd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_bd88.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636367/b/incredible-hulk__primary_a903.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_918b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/625291/b/incredible-hulk__primary_a0ea.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_078f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/605740/b/incredible-hulk__primary_25fe.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_264d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/590548/b/incredible-hulk__primary_4733.jpg"}],"photoTotalCount":23,"popularCities":["Spokane, WA","Toronto, ON","Bay City, MI","Detroit, MI","Santa Ana, CA","Wenatchee, WA"],"permalink":"https://mobileapi.leafly.com/sativa/incredible-hulk","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.54411764705882/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Green Crack","subtitle":null,"slug":"green-crack","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/green-crack","symbol":"Gc","applink":"leafly://strain/green-crack"},{"name":"Jack Herer","subtitle":null,"slug":"jack-herer","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jack-herer","symbol":"Jh","applink":"leafly://strain/jack-herer"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":194257,"slug":"incredible-hulk","name":"Incredible Hulk","subtitle":null,"symbol":"Inc","category":"Sativa","description":"\u003cp\u003eIncredible Hulk is a sativa strain that harnesses the active and stimulating effects of its parent strains, \u003ca href=\"https://www.leafly.com/sativa/green-crack\"\u003eGreen Crack\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/sativa/jack-herer\"\u003eJack Herer\u003c/a\u003e. Creativity and social energy get a boost while blueberry, pineapple, and earthy flavors overwhelm the palate. This high-energy sativa is preferred as a daytime remedy for minor aches and pains.\u003c/p\u003e\n","descriptionPlain":"Incredible Hulk is a sativa strain that harnesses the active and stimulating effects of its parent strains, Green Crack and Jack Herer. Creativity and social energy get a boost while blueberry, pineapple, and earthy flavors overwhelm the palate. This high-energy sativa is preferred as a daytime remedy for minor aches and pains.\n","aka":null,"rating":4.54,"highlightedReviews":[{"id":1386580,"username":"TheBigGreenGiant","text":"Man this strain is chronic! Smoke this and it instantly hits you like a brick wall! Got hold of a sample so didn\u0027t have too much and ended up sharing one joints worth between 3 of us - and it\u0027s a good job too. Fried the lot of us and safe to assume you don\u0027t need much of this to feel the full effects. Was a smooth smoke which took me by surprise but nevertheless a bonus.  At first I was in a heavy body high state, but after about half an hour or so I was in the mood to get up and be active, resulting in me jogging in the rain to the shop.  Honestly this is one hell of a strain!  If there\u0027s an opportunity to get hold of this then take it with both hands.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1636054,"username":"RandomStoner18","text":"On cloud nine and didn\u0027t even finish the bowl. I\u0027ve cut down my usage from being stoned 24/7 to a couple bowls a day. Weed is weed, and high is high, but when you\u0027ve grown a tolerance the high it becomes more comfortable than exciting. This weed takes me on different roller-coaster rides each time I smoke it.  Right now my mind is thinking about a thousand different things at once, yet it\u0027s not overwhelming or stressful. I\u0027m distant, yet focused. My stress, anxiety, and sadness are all gone. I\u0027m suddenly hopeful and motivated. \n\nThe smell is pungent and wonderful. If I close my eyes and smell it I think of a rain forest shrouded in tall pine trees. In the distance is a shallow river surrounded with rocks enveloped in moss.\n\nThe taste is fantastic in my pipe. Very earthy and bold, but smooth. I bet this would be amazing in a nice bong.\n\nDry mouth is only really evident when talking for a long period of time. \n\nIf you\u0027re keeping yourself occupied the munchies are tamable. If you\u0027re being lazy you\u0027ll eat enough food for 3 people and still want to order a pizza. Not even because you\u0027re hungry, but because there\u0027s so many tasty flavors out there.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3071","title":"Catch These 7 Cannabis Strains for Your Next Pokémon GO Session","author":"Gage Peake","category":null,"date":"\/Date(1468301400000)\/","text":"Have you noticed more people walking around your neighborhood swiping on their cell phone in an almost zombie-like-state recently? Chances are, that person is trying to catch ‘em all on the new gaming app Pokémon GO, which his already been installed more times in its first week than the dating app Tinder in its five years of existence. After a few of us here at Leafly were wandering around the office trying to capture a creature, we figured we’d give our tired legs a break and come up with a list of the best cannabis strains to pair with your next Pokémon GO session.\nPick up one of these strain options before you get back out there and start playing right Meowth.\n  Fire OG\nFire OG is an ideal choice for the next time you and your friends are out trying to catch the fire-breathing Charizard. Powerful in its own right, Charizard’s flame is so hot, it can melt boulders, making it the perfect match for the strongest of the OG strains that sports red hairs (which gives this hybrid its “Fire” name).\n“Fire OG is NOT to be underestimated. As a super- sativa afficanado [sic] I’m usually somewhat [relatively] underwhelmed by decent, but dime a dozen “OG’s.” This however, is a kick in the face and a ripping sativa one at that. Fire OG and its crosses Firewalker (fire x skywalker) and Fire King (x king louis) are all superior, (while I believe the latter to be the strongest) this is fucking intense and uplifting until you start to feel your eyes seal. Once that happens (an hour thirty in) you ARE going to relax… fetally. 10/10.” – Jackboothe\n  Durban Poison\nFeeling a little sleepy while on your walk? Don’t end up feeling like a Snorlax The pure sativa Durban Poison will be the perfect strain to help you stay in tune with your surroundings.\n“Does not get any better than this,exactly what you would expect from a sativa, energizing uplifting and a very tasty sweet pine and citrus flavor, definitely one of my top 5 favorite strains.” – RiPpEdCiTy\n  707 Headband\nAnother strain that can help treat some tension and anxiety you might face when trying to catch ‘em all, Headband 707 brings a strong hybrid high that leaves consumers feeling “heady” and creative rather than sleepy.\n“With its strong, sweet aroma, headband is a sensation for even the most critical of cannabis pundits. I enjoy the creative/anxiolytic effects that come up, makes my dreams appear as if I am a young Pokemon master. The old Pokemon, not this new crap.” – Dwarren\n  Poison Haze\nWhile out trying to catch the poison/ground type Nidoqueen, this Poison Haze strain with its sweet, citrus aroma will help you take her and her powerful tail down in battle. Its energetic and happy high will help any adult Pokémon fan through his or her voyage in catching the characters.\n“This is an extremely potent strain with a intense powerful high. The high was similar to the high from durban poison, except it lasted a hell of a lot longer. It was a very enjoyable high. Got rushes of energy and these wierd phycadelic [sic] -like experiences which were coming and going as i was smoking the blunt. I wouldnt say i was tripping, as that is impossible from consuming marijaunna [sic], but it was just odd. great and extremely enjoyable, but odd. the only downside to this bud is the high didnt last that long, and wore off after about an hour or so. On the positive side there was no burnout, and the bud had a nice fruity lemony taste to it. I would definately [sic] recommend this bud. the high it provided me with was very unique and pleasant. This is not for new smokers. This bud also made me very active but, due to the short duration of the high, could be smoked before bed.” – patrickbasler\n  Super Silver Haze\nAre you at the point in your Pokémon GO journey where all you want to do is get blasted with Blastoise? The four-time High Times Cannabis Cup winner Super Silver Haze will do the job with its energetic, long-lasting body high.\n“The strongest sativa. Especially from a skilled grower, it lives up to and exceeds high expectations. Incredible mood-enhancement, legendary taste and smell.” – nolovedeepweb\n  Agent Orange\nFeeling a bit crabby on your walk to capture Pokémon? Don’t end up like Krabby! Instead, try the hybrid Agent Orange strain to help bring an uplifting, happy high to your journey.\n“pretty potent strain have a munch pack ready( I spent 10 bucks Worth of muchies [sic] it smelled just like sunny d to me(x this strain had me very talkative, had me going through so many detailed stories I’d say this is a good strain for anyone going through depression, as it is very high in euphoria” – happy0102\n  Incredible Hulk\nNeed a little extra kick on your final push in finding Pokémon characters? The Incredible Hulk sativa will help you not end up like Slowpoke, giving a creative and social energy boost while the blueberry, pineapple, and earthy flavors overwhelm the palate.\n“good sativa. smokes smooth and makes you feel really euphoric and uplifted. gives a very energetic and doesn’t make you tired as most strains will. This is a great sativa but you’ll always want an indica or hybrid around for the nighttime full body relaxation.” – MahoneyMcLeaf","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001528/catch-these-7-cannabis-strains-for-your-next-pokemon-go-session.jpg","urlslug":"/news/strains-products/catch-these-7-cannabis-strains-for-your-next-pokemon-go-session"},{"id":"contentitems-3135","title":"Heroes Among Us: 7 Cannabis Strains That Make You Feel Like Superman","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1465740000000)\/","text":"It’s important to celebrate our heroes. Real or imaginary, these men and women help us define our ideal selves. Sometimes these heroes are imbued with superhuman abilities, like the power of flight or telepathy, but much of the time, the attributes that make a superhero are inherently human. Heroes are characters that stand up for the weak and defenseless. They go beyond the call to raise up their fellow man. Heroes are not indestructible, but simply willing to give more of themselves without the need of thanks or admiration.\nYes, heroes are among us and within us, and on this day devoted to Superman, the Übermensch, I’ve curated a shortlist of strains that will imbue you with superhuman sensations that will hopefully enable you to do something heroic…or at least conquer the villainous forces of laziness and depression. Up, up, and away!\n \nAllen Wrench\n \n“This strain is pow!!! Gets you a super uplifting high with a great taste and smooth smoke not very harsh at all even when the bowl is almost ass and still tastes good and the smell is unbelievable super earthy citrus and could smell it from across my house, great strain won’t regret.” – sillbillybro\n \nMaui\n \n“Beautiful strain came on subtle and took over my whole body for a wonderful ride. I have permanent nerve damage due to an IED this stuff makes me feel like superman.” – Dungy51\n \nKryptonite\n\n“Yup. So that’s what Superman feels like when he is flying. I got a top shelf, frosty, extra strength dose of this stuff. I hit in a vape… Pure, tasty and then BOOM! This stuff is no joke. . .tread lightly.” – Rhobert\n \nSuperman OG\n \n“Faster than a speeding bowl-hit, more powerful than locomotive, it’s Superman OG! This wax is dank. Be sure to get it while it lasts at Delta-9 Association in San Jose.” – tgigrass\n \nIncredible Hulk\n \n“Very tasty, high energy strain. Perfect morning smoke to get your day started and the creative juices flowing, but smoke any more than a bowl and it hits you like a train with an incredibly strong cerebral high. Oh, and have some snacks ready because this shit is guaranteed to give you some extreme munchies.” – absentia882\n \nChemdawg\n \n“8/10: I like this one a lot. She’s very much like an OG Kush but more leaning on the lighter side in terms of effects. She’s not gonna get ya stoned out ya brains, but what she does offer you is a nice full body high and the ability to eat 1,467,279 cheeseburgers and fries. So smile, relax, and just know everything’s gonna be just fine J” – beelzebub\n \nCinderella 99\n \n“‘I am, I am, I am Superman, and I can do anything’… are not just lyrics from the R.E.M. song, but that’s how you will feel after smoking Cinderella 99. I felt like Superman flying over Market Street in San Francisco. It was an uplifting feeling. When I came back down to earth, I got wobbly legs and a pretty bad case of paranoia, all the people on the sidewalk with their shopping bags, the street performers were making me feel dizzy. That lasted maybe five minutes, then I felt like that first time you got baked, I mean really high. Time slows down, and you feel like everyone in the world knows you’re high. Fun times. I highly recommend for absolutely eliminating anxiety, stress, and aches and pains, just don’t overdo it. Go easy with this one.” – blackhawks15\n \nWhile these strains might not make you leap over a building in a single bound, shoot lasers out of your eyes, or tear a phone book in half, they should pack a physical stimulation that encourages a sense of wellbeing that traverses the sativa/hybrid/indica continuum. Each strain is suited for a series of semi-heroic deeds that may include making a cape out of bed sheets or other household objects, jumping on a trampoline while wearing said cape, and donning a fist-forward flying motion while walking/running anywhere. Go forth, do good, and live on!\n“I’m not a prophet or a stone aged man, just a mortal with potential of a superman. I’m living on.” – David Bowie","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001722/heroes-among-us-7-cannabis-strains-that-make-you-feel-like-superm.jpg","urlslug":"/news/strains-products/heroes-among-us-7-cannabis-strains-that-make-you-feel-like-superm"}],"reviewCount":68,"flavors":[{"name":"Earthy","score":21.3258480649785},{"name":"Blueberry","score":18.38270425226947},{"name":"Citrus","score":17.998088867654086},{"name":"Honey","score":16.84424271380793},{"name":"Skunk","score":15.824175824175823}],"effects":[{"name":"Happy","score":84.01576684185379},{"name":"Uplifted","score":81.457238413760152},{"name":"Euphoric","score":75.838509316770185},{"name":"Energetic","score":75.320114667940757},{"name":"Creative","score":57.071189679885329}],"symptoms":[{"name":"Stress","score":23.248924988055425},{"name":"Depression","score":7.4247491638795982},{"name":"Pain","score":5.6354515050167224},{"name":"Lack of Appetite","score":5.2508361204013383},{"name":"Fatigue","score":4.8662207357859533}],"conditions":[{"name":"ADD/ADHD","score":23.115145723841373},{"name":"Anxiety","score":20.556617295747731},{"name":"Fibromyalgia","score":16.459627329192546},{"name":"Hypertension","score":14.67032967032967},{"name":"Bipolar Disorder","score":5.88628762541806}],"negatives":[{"name":"Dry Eyes","score":46.569517439082652},{"name":"Dry Mouth","score":13.695652173913043},{"name":"Dizzy","score":1.9230769230769231},{"name":"Headache","score":1.153846153846154},{"name":"Paranoid","score":1.153846153846154}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_22ad.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002185/b/incredible-hulk__primary_5951.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_3e58.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001963/b/incredible-hulk__primary_e7cd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_bd88.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636367/b/incredible-hulk__primary_a903.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_918b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/625291/b/incredible-hulk__primary_a0ea.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_078f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/605740/b/incredible-hulk__primary_25fe.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_264d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/590548/b/incredible-hulk__primary_4733.jpg"}],"photoTotalCount":23,"popularCities":["Spokane, WA","Toronto, ON","Bay City, MI","Detroit, MI","Santa Ana, CA","Wenatchee, WA"],"permalink":"https://mobileapi.leafly.com/sativa/incredible-hulk","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.54411764705882/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Green Crack","subtitle":null,"slug":"green-crack","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/green-crack","symbol":"Gc","applink":"leafly://strain/green-crack"},{"name":"Jack Herer","subtitle":null,"slug":"jack-herer","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jack-herer","symbol":"Jh","applink":"leafly://strain/jack-herer"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":194257,"slug":"incredible-hulk","name":"Incredible Hulk","subtitle":null,"symbol":"Inc","category":"Sativa","description":"\u003cp\u003eIncredible Hulk is a sativa strain that harnesses the active and stimulating effects of its parent strains, \u003ca href=\"https://www.leafly.com/sativa/green-crack\"\u003eGreen Crack\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/sativa/jack-herer\"\u003eJack Herer\u003c/a\u003e. Creativity and social energy get a boost while blueberry, pineapple, and earthy flavors overwhelm the palate. This high-energy sativa is preferred as a daytime remedy for minor aches and pains.\u003c/p\u003e\n","descriptionPlain":"Incredible Hulk is a sativa strain that harnesses the active and stimulating effects of its parent strains, Green Crack and Jack Herer. Creativity and social energy get a boost while blueberry, pineapple, and earthy flavors overwhelm the palate. This high-energy sativa is preferred as a daytime remedy for minor aches and pains.\n","aka":null,"rating":4.54,"highlightedReviews":[{"id":1386580,"username":"TheBigGreenGiant","text":"Man this strain is chronic! Smoke this and it instantly hits you like a brick wall! Got hold of a sample so didn\u0027t have too much and ended up sharing one joints worth between 3 of us - and it\u0027s a good job too. Fried the lot of us and safe to assume you don\u0027t need much of this to feel the full effects. Was a smooth smoke which took me by surprise but nevertheless a bonus.  At first I was in a heavy body high state, but after about half an hour or so I was in the mood to get up and be active, resulting in me jogging in the rain to the shop.  Honestly this is one hell of a strain!  If there\u0027s an opportunity to get hold of this then take it with both hands.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"},{"id":1636054,"username":"RandomStoner18","text":"On cloud nine and didn\u0027t even finish the bowl. I\u0027ve cut down my usage from being stoned 24/7 to a couple bowls a day. Weed is weed, and high is high, but when you\u0027ve grown a tolerance the high it becomes more comfortable than exciting. This weed takes me on different roller-coaster rides each time I smoke it.  Right now my mind is thinking about a thousand different things at once, yet it\u0027s not overwhelming or stressful. I\u0027m distant, yet focused. My stress, anxiety, and sadness are all gone. I\u0027m suddenly hopeful and motivated. \n\nThe smell is pungent and wonderful. If I close my eyes and smell it I think of a rain forest shrouded in tall pine trees. In the distance is a shallow river surrounded with rocks enveloped in moss.\n\nThe taste is fantastic in my pipe. Very earthy and bold, but smooth. I bet this would be amazing in a nice bong.\n\nDry mouth is only really evident when talking for a long period of time. \n\nIf you\u0027re keeping yourself occupied the munchies are tamable. If you\u0027re being lazy you\u0027ll eat enough food for 3 people and still want to order a pizza. Not even because you\u0027re hungry, but because there\u0027s so many tasty flavors out there.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3071","title":"Catch These 7 Cannabis Strains for Your Next Pokémon GO Session","author":"Gage Peake","category":null,"date":"\/Date(1468301400000)\/","text":"Have you noticed more people walking around your neighborhood swiping on their cell phone in an almost zombie-like-state recently? Chances are, that person is trying to catch ‘em all on the new gaming app Pokémon GO, which his already been installed more times in its first week than the dating app Tinder in its five years of existence. After a few of us here at Leafly were wandering around the office trying to capture a creature, we figured we’d give our tired legs a break and come up with a list of the best cannabis strains to pair with your next Pokémon GO session.\nPick up one of these strain options before you get back out there and start playing right Meowth.\n  Fire OG\nFire OG is an ideal choice for the next time you and your friends are out trying to catch the fire-breathing Charizard. Powerful in its own right, Charizard’s flame is so hot, it can melt boulders, making it the perfect match for the strongest of the OG strains that sports red hairs (which gives this hybrid its “Fire” name).\n“Fire OG is NOT to be underestimated. As a super- sativa afficanado [sic] I’m usually somewhat [relatively] underwhelmed by decent, but dime a dozen “OG’s.” This however, is a kick in the face and a ripping sativa one at that. Fire OG and its crosses Firewalker (fire x skywalker) and Fire King (x king louis) are all superior, (while I believe the latter to be the strongest) this is fucking intense and uplifting until you start to feel your eyes seal. Once that happens (an hour thirty in) you ARE going to relax… fetally. 10/10.” – Jackboothe\n  Durban Poison\nFeeling a little sleepy while on your walk? Don’t end up feeling like a Snorlax The pure sativa Durban Poison will be the perfect strain to help you stay in tune with your surroundings.\n“Does not get any better than this,exactly what you would expect from a sativa, energizing uplifting and a very tasty sweet pine and citrus flavor, definitely one of my top 5 favorite strains.” – RiPpEdCiTy\n  707 Headband\nAnother strain that can help treat some tension and anxiety you might face when trying to catch ‘em all, Headband 707 brings a strong hybrid high that leaves consumers feeling “heady” and creative rather than sleepy.\n“With its strong, sweet aroma, headband is a sensation for even the most critical of cannabis pundits. I enjoy the creative/anxiolytic effects that come up, makes my dreams appear as if I am a young Pokemon master. The old Pokemon, not this new crap.” – Dwarren\n  Poison Haze\nWhile out trying to catch the poison/ground type Nidoqueen, this Poison Haze strain with its sweet, citrus aroma will help you take her and her powerful tail down in battle. Its energetic and happy high will help any adult Pokémon fan through his or her voyage in catching the characters.\n“This is an extremely potent strain with a intense powerful high. The high was similar to the high from durban poison, except it lasted a hell of a lot longer. It was a very enjoyable high. Got rushes of energy and these wierd phycadelic [sic] -like experiences which were coming and going as i was smoking the blunt. I wouldnt say i was tripping, as that is impossible from consuming marijaunna [sic], but it was just odd. great and extremely enjoyable, but odd. the only downside to this bud is the high didnt last that long, and wore off after about an hour or so. On the positive side there was no burnout, and the bud had a nice fruity lemony taste to it. I would definately [sic] recommend this bud. the high it provided me with was very unique and pleasant. This is not for new smokers. This bud also made me very active but, due to the short duration of the high, could be smoked before bed.” – patrickbasler\n  Super Silver Haze\nAre you at the point in your Pokémon GO journey where all you want to do is get blasted with Blastoise? The four-time High Times Cannabis Cup winner Super Silver Haze will do the job with its energetic, long-lasting body high.\n“The strongest sativa. Especially from a skilled grower, it lives up to and exceeds high expectations. Incredible mood-enhancement, legendary taste and smell.” – nolovedeepweb\n  Agent Orange\nFeeling a bit crabby on your walk to capture Pokémon? Don’t end up like Krabby! Instead, try the hybrid Agent Orange strain to help bring an uplifting, happy high to your journey.\n“pretty potent strain have a munch pack ready( I spent 10 bucks Worth of muchies [sic] it smelled just like sunny d to me(x this strain had me very talkative, had me going through so many detailed stories I’d say this is a good strain for anyone going through depression, as it is very high in euphoria” – happy0102\n  Incredible Hulk\nNeed a little extra kick on your final push in finding Pokémon characters? The Incredible Hulk sativa will help you not end up like Slowpoke, giving a creative and social energy boost while the blueberry, pineapple, and earthy flavors overwhelm the palate.\n“good sativa. smokes smooth and makes you feel really euphoric and uplifted. gives a very energetic and doesn’t make you tired as most strains will. This is a great sativa but you’ll always want an indica or hybrid around for the nighttime full body relaxation.” – MahoneyMcLeaf","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001528/catch-these-7-cannabis-strains-for-your-next-pokemon-go-session.jpg","urlslug":"/news/strains-products/catch-these-7-cannabis-strains-for-your-next-pokemon-go-session"},{"id":"contentitems-3135","title":"Heroes Among Us: 7 Cannabis Strains That Make You Feel Like Superman","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1465740000000)\/","text":"It’s important to celebrate our heroes. Real or imaginary, these men and women help us define our ideal selves. Sometimes these heroes are imbued with superhuman abilities, like the power of flight or telepathy, but much of the time, the attributes that make a superhero are inherently human. Heroes are characters that stand up for the weak and defenseless. They go beyond the call to raise up their fellow man. Heroes are not indestructible, but simply willing to give more of themselves without the need of thanks or admiration.\nYes, heroes are among us and within us, and on this day devoted to Superman, the Übermensch, I’ve curated a shortlist of strains that will imbue you with superhuman sensations that will hopefully enable you to do something heroic…or at least conquer the villainous forces of laziness and depression. Up, up, and away!\n \nAllen Wrench\n \n“This strain is pow!!! Gets you a super uplifting high with a great taste and smooth smoke not very harsh at all even when the bowl is almost ass and still tastes good and the smell is unbelievable super earthy citrus and could smell it from across my house, great strain won’t regret.” – sillbillybro\n \nMaui\n \n“Beautiful strain came on subtle and took over my whole body for a wonderful ride. I have permanent nerve damage due to an IED this stuff makes me feel like superman.” – Dungy51\n \nKryptonite\n\n“Yup. So that’s what Superman feels like when he is flying. I got a top shelf, frosty, extra strength dose of this stuff. I hit in a vape… Pure, tasty and then BOOM! This stuff is no joke. . .tread lightly.” – Rhobert\n \nSuperman OG\n \n“Faster than a speeding bowl-hit, more powerful than locomotive, it’s Superman OG! This wax is dank. Be sure to get it while it lasts at Delta-9 Association in San Jose.” – tgigrass\n \nIncredible Hulk\n \n“Very tasty, high energy strain. Perfect morning smoke to get your day started and the creative juices flowing, but smoke any more than a bowl and it hits you like a train with an incredibly strong cerebral high. Oh, and have some snacks ready because this shit is guaranteed to give you some extreme munchies.” – absentia882\n \nChemdawg\n \n“8/10: I like this one a lot. She’s very much like an OG Kush but more leaning on the lighter side in terms of effects. She’s not gonna get ya stoned out ya brains, but what she does offer you is a nice full body high and the ability to eat 1,467,279 cheeseburgers and fries. So smile, relax, and just know everything’s gonna be just fine J” – beelzebub\n \nCinderella 99\n \n“‘I am, I am, I am Superman, and I can do anything’… are not just lyrics from the R.E.M. song, but that’s how you will feel after smoking Cinderella 99. I felt like Superman flying over Market Street in San Francisco. It was an uplifting feeling. When I came back down to earth, I got wobbly legs and a pretty bad case of paranoia, all the people on the sidewalk with their shopping bags, the street performers were making me feel dizzy. That lasted maybe five minutes, then I felt like that first time you got baked, I mean really high. Time slows down, and you feel like everyone in the world knows you’re high. Fun times. I highly recommend for absolutely eliminating anxiety, stress, and aches and pains, just don’t overdo it. Go easy with this one.” – blackhawks15\n \nWhile these strains might not make you leap over a building in a single bound, shoot lasers out of your eyes, or tear a phone book in half, they should pack a physical stimulation that encourages a sense of wellbeing that traverses the sativa/hybrid/indica continuum. Each strain is suited for a series of semi-heroic deeds that may include making a cape out of bed sheets or other household objects, jumping on a trampoline while wearing said cape, and donning a fist-forward flying motion while walking/running anywhere. Go forth, do good, and live on!\n“I’m not a prophet or a stone aged man, just a mortal with potential of a superman. I’m living on.” – David Bowie","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001722/heroes-among-us-7-cannabis-strains-that-make-you-feel-like-superm.jpg","urlslug":"/news/strains-products/heroes-among-us-7-cannabis-strains-that-make-you-feel-like-superm"}],"reviewCount":68,"flavors":[{"name":"Earthy","score":21.3258480649785},{"name":"Blueberry","score":18.38270425226947},{"name":"Citrus","score":17.998088867654086},{"name":"Honey","score":16.84424271380793},{"name":"Skunk","score":15.824175824175823}],"effects":[{"name":"Happy","score":84.01576684185379},{"name":"Uplifted","score":81.457238413760152},{"name":"Euphoric","score":75.838509316770185},{"name":"Energetic","score":75.320114667940757},{"name":"Creative","score":57.071189679885329}],"symptoms":[{"name":"Stress","score":23.248924988055425},{"name":"Depression","score":7.4247491638795982},{"name":"Pain","score":5.6354515050167224},{"name":"Lack of Appetite","score":5.2508361204013383},{"name":"Fatigue","score":4.8662207357859533}],"conditions":[{"name":"ADD/ADHD","score":23.115145723841373},{"name":"Anxiety","score":20.556617295747731},{"name":"Fibromyalgia","score":16.459627329192546},{"name":"Hypertension","score":14.67032967032967},{"name":"Bipolar Disorder","score":5.88628762541806}],"negatives":[{"name":"Dry Eyes","score":46.569517439082652},{"name":"Dry Mouth","score":13.695652173913043},{"name":"Dizzy","score":1.9230769230769231},{"name":"Headache","score":1.153846153846154},{"name":"Paranoid","score":1.153846153846154}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_22ad.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002185/b/incredible-hulk__primary_5951.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_3e58.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001963/b/incredible-hulk__primary_e7cd.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_bd88.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636367/b/incredible-hulk__primary_a903.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_918b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/625291/b/incredible-hulk__primary_a0ea.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_078f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/605740/b/incredible-hulk__primary_25fe.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/incredible-hulk_100x100_264d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/590548/b/incredible-hulk__primary_4733.jpg"}],"photoTotalCount":23,"popularCities":["Spokane, WA","Toronto, ON","Bay City, MI","Detroit, MI","Santa Ana, CA","Wenatchee, WA"],"permalink":"https://mobileapi.leafly.com/sativa/incredible-hulk","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.54411764705882/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Green Crack","subtitle":null,"slug":"green-crack","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/green-crack","symbol":"Gc","applink":"leafly://strain/green-crack"},{"name":"Jack Herer","subtitle":null,"slug":"jack-herer","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jack-herer","symbol":"Jh","applink":"leafly://strain/jack-herer"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
