{
    "aka": null,
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1522705256000)/",
            "id": "contentitems-62050",
            "text": "Instrumental music exists outside the realm of vocalists, with guitar, horns, and keys filling the space with innovative instrumentation (known as instrumental interludes) where lyrics would normally reside. Though commonly associated with jazz, instrumental music is not limited to any single genre, and can even transcend genre altogether.\nThe beauty in instrumental music is its ability to push the boundaries of sound—exploring and weaving in and out of its structure—with an ease not afforded to lyrical constructs.\n\nBelow, discover five fantastic instrumental albums paired with the perfect strain and explore the vast range of sounds and possibilities instrumental music provides.\nFeeling Good by Dorothy Ashby\n\nStrain Pairing Recommendation: Euforia\nReleased posthumously in 2015, Feeling Good is an incredible collection of harpist Dorothy Ashby’s music that can’t be missed. The 30-track album runs for nearly two hours and will leave no question as to why Ashby’s prowess makes her one of the top instrumental artists to know and love. Her light, lovely, and versatile sound relaxes yet enlivens. Feeling Good is a feel-good instrumental jazz album with a fresh twist, as Ashby demonstrates the harp’s use as a bebop instrument that is as engaging as any saxophone.\nFind Euforia Nearby\nJuice by Medeski, Martin, Scofield & Wood\n\nStrain Pairing Recommendation: Candy Jack\nJuice, released in 2014, is the latest album from the dynamite quartet, Medeski, Martin, Scofield & Wood. The album contains all the signature versatility that Medeski, Martin & Wood bring to their albums, with the expert finesse and precision of legendary guitarist John Scofield. The eclectic 10-track album will keep you on your toes as it bends and twists through experimental and improvisational jazz fusion. Medeski’s wizard-like ability to manipulate the keys and organ provokes creativity and a sense of playfulness that will keep you guessing and surprised from “Sham Time” to “The Times They Are A-Changing.”\nFind Candy Jack Nearby\n\nNomad (Remastered) by Lotus\n\nStrain Pairing Recommendation: Fortune Cookies\nNomad was originally released in 2005, but the latest remastered and live version—released in 2014—is here to remind us all over again why we will always love this album. With funky, upbeat stylings and a full, rounded sound, Nomad wastes no time pulling you into its world—and what a joyful world it is. Songs such as “Travel” incorporate light, melodic vocalizations, blended seamlessly so that they become a sort of instrumentation of their own. Nomad traverses landscapes, delivering transcendental bliss and danceable rhythms in a single album.\nFind Fortune Cookies Nearby\nMigration by Bonobo\n\nStrain Pairing Recommendation: 303 OG\nBonobo’s Migration, released in 2017, is an extension of his unique sound and musical stylings. Each song is masterfully manipulated and crafted, flowing from one track to the next with versatility. Though Migration is electronically styled, Bonobo’s use of real instruments creates a depth and soul within the music that is often lacking amongst electronic artists. And while the album incorporates lyrics on a few tracks, it is deftly woven into the soundscape the way any other instrument is intertwined. Migration explores a range of sounds and feelings, from upbeat tribal rhythms to soft, melodic, wordless ballads, making it an album that tells endless stories with every note.\nFind 303 OG Nearby\n\nGentlemen, I Neglected To Inform You You Will Not Be Getting Paid by Charlie Hunter\n\nStrain Pairing Recommendation: Sweet Cheese\nWith a title reflecting the playfulness instilled in this instrumental album, Gentlemen, I Neglected To Inform You You Will Not Be Getting Paid is a modern jazz collection with a funky twist. Released in 2010, the album runs short at only 38 mins, but the pointed, swampy vibe and full sound, makes up for it. Hunter’s guitar sails beside  a medley of drums, horns, and bass, creating a sound that is both precisely orchestrated and experimentally fun. This album will leave your mind stimulated even as you relax into every note.\nFind Sweet Cheese Nearby",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/04/02132016/best-instrumental-albums-to-listen-to-while-high-header.jpg",
            "title": "5 Fantastic Instrumental Albums to Listen to While High",
            "urlslug": "/news/lifestyle/5-instrumental-albums-to-listen-to-while-high"
        },
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1465056000000)/",
            "id": "contentitems-3625",
            "text": "Cannabis is a flower. And like flowers, cannabis exhibits strong, diverse odors that will stimulate your mind and elicit different sensations based on those smells (and, when smoked, flavors). These smell- and flavor-inducing chemicals are known as terpenes, which are representative of potential effects inside each unique flower. Linalool, for example, is a powerful terpene most commonly associated with lavender. It’s known for its relaxing, sedative effects — the same thing people hope to inspire when they place a pouch of lavender under their pillows before bed.\n\nCannabis is a flower. Lavender is a flower. So what? Flowers smell like flowers.\nWait. Hold your horses, y’all. Here’s where it gets weird.\nOf all the terpenes, of which more than 200 are found in cannabis, many evoke smells that don’t occur naturally in nature. Today, we are going to focus on a few terpenes near and dear to my heart (and stomach): CHEESE!\nThe “cheesy” terpenes are easily some of the most pungent and challenging. But the strains reward the adventurous palate with brilliant, uplifting effects that are pleasantly stimulating and luscious.\n\nSuch terpenes include octanoic acid, (methyl thio) butyrate, ethylmethyl acetic acid, hexanoic acid, isovaleric acid, and methyl mercaptan. These chemicals traverse the scale of cheesiness from the sweet, vanilla ice cream elements of Dairy Queen to the significantly cave-aged earthiness of OG Cheese and UK Cheese.\nBut cheese strains aren’t exclusively savory. Like many fine cheese plates, fruit notes add a complementary sweetness to the umami qualities of a truly robust queso. Strains like Blueberry Cheesecake, Blue Cheese, Sweet Cheese, Bubble Cheese, and many more incorporate sweet elements that can bring creeping indica effects to this primarily sativa-hybrid family.\nCheese terpenes may not be the most pleasant to smell, but they are everywhere. Check out this quote by THCFarmer.com pertaining to one of the many cheese-like terpenes:\n“Isovaleric Acid has a strong, pungent, sour, stinky feet, sweaty cheese smell. It is a major component of the cause of unpleasant foot odor. However, its volatile esters have pleasing scents and are used widely in perfumery. Used as a flavoring it is cheesy, dairy, sweet creamy, fermented, waxy and berry. It has shown effectiveness as an anticonvulsant and antidepressant.”\nThis isn’t a recommendation to huff your stinky socks in an effort to conquer depression, but a simple illustration of the fine line between the refined and the repulsive. So go on: Grab a bowl, smile, and say, “cheese!” Looking for some options? Check the “cheese” filter in our strain explorer for some pungent options!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12003028/why-do-some-cannabis-strains-smell-like-cheese.jpg",
            "title": "Why Do Some Cannabis Strains Smell Like Cheese?",
            "urlslug": "/news/strains-products/why-do-some-cannabis-strains-smell-like-cheese"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 69.52012383900929
        },
        {
            "name": "Bipolar Disorder",
            "score": 22.960526315789473
        },
        {
            "name": "Migraines",
            "score": 22.63157894736842
        },
        {
            "name": "PTSD",
            "score": 22.30263157894737
        },
        {
            "name": "ADD/ADHD",
            "score": 21.973684210526315
        }
    ],
    "description": "<p>Sweet Cheese is a 70% <a href=\"http://leafly.com/sativa\">sativa</a> strain that combines the potency and unique flavor profiles of <a href=\"http://www.leafly.com/hybrid/cheese\">Cheese</a> and <a href=\"http://www.leafly.com/hybrid/black-jack\">Black Jack</a>. Bred by Sweet Seeds, this strain was designed to &nbsp;induce long-lasting <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\">relaxation</a> throughout the body, coupled with intense cerebral <a href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\">euphoria</a>. Sweet Cheese is marked by the fragrant fusion of <a href=\"http://www.leafly.com/explore#!/explore/flavors-cheese\">cheese</a> and <a href=\"http://www.leafly.com/explore#!/explore/flavors-spicyherbal\">spice</a>, a combination of aromas found in few other cannabis varieties. Outdoor Sweet Cheese plants finish flowering in mid-October, while indoor plants bloom in 9 weeks.</p>\n",
    "descriptionPlain": "Sweet Cheese is a 70% sativa strain that combines the potency and unique flavor profiles of Cheese and Black Jack. Bred by Sweet Seeds, this strain was designed to &nbsp;induce long-lasting relaxation throughout the body, coupled with intense cerebral euphoria. Sweet Cheese is marked by the fragrant fusion of cheese and spice, a combination of aromas found in few other cannabis varieties. Outdoor Sweet Cheese plants finish flowering in mid-October, while indoor plants bloom in 9 weeks.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 123.93575851393189
        },
        {
            "name": "Relaxed",
            "score": 104.88390092879258
        },
        {
            "name": "Euphoric",
            "score": 81.63312693498452
        },
        {
            "name": "Uplifted",
            "score": 74.76393188854489
        },
        {
            "name": "Sleepy",
            "score": 64.58591331269349
        }
    ],
    "flavors": [
        {
            "name": "Cheese",
            "score": 79.98839009287926
        },
        {
            "name": "Sweet",
            "score": 73.44814241486067
        },
        {
            "name": "Pungent",
            "score": 67.21749226006192
        },
        {
            "name": "Earthy",
            "score": 62.63157894736842
        },
        {
            "name": "Spicy/Herbal",
            "score": 23.59907120743034
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 63,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1388069,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "This was one of the stinkiest buds I've ever tried.  I really can't emphasize it enough that this is one smelly strain of weed.  But it is a nice smell.\r\nAnyway, this could  probably help with sleep problems as when I smoked it at night, I literally just had to go to bed after.  And I'm a stay up late kind of guy.  Nice taste, nice high, pain and stress relief, what more can I say?",
            "username": "Dimedude"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Pl-Y2_w7iIfXMq-susdCw64Abdk=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fZFL3vk8uSMmuki8G4w8c_old-school-purple.png",
            "id": 1607320,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/3/240",
            "text": "This strain is the definition of \"okay weed.\"  It tastes okay (I don't like cheese strains, I may be biased), but the high is pretty nice.  It leaves you relaxed, uplifted, and ready to take on any daily task.  Makes you very productive, but the high doesn't last super long.  I like this strain a lot, but compared to other sativas it's not as potent.",
            "username": "Lunar_Lesbian"
        }
    ],
    "id": 89840,
    "name": "Sweet Cheese",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 65.57275541795666
        },
        {
            "name": "Dry Eyes",
            "score": 44.256965944272444
        },
        {
            "name": "Anxious",
            "score": 26.540247678018577
        },
        {
            "name": "Paranoid",
            "score": 21.973684210526315
        },
        {
            "name": "Headache",
            "score": 1.3157894736842104
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/cheese",
            "category": "Hybrid",
            "name": "Cheese",
            "permalink": "https://mobileapi.leafly.com/hybrid/cheese",
            "slug": "cheese",
            "subtitle": null,
            "symbol": "Che"
        },
        {
            "applink": "leafly://strain/black-jack",
            "category": "Hybrid",
            "name": "Black Jack",
            "permalink": "https://mobileapi.leafly.com/hybrid/black-jack",
            "slug": "black-jack",
            "subtitle": null,
            "symbol": "Bj"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/sweet-cheese",
    "photoTotalCount": 32,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/678770/b/sweet-cheese__primary_7198.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-cheese_100x100_f5fc.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/660683/b/sweet-cheese__primary_9c5e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-cheese_100x100_bdb9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636203/b/sweet-cheese__primary_cebb.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-cheese_100x100_949a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/636170/b/sweet-cheese__primary_f0e8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-cheese_100x100_43ae.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/572049/b/sweet-cheese__primary_07fc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-cheese_100x100_4481.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/569316/b/sweet-cheese__primary_6cc2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sweet-cheese_100x100_0935.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Toronto, ON",
        "Ottawa, ON",
        "Calgary, AB",
        "Edmonton, AB",
        "Spokane, WA",
        "Tucson, AZ",
        "Hamilton, ON",
        "Kelowna, BC",
        "London, ON",
        "Montréal, QC"
    ],
    "rating": 4.23,
    "relatedStrains": [],
    "reviewCount": 83,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "sweet-cheese",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.2289156626506/240",
    "subtitle": null,
    "symbol": "Swc",
    "symptoms": [
        {
            "name": "Depression",
            "score": 52.13235294117647
        },
        {
            "name": "Stress",
            "score": 49.19117647058823
        },
        {
            "name": "Insomnia",
            "score": 45.57275541795665
        },
        {
            "name": "Headaches",
            "score": 44.91486068111455
        },
        {
            "name": "Pain",
            "score": 25.572755417956657
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
