{"sl_translate":"description,descriptionPlain,category","id":12307,"slug":"hawaiian","name":"Hawaiian","subtitle":null,"symbol":"Haw","category":"Sativa","description":"\u003cp\u003eHawaiian is a mostly sativa hybrid that will give you a happy, vacation feeling. Creative but not so focused, this bud is great for a relaxing day. These light green buds have a sweet smell and taste that is not super potent but will bring to mind fresh tropical fruit.\u003c/p\u003e\n","descriptionPlain":"Hawaiian is a mostly sativa hybrid that will give you a happy, vacation feeling. Creative but not so focused, this bud is great for a relaxing day. These light green buds have a sweet smell and taste that is not super potent but will bring to mind fresh tropical fruit.\n","aka":null,"rating":4.28,"highlightedReviews":[{"id":1414145,"username":"Eric420","text":"Hawaiian smells really tropical and sweet with a little citrus thrown in but it tastes almost like nothing it\u0027s just really sweet it\u0027s like sugar there\u0027s no taste its just sweet , so I geuss the way to describe the taste is sugar cane. The effects come on quite quick right to the head really buzzy sativa crazy boost of motivation and energy I have ADD and this helps a lot with my needing to stay focused. Colors are more vivid it\u0027s a really great sativa lifts your mood very well. 4.6 out of 5 for me one of my favorites","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"},{"id":1628586,"username":"Rome1931","text":"Great strain!!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59186","title":"Which Cannabis Strains Are Highest in CBD, According to Lab Data?","author":"Bailey Rahn","category":null,"date":"\/Date(1519851079000)\/","text":"Cannabidiol, or CBD, is becoming a mainstay in consumers’ medicine cabinets as it combats pain, inflammation, anxiety, and much more. However, even as CBD strains and products become more readily available, the price tag can often make one flinch. For this reason, it’s worth knowing which products will bring the best value based on CBD abundance.\n\nLooking at data from cannabis testing labs across Washington State, we compiled a list of strains that tend to produce significant amount of CBD. These numbers are derived from the testing samples of cannabis flowers and do not include CBD concentrates.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nIn the above graph, you’ll find the average cannabinoid contents of ten popular CBD-dominant strains. You’ll notice that many of these strains contain only trace amounts of THC, while others exhibit a more balanced CBD:THC ratio (which means they will be more euphoric in effect). This graph is based on datasets from multiple reliable testing labs across Washington State. However, it’s worth noting that the datasets from each individual lab differ slightly.\nTake a look at the cannabinoid data from one lab, and notice how the numbers shift slightly.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nMost strains maintain a CBD:THC ratio similar to that in the averaged dataset. However, you’ll also see deviations, like ACDC which exhibits a more balanced CBD:THC ratio according to this lab’s individual testing results.\nNow let’s see how the dataset of Lab A compares to a different lab, also represented in the larger, averaged dataset above.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nAs you can see, the CBD levels from Lab B are much higher on average than those from Lab A. There are a number of possible explanations for this. A lab may manufacture bloated cannabinoid profiles, as we’ve seen some labs do in the past. It could also be that Lab B simply tested samples from growers who achieved higher CBD levels in their harvest.\nThe main takeaway here is this: the cannabinoid profile printed on your product depends not only on the strain’s genetics and expertise of the grower, but also on the testing methods (and ethics) of the local lab that performed the chemical analysis. The Dancehall you bought on your last trip to the dispensary is likely to reflect the cannabinoid data illustrated in the above graphs–however, if you see deviation, the reason lies in the many layers of strain and data variability.\n\nCannabis Strains With High Levels of CBD\nWith this caveat in mind, let’s look at the strains that expressed the highest levels of CBD according to the above lab data.\n\nFind Dancehall Nearby\nDancehall is an upbeat and inspiring strain meant to lift your spirits while coercing creativity. With a CBD:THC ratio of nearly 20:1 on average, this strain delivers little to no euphoric effects that might distract focus or dampen cognition in THC-sensitive consumers.\n\nFind ACDC Nearby\nKnown for its keen ability to lift anxiety of all shades, ACDC is a godsend to consumers susceptible to the side effects of THC. This strain allows you to harness many of the desirable traits of cannabis, like light-footed physical relaxation and gentle mood elevation, without the cost of a clear, calm mind.\n\nFind Suzy Q Nearby\nSuzy Q is a CBD-dominant strain with an extremely modest amount of THC, making it another mellow strain with little to no high. The mild effects of this pine-scented strain help you shed anxious or demotivating mental blocks that stood in the way of creativity and productivity.\n\nFind Ringo’s Gift Nearby\nNamed in recognition of the CBD pioneer Lawrence Ringo, Ringo’s Gift imbues the consumer with a sense of wellbeing alongside steady relief in the body. Use this strain to take the edge off pain and stress, while allowing the mind to roam free without the shackles of paranoia or distracting euphoria.\n\nFind Charlotte’s Web Nearby\nCharlotte’s Web was the first CBD strain to receive media attention, and has achieved legendary status among CBD varieties ever since. Although its reputation is built upon its success in treating epilepsy, this strain has aided patients treating many other conditions including pain, anxiety, and inflammation. Charlotte’s Web is grown by CW Pharmaceuticals in Colorado.\n\nFind Remedy Nearby\nRemedy is a high-CBD strain that quietly ushers in easy relaxation without mental fog. For consumers seeking something a little more relaxing than a cup of tea, Remedy offers a solution with effects that rid the mind of anxiety while soothing aches, pains, and inflammation.\n\nFind Sour Tsunami Nearby\nSour Tsunami has become a household name among high-CBD strains. This variety tends to produce less than 1-2% of THC, so you can reap its medicinal benefits without the high. Sour Tsunami is fairly prolific, so keep an eye out for this strain at your next dispensary visit if you’re looking to quell pain or anxiety symptoms without the interference of THC.\n\nFind Hawaiian Dream Nearby\nIf you’re looking to harness the benefits of THC and CBD but wary of getting too high, Hawaiian Dream is the strain for you. With a THC content of around 5% and a CBD profile stretching between 5-10%, Hawaiian Dream can help abate symptoms with only mild, gentle euphoria. As an added bonus, this strain throws in a little tropical flavor to sweeten the experience.\n\nFind Dance World Nearby\nDance World is a CBD-dominant strain that almost achieves a balanced CBD:THC ratio, making it especially appropriate for consumers struggling with pain, depression, and lack of appetite. This synergy of THC and CBD helps to inspire positivity and more vibrant moods by handing you subdued euphoria on a leash.\n\nFind Nordle Nearby\nNordle offers a balanced abundance of both THC and CBD that makes it especially suitable for patients dealing with pain, insomnia, muscle spasms, and anxiety. If your symptoms are keeping you up at night, Nordle is a great nightcap solution for dialing down pain and worries so you can spend less time tossing and turning.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28121936/high-cbd-strains.jpg","urlslug":"/news/strains-products/high-cbd-marijuana-strains-according-to-lab-data"},{"id":"contentitems-3537","title":"The Best Cannabis Strains for the Holidays (According to Leafly Reviewers)","author":"Brett Konen","category":null,"date":"\/Date(1450897200000)\/","text":"The holidays are fast approaching, so naturally you’re thinking about the perfect cannabis strains to enjoy over the upcoming weeks. Have innumerable aunts, uncles, in-laws, and second cousins coming into town for the long weekend? You’ll probably need something to chill you out after all that family time. Wanting to keep moving in spite of the weather? You’re after something active. Have about a thousand errands left to run? Something to spice up the process would be nice.\nLuckily, Leafly user reviews are a gold mine of suggestions for cannabis strains that fit any scenario, so we’ve compiled a few great user-sourced recommendations for a range of seasonal activities listed below. Whether you’re grocery shopping, cocoa-sipping, or baking some cannabis-infused holiday cookies, try out one of the ideas below and enjoy your holiday celebrations!\n\nFor Coping with Winter\n  “This is the perfect strain to make Seattle winter days productive! A couple hits gives my ambition, creativity and libido a jump-start.” –munin.raven\n \n “My go to for getting my figure back after holiday indulgence!” –grngrazer\n \n “Smooth pull, great taste – exactly what I hoped for…real killer high to cure the inevitable holiday blues.” –hazedandconfused\nFor Spending Time with Family \u0026 Friends\n “Smells like Christmas trees, tastes like pine and lightens the heart and mind…I found it made the whole holiday with ALL the family, very enjoyable. Oh and added benefits of not breaking ornaments or dropping the turkey.” –Free_Byrd\n \n “Smoked this with my Nana and great Uncle Pete while on winter vacation…Made me forget how much my back hurt from sleeping on an air mattress.” –somniumtextrix\n \n “A swift cerebral head high, accompanied by a punch of energy. Best used at a party with friends as is very good for getting you in the mood, to talk, dance, whatever!” –JustAnotherStoner\nFor Curling Up by the Fire\n “I could feel every atom in my body float away in rhythm with the space heater I was sitting next to. Perfect for sitting home on a cold winter evening and then getting a good night sleep.” –Anonymous\n \n “I enjoyed a blunt and hits from my vaporizer along side with a cup of hot chocolate, it was a great combo…pick it up for a stay-at-home type of day.” –kushconnoisseur420\n \n “I’m washing it down with some seasonal ale and it’s the perfect end to a perfect night.” –BudseyXO\nLooks, Smells, and Tastes Like Christmas\n “When I opened the bag I thought I was suddenly on a camping trip. It smelled like a Christmas tree…The taste of pine, clove and earth danced across across my palate.” –robmacpheejr\n \n “Nom nom nom like a Christmas tree with a lifesaver candy cane in your mouth.” –greedyguy\n \n “Feels like I threw a Christmas tree in a wood chipper… lights, ornaments, candy canes – everything – and put it in my Pax to vape it.’” –Midnyte003\nFor Making Spirits Bright\n “This is like that one ‘big’ present hidden behind the tree just when you think you didn’t get what you ‘really’ wanted that year. It’s that good.” –Anonymous\n \n “My brain lit up like Times Square on New Years Eve.” –Grumple\n \n “This strain had me smiling like the Grinch that stole Christmas.” –Skyclub\n \n “Like skating across a frozen lake surrounded by snowflakes in the night.” – bugpowderdustmugwumpjism\n \n “BEST. STRAIN. EVER. Four for you, Sour D, you go Sour D.” –Anonymous\nWhat are some of your favorite strains to enjoy over the holidays? Share in the comments!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12002805/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re.jpg","urlslug":"/news/strains-products/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re"}],"reviewCount":138,"flavors":[{"name":"Tropical","score":42.101391118245047},{"name":"Citrus","score":40.135098983413585},{"name":"Berry","score":32.191902978419833},{"name":"Orange","score":31.630105225610841},{"name":"Flowery","score":30.397271268057782}],"effects":[{"name":"Happy","score":84.483681112894587},{"name":"Talkative","score":75.385678616015682},{"name":"Uplifted","score":72.944533618690912},{"name":"Euphoric","score":69.324059211699662},{"name":"Energetic","score":62.504458712323881}],"symptoms":[{"name":"Stress","score":17.150436953807741},{"name":"Headaches","score":12.234706616729088},{"name":"Depression","score":10.752184769038703},{"name":"Pain","score":9.0667915106117363},{"name":"Fatigue","score":7.6622971285892634}],"conditions":[{"name":"Anxiety","score":9.6285892634207251},{"name":"Asthma","score":3.4800249687890137},{"name":"ADD/ADHD","score":1.1235955056179776},{"name":"Migraines","score":1.1235955056179776},{"name":"PTSD","score":0.9831460674157303}],"negatives":[{"name":"Dry Mouth","score":37.638220082040306},{"name":"Dry Eyes","score":16.53290529695024},{"name":"Paranoid","score":1.6853932584269662},{"name":"Anxious","score":1.2640449438202246},{"name":"Dizzy","score":0.84269662921348309}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/hawaiian_100x100_21f0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/558538/b/hawaiian__primary_c4d1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/hawaiian_100x100_eb39.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/508725/b/hawaiian__primary_7d98.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/hawaiian_100x100_c499.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506593/b/hawaiian__primary_9d89.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/hawaiian_100x100_8e67.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/465325/b/hawaiian__primary_7671.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/hawaiian_100x100_9560.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/422266/b/hawaiian__primary_a4e3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/hawaiian_100x100_2008.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/422482/b/hawaiian__primary_eb2f.jpg"}],"photoTotalCount":24,"popularCities":["Portland, OR","Vancouver, BC","Montréal, QC","Calgary, AB","Toronto, ON","Edmonton, AB","Victoria, BC","Winnipeg, MB","Beaverton, OR","Hood River, OR"],"permalink":"https://mobileapi.leafly.com/sativa/hawaiian","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.28260869565217/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
