{
    "aka": null,
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1475690456000)/",
            "id": "contentitems-8012",
            "text": "I grew up watching Adam West and Burt Ward thwart evildoers after school. Back then I would saunter into the living room and settle down in front of our JC Penney television to admire the collected demeanor of gentleman millionaire Bruce Wayne and his eager ward/sidekick as they unraveled the nefarious tapestry of evil that had been subtly stitched together with sinister subterfuge. (Apparently alliteration attracted audiences back then; or, if nothing else, it gave the dialogue a poetic quality.)\nOne of the most famous turns-of-phrase that came out of the dynamic duo of the mid-60s was Robin’s, “Holy ___, Batman!” This particular set of words arises hilariously often in strain reviews, so without further ado, here’s a small sampling of some of my favorites. Holy strain reviews, Batman!\nHybrid Cannabis Strains\n   GSC (f.k.a Girl Scout Cookies)\n\n“Holy carp fish, batman. This is magic. Definitely gives you a floaty, yet energized feel. You feel it creeping up behind your eyes and in two shakes of a lambs tail, you’re high as goddamn ever.” – Anonymous\n\n   Fruity Pebbles\n\n“Holy hand grenade of Antioch, Batman. Smoking this is like watching high speed film of a remote detonation. But a detonation of giggles and time slippage. Bring this to game-night at the beach. I did, and I’m very happy about that. Social, happy, very fast acting. The super-high phase came on within 5 minutes and lasted about 10-20 minutes. After words a really happy normal to low key high kicked in and took the wheel for around 3 hours. Two of us fell asleep during this time and three of us had energy to spare.  A very solid night sleep followed for me.” – ChestyMcDeathrack\n\n   Chemdawg\n\n“Holy space balls batman. I think we’ve got a winner right here. Toked a small bowl last after a month of FireOG and White Widow. Let me tell you I nearly tripped my balls out. I had a legit out of body experience lying in bed with my wife after smoking. Needless to say I couldn’t sleep. Headed down to TV land, Jay Leno’s new show is pretty good.” – jamtastic\n\nIndica Cannabis Strains\n   Superman OG\n\n“Holy sh*t Batman, I just found one of the newest to my Top 10!!! Dare I say to the coveted #1 slot?!? Honestly, I love ALL strains but you know the standouts and this strain STANDS out! When the description uses the word ‘pungent’, yep, it IS pungent and smokes the same. I usually cough during a bowl but the HIGH it totally worth it!! Definitely agree with many, this is NOT for beginners starting on meds like this but for everyone else, if you come across Superman, GET YOU SOME, you will not be disappointed!!! Believe it or not, this doesn’t really knock me out like others I know that have came across it but DAMN, I love the deeply euphoric, giggly, happy, relaxing high, one the best I’ve felt. Thank you GROWERS of this strain, your the BEST!!!” – dhlvisdrt\n\n   SFV OG Kush\n\n“Holy amazing sleep, Batman! SLEEPIES!! This knocked my ass OUT – I haven’t slept in 2 days and this let me sleep for 7 hours straight, didn’t even move. Super important different between this ‘Kush’ and regular OG…. Smelled like pine, a bit pungent, woody, lemon/citrus, and a slight herbal scent with a little spicy kick. This OG Kush combination is an amazingly super light and smooth smoke! Packed 1/2 a bowl and it tasted like sweet flowers, pine, dankish, and herbal, like tearing open a packet of tea. Went straight to my head and my face was nuuuuumb. Helped my spine amazingly well 5/5, took my kidney stone pain down to 30%, felt cold spots in my back where it hurts, helped with my tendon pain 3/5, and a little bit of nerve pain 2/5 – noticeable enough. No munchies, I passed out – definitely a night time use, great for insomnia. Hits heavy, so I wouldn’t use this as a beginner unless you have insomnia – this is your golden ticket!” – Midnyte003\n\n   G-13\n\n“uuuuuuhhhhh…. I don’t remember what I was doing. or anything at all for that matter. where am i, who am i. it’s about like that. lol. by far the best escape from reality I’ve ever experienced personally if u wanna sit back and chill and just not give a shit about a freaking thing period simply cause u can’t remember a freaking thing. this one is an absolute must try to believe what it can actually achieve for you. review does no justice cause it simply cannot be explained in words properly. has to be experienced personally to know. I just got my first experience with it and will definitely be getting again any and every time I have chance. HOLY MOLY COW BATMAN!!!!” – 247kushpuffer\n\nSativa Cannabis Strains\n   Crystal Coma\n\n“Holy high, Batman! This is some amazing product! Awesome high, good upper, and I’m not a space cadet either! Perfect for a ‘getting shit done but still would like to smoke’ day.” – Anonymous\n\n   Sour Diesel\n\n“Holy racing heart beat and heart pounding out of my chest batman! Everyone has the same experience.” – Anonymous\n\n   East Coast Sour Diesel\n\n“Holy Batman! This thing is like a triple dose of espresso for me! Makes me so hyper I cannot sit still LOL.! Energetic for sure, good for picking up the afternoon blehs. Also gives you an appetite. I don’t think I’ll smoke this at night or I’ll be sleepless!” – HappilyPainFree\n\n   Alaskan Thunder Fuck\n\n“Holy sweet jumped up sativa, Batman. This has to be the most aptly named strain yet. As powerful and as potent as being screwed by an angry Thor. Good if unique taste, rather a sweet note. Has good legs, at 5 to 6. Definitely worth getting when possible. Extraordinary body effects for a sativa. Get some and have intimate relations with the God of Thunder today!” – doobwalker\n\n\n“Leaping caribou, Batman! If this bud doesn’t embody the cold, rugged, wintery majesty that is the Alaskan wilderness, then I dont know what does. With notes of pine trees and freedom, this kush is optimum for white water rafting, eating a raw salmon, fighting a bear, or a combination of the three. Would ride a dog sled for miles in the dead of winter to get ahold of this weed. As in the words of the Eskimos this is some ‘ˈtʃaknaχ ˈhwaʁiχ’.” – wespeterson24\n\nLead image: Twentieth Century Fox Film Corporation",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/10/04153114/holy-cannabis-strain-reviews-batman.jpg",
            "title": "These Cannabis Strains Are So Good, They'll Make You Utter \"Holy ___, Batman!\"",
            "urlslug": "/news/strains-products/holy-cannabis-strains-batman"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1392139800000)/",
            "id": "contentitems-3515",
            "text": "Last weekend in San Bernardino saw another epic battle between growers in the 2014 High Times Los Angeles Cannabis Cup. California’s best heirlooms, classic favorites, and new crossbred varieties fought head-to-head in their respective categories: indica, sativa, and hybrid. In case you weren’t there to witness the history, here are the strains that took this year’s bronze, silver and gold.\nBEST SATIVAS\n\n1st Place — Red Dragon from RCP Sacramento\nCharacteristics of Red Dragon:\n\nCross between West Himalayan Kush and Utopia Haze\nSweet, fruity aroma\nInduces euphoric, happy, and uplifting effects; good for social gatherings\nMay effectively treat depression and stress disorders\nHigh THC may cause paranoia in anxiety-prone individuals\nGrows best indoors with a 8 to 10 week flowering time\n\n\n2nd Place — Silver Haze from Gold Coast Collection\nCharacteristics of Silver Haze:\n\nCross between Haze, Northern Lights, and Skunk\nFruity, pine aroma\nEuphoric head and body effects; allows mental clarity\nSuitable for indoor and outdoor gardens; 8 to 10 week flowering time\n\n \n\n3rd Place — Crystal Coma from Alpha Medic\nCharacteristics of Crystal Coma:\n\nSaid to be a cross between Cheese and Skunk #1\nHeavy trance-like effects; relaxing mental calm\nTHC content of up to 26%\nGood for nighttime treatment of stress disorders, pain, and sleeplessness\n\nBEST INDICAS\n\n1st Place — XXX OG from Life is Good Healing\nCharacteristics of XXX OG:\n\nCross between OG Kush and XXX\nEarthy, pine, and lemon aroma\nSedating and lethargic effects; heavy relaxation\nMay effectively treat sleeplessness, severe nausea, and chronic pain\n\n\n2nd Place — Veganic LA Confidential from Private Stock for Buds and Roses\nCharacteristics of LA Confidential:\n\nCross between Afghani landrace and Southern California Afghani\nSweet, earthy, pine aroma\nCerebral euphoria and full-body relaxation\nUsed by patients to treat acute pain and sleep disorders\n\n \n\n3rd Place — Blackwater from Terrapin Terpene Collective\nCharacteristics of Blackwater:\n\nHybrid of Mendo Purps and San Fernando Valley OG Kush\nGrape, lemon, and pine aroma\nMellow cerebral experience that melts into a head-to-toe euphoric calm; may cause some mental cloudiness\nPatients have reported its success in treating pain, appetite loss, multiple sclerosis, and stress disorders\nFlowering time of 8 to 10 weeks\n\nBEST HYBRIDS\n\n1st Place — GG4 (f.k.a Gorilla Glue #4) from Standard Seed Collective\nCharacteristics of GG4 (f.k.a Gorilla Glue #4):\n\nSaid to come from Chemsis, Sour Dubb, and Chocolate Diesel\nChunky, conic, crystal-covered buds\n56 to 60 day flowering time\n\n2nd Place — Alpha OG from Alpha Medic\nCharacteristics of Alpha OG:\n\nOG Kush phenotype\nPine aroma\nConsistently tests over 20% THC when grown optimally\nMay treat sleep apnea, appetite and weight loss, nausea, and chronic pain\n\n\n3rd Place — Redding OG from RCP Sacramento\nCharacteristics of Redding OG:\n\nLong-lasting and uplifting; energizing enough for social activities\nHigh THC content\nMay help with sleeplessness, appetite loss, depression, and stress\n\nphoto credit: kevinthoule via photopin cc",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/02/12002727/the-2014-los-angeles-cannabis-cup-winning-strains.jpg",
            "title": "The 2014 Los Angeles Cannabis Cup Winning Strains",
            "urlslug": "/news/strains-products/the-2014-los-angeles-cannabis-cup-winning-strains"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 34.64081207704321
        },
        {
            "name": "PTSD",
            "score": 30.37220197813639
        },
        {
            "name": "ADD/ADHD",
            "score": 25.596043727225403
        },
        {
            "name": "PMS",
            "score": 23.60489328474753
        },
        {
            "name": "Bipolar Disorder",
            "score": 23.38365434669443
        }
    ],
    "description": "<p class=\"p1\">Crystal Coma is a rare sativa-dominant hybrid from California that induces deep, trance-like effects. Its name foreshadows the debilitating relaxation to come, a long-lasting calm that shuts off mental overactivity. Pastel green breaks through this sativa&rsquo;s thick blanket of crystal trichomes that contributes to its staggeringly high THC content of up to 26 percent. Crystal Coma&rsquo;s genetics are long lost, but myth has it that the origins lie in <a href=\"http://www.leafly.com/indica/cheese\"><span class=\"s1\">Cheese</span></a> and <a href=\"http://www.leafly.com/sativa/skunk-1\"><span class=\"s1\">Skunk #1</span></a>. Anxiety, PTSD, pain, and sleeplessness are no match for Crystal Coma&rsquo;s potency, a medicine that is highly recommended for nighttime use.&nbsp;Crystal Coma took 3rd place in&nbsp;the 2014 L.A. Cannabis Cup.</p>\n",
    "descriptionPlain": "Crystal Coma is a rare sativa-dominant hybrid from California that induces deep, trance-like effects. Its name foreshadows the debilitating relaxation to come, a long-lasting calm that shuts off mental overactivity. Pastel green breaks through this sativa&rsquo;s thick blanket of crystal trichomes that contributes to its staggeringly high THC content of up to 26 percent. Crystal Coma&rsquo;s genetics are long lost, but myth has it that the origins lie in Cheese and Skunk #1. Anxiety, PTSD, pain, and sleeplessness are no match for Crystal Coma&rsquo;s potency, a medicine that is highly recommended for nighttime use.&nbsp;Crystal Coma took 3rd place in&nbsp;the 2014 L.A. Cannabis Cup.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 74.21395106715252
        },
        {
            "name": "Uplifted",
            "score": 51.27277459656429
        },
        {
            "name": "Relaxed",
            "score": 44.726704841228525
        },
        {
            "name": "Creative",
            "score": 39.79437792816241
        },
        {
            "name": "Tingly",
            "score": 32.142113482561165
        }
    ],
    "flavors": [
        {
            "name": "Spicy/Herbal",
            "score": 26.10359187922957
        },
        {
            "name": "Woody",
            "score": 26.10359187922957
        },
        {
            "name": "Coffee",
            "score": 26.10359187922957
        },
        {
            "name": "Pungent",
            "score": 24.26861009890682
        },
        {
            "name": "Pepper",
            "score": 20.442477876106196
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png",
            "id": 1397636,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Wow. Just WOW. Here is a real in depth review of what i have just fucking felt...\n\nIf you are a person with a type B personality ( Creative thinker/ artist mindset / sensitive / insecure ) this will pierce all of the layers of you. This will bring you back to old times. Smoke enough of it and you will have an overflow of emotions and energy flow into you. If you smoke kush because you feel alone. This will re-evaluate  everything that you are going through in your life and will put it right in front of your face. If your looking for a challenge this kush is not for the faint of hearts...so be warned! will make you feel super emotional. The euphoria rush is remnant of pure MDMA. \n\nCrystal come has an Earthy taste, with a hint of lemon. Smoothest kush ive smoked on exhale with minimal coughs ( i was sick tho ) When people say \"rare\" i mean my dispensary had only 16g of this at its disposal. \n\nCrystal come is a diamond in the sand. Smoke it wisely brothas!",
            "username": "onderwish"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1635689,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Crystal Coma is not for the faint heart! It starts off with a really dizzy feeling then a INDICA SLAM that has to put you to bed, especially if you blaze way too much! It’ll have you passing out in random places if your not careful! Yea it’s great for night use but great morning jazz cause it’s a one jointer!",
            "username": "ORGANIC PHENOTYPE"
        }
    ],
    "id": 65392,
    "name": "Crystal Coma",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 31.478396668401874
        },
        {
            "name": "Dry Eyes",
            "score": 24.711087975013015
        },
        {
            "name": "Dizzy",
            "score": 24.26861009890682
        },
        {
            "name": "Anxious",
            "score": 4.268610098906819
        },
        {
            "name": "Paranoid",
            "score": 4.0473711608537215
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/cheese",
            "category": "Hybrid",
            "name": "Cheese",
            "permalink": "https://mobileapi.leafly.com/hybrid/cheese",
            "slug": "cheese",
            "subtitle": null,
            "symbol": "Che"
        },
        {
            "applink": "leafly://strain/skunk-1",
            "category": "Hybrid",
            "name": "Skunk No. 1",
            "permalink": "https://mobileapi.leafly.com/hybrid/skunk-1",
            "slug": "skunk-1",
            "subtitle": null,
            "symbol": "Sk1"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/crystal-coma",
    "photoTotalCount": 21,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/655214/b/crystal-coma__primary_2243.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/crystal-coma_100x100_6f55.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/553930/b/crystal-coma__primary_806f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/crystal-coma_100x100_83f5.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/548323/b/crystal-coma__primary_8eda.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/crystal-coma_100x100_3ca6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/512396/b/crystal-coma__primary_4890.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/crystal-coma_100x100_b89a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/507802/b/crystal-coma__primary_2049.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/crystal-coma_100x100_a301.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500156/b/crystal-coma__primary_aa72.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/crystal-coma_100x100_ce8b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Toronto, ON",
        "Calgary, AB",
        "Edmonton, AB",
        "Montréal, QC",
        "Vancouver, BC",
        "Brampton, ON",
        "Mississauga, ON",
        "Mount Morris, MI",
        "Nanaimo, BC",
        "Ottawa, ON"
    ],
    "rating": 4.61,
    "relatedStrains": [],
    "reviewCount": 100,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "crystal-coma",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.61/240",
    "subtitle": null,
    "symbol": "Crc",
    "symptoms": [
        {
            "name": "Stress",
            "score": 58.18063508589277
        },
        {
            "name": "Depression",
            "score": 54.133263925039046
        },
        {
            "name": "Headaches",
            "score": 48.53722019781364
        },
        {
            "name": "Pain",
            "score": 46.70223841749089
        },
        {
            "name": "Fatigue",
            "score": 27.431025507548153
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
