{
    "aka": "3-D CBD",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1447430400000)/",
            "id": "contentitems-3355",
            "text": "Leafly's strain database was just updated with some new varieties. Have you had a chance to check out Snoop Dogg's newest line of cannabis strains? Read about those and more below. Also, remember to submit a review if you've tried any of these newly added strains!\n \n 1. Orange Creamsicle\n\nTaking the best attributes of parent strains Orange Crush and Juicy Fruit, Orange Creamsicle’s tall structure, heavy colas, and pungent flavor will be sure to keep you coming back for more. This hybrid strain, as the name suggests, has a strong citrus flavor and is used to treat nausea and anxiety. Growers will be happy with this heavy producer that flowers in 9 weeks with beautiful orange-white coloring and a thick coating of resin.\n\nClick here for a full list of locations currently carrying Orange Creamsicle\n \n 2. 3D CBD\n\n3D CBD from Snoop Dogg’s branded line of cannabis strains was crafted with patients in mind. With a THC:CBD ratio of about 5:8, this earthy-flavored sativa is preferred for treating pain, inflammation, and muscle tension. Consumers susceptible to THC-induced anxiety may also appreciate the sobering, relaxing balance CBD has to offer.\n\n3D CBD is currently available at LivWell on Broadway in Denver, CO\n \n 3. Purple Bush\n\nPurple Bush, brought to you by Leafs by Snoop, is an indica-dominant hybrid that carries all the hallmark traits of a kush with a hint of berry flavor. This dense purple-hued strain tests upward of 21% THC and will have you feeling relaxed after a long day.\n\nPurple Bush is currently available at LivWell on Broadway in Denver, CO\n \n 4. Bluniverse\n\nBluniverse, also called Blue Universe, is a 50/50 hybrid strain bred by Dynasty Seeds. Mothered by Blue Magoo and fathered by Ms. Universe, Bluniverse inherits a complex flavor profile of blueberry, cherry, and vanilla spice. Its initial effects focus themselves cerebrally, with high-flying euphoria that tapers into pacifying relaxation over time. This hybrid may express one of three different phenotypes, one that takes after Blue Magoo, another taking after Ms. Universe, and a third that exhibits a balance of each parent’s characteristics.\n\nClick here for a full list of locations currently carrying Bluniverse\n \n 5. Tangerine Man\n\nFrom Leafs by Snoop comes Tangerine Man, a sativa-dominant hybrid that is perhaps the best of his new strains. With a citrus aroma and trichome-coated buds, expect a nice pick-me-up that pairs wonderfully with daytime physical activity.\n\nTangerine Man is currently available at LivWell on Broadway in Denver, CO\n \n 6. Gooberry\n\nGooberry is an indica-dominant strain descended from legendary parents Afgoo and Blueberry. This fruity, spicy strain will leave you giggling on your couch with upward of 20% THC. Consumers highly recommend this strain for night time use to treat pain and insomnia, and it's sure to leave you with the munchies. Like most indicas, Gooberry will flower in 7-9 weeks with a short, bushy structure.\n\nGooberry is currently available at Orange County Cannabis Club in Santa Ana, CA\n \n 7. ICED Grapefruit\n\nICED Grapefruit by Female Seeds is a hybrid strain that brings together genetics from ICE and Grapefruit. The resulting hybrid leans slightly to the sativa side, offering uplifting and happy effects that keep positivity flowing. The physically relaxing qualities of this strain come from its ICE parent, an indica-dominant hybrid cherished for its sedating effects. Both parents come through in the flavor as hashy notes intermix with sweet citrus and fruit.\n\nClick here for a full list of locations currently carrying ICED Grapefruit\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12002256/new-strains-alert-orange-creamsicle-blueberry-dream-iced-grapefru-f17c.png",
            "title": "New Strains Alert: Orange Creamsicle, Bluniverse, ICED Grapefruit, 3D CBD, and More",
            "urlslug": "/news/strains-products/new-strains-alert-orange-creamsicle-blueberry-dream-iced-grapefru-f17c"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Epilepsy",
            "score": 15.882352941176471
        },
        {
            "name": "Cancer",
            "score": 14.411764705882353
        },
        {
            "name": "Migraines",
            "score": 11.470588235294118
        },
        {
            "name": "Asthma",
            "score": 10
        },
        {
            "name": "Anxiety",
            "score": 7.352941176470589
        }
    ],
    "description": "<p>3D CBD from Snoop Dogg&rsquo;s branded line of cannabis strains was crafted with patients in mind. With a THC:CBD ratio of about 5:8, this earthy-flavored sativa is preferred for treating pain, inflammation, and muscle tension. Consumers susceptible to THC-induced anxiety may also appreciate the sobering, relaxing balance <a href=\"https://www.leafly.com/news/cannabis-101/whats-the-deal-with-these-high-cbd-strains\">CBD</a> has to offer.</p>\n",
    "descriptionPlain": "3D CBD from Snoop Dogg&rsquo;s branded line of cannabis strains was crafted with patients in mind. With a THC:CBD ratio of about 5:8, this earthy-flavored sativa is preferred for treating pain, inflammation, and muscle tension. Consumers susceptible to THC-induced anxiety may also appreciate the sobering, relaxing balance CBD has to offer.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 33.23529411764706
        },
        {
            "name": "Happy",
            "score": 30.294117647058822
        },
        {
            "name": "Uplifted",
            "score": 27.352941176470587
        },
        {
            "name": "Focused",
            "score": 25.88235294117647
        },
        {
            "name": "Talkative",
            "score": 20
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 24.411764705882355
        },
        {
            "name": "Flowery",
            "score": 14.411764705882353
        },
        {
            "name": "Woody",
            "score": 7.352941176470589
        },
        {
            "name": "Spicy/Herbal",
            "score": 2.941176470588235
        },
        {
            "name": "Sweet",
            "score": 2.941176470588235
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png",
            "id": 1413795,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "New CBD Strain !!!\n3D CBD by Leafs by Snoop \nHas enough CBD for your medicinal needs and is low enough in THC to not cause Anxiety (worst aspect of weed). \n\nThis Strain is REAL MEDICINE and every household should have some !\n\nFlowers are the next to the spongiest of all Leafs by Snoop Flowers (Northern Lights is the spongiest).\n\nThis strain is NOT Pre 98 Bubba Kush repackaged \nIt's not \nPre 98 is very dense \nThis strain is spongy \n(It's clearly has Sativa parentage).\n\nThe fact that it's spongier makes breakup easier and burns evenly \nPerfect to use as Medicine \n\nThanks Snoop \nThis is a big deal for so many who need CBD !!! ",
            "username": "MedicalIncredible"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1501131,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I was just diagnosed with Thyroid Cancer, Epilepsy, also have IIH with a VP Shunt, Factor V Liden and 13 surgeries under my belt to keep me alive. \nI started using marijuana a year ago for migraines. Our local Shatter Shots has a local vendor with this strain and with me just holding the bud in my hand I quite coughing, I could talk. The guys at the booth with my husband were amazed. I smoke up to 6 bowls daily of this on my 4th day. No more headaches, no more coughing, no more sore throat. I can breath deep and long. Now one thing I find interesting you say it makes you feel sleeping and relaxed, not me I don’t feel wired I just feel like the 1st time I can breath move talk and do my house hold hold chores with out coughing up a lung. Now to sleep I have to use a Indica to sleep. Thanks Snoop for this amazing life saving strain! I am forever grateful, now my prayer is to be able to afford the dosage I need to feel this amazing! \nTiffany Miller ",
            "username": "TiffanyMiller"
        }
    ],
    "id": 187791,
    "name": "3D CBD",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 11.470588235294118
        },
        {
            "name": "Dry Eyes",
            "score": 10
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/sativa/3d-cbd",
    "photoTotalCount": 2,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/464652/b/3d-cbd__primary_cd61.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/3d-cbd_100x100_066c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/408445/b/3d-cbd__primary_66a3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/3d-cbd_100x100_7ad8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Beaverton, OR"
    ],
    "rating": 4.59,
    "relatedStrains": [],
    "reviewCount": 17,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "3d-cbd",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.58823529411765/240",
    "subtitle": null,
    "symbol": "3dc",
    "symptoms": [
        {
            "name": "Pain",
            "score": 31.764705882352942
        },
        {
            "name": "Stress",
            "score": 27.352941176470587
        },
        {
            "name": "Insomnia",
            "score": 22.941176470588236
        },
        {
            "name": "Headaches",
            "score": 21.470588235294116
        },
        {
            "name": "Inflammation",
            "score": 17.352941176470587
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
