{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1514822427000)/",
            "id": "contentitems-40128",
            "text": "For most of us in the Western hemisphere, drinking is usually the first step into the wide and varied world of intoxicants. Drinking, like cannabis, can give a person access to a wide range of sensations–but in all fairness, only one of these significantly increases your chance of barfing. And yes, I mean alcohol. Alcohol can be a lot of fun, but one of the primary deterrents for getting lit on liquor or wrecked on red wine (especially after age 30) is the fierce hangover the next day.\nHangovers can feel like a vampire drained your body of all life-giving fluids just before throwing you in front of a speeding city bus. And somehow you miraculously survived.\nEnter cannabis and its soothing cocktail of cannabinoids. These unique chemical compounds can induce pleasurable euphoria while tempering nausea, reducing inflammation, and stimulating appetite. Cannabis is not a silver bullet for removing a hangover, but it’s often a step toward recovery. Cannabis mixed with a good breakfast and the steady intake of water can revive and rejuvenate even the most wretched party monster.\n\nA cannabis oil cartridge and pen battery is my preferred cannabis consumption method following a long night of drinking. This method is convenient for a few reasons:\n\nYou don’t have to get out of bed\nThe potency and variety of cartridges are at my disposal\nNo need for extra steps like lighting a bowl\nThey are generally less harsh (i.e., you’re less likely to cough and exacerbate your current discomfort)\n\nBrowse Cannabis Vape Pens\nGoing a step further, I would recommend a CBD-dominant cartridge with a 1:1 or 3:1 CBD/THC ratio. This mixture of cannabinoids is utilized by cannabis consumers in and outside the medicinal cannabis community for its anti-inflammatory, anti-anxiety, and analgesic (pain reducing) qualities.\nI encourage you to explore and experiment with strains and products that work best for you. Some folks would rather snap off a zippy sativa to front-load their body and mind with energy. Others seek out strains that help dull the pounding headache of a hangover. My point is, there is no one way. Just be sure to supplement all cannabis consumption with plenty of water and food (and maybe a multivitamin after said food) to assist in the recovery process.\n\nExplore your local dispensary beforehand, and who knows, you might find a deal or two that prepares you for a long Saturday or Sunday of post-party recuperation.\nCannabis Strain Recommendations for Alleviating Hangovers\nHigh-CBD Cannabis Strains\n   Harlequin\nOne of the most popular, and thus, readily available CBD-dominant strains in many cannabis markets, Harlequin offers a solid CBD:THC ratio and a gentle, but noticeable mood boost. This strain’s soothing, happy buzz can work wonders after a solid holiday brunch.\nFind Harlequin Nearby\n   Sour Tsunami\nSour Tusnami is another popular CBD strain that can help tone down nausea and temper inflammation. The bouquet can be a little flat, but the overall effects (especially when mixed with food and water) are stunningly apparent and not mentally or physically cumbersome, which some THC-dominant strain can be.\nFind Sour Tsunami Nearby\n   Dancehall\nHangover or no hangover, Dancehall is curently my favorite CBD dominant flower, period. With usually less than 2% THC and upwards of 20% CBD, Dancehall hits all the right notes at the perfect pitch and volume. The terpene profile is surprisingly dank, reeking of skunk and swamp grass, but the flavor is sweet and herbaceous on the tongue. In a pipe, joint, or vaporizer, Dancehall will be your host at the after-after-after party come New Years Day.\nFind Dancehall Nearby\n   Cannatonic\nCannatonic is known for having a 3:1 CBD/THC ratio, which is perfect for consumers looking for a little headiness with their dose of wellness. This strain is also a popular concentrate, giving vapers, dabber, and other high-potency consumers a good option if smoke inhalation is too harsh. But beware of the dreaded dab cough! Uncontrollable post-hit hacking is the absolute worst with a hangover–trust me!\nFind Cannatonic Nearby\nTHC-Dominant Cannabis Strains\n   Lavender\nLavender is a natural choice for this list: 1) it is indica-dominant in effect, 2) its high concentrations of the terpene linalool should help with the discomfort caused by a hangover, 3) Lavender is sedative at a higher dose, but can be quite functional with only a hit or two. This allows consumer modulate their dosage depending on the severity of their hangover.\nFind Lavender Nearby\n   Hindu Kush\nHindu Kush is one of the more mellow options on this list. The goal is to reduce the overall physical discomfort caused by a hangover, and Hindu Kush dulls just about every sense a person could have. This isn’t a one-and-done painkiller, but consumption should lead to some degree of physical and mental relief from a hangover.\nFind Hindu Kush Nearby\n   Jillybean\nJillybean is a joyous strain with delicious flavors that can add a little pep to your step post-NYE. This strain’s sweet citrus flavor and sativa-dominant bent give the consumer a nudge toward alertness and a slight boost of energy.\nFind Jillybean Nearby\n   Chocolope\nChocolope is a spicy, nutty flower with good energy in store. This strain is pungent and invigorating, leaving the consumer with a happy feeling right between the ears. Mood elevation is a great way to stem the down-and-out feeling of a hangover. Chocolope is a great rallying call on New Years Day to bring your fellow hungover party goers out and back to life.\nFind Chocolope Nearby",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/29164217/hangover.jpg",
            "title": "Hungover? These Cannabis Strains Can Help",
            "urlslug": "/news/strains-products/best-cannabis-strains-for-hangovers"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1498402845000)/",
            "id": "contentitems-32161",
            "text": "Ever wanted to grow your favorite strain? Leafly and General Hydroponics are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: A sativa-dominant high-CBD strain, Harlequin was bred by crossing a Thai sativa, a Swiss landrace, and Colombian Gold. Its balanced levels of THC and CBD make it a unique strain with minimal psychoactive effects. CBD calms the high caused by THC, leaving the consumer feeling relaxed but not overwhelmed. Harlequin is popularly used by patients who wish to treat pain while remaining clear-headed and functional.\nGrow Techniques: CBD strains should be harvested early, as CBD levels degrade more rapidly than THC levels. The plant is a heavy yielder, so be prepared for large colas. Training the plants while keeping good airflow in the canopy leads to maximum yields. Harlequin grows well either hydroponically or in soil.\nFlowering Time: 8 weeks\nYield: High\nGrow Difficulty: Moderate\nClimate: Keep between 72-85 degrees Fahrenheit. This strain can handle higher humidity levels, but keep good airflow in your garden.\nIndoor/Outdoor: Grows indoors or out, though a controlled environment will help the plant with its CBD production.\nFeeding: Make sure Harlequin has access to soil nutrients by watering with compost tea. If growing hydroponically, give the plants lots of oxygen in the later stages of flowering to increase bud production.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/24130330/harlequin-cannabis.jpg",
            "title": "Tips for Growing Harlequin Cannabis",
            "urlslug": "/news/growing/how-to-grow-harlequin-marijuana"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 67.90021830909681
        },
        {
            "name": "PTSD",
            "score": 22.950085508496727
        },
        {
            "name": "ADD/ADHD",
            "score": 22.783558531222084
        },
        {
            "name": "Migraines",
            "score": 17.101015932791633
        },
        {
            "name": "Bipolar Disorder",
            "score": 15.741374795113112
        }
    ],
    "description": "<p>Harlequin is a 75/25 <a href=\"http://leafly.com/sativa\">sativa</a>-dominant strain renowned for its reliable expression of <a href=\"http://www.leafly.com/news/lifestyle/whats-the-deal-with-these-high-cbd-strains\">CBD</a>. A descendant of <a href=\"http://www.leafly.com/sativa/colombian-gold\">Colombian Gold</a>, a Nepali indica, and&nbsp;<a href=\"http://www.leafly.com/sativa/thai\">Thai</a>&nbsp;and <a href=\"https://www.leafly.com/sativa/swiss-sativa\">Swiss</a> <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\">landrace</a> strains, you can depend on Harlequin to provide clear-headed, alert sativa effects. Unlike most high-CBD strains, Harlequin almost always develops a CBD:THC ratio of 5:2, making this strain one of the most effective out there for treatment of <a href=\"http://www.leafly.com/explore#!/explore/symptoms-pain/\">pain</a> and <a href=\"http://www.leafly.com/explore/conditions-anxiety\">anxiety</a>, as CBD can counteract&nbsp;THC&rsquo;s paranoia while amplifying its painkilling properties. Flavors can range from <a href=\"http://www.leafly.com/explore/flavors-earthy\">earthy</a> musk to sweet <a href=\"http://www.leafly.com/explore/flavors-mango\">mango</a>, but without a doubt, what draws crowds to Harlequin is its ability to <a href=\"http://www.leafly.com/explore/tags-relaxed\">relax</a> without sedation&nbsp;and to relieve without intoxication.</p>\n",
    "descriptionPlain": "Harlequin is a 75/25 sativa-dominant strain renowned for its reliable expression of CBD. A descendant of Colombian Gold, a Nepali indica, and&nbsp;Thai&nbsp;and Swiss landrace strains, you can depend on Harlequin to provide clear-headed, alert sativa effects. Unlike most high-CBD strains, Harlequin almost always develops a CBD:THC ratio of 5:2, making this strain one of the most effective out there for treatment of pain and anxiety, as CBD can counteract&nbsp;THC&rsquo;s paranoia while amplifying its painkilling properties. Flavors can range from earthy musk to sweet mango, but without a doubt, what draws crowds to Harlequin is its ability to relax without sedation&nbsp;and to relieve without intoxication.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 73.97173162360079
        },
        {
            "name": "Uplifted",
            "score": 60.98182780425771
        },
        {
            "name": "Focused",
            "score": 59.002564434807425
        },
        {
            "name": "Happy",
            "score": 51.5733918771302
        },
        {
            "name": "Energetic",
            "score": 46.11597199214022
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 20.3313331233892
        },
        {
            "name": "Woody",
            "score": 10.845739992936254
        },
        {
            "name": "Citrus",
            "score": 10.573516531460456
        },
        {
            "name": "Flowery",
            "score": 9.294934879047029
        },
        {
            "name": "Pine",
            "score": 9.039290990225568
        }
    ],
    "growInfo": {
        "averageYield": "High",
        "difficulty": "Easy",
        "environment": null,
        "floweringDays": 56,
        "growNotes": "\n\tBest results with excellent air circulation\n\tClearing lower branches can improve circulation and air flow\n\tGrows best in temperatures between 70 to&nbsp;80&deg;F (21 to 27&deg;C) and at 50% humidity\n\n",
        "height": "Tall",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1417866,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Harlequiin has been nothing short of a miracle for my varied health problems.\n\nI am 30 years old and had not done cannabis before. I was researching ways to heal my gastrointestinal inflammation and bleeding, which contributes to most of my other problems (allergies, hormonal imbalance, fatigue, exercise intolerance, etc) and decided to give cannabis a try. \n\nI did some other strains before trying a high CBD, low THC strain. I didn't really enjoy the spaciness most highs impart; I'm one of those people that really likes my brain being as active and engaged and coherent as possible, so other strains just bored me. I really need my short term memory intact, too; that drives me crazy.\n\nSo I got a strain of Harlequin that's 15% CBD to 7% THC. Three hits gets me high, so I take two in the morning and two at night and I can function normally.\n\nI AM NOT EXAGGERATING WHEN I SAY HARLEQUIN HAS TURNED MY LIFE AROUND. Before, I would eat a very restricted diet (restricted form of paleo) to avoid all my food allergies, eat all organic, eat as much raw food as possible, etc. Even doing all this, and taking probiotics and enzymes, was not enough to really help my digestive tract much. I would feel considerably better than when I didn't do those things, but I'd still low on energy, and I still had exercise intolerance, and so on.\n\nMy first week on Harlequin I decided to test if cannabis was as effective as I'd heard on some medical forums. Ulcerative colitis patients were saying it stopped their bleeding entirely, and I found that hard to believe but I figured they had no reason to lie, and most of these people sounded like they had worse GI problems than I did too. So the first day, I ate a bunch of things I usually can't eat at all. I waited for the stuffy nose, the feeling of being hit by a truck, the need to nap... nothing ever came. My stomach never got upset. I thought surely I'd feel it the next morning -- I will always, always wake up with a stuffy nose and sore all over if I eat so much as extra sugar -- but nope. I woke up feeling better than ever. \n\nFor a FULL WEEK I just ate complete junk AND I FEEL BETTER THAN I EVER HAVE IN MY LIFE. \n\n- No more gastrintestinal bleeding. No more related pain, either.\n\n- My dietary histamine intolerance is gone completely. This is good news for my love of tea.\n\n- Normally my skin would be pallid and oily, and my face would be puffy, and I'd be breaking out. My skin looks vibrant.\n\n- My normally messed up circadian rhythms are correcting themselves: after years of sleeping 12 to 16 hours from sheer fatigue, if I go to bed at 3AM I actually have trouble sleeping past 9AM, but I feel rested and alert! I've only been on the Harlequin a short while but my sleep schedule has been creeping back to something \"normal:\" I'm going to gradually sleep earlier and waking up earlier. I'm curious to see if this will turn into an 11AM to 6AM sort of thing, which would be nice.\n\n- I had almost ZERO PMS symptoms, though mine were never very bad. Considerably less bleeding, too, and I usually have a day of heavy bleeding.\n\n- My exercise intolerance is gone! Before, my low blood pressure meant my heart had to shoot up to 220+ bpm just to get oxygen to my cells if I did any sort of cardio. It was never enough, either, so I could faint. And I always felt TERRIBLE afterwards: no sort of endorphin rush whatsoever, I just needed to nap. I went to the gym again after doing Harlequin and exercise is MUCH EASIER: my heart rate never went over 175 and I had no problem running. I wasn't tired, or in any danger of fainting, and the best part is when I was done, I FELT GREAT THE REST OF THE DAY. I've actually found myself getting the urge to go exercise, even on days that I've already exercised, when I never get that urge at all normally.\n\nI CANNOT BELIEVE JUST DOING CANNABIS DROPPED MY HEART RATE 50BPM INTO NORMAL PEOPLE TERRITORY WHEN MONTHS OF STUBBORN DETERMINATION TRYING TO WORK OUT DIDN'T DROP IT EVEN 1BPM. I sound like an informercial but I cannot get over this.\n\n- Similarly, I do not want to nap or feel like I'm going to pass out if I'm in 85F+ weather anymore. I just feel fine! So it's having a positive effect on my low blood pressure.\n\n- Libido seems to be incrementally increasing with use. I think this is a function of my hormones balancing, probably not a direct effect of a compound in Harlequin.\n\nHarlequin appears to be doing a lot of wonderful things to my hormones, whether directly or because my stomach isn't complicating matters I don't know. But I don't care. I will probably do Harlequin for the rest of my life, unless I find something similar.\n\nI doubt most people will have results as dramatic as mine, particularly if they haven't had a slew of difficult-to-target health problems, but maaaaan. If you have any of the issues I've described, I urge you to get some. I wish I had this decades ago.",
            "username": "nattiecakes"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1638054,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "my new favorite every day strain. it helps my body relax with the high CBD but has that great sativa buzz. lots of indica heavy CBD strains out there so this one is a gem if ya want your body to feel like it's on find couch but still be up and about getting stuff done",
            "username": "ganjapanese"
        }
    ],
    "id": 915,
    "name": "Harlequin",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 15.160078302601667
        },
        {
            "name": "Dry Eyes",
            "score": 14.46254028029729
        },
        {
            "name": "Anxious",
            "score": 11.955409560549748
        },
        {
            "name": "Dizzy",
            "score": 10.23341660023903
        },
        {
            "name": "Headache",
            "score": 9.468254970591419
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/colombian-gold",
            "category": "Sativa",
            "name": "Colombian Gold",
            "permalink": "https://mobileapi.leafly.com/sativa/colombian-gold",
            "slug": "colombian-gold",
            "subtitle": null,
            "symbol": "Cg"
        },
        {
            "applink": "leafly://strain/thai",
            "category": "Sativa",
            "name": "Thai",
            "permalink": "https://mobileapi.leafly.com/sativa/thai",
            "slug": "thai",
            "subtitle": null,
            "symbol": "Tha"
        },
        {
            "applink": "leafly://strain/swiss-sativa",
            "category": "Sativa",
            "name": "Swiss Sativa",
            "permalink": "https://mobileapi.leafly.com/sativa/swiss-sativa",
            "slug": "swiss-sativa",
            "subtitle": null,
            "symbol": "Sws"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/harlequin",
    "photoTotalCount": 76,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/sativa/harlequin/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/sativa/harlequin/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002177/b/harlequin__primary_b32c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/harlequin_100x100_213c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002097/b/harlequin__primary_62a5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/harlequin_100x100_6dc4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/635574/b/harlequin__primary_1366.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/harlequin_100x100_4c6b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/595215/b/harlequin__primary_b99c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/harlequin_100x100_be45.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/593229/b/harlequin__primary_606a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/harlequin_100x100_538f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/564059/b/harlequin__primary_7ffa.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/harlequin_100x100_2bea.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Los Angeles, CA",
        "Seattle, WA",
        "Portland, OR",
        "Denver, CO",
        "Eugene, OR",
        "Bellingham, WA",
        "Chicago, IL",
        "Colorado Springs, CO",
        "Vancouver, BC",
        "Everett, WA"
    ],
    "rating": 4.31,
    "relatedStrains": [],
    "reviewCount": 1018,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "harlequin",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.31335952848723/240",
    "subtitle": null,
    "symbol": "Har",
    "symptoms": [
        {
            "name": "Pain",
            "score": 52.04281384187926
        },
        {
            "name": "Stress",
            "score": 47.04325259231801
        },
        {
            "name": "Depression",
            "score": 38.02935718823569
        },
        {
            "name": "Inflammation",
            "score": 28.819384076393426
        },
        {
            "name": "Headaches",
            "score": 25.39714432237797
        }
    ],
    "testGraph": "https://leafly.s3.amazonaws.com/strains/testing/1q0LqBPIRGqcKQhh9FBU_harlequin.png",
    "videoUrl": null,
    "weakDescription": false
}
