{"sl_translate":"description,descriptionPlain,category","id":77809,"slug":"sour-tangie","name":"Sour Tangie","subtitle":null,"symbol":"Stg","category":"Sativa","description":"\u003cp\u003eDNA Genetics\u0026rsquo; Sour Tangie is an 80% \u003ca href=\"http://leafly.com/sativa\"\u003esativa\u003c/a\u003e cross between \u003ca href=\"http://www.leafly.com/sativa/east-coast-sour-diesel\"\u003eEast Coast Sour Diesel\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/sativa/tangie\"\u003eTangie\u003c/a\u003e. Sour Tangie brings together the classic Sour Diesel aroma with Tangie\u0026rsquo;s \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-creative\"\u003ecreative\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003eelevating\u003c/a\u003e buzz and strong \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-citrus\"\u003ecitrus\u003c/a\u003e overtones. This sativa has two different \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\"\u003ephenotypes\u003c/a\u003e that express either Sour Diesel or Tangie bud structures and effects. Sour Tangie grows quickly in its vegetative cycle and finishes flowering in 9 to 10 weeks indoors.\u003c/p\u003e\n","descriptionPlain":"DNA Genetics\u0026rsquo; Sour Tangie is an 80% sativa cross between East Coast Sour Diesel and Tangie. Sour Tangie brings together the classic Sour Diesel aroma with Tangie\u0026rsquo;s creative, elevating buzz and strong citrus overtones. This sativa has two different phenotypes that express either Sour Diesel or Tangie bud structures and effects. Sour Tangie grows quickly in its vegetative cycle and finishes flowering in 9 to 10 weeks indoors.\n","aka":"Sunva","rating":4.55,"highlightedReviews":[{"id":1417944,"username":"jamesm0792","text":"Okay I smoked a few bongs rips of this, and my girlfriend was completely toasted like the meatball sub at Subway. Honestly, roasted like a Jetpuffed Marshmallow. Seriously baked like an apple pie on July 4th, with fireworks blasting overhead. It was extremely patriotic. Entirely cooked.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1634042,"username":"GreatScott2115","text":"I\u0027ve vaped several really good 80/20 Sativa Dom. Hybrids including Goji OG, Super Lemon Haze, Ghost Train Haze, Sour Diesel, Acapulco Gold and Sour Tangie.  I like them all but Sour Tangie may just be my favorite of the group.  \nAs far as the flavor goes, it has a very skunky, citrusy sort of taste to it.  As far as effects, it\u0027s very euphoric and cerebral.   This would be an excellent strain to pair with a good comedy.  Just be sure to have snacks, refreshments and eye drops close by.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-16353","title":"The Top Trending Cannabis Strains of 2016","author":"Bailey Rahn","category":null,"date":"\/Date(1484957722000)\/","text":"Every year we like to look back and recognize the rising stars of the cannabis world. Last year, GG4 (f.k.a Gorilla Glue #4), Critical Kush, Candyland, and ACDC were among the fastest trending strains according to Leafly user strain reviews, but which strains stood out from the crowd this year?\nTo eliminate outliers that might skew the results, we restricted our search to the top 200 ranking strains of 2016. These strains tend to be more available nationwide, and we hope you’re able to find them in your area!\nBudtenders and inventory managers – are these trending strains on your menu? If not, consider keeping an eye out for them. Because in 2016, they were flying off the shelves fast.\n\n#10. Blue Cookies\n\nWe all know that customers swarm around anything containing the word “Cookies,” thanks to the Girl Scout Cookie hype. But what makes Blue Cookies stand out from the many, many other Cookie crosses? The addition of Blueberry indica genetics, of course.\n#9. Birthday Cake Kush\n\nAnother decadent GSC (f.k.a Girl Scout Cookies) cross, Birthday Cake Kush also pulls in genetics from Cherry Pie to achieve a dessert-like taste that’s not altogether unlike cake itself. It may not be your birthday, but the luxurious and relaxing qualities of this potent hybrid are certainly something to celebrate.\n#8. Sour Tangie\n\nThe citrus-loaded sativa strain Tangie can’t possibly be improved. Or can it? DNA Genetics has done it again, spinning their Tangie masterpiece with the help of East Coast Sour Diesel genetics. Sour Tangie improves the fuel-like taste of Sour Diesel without compromising Sour D’s high-flying creative effects, making this sativa a must-have for flavor enthusiasts and artists alike.\n#7. Purple Candy\n\nPurple Candy blossomed in British Columbia, Canada. Believed to be a cross between BC Sweet Tooth and Mendocino Purps, it’s as sticky and sweet as grape hard candy. But you won’t feel a sugar rush with this indica; instead, expect the heavy-hitter to prime you for bedtime or a solid nap.\n#6. Quantum Kush\n\nA good sativa can lend a positive spark to an otherwise dreary day of chores, so it’s no wonder that Quantum Kush tipped the charts in 2016 as one of the fastest trending sativa strains. While some sativas bring on the buzz with a bit too much gusto, resulting in anxiety and paranoia, Quantum Kush manages to deliver creative, talkative, giggly qualities without what we like to call “The Fear.”\n#5. God’s Green Crack\n\nWho knew the not-so holy union of God Bud and Green Crack would result in something so heavenly? God Bud is known for producing mammoth yields of gargantuan buds, but the effects are a little heavy-handed for some. That’s why Jordan of the Islands crossbred God Bud with Green Crack, the high-flying sativa strain that focuses all of its effort on elevating the mind to a place where laughing fits are inevitable.\n#4. Gelato\n\nA new generation of GSC (f.k.a Girl Scout Cookies) has arrived, and its name is Gelato. From the same breeders that delivered fan favorites Sunset Sherbet and GSC (f.k.a Girl Scout Cookies), Cookie Fam Genetics from Bay Area, California isn’t finished with their royal line quite yet. Gelato, a descendent of Sunset Sherbet and Thin Mint GSC (f.k.a Girl Scout Cookies), blooms in bright colors that are almost as inviting as its tantalizing dessert-like aroma.\n#3. Grape Stomper\n\nGrape Stomper isn’t a new strain, but a jump in Leafly reviews will show that not all good things are sparkly and new. Strong genetics inherited from Purple Elephant and Chemdawg Sour Diesel equip this strain with the full package: flavor, potency, and consistency. Relaxing without encumbering social skills, the balanced Grape Stomper is an excellent choice for so many different activities. No wonder its popularity isn’t waning.\n#2. Nuken\n\nNuken is also an older strain making a comeback. Originally found in Canada, it’s since proliferated throughout the Pacific Northwest to states like Washington and Oregon. Herbal and sweet in flavor, Nuken cradles you in a blanket of dreamy euphoria where your thoughts can float upward to bliss.\n#1. Superglue\n\nLast year, the top trending strain was GG4 (f.k.a Gorilla Glue #4). This year it’s Superglue, which surprisingly bears no family ties to last year’s champ. A cross between Northern Lights and Afghani, Superglue develops a thick coat of sticky resin that will quite literally glue your fingers together. Though its parentage may lead you to believe Superglue will be a knockout, this strain is bred to deliver more light-footed effects. In fact, Leafly users have described this strain as focusing and creative while simultaneously relaxing the body.\n\nWhat was your favorite strain of 2016? We want to hear from you! Leave your most memorable cannabis varieties in the strain section below.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/20115737/cannabis-flower-up-close.jpg","urlslug":"/news/strains-products/top-trending-cannabis-strains-2016"},{"id":"contentitems-3451","title":"Pick Up These Patriotic Strains for Independence Day","author":"Lisa Rough","category":null,"date":"\/Date(1467648000000)\/","text":"To celebrate America\u0027s Independence Day, we’ve compiled reviews for strains that have made our Leafly reviewers feel particularly patriotic. For maximum enjoyment, we recommend sparking these strains while watching fireworks, enjoying tasty treats at your best friend’s BBQ, or just lazing around lakeside on a sunny summer day. Happy 4th of July, everyone!\n \nSome strains wake you up with American passion:\n\n\nGOOD MORNING POT SMOKING AMERICA! –Samurai_JAC\n\n \nOkay, so Led Zeppelin is not the most patriotic music to listen to, but America is all about that FREEDOM!\n\n\nBaked like an apple pie on the 4th of July!! enjoy with Led Zeppelin for the full experience. –Whiteside420\n\n \nSome strains make you feel like you’ve fulfilled your patriotic duty:\n\n\nSmoking weed is the most patriotic thing I\u0027ve ever done. –Meighan\n\n \nThis strain is basically just a big ol’ firework in your cerebrum:\n\n\nSenses lit up like the 4th of July. –westcoastload\n\n \nFor when you are overwhelmed with the love of cannabis and country:\n\n\nThe best strain I\u0027ve ever smoked and the prettiest I\u0027ve ever seen. God bless America. –zonnes\n\n \nHow toasty are you hoping to get? How baked? How cooked? Are you hungry yet?\n\n\nOkay I smoked a few bongs rips of this, and my girlfriend was completely toasted like the meatball sub at Subway. Honestly, roasted like a Jetpuffed Marshmallow. Seriously baked like an apple pie on July 4th, with fireworks blasting overhead. It was extremely patriotic. Entirely cooked. –jamesm0792\n\n \nPonder the big questions this Independence Day:\n\n\nI would recommend smoking this with some friends who want to talk about the universe or why exit signs are green in America and Red in Canada. –dustrox\n\n \nDo you want to feel like an American hero and get the girl? A lofty goal, but maybe this strain could help:\n\n\nHOLY SHIT, I feel like CAPTAIN AMERICA!!! Is that freedom I smell? Wow, what an amazing, intense high… Even the body effects make you feel like a superhero! Everything is heightened. Euphoric. Laid back, easy-going. Relaxed, but still alert and ready for action! Save the day and get the girl, hell yes!! Don\u0027t forget the victory party! Oh, and by the way, it\u0027s not paranoia that some of you are feeling a hint of. No my friends, that\u0027s you looking for any excuse to save the day. Ha! No negative side effects here! –Cannadise\n\n \nAnd last, but not least, if you can’t find a patriotic strain, settle for one that will leave you feeling grand:\n\n\nIf you aren\u0027t able to find any of the patriotic ones during the 4th of July, then get this stuff to make the day grand. –JohnnySativa420","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12002513/patriotic-strain-reviews-for-independence-day.jpg","urlslug":"/news/strains-products/patriotic-strain-reviews-for-independence-day"}],"reviewCount":344,"flavors":[{"name":"Citrus","score":66.1941922811488},{"name":"Orange","score":47.454182961429339},{"name":"Diesel","score":24.964461196345251},{"name":"Sweet","score":21.6425415700778},{"name":"Lemon","score":20.169524517350602}],"effects":[{"name":"Uplifted","score":77.851067343820972},{"name":"Happy","score":71.650799549350268},{"name":"Energetic","score":57.305952233488469},{"name":"Euphoric","score":56.94569788772688},{"name":"Relaxed","score":52.6370972023146}],"symptoms":[{"name":"Stress","score":59.088201117186621},{"name":"Depression","score":45.336158741955835},{"name":"Fatigue","score":30.296608919797325},{"name":"Lack of Appetite","score":27.5828304813812},{"name":"Pain","score":23.018527366353453}],"conditions":[{"name":"Anxiety","score":28.551226014994132},{"name":"PTSD","score":15.891006470716615},{"name":"ADD/ADHD","score":13.779175735697475},{"name":"Crohn\u0027s Disease","score":8.46103708422549},{"name":"Gastrointestinal Disorder","score":8.2360071490506268}],"negatives":[{"name":"Dry Mouth","score":33.755669987554043},{"name":"Dry Eyes","score":17.942082072516854},{"name":"Paranoid","score":9.5541870904189743},{"name":"Dizzy","score":7.2431326054514455},{"name":"Anxious","score":6.8766847752355}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-tangie_100x100_8a03.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1006186/b/sour-tangie__primary_740e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-tangie_100x100_ebfe.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001649/b/sour-tangie__primary_57f8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-tangie_100x100_4bbf.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001022/b/sour-tangie__primary_a055.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-tangie_100x100_9302.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/668402/b/sour-tangie__primary_24a6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-tangie_100x100_484d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/651408/b/sour-tangie__primary_4ffc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sour-tangie_100x100_0908.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/643792/b/sour-tangie__primary_85b1.jpg"}],"photoTotalCount":52,"popularCities":["Portland, OR","Seattle, WA","Toronto, ON","Eugene, OR","Los Angeles, CA","Bend, OR","Vancouver, BC","Edmonton, AB","Medford, OR","Ottawa, ON"],"permalink":"https://mobileapi.leafly.com/sativa/sour-tangie","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.54651162790698/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"East Coast Sour Diesel","subtitle":null,"slug":"east-coast-sour-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/east-coast-sour-diesel","symbol":"Eas","applink":"leafly://strain/east-coast-sour-diesel"},{"name":"Tangie","subtitle":null,"slug":"tangie","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/tangie","symbol":"Tg","applink":"leafly://strain/tangie"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
