{
    "aka": "Sumo",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1466201700000)/",
            "id": "contentitems-3798",
            "text": "This week we are showing off strains from Colorado Seed Inc. These genetics have been bred for potency and effectiveness, illustrating the Centennial State’s love for this resinous flower and the citizens who enjoy it. Sanjay Gupta Kush (AKA Gupta Kush) is one of Colorado Seed Inc.’s most famous strains, named for Dr. Sanjay Gupta, a television personality and neurosurgeon who has been outspoken about the supplementary benefits of medicinal cannabis within traditional medicine. This horticultural homage made its way to CNN and the Huffington Post, and garnered quite a bit of attention for the Boulder-based buds. But, that’s just the tip of cola. Dig deeper into these gorgeous genetics and puff, puff, pass the good vibes onward.\n \n   Grilled Cheese\n\nGrilled Cheese is a cross of TGA/Subcool’s Cheese Quake and Colorado Seed Inc.’s Gupta Kush. This strain shows off cheesy terpenes with a hint of citrus on the finish. Expect a mellow buzz with meditative Kush elements. Use this pungent strain to help relieve mild to moderate physical discomfort and for mood enhancement.\n\n \n   Chupacabra\n\nChupacabra looks like a sativa and acts like an indica. With tall, bright green buds that fray into even brighter orange hairs, this wild strain reeks of its Golden Goat heritage. This strain brings together Hawaiian Romulan’s mental stylings with Island Sweet Skunk’s brilliant tropical aroma, and is finally anchored by Gupta Kush. This 50/50 hybrid will leave your mind sizzling as you nestle into your favorite piece of furniture.\n\n \n   Jelly Roll\n\nJelly Roll is a sweet treat crafted by Colorado Seed Inc. to show off their wonderful Jellyroll (God Bud x Grapefruit) crossed against their yield powerhouse, Gupta Kush. With delicious grape and anise aromas brought by the Jelly Roll #7, Jelly Roll emanates a rich odor that will fill the room. Use this indica for a long lasting, mid-level body high driven by a heady energy many would describe as meditative.\n\n \n   Doobiebird Daydream\n\nDoobiebird Daydream is another Blue Dream hybrid that combines its famous creative relaxation with the medicinal qualities of Sanjay Gupta Kush. The Doobiebird was also the Colorado Seed Inc. mascot until Colorado State law prohibited cartoon characters to be associated with dispensaries. This hybrid expresses itself with the lime green buds of Blue Dream and a Kush aroma with a hint of skunk. Expect uplifted and motivational attributes that are grounded in a stabilizing body buzz that goes full sedation with heavier dosing.\n\n \n   Rebel God Smoke\n\nRebel God Smoke is a pro-grade sativa-dominant strain that blasts users with the motivating energy of a launching warhead. This rocket fuel is a cross of Cinderella 99 and Gupta Kush, and has been known to finish flowering in under 8 weeks. The plant should smell of red currant and cabernet with just a hint of fuel on the rim. Use this strain with caution, as it can over-stimulate even the most seasoned cannabis veteran.\n\n \n   Sumo Grande\n\nSumo Grande is a unique cross that builds off the old school genetics of Sensi Star and Sour Diesel to create Hong Kong, which is then crossed with the sativa Nina Limone, a citrusy yield powerhouse. This gorgeous plant grows big and strong (a testament to its namesake) and creates buds that offer a motivating buzz with minimal paranoia. Use this strain as a pick-me-up that focuses the mind without encumbering the body.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/16214749/new-strains-alert-gupta-kush-grilled-cheese-rebel-god-smoke-and-m.jpg",
            "title": "New Strains Alert: Gupta Kush, Grilled Cheese, Rebel God Smoke, and More",
            "urlslug": "/news/strains-products/new-strains-alert-gupta-kush-grilled-cheese-rebel-god-smoke-and-m"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "ADD/ADHD",
            "score": 6.25
        },
        {
            "name": "Anxiety",
            "score": 6.25
        },
        {
            "name": "Cancer",
            "score": 6.25
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 6.25
        }
    ],
    "description": "<p>Sumo Grande is&nbsp;a unique cross that&nbsp;builds off the old school genetics of <a href=\"https://www.leafly.com/indica/sensi-star\">Sensi Star</a> and <a href=\"https://www.leafly.com/sativa/sour-diesel\">Sour Diesel</a> to create <a href=\"https://www.leafly.com/hybrid/hong-kong\">Hong Kong</a>, which is then crossed with the sativa&nbsp;Nina Limone, a citrusy yield powerhouse. This gorgeous plant grows big and strong (a testament to its namesake) and creates buds that offer a motivating buzz with minimal paranoia. Use this strain as a pick-me-up that focuses the mind without encumbering the body. Sumo Grande is a proprietary genetic strain created by <a href=\"https://coloradoseedinc.com/\">Colorado Seed Inc.</a>&nbsp;</p>\n",
    "descriptionPlain": "Sumo Grande is&nbsp;a unique cross that&nbsp;builds off the old school genetics of Sensi Star and Sour Diesel to create Hong Kong, which is then crossed with the sativa&nbsp;Nina Limone, a citrusy yield powerhouse. This gorgeous plant grows big and strong (a testament to its namesake) and creates buds that offer a motivating buzz with minimal paranoia. Use this strain as a pick-me-up that focuses the mind without encumbering the body. Sumo Grande is a proprietary genetic strain created by Colorado Seed Inc.&nbsp;\n",
    "effects": [
        {
            "name": "Focused",
            "score": 143.75
        },
        {
            "name": "Creative",
            "score": 137.5
        },
        {
            "name": "Talkative",
            "score": 131.25
        },
        {
            "name": "Uplifted",
            "score": 131.25
        },
        {
            "name": "Energetic",
            "score": 131.25
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 37.5
        },
        {
            "name": "Sweet",
            "score": 25
        },
        {
            "name": "Pine",
            "score": 25
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1393588,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "If Gandhi smoked this would be his brand. Makes me so in tuned with everything, so at peace with everything. A septiva for real! At the same time, if you asked me to go into the kitchen and asked me to get some Twizzlers and I would go in there and come back out with everything but Twizzlers. If you asked about the Twizzlers I would be like \"what now?\" Get it, smoke it. Forget it and get it again.",
            "username": "mudflapp"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Pl-Y2_w7iIfXMq-susdCw64Abdk=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fZFL3vk8uSMmuki8G4w8c_old-school-purple.png",
            "id": 1628347,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "A beautiful flower!  This strain has a lot going for it, it's lung candy.  Testing at 24.3% - 31.9% Thc and 0% cbd.  The bugs are epicly frosty and the smell is to die for.  Majorly uplifting and energy promoting.  I also purchased some shatter concentrate of the same strain and would also highly recommend.  purchased from NuVue Pharma recreational.",
            "username": "ThraxZx"
        }
    ],
    "id": 230960,
    "name": "Sumo Grande",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 106.25
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/hong-kong",
            "category": "Hybrid",
            "name": "Hong Kong",
            "permalink": "https://mobileapi.leafly.com/hybrid/hong-kong",
            "slug": "hong-kong",
            "subtitle": null,
            "symbol": "Hkg"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/sumo-grande",
    "photoTotalCount": 1,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/526910/b/sumo-grande__primary_a603.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/sumo-grande_100x100_a707.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO",
        "Gunnison, CO"
    ],
    "rating": 4.6,
    "relatedStrains": [],
    "reviewCount": 5,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "sumo-grande",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.6/240",
    "subtitle": null,
    "symbol": "Smo",
    "symptoms": [
        {
            "name": "Depression",
            "score": 31.25
        },
        {
            "name": "Fatigue",
            "score": 31.25
        },
        {
            "name": "Lack of Appetite",
            "score": 31.25
        },
        {
            "name": "Stress",
            "score": 31.25
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
