{"sl_translate":"description,descriptionPlain,category","id":201,"slug":"voodoo","name":"Voodoo","subtitle":null,"symbol":"Vdo","category":"Sativa","description":"\u003cp\u003eVoodoo, bred from a Thai \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\"\u003elandrace\u003c/a\u003e in 1997, is an uplifting sativa cannabis strain with long-lasting, euphoric effects. A fresh, fruity aroma emanates from the dense, pine-green buds enameled in crystal trichomes, with nutty and spicy flavors to follow. Depression, fatigue, and stress stand no chance against the uplifting, almost energizing, qualities of Voodoo. This strain prospers both indoors and outdoors, and flowers 8 to 9 weeks after its vegetative cycle.\u003c/p\u003e\n","descriptionPlain":"Voodoo, bred from a Thai landrace in 1997, is an uplifting sativa cannabis strain with long-lasting, euphoric effects. A fresh, fruity aroma emanates from the dense, pine-green buds enameled in crystal trichomes, with nutty and spicy flavors to follow. Depression, fatigue, and stress stand no chance against the uplifting, almost energizing, qualities of Voodoo. This strain prospers both indoors and outdoors, and flowers 8 to 9 weeks after its vegetative cycle.\n","aka":null,"rating":4.22,"highlightedReviews":[{"id":1379527,"username":"woodymac420","text":"\r\nMy first hit I was high. The one thing I\u0027ve noticed is that it makes a difference on how you smoke what your smoking. There are some strains that hit harder in the bong and others I\u0027d prefer in my glass blunt. VooDoo hits hard in the bong and lasts a very long time. We had two bowls during the day over a 12 hour period of time and we remained high. It was a great feeling that lasted all day. Thanks to my new peeps at Altitude Organic in Colorado Springs. Shouts out to GrowLife aka GL4L. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1577220,"username":"MMJsupporter","text":"ordered in dec 2017....it\u0027s feb 2018...I cannot remember this strain or it\u0027s effects...it was either really good or really bad.... so I\u0027ll sit my review in the middle....","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3537","title":"The Best Cannabis Strains for the Holidays (According to Leafly Reviewers)","author":"Brett Konen","category":null,"date":"\/Date(1450897200000)\/","text":"The holidays are fast approaching, so naturally you’re thinking about the perfect cannabis strains to enjoy over the upcoming weeks. Have innumerable aunts, uncles, in-laws, and second cousins coming into town for the long weekend? You’ll probably need something to chill you out after all that family time. Wanting to keep moving in spite of the weather? You’re after something active. Have about a thousand errands left to run? Something to spice up the process would be nice.\nLuckily, Leafly user reviews are a gold mine of suggestions for cannabis strains that fit any scenario, so we’ve compiled a few great user-sourced recommendations for a range of seasonal activities listed below. Whether you’re grocery shopping, cocoa-sipping, or baking some cannabis-infused holiday cookies, try out one of the ideas below and enjoy your holiday celebrations!\n\nFor Coping with Winter\n  “This is the perfect strain to make Seattle winter days productive! A couple hits gives my ambition, creativity and libido a jump-start.” –munin.raven\n \n “My go to for getting my figure back after holiday indulgence!” –grngrazer\n \n “Smooth pull, great taste – exactly what I hoped for…real killer high to cure the inevitable holiday blues.” –hazedandconfused\nFor Spending Time with Family \u0026 Friends\n “Smells like Christmas trees, tastes like pine and lightens the heart and mind…I found it made the whole holiday with ALL the family, very enjoyable. Oh and added benefits of not breaking ornaments or dropping the turkey.” –Free_Byrd\n \n “Smoked this with my Nana and great Uncle Pete while on winter vacation…Made me forget how much my back hurt from sleeping on an air mattress.” –somniumtextrix\n \n “A swift cerebral head high, accompanied by a punch of energy. Best used at a party with friends as is very good for getting you in the mood, to talk, dance, whatever!” –JustAnotherStoner\nFor Curling Up by the Fire\n “I could feel every atom in my body float away in rhythm with the space heater I was sitting next to. Perfect for sitting home on a cold winter evening and then getting a good night sleep.” –Anonymous\n \n “I enjoyed a blunt and hits from my vaporizer along side with a cup of hot chocolate, it was a great combo…pick it up for a stay-at-home type of day.” –kushconnoisseur420\n \n “I’m washing it down with some seasonal ale and it’s the perfect end to a perfect night.” –BudseyXO\nLooks, Smells, and Tastes Like Christmas\n “When I opened the bag I thought I was suddenly on a camping trip. It smelled like a Christmas tree…The taste of pine, clove and earth danced across across my palate.” –robmacpheejr\n \n “Nom nom nom like a Christmas tree with a lifesaver candy cane in your mouth.” –greedyguy\n \n “Feels like I threw a Christmas tree in a wood chipper… lights, ornaments, candy canes – everything – and put it in my Pax to vape it.’” –Midnyte003\nFor Making Spirits Bright\n “This is like that one ‘big’ present hidden behind the tree just when you think you didn’t get what you ‘really’ wanted that year. It’s that good.” –Anonymous\n \n “My brain lit up like Times Square on New Years Eve.” –Grumple\n \n “This strain had me smiling like the Grinch that stole Christmas.” –Skyclub\n \n “Like skating across a frozen lake surrounded by snowflakes in the night.” – bugpowderdustmugwumpjism\n \n “BEST. STRAIN. EVER. Four for you, Sour D, you go Sour D.” –Anonymous\nWhat are some of your favorite strains to enjoy over the holidays? Share in the comments!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12002805/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re.jpg","urlslug":"/news/strains-products/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re"},{"id":"contentitems-3581","title":"These 5 Truly Horrific Strains Are Just What You Need to Celebrate Halloween","author":"Sara Dilley","category":null,"date":"\/Date(1414782000000)\/","text":"Last year we brought you the spookiest strains to celebrate Halloween with; this year we’re getting downright horrific. These strains are not for the faint of heart. Hideous creatures, the walking dead, and dismemberment are just a few of the topics we’ll cover. If you’re into bone-chilling, shiver-inducing terror: sit back, relax, and pull up one of these scary strains, a classic horror film, and enjoy the show!\nBrains Damage\nThis hybrid cross between Acapulco Mexican, Mango, Hawaiian, and KC 36 won’t leave you zombified, but it will come after your brains! Bred by Holland’s KC Brains, its mellow, relaxed effects will give you a subtle energy akin to Romero’s ghouls from Night of the Living Dead: subdued, slow, but totally content to seek fresh flesh from dusk ‘til dawn.\nFrankenstein\nIt’s no coincidence that this indica inspires the sort of creativity needed to stitch together a creature from the parts and pieces of other living beings. Frankenstein (or Fronkensteen, depending on whom you ask), will give you the inventive spirit to create a monster of your own, but it will quickly soothe you into a happy, relaxed lull that gives way to a good night’s sleep. If you aren’t feeling like harvesting body parts, your night would be just as well spent curling up on the couch with Mel Brooks’ classic Young Frankenstein.\nBlack Dahlia\nAlthough this hybrid is lesser known than the infamous murder of the same name, its effects are no-less potent. While it won’t leave your body severed and mutilated in a vacant lot, it will isolate and relieve chronic pain, an irony that isn’t lost on us. Although this hybrid is known to produce euphoria, its effects lean strongly indica, and is best used for a Halloween movie marathon.\nWhite Zombie\nWhether you’re a diehard metal fan or just enjoy the plight of the undead, this cerebrally-focused hybrid has everything you need to stimulate your brains(sssss)! This strain is truly multi-faceted: it will get your creative juices flowing while simultaneously relieving stress and depression.\nVoodoo\nUnlike its namesake, this strain’s history isn’t shrouded in mystery and mysticism. Have an unprecedented case of the Halloween blues? This strain is also know to crush depression, fatigue, and stress, leaving you ready to dance the night away or perform ritualistic Haitian Vodou, whichever lights your cermonial candle.\nphoto credit: Brett Kiger via photopin cc","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/10/12002916/these-truly-horrific-strains-are-just-what-you-need-to-celebrate.jpg","urlslug":"/news/strains-products/these-truly-horrific-strains-are-just-what-you-need-to-celebrate"}],"reviewCount":59,"flavors":[{"name":"Earthy","score":8.7191358024691361},{"name":"Pungent","score":7.79320987654321},{"name":"Pepper","score":7.1759259259259256},{"name":"Sweet","score":7.1759259259259256},{"name":"Flowery","score":6.867283950617284}],"effects":[{"name":"Relaxed","score":29.320987654320987},{"name":"Happy","score":27.391975308641975},{"name":"Tingly","score":23.688271604938272},{"name":"Sleepy","score":22.762345679012345},{"name":"Euphoric","score":22.376543209876544}],"symptoms":[{"name":"Pain","score":25.231481481481481},{"name":"Headaches","score":19.675925925925927},{"name":"Depression","score":16.820987654320987},{"name":"Fatigue","score":14.969135802469136},{"name":"Insomnia","score":7.79320987654321}],"conditions":[{"name":"Anxiety","score":11.805555555555555},{"name":"PTSD","score":7.4845679012345681},{"name":"Arthritis","score":6.25},{"name":"Migraines","score":1.8518518518518516},{"name":"ADD/ADHD","score":1.5432098765432098}],"negatives":[{"name":"Dry Mouth","score":30.246913580246911},{"name":"Paranoid","score":14.351851851851851},{"name":"Anxious","score":6.867283950617284},{"name":"Dry Eyes","score":3.0864197530864197},{"name":"Dizzy","score":0.92592592592592582}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/voodoo_100x100_1329.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/659666/b/voodoo__primary_fbe9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/voodoo_100x100_ca8a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/595470/b/voodoo__primary_fd03.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/voodoo_100x100_4e09.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/522096/b/voodoo__primary_ea3a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/voodoo_100x100_a59d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/508394/b/voodoo__primary_5b06.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/voodoo_100x100_23fe.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/357612/b/voodoo__primary_61d1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/voodoo_100x100_b7a8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/339227/b/voodoo__primary_899b.jpg"}],"photoTotalCount":18,"popularCities":["Detroit, MI","Las Vegas, NV","Los Angeles, CA","Chicago, IL","Highland Park, IL","Lincoln City, OR","Portland, OR","Victoria, BC"],"permalink":"https://mobileapi.leafly.com/sativa/voodoo","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.22033898305085/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Thai","subtitle":null,"slug":"thai","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/thai","symbol":"Tha","applink":"leafly://strain/thai"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
