{
    "aka": "CBD MediHaze, CBD Medi Haze, Medi Haze, Medi Haze CBD, MediHaze CBD",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1455998400000)/",
            "id": "contentitems-2955",
            "text": "“There’s weed that don’t make you hungry? For real? Honey, this changes everything.”\nThat was my Lyft driver’s response when I told her not all cannabis makes your gullet an insatiable black hole. Most cannabis consumers – especially first-time experimenters – have only tried high-THC strains, so it’s no wonder that the dispelling of this common misconception comes to the surprise of many who have long associated cannabis with the inevitable “munchies” syndrome.\nThe munchies can be a beautiful thing, and I’m not just talking about the pure ecstasy that comes with dual-wielding a fried chicken leg and an ice cream sandwich once in a while. That appetite stimulation is life-changing for patients dealing with cancer, depression, and other gastrointestinal/appetite disorders. But not everyone wants uncontrollable food lust, and some will actively avoid cannabis because of this one side effect – particularly those struggling with pre-existing eating and weight issues.\nFor those of you interested in reaping the myriad of benefits cannabis has to offer without the unbridled gluttony, we hope you find this list helpful. Remember, you can click the strain to see if it’s available at a store or dispensary near you!\n\n \nHigh-CBD Strains\nIf you’ve ever tried a high-CBD strain before, you’ve probably noticed that they don’t summon the munchies monster like THC-rich varieties. A Yale study published last year found that THC – the same chemical responsible for cannabis’ euphoric high – stimulated a group of nerve cells in the hypothalamus, the area of the brain that governs instincts like hunger and arousal.\n\nWhile less is known about CBD’s influence on appetite, we do know that this non-psychoactive constituent counteracts many effects of THC and researchers have even eyed CBD as an anti-obesity treatment based on its activity in the brain. Our own anecdotal evidence leads us to recommend high-CBD, low-THC strains for the best “munchie-less” experience, but a strain with equal parts CBD and THC can also induce less hunger with the added benefit of mild euphoria.\n\n \n\nA popular strain found in many Oregon shops, Harle-Tsu is hybrid cross between two high-CBD parents, Harlequin and Sour Tsunami (which are also worth looking into for minimal munchies strains). Harle-Tsu typically expresses a high-CBD profile with very little THC, making it a perfect choice for anyone who wants the relaxing and therapeutic effects of cannabis minus the euphoria or paranoia.\n \n\nThe “Remedy” for your over-excited appetite is this indica cross between Cannatonic and Afghan Skunk. With a THC content that rarely squeaks past 1%, Remedy delivers mental tranquility and physical relief without the psychoactive burden. This Pacific Northwest strain is perfect for the patient needing to curb pain, anxiety, tension, headaches, or insomnia, but doesn’t want to interrupt their day with hourly snack breaks.\n \n\nCanna-Tsu is taking off across the U.S., discoverable in Oregon, California, Illinois, Washington, Colorado, and many other medical marijuana states. Sweet and earthy in flavor, Canna-Tsu provides a boost to both mood and focus. Though this strain may calm upset tummies, you shouldn’t feel any extra rumblings of hunger.\n \n\nFor uncompromised energy and clarity, we recommend the low-munchies sativa MediHaze. This one can sometimes exhibit equal levels of THC and CBD, but compared to high-THC, low-CBD strains, MediHaze is much better for keeping the appetite at bay.\n \n\nSimilar to the widely coveted ACDC hybrid, Cannatonic is a high-CBD strain that relaxes the body while leaving the mind free to focus. On average, Cannatonic has a 2:1 ratio of CBD:THC, meaning you probably won’t feel much in the way of a high or hunger.\n \nHigh THCV Sativa Strains\nBy now you know what THC and CBD is, but you may not be familiar with the less ubiquitous THCV, a related chemical that suppresses appetite. While most strains on the market today tend to test anywhere between 10-20% THC, what’s considered a high THCV content might only hit a high-water mark of 5%. THCV tends to be more abundant in sativa strains, and it’s possible you’ve noticed that sativas tend to provoke hunger less than indica strains. The unique metabolic effects of THCV even have researchers considering its utility in treating obesity and diabetes.\n\nWhile high-CBD strains tend to induce little to no high, these THCV-rich sativas produce high-energy, psychoactive effects. That’s good news if you like the euphoria associated with cannabis, but don’t want the raging appetite.\n \n\nWith an average THCV content that ranges between 0.2 to 1.8%, Durban Poison is the perfect weapon against overactive appetites and can be found in most major markets. Cherished for its active, upbeat high that can fuel productivity, this pure African sativa keeps you focused on what matters more than snacks.\n \n\nResist the call of the pizza with Power Plant, an electrifying sativa that descends from African landrace strains. Its spicy, peppery aroma perks up the senses, leaving you with inspiration and positivity instead of a demanding stomach. You can find Power Plant in many different markets across the U.S. and beyond, so check to see if a shop near you is carrying it.\n \n\nKill the temptation to order half Taco Bell’s menu with Jack the Ripper, a sativa strain that carries a tantalizing lemon scent. A favorite in the Pacific Northwest, this invigorating sativa is sure to summon a talkative mood long before a talkative tum.\n \n\nAnother African sativa, Red Congolese focuses all of its psychoactive energy in the head, helping creativity and focus to thrive. Among the list of activities this sativa motivates, you’ll sooner find hiking, painting, and reading more appealing than eating the entire contents of your fridge. Though most frequently found in Vancouver, BC and Ontario, you might be delightfully surprised by its occasional appearance on the West Coast and in other areas of the U.S..\n \n\nAs sweet and citrusy as this sativa might taste, Moby Dick doesn’t coerce the appetite as much as other strains. Expect instead to feel your mood and energy elevate to a place in which it’s easy to feel satisfied whether or not you treated yourself to an entire cheesecake. This sativa is lovingly embraced in Canada and Spain, although Americans have also reported sightings of the legendary Moby Dick in many markets.\nInterested in strains that do make you hungry? Try these 10!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/10173255/iStock-526148526.jpg",
            "title": "10 Cannabis Strains That Won’t Make You (As) Hungry",
            "urlslug": "/news/strains-products/10-cannabis-strains-that-wont-make-you-as-hungry"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1438790400000)/",
            "id": "contentitems-3607",
            "text": "CBD cannabis strains are hitting the market so fast, it’s impossible to keep track of them all. The list below will familiarize you with the most common CBD varieties, but keep in mind that your dispensary probably stocks many others. If these popular strains aren’t in stock or you’d like to try something new, ask your budtender to point out other standout CBD strains and products.\nWhat is CBD, you might ask? CBD stands for cannabidiol, a non-intoxicating cannabis constituent with a variety of studied benefits such as:\n\nPain relief\nAnti-inflammatory\nAnti-epileptic\nAnti-anxiety\n\n\nA strain can be high in THC, CBD, or a combination of the two. Both compounds have unique medicinal properties, some of which are amplified when both compounds are present (e.g. pain management). High-CBD or mixed strains tend to be the best choices for consumers prone to anxiety. But ultimately, you’ll be the one to decide which strain works best for you.\nNote that these strains tend to express consistent THC:CBD profiles, but you may encounter variations (e.g. ACDC may be found with little to no THC, or exhibit a balanced THC:CBD ratio). Always check each product’s tested cannabinoid profile to be certain of its THC and CBD levels.\nTo see if one of the below CBD strains is available nearby, click the strain tile and scroll down to its Finder map.\nCommon High-CBD/Low-THC Strains\nPopular Uses: Epilepsy, severe anxiety, inflammation, fatigue\n\nCommon Mixed THC/CBD Strains\nPopular Uses: Pain, mild anxiety, insomnia, inflammation\n\nYou can search Leafly’s strain database for more CBD strains, or contact your local dispensary to explore more options near you.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/08/14155434/which-cannabis-strains-high-in-CBD.jpg",
            "title": "Which Cannabis Strains Are High in CBD?",
            "urlslug": "/news/strains-products/what-cannabis-strains-are-high-in-cbd"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 63.94346087949742
        },
        {
            "name": "ADD/ADHD",
            "score": 33.20673900628212
        },
        {
            "name": "Migraines",
            "score": 31.507709880068532
        },
        {
            "name": "PTSD",
            "score": 30.26556253569389
        },
        {
            "name": "Fibromyalgia",
            "score": 25.868075385494006
        }
    ],
    "description": "<p>MediHaze (or CBD Medi Haze) is an 80/20 <a href=\"http://www.leafly.com/explore/category-sativa\">sativa</a>-dominant strain bred by CBD Crew that crosses genetics from <a href=\"http://leafly.com/sativa/super-silver-haze\">Super Silver Haze</a>, <a href=\"http://www.leafly.com/sativa/nevilles-haze\">Neville&rsquo;s Haze</a>, and an undisclosed <a href=\"http://www.leafly.com/news/cannabis-101/whats-the-deal-with-these-high-cbd-strains\">CBD-rich</a> parent. Its THC to CBD ratio typically comes out 1:1, but some seeds will offer a doubled CBD content. THC and CBD&rsquo;s synergy provide relief to a variety of symptoms, some of which include <a href=\"http://www.leafly.com/explore/symptoms-pain\">pain</a>, <a href=\"http://www.leafly.com/explore/symptoms-inflammation\">inflammation</a>, and <a href=\"http://www.leafly.com/explore/tags-anxious\">anxiety</a>. <a href=\"http://www.leafly.com/explore/flavors-pine\">Pine</a>, <a href=\"http://www.leafly.com/explore/flavors-minty\">mint</a>, and <a href=\"http://www.leafly.com/explore/flavors-spicyherbal\">spice</a> aromas burst from MediHaze buds in a fragrant introduction to its clear-headed, <a href=\"http://www.leafly.com/explore/tags-uplifted\">uplifting</a> effects.&nbsp;</p>\n",
    "descriptionPlain": "MediHaze (or CBD Medi Haze) is an 80/20 sativa-dominant strain bred by CBD Crew that crosses genetics from Super Silver Haze, Neville&rsquo;s Haze, and an undisclosed CBD-rich parent. Its THC to CBD ratio typically comes out 1:1, but some seeds will offer a doubled CBD content. THC and CBD&rsquo;s synergy provide relief to a variety of symptoms, some of which include pain, inflammation, and anxiety. Pine, mint, and spice aromas burst from MediHaze buds in a fragrant introduction to its clear-headed, uplifting effects.&nbsp;\n",
    "effects": [
        {
            "name": "Happy",
            "score": 92.4814391776128
        },
        {
            "name": "Relaxed",
            "score": 78.84922901199315
        },
        {
            "name": "Energetic",
            "score": 59.3032552826956
        },
        {
            "name": "Euphoric",
            "score": 56.37635636778984
        },
        {
            "name": "Focused",
            "score": 51.79611650485437
        }
    ],
    "flavors": [
        {
            "name": "Spicy/Herbal",
            "score": 67.80982295830954
        },
        {
            "name": "Earthy",
            "score": 51.49343232438607
        },
        {
            "name": "Sage",
            "score": 40.48543689320388
        },
        {
            "name": "Pine",
            "score": 32.707024557395776
        },
        {
            "name": "Nutty",
            "score": 20
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 67,
        "growNotes": "\n\tExpect&nbsp;yields between 450-550 grams per square meter\n\tMost weight comes in latter half of flowering\n\n",
        "height": "Medium",
        "outdoorFinish": "Mid October",
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png",
            "id": 1417526,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "🤗🌲 MediHaze is the ULTIMATE wake & bake strain! I didn't know what to expect so I made sure it was a strain I tried with a freshly rested mind. The smell and taste was very spicy and earthy... honestly kind of reminds me of the old school pretendo that used to float around. The high is fantatsic. There needs to be more CBD in strains because for such a low percentage of THC (4.76%), MediHaze has a wonderful high and it is very euphoric and energetic with 8.38% CBD!. Also relieves all sorts of pains and stress! What an awesome strain. Deep Roots Harvest did a fine job! b-Myrcene: 3.14 mg/g, a-Pinene: 0.63 mg/g, Ocimine (a/b): 0.58 mg/g, b-Pinene: 0.13 mg/g, Guaiol: 0.12 mg/g.",
            "username": "deadlightbulb"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/pcLF3iVgFIAjtyrvI766XmPpMEg=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2fyw-5oIGsfQsJqhOhOzQMvgxJX2g%3d%2f120x120%2fhttps%253A%252F%252Fs3.amazonaws.com%252Fleafly%252Fbin%252FzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1627027,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This is my daytime medicine. Simply amazing, doesn’t get me super duper stoned (which I prefer at night) and therefore helps me function throughout the day. I find with some sativas, I tend to get tired later in the day. However with Medihaze I’m energetic and stress free. AWESOME if you like to stay active while still enjoying the psychoactive effect of cannabis.",
            "username": "moose32481"
        }
    ],
    "id": 151215,
    "name": "MediHaze",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 8.79497430039977
        },
        {
            "name": "Anxious",
            "score": 3.912050256996002
        },
        {
            "name": "Headache",
            "score": 3.4266133637921183
        },
        {
            "name": "Paranoid",
            "score": 3.4266133637921183
        },
        {
            "name": "Dry Eyes",
            "score": 0.7281553398058253
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/nevilles-haze",
            "category": "Sativa",
            "name": "Neville's Haze",
            "permalink": "https://mobileapi.leafly.com/sativa/nevilles-haze",
            "slug": "nevilles-haze",
            "subtitle": null,
            "symbol": "Nhz"
        },
        {
            "applink": "leafly://strain/super-silver-haze",
            "category": "Sativa",
            "name": "Super Silver Haze",
            "permalink": "https://mobileapi.leafly.com/sativa/super-silver-haze",
            "slug": "super-silver-haze",
            "subtitle": null,
            "symbol": "Ss"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/medihaze",
    "photoTotalCount": 6,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/643978/b/medihaze__primary_6eb0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/medihaze_100x100_fd9a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/496778/b/medihaze__primary_ee8b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/medihaze_100x100_1858.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/494600/b/medihaze__primary_1d7c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/medihaze_100x100_49e8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/494804/b/medihaze__primary_65ea.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/medihaze_100x100_aa61.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/411982/b/medihaze__primary_e042.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/medihaze_100x100_7cfb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/401840/b/medihaze__primary_c365.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/medihaze_100x100_e992.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Eugene, OR",
        "Beaverton, OR",
        "Hood River, OR",
        "Oregon City, OR",
        "Sumpter, OR",
        "Tigard, OR",
        "Albany, OR",
        "Ashland, OR",
        "Bend, OR"
    ],
    "rating": 4.59,
    "relatedStrains": [],
    "reviewCount": 116,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "medihaze",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.58620689655172/240",
    "subtitle": null,
    "symbol": "Mdh",
    "symptoms": [
        {
            "name": "Pain",
            "score": 52.52427184466019
        },
        {
            "name": "Stress",
            "score": 47.61279268989149
        },
        {
            "name": "Headaches",
            "score": 39.58880639634495
        },
        {
            "name": "Depression",
            "score": 24.942889777270132
        },
        {
            "name": "Inflammation",
            "score": 20.28840662478584
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
