{
    "aka": "Kings Bread, King’s Breath, Kingsbread, Kingsbreath",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1503703122000)/",
            "id": "contentitems-39132",
            "text": "Born in 1960s Jamaica, reggae was an evolution of its predecessors: ska and rocksteady. The genre quickly took on a life of its own and eventually made its way to the United States, where it became a staple of 1960s culture. It also carved a special niche in the cannabis world, since reggae’s penchant for political lyrics did not shy away from the topic of legalization.\n\nIt’s a genre that is powerful in both its unique sound and inherently political roots. It is music that uplifts the spirit and rallies the heart. The era of reggae produced a plethora of iconic artists such as Bob Marley, Bunny Wailer, Peter Tosh, The Abyssinians, and Toots & The Maytals—the latter of whom actually coined the term ‘reggae’ with the 1968 single, “Do The Reggay.”\nTo better understand and appreciate the genre, pack a pipe, grab your friends, and explore the soulful reggae music below—each album we suggest is an ideal match for the right cannabis strain.\nStony Hill by Damian Marley\n\nStrain Pairing Recommendation: King’s Bread\nYoungest son of the legendary Bob Marley, Damian Marley continues his father’s legacy in reggae with his own fresh sound. Stony Hill is Marley’s newest album—released in July of this year, it combines modern electronic elements with classic reggae beats. Stony Hill feels like the next modern step in a continuously growing genre that refuses to lose its heart along the way.\nIn true reggae style, Marley’s lyrics do not shy away from telling honest and human stories. From wondering what the future will bring on one track, while impeccable backup vocals chime “believe in your dreams” on another, the album explores the depth of human character.\nThis 18-track album also features the song “Medication” featuring Marley’s brother and guest artist, Stephen Marley. The song is an ode to Marley’s love of “Mary Jane” and the medicinal power of cannabis. You’ll be singing along to the lyrics, “And I say to myself, what a wonderful herb.”\n\nSevana EP by Sevana\n\nStrain Pairing Recommendation: Purple Bud\nHailing from Kingston, Jamaica, Sevana burst onto the scene last year with her first EP album, where she delivers stunning, expert vocals and impactful reggae beats. The album begins with the softer ballad “Carry You” before launching into the groovy “Bit Too Shy,” which sets the tone for the rest of the collection.\nThe EP’s music will get you moving to the rhythm, while Sevana’s energetic and heartfelt vocals delight across the soundscape with perfect control and beautiful clarity. Sevana captures the heart of reggae in her music, vocals, and lyrics for a complete immersion in classic reggae via a modern recording artist. Sevana’s debut album proves she’s an artist to watch and gives us high hopes of more great albums to come.\nEqual Rights by Peter Tosh\n\nStrain Pairing Recommendation: Jah Kush\nAlong with Bob Marley and Bunny Wailer, Peter Tosh got his start as part of The Wailers. Afterwards, he went on to become his own successful solo artist and produced many iconic albums, including Equal Rights in 1977.\nEqual Rights opens with the familiar song, “Get Up, Stand Up,” performed with Tosh’s unique style and sound. The album contains classics such as “Downpressor Man” and “Stepping Razor,” and features Tosh’s punctuated and mellow vocals accompanied by melodies that are rich, vibrant, and smooth.\nAs a whole, Equal Rights is an iconic reggae album that encapsulates the heart and soul of reggae as it was at the time of its initial emergence onto the popular scene. For this reason, it will always reign as a powerful memento of reggae’s roots.\n\nAfrican Holocaust by Steel Pulse\n\nStrain Pairing Recommendation: Malawi\nReleased in 2004, African Holocaust is the latest in a long line of albums produced by Steel Pulse. Though over a decade old, it remains relevant today both musically as well as lyrically, touching on topics such as global warming, corruption in government and religion, and the ramifications of slavery.\nFormed in 1975 in Birmingham, England, Steel Pulse has had a somewhat rotating cast of players over the years, but always with lead singer David Hinds at the forefront holding down vocals and rhythm guitar.\nAfrican Holocaust is no exception, with Hinds’s fierce voice leading the upbeat reggae melodies that encourage dance and reflection all at once. It is this combination of poignant lyrics and stunningly composed music full of drums and horns that makes African Holocaust such a noteworthy album.\nRebirth by Jimmy Cliff\n\nStrain Pairing Recommendation: Lamb’s Bread\nRebirth was released in 2012 as part of what Jimmy Cliff said was “a rebirth of my career at this time.” It was the first album Cliff had released in eight years, and went on to win a Grammy for Best Reggae Album. Cliff has been producing reggae music since the 1960s and is one of the few original artists who still produces new music today while touring or appearing at festivals (such as Lockn’ in 2015).\nRebirth manages to encapsulate Cliff’s classic reggae feel while shining anew with crisp, fresh, updated sounds. The 13-track album features new, original music as well as some covers—all of it exceedingly lively, joyful, and brimming with energy.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/25110707/best-reggae-albums-header.jpg",
            "title": "5 Reggae Albums to Listen to While High",
            "urlslug": "/news/lifestyle/reggae-albums-listen-high"
        },
        {
            "author": "Will Hyde",
            "category": null,
            "date": "/Date(1486400400000)/",
            "id": "contentitems-3001",
            "text": "Today we honor the birthday of Robert Nesta Marley. The Reggae legend, better known as Bob, would have turned 72 today. To celebrate the man who spent so much of his life singing the songs of universal peace, love and, of course, cannabis, we give you seven strains that were influenced by him and his home island of Jamaica.\n1. Jamaican\n\n \n \n \n \nThe Jamaican strain refers to the indigenous varieties of cannabis (or landraces) that grow natively in this region of the world. Because of Jamaica’s latitude and climate, these varieties tend to be sativa in structure and effect.\n2. Lamb’s Bread\n\n \n \n \n \nAlso called “Lamb’s Breath,” Lamb’s Bread is a bright green and sticky sativa strain. The effects have been known to give mass amounts of energy and positive introspection. Stress subsides quickly from the Lamb’s Bread buzz, which can help ease depression. The origins of this plant comes from Jamaica and it has been reported that even Bob Marley himself has encountered this wonderful slice of cannabis genealogy.\n3. Jamaican Pearl\n\n \n \n \n \nJamaican Pearl is a sweetly potent outdoor sativa strain from Dutch breeder Sensi Seeds whose presence will bring a taste of the Caribbean to cannabis consumers. Jamaica is home to sativas of astounding quality and potency, selectively bred for countless generations. This strain, a genetic cross between Marley’s Collie and Early Pearl, provides a nice breezy cerebral sensation with tropical flavors.\n4. King’s Bread\n\n \n \n \n \nSaid to be a sativa landrace from the Blue Mountains of Jamaica, King’s Bread (or King’s Breath) delivers mellowing and euphoric cerebral effects. Finger-like bulbs reach out from the citrus-scented buds wrapped in crystal trichomes. Lamb’s Bread is counted among its progeny, although King’s Bread’s lineage is not well documented. Pain relief, appetite stimulation, and stress alleviation are just a few of the therapeutic benefits King’s Bread has to offer.\n5. Jamaican Dream\n\n \n \n \n \nJamaican Dream is a 90% sativa bred by Eva Seeds using Jamaican genetics. A subtle and sweet flavor carries you through to an elevated mood and weightless euphoria. The effects are light enough to start your day with, making this strain ideal for early treatment of depression and fatigue. Jamaican Dream’s pointed, compact buds will finish their flowering cycle after 42 to 45 days indoors, or at the end of September in outdoor gardens.\n6. Marley’s Collie\n\n \n \n \n \nMarley’s Collie is an indica-dominant hybrid bred by Sensi Seeds that won the Dutch High Life Cup in 1999. These sticky, spiky buds offer a pungent sweet aroma with musky Afghani undertones, delivering effects that are strong in both physical and cerebral sensation. Indoor and outdoor grows can expect flowers between 60 and 65 days.\n7. Jamaican Lion\n\n \n \n \n \nJamaican Lion is a high-CBD sativa strain with mildly psychoactive effects that stimulate creativity and focus without the loss of functionality. Its rich genetic background combines Mountain Lion — a Rockbud and Lionheart cross — with a Jamaican sativa known as Yarders. Shadrock, Jamaican Lion’s creator, first brought the strain to California in 2007, where it was distributed to patients by Harborside. Ushered in by a sweet herbal aroma, Jamaican Lion induces mild psychoactivity that carries through despite its low THC content. Sensory perception sharpens as bad moods dull in clear-headed sensations that can be described as simultaneously uplifting and calming. Few strains compare to Jamaican Lion as it eases pain, anxiety, and inflammation without intoxication or mental cloudiness. Its CBD content is highest around week 9 of flowering, but if you’re looking for more of a 1:1 ratio of CBD and THC, Shadrock recommends harvesting at week 8 instead.\nHave you tried any of these Jamaican strains? If so, leave your review on the strain’s detail page. If these don’t sound like your kind of cannabis, use the Leafly Explorer to find the strain with the flavors and effects you are looking. Happy Birthday Bob! Stir it up!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/02/12001330/7-jamaican-strains-to-try-in-honor-of-bob-marleys-birthday.jpg",
            "title": "7 Jamaican Cannabis Strains to Try in Honor of Bob Marley's Birthday",
            "urlslug": "/news/strains-products/7-jamaican-strains-to-try-in-honor-of-bob-marleys-birthday"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 9.027777777777777
        },
        {
            "name": "PMS",
            "score": 2.7777777777777777
        },
        {
            "name": "ADD/ADHD",
            "score": 2.083333333333333
        },
        {
            "name": "Migraines",
            "score": 2.083333333333333
        },
        {
            "name": "Bipolar Disorder",
            "score": 2.083333333333333
        }
    ],
    "description": "<p>Said to be a sativa <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\">landrace</a> from the Blue Mountains of Jamaica, King&rsquo;s Bread (or King&rsquo;s Breath) delivers mellowing and euphoric cerebral effects. Finger-like bulbs reach out from the citrus-scented buds wrapped in crystal trichomes. <a href=\"http://www.leafly.com/sativa/lamb-s-bread\">Lamb&rsquo;s Bread</a> is counted among its progeny, although King&rsquo;s Bread&rsquo;s lineage is not well documented. Pain relief, appetite stimulation, and stress alleviation are just a few of the therapeutic benefits King&rsquo;s Bread has to offer.</p>\n",
    "descriptionPlain": "Said to be a sativa landrace from the Blue Mountains of Jamaica, King&rsquo;s Bread (or King&rsquo;s Breath) delivers mellowing and euphoric cerebral effects. Finger-like bulbs reach out from the citrus-scented buds wrapped in crystal trichomes. Lamb&rsquo;s Bread is counted among its progeny, although King&rsquo;s Bread&rsquo;s lineage is not well documented. Pain relief, appetite stimulation, and stress alleviation are just a few of the therapeutic benefits King&rsquo;s Bread has to offer.\n",
    "effects": [
        {
            "name": "Focused",
            "score": 59.02777777777778
        },
        {
            "name": "Relaxed",
            "score": 55.55555555555556
        },
        {
            "name": "Creative",
            "score": 35.41666666666667
        },
        {
            "name": "Uplifted",
            "score": 34.72222222222222
        },
        {
            "name": "Euphoric",
            "score": 12.5
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 27.083333333333332
        },
        {
            "name": "Citrus",
            "score": 4.166666666666666
        },
        {
            "name": "Lemon",
            "score": 3.4722222222222223
        },
        {
            "name": "Pungent",
            "score": 2.083333333333333
        },
        {
            "name": "Sweet",
            "score": 1.3888888888888888
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png",
            "id": 1332319,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Funky looking dark green nugs with oversized finger-like calyxes and thick orange hairs. Smell is skunky and pungent, but less so that other examples of Lamb’s Bread, with undertones of citrus and haze. Smoke is smooth and pungent like the smell, with a defined sharpness similar to Jack Herer or Haze. Effects are felt quickly, with a heady, cerebral and soaring type head high. I felt extremely euphoric and giggly, happy to be around good company, quite social and talkative. The high is musical and creative; music is greatly enhanced and engaging, emphasizing the trippy qualities of the high. After the peak, I felt significantly more uplifted and energetic than usual, even motivated. Cleaning and organizing is fun and I still felt more talkative and social than usual. Significant appetite stimulation and mild come down but somewhat scatterbrained and absent minded. Nonetheless, great for depression / anxiety and bipolar, perfect for early morning, great all day smoke. Leaves one feeling content and relaxed with minimal mental burn out, absolutely perfect example of an upbeat daytime Sativa for getting things done, relaxing with friends, and being outside. 10/10",
            "username": "ARStewart41"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1451670,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Very clear headed sativa high. Mello and relaxed while having creative energy to simmer with. Great for anxiety. Listed at 18% THC. It's a unique high and smoke experience.",
            "username": "bsweezy"
        }
    ],
    "id": 681,
    "name": "King's Bread",
    "negatives": [
        {
            "name": "Headache",
            "score": 27.77777777777778
        },
        {
            "name": "Dry Mouth",
            "score": 2.7777777777777777
        },
        {
            "name": "Dizzy",
            "score": 0.6944444444444444
        },
        {
            "name": "Dry Eyes",
            "score": 0.6944444444444444
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/jamaican",
            "category": "Sativa",
            "name": "Jamaican",
            "permalink": "https://mobileapi.leafly.com/sativa/jamaican",
            "slug": "jamaican",
            "subtitle": null,
            "symbol": "Jam"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/kings-bread",
    "photoTotalCount": 10,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/522436/b/king-s-bread__primary_a564.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/king-s-bread_100x100_1672.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/375370/b/king-s-bread__primary_46fe.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/king-s-bread_100x100_2d50.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/375067/b/king-s-bread__primary_78d1.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/king-s-bread_100x100_c378.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/269612/b/king-s-bread__primary_7d3d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/king-s-bread_100x100_4ee0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/125506/b/king-s-bread_825x550_a174.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/king-s-bread_100x100_b37c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/125423/b/king-s-bread_825x550_5783.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/king-s-bread_100x100_2239.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Spokane, WA"
    ],
    "rating": 4.19,
    "relatedStrains": [],
    "reviewCount": 27,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "kings-bread",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.18518518518519/240",
    "subtitle": null,
    "symbol": "Kbr",
    "symptoms": [
        {
            "name": "Pain",
            "score": 27.77777777777778
        },
        {
            "name": "Lack of Appetite",
            "score": 26.38888888888889
        },
        {
            "name": "Nausea",
            "score": 26.38888888888889
        },
        {
            "name": "Stress",
            "score": 10.416666666666668
        },
        {
            "name": "Depression",
            "score": 7.638888888888889
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
