{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1469051100000)/",
            "id": "contentitems-3061",
            "text": "Space: the final frontier. The massively empty wonder which has tantalized the imagination of mankind since first gazing upwards to witness the brilliance of the celestial. Whether for discovery, in reaction to climate change, or because you’re an overly excited core that wants to go to space, exploration is more relevant and possible than ever. With private space companies reigniting the torch of space travel and helmed by incredibly smart and innovative individuals (like Elon Musk, founder of SpaceX, or Sir Richard Branson of Virgin Galactic), it’s not hard to believe we are entering a golden age of cosmological discovery.\nOn the shoulders of giants we stride forward into a future not grounded on Earth. Here at Leafly, we’d like to reengage the booster switch and combust a little propellant in honor of the men and women around the world making the dream of space exploration a reality. We’ve compiled a list of outer space-themed cannabis strains to help you celebrate the scientists, star formations, conspiratorial UFO hunters, Apollo missions, and others on this Space Exploration Day.\n  Project Blue Book\nOriginating in 1952, Project Blue Book kicked off a series of studies conducted by the U.S. Air Force to determine if UFOs were a threat to national security. Its strain counterpart is a sativa-leaning hybrid offering a serene body high and calm, focused effects that are perfect for star-gazing.\n  Sputnik\nThis rocket was used by the Soviet Union to perform the world’s first satellite launch in 1957. Strain-wise, the spunky Sputnik sativa (say that three times fast!) has hints of sour and diesel, perhaps from that rocket boost of uplifting effects you may experience.\n“2 hits to liftoff. Decent buzz out of the launchpad. mid buzz nice and headize, no burn out at the end. good strain to kick back, and rate strains.” – sonofabrokenman\n  Apollo 11\nThe first space flight that brought humans on the Moon, Apollo 11 is the reason we’re celebrating this date today since it occurred on July 20th, 1969. Neil Armstrong and Buzz Aldrin took one small step for man and one giant leap for mankind. The strain, meanwhile, offers strong cerebral effects that are good for treating stress and moderate pain.\n“I love this strain. It takes you on a cosmic journey while leaving you grounded on planet earth. –symbol9991\n  Stephen Hawking Kush\nThe iconic theoretical physicist brought us predictions on black holes, gravitational singularity theorems, and cosmology. His strainsake, Stephen Hawking Kush, is an indica-dominant offering that helps with pain, nausea, and relaxation.\n“Healing codes from the universe immediately came to me when I smoked a hit of this high 11.4 CBD strain. Absolutely Smiles and TOTAL RELEIF are endrenching me in this dream. My love of indica just got greater because I have had a crush on Stephen Hawking and now I can smoke bud named after his fine ass and mind. WOW I think this strain will make me more intelligent. It is so much stonier and higher than I thought it …” – StellarStoner\n  Apollo 13\nThe seventh manned mission in the Apollo space program, Apollo 13 was the United States’ third intended Moon landing. Unfortunately, an oxygen tank exploded and crippled the Service Module. The crew managed to cobble together some makeshift repairs and return safely to Earth on April 17th. Not only did this historical event result in a blockbuster film of the same name, it also inspired the popular Apollo 13 hybrid strain featuring cerebral, energizing effects and an appropriately earthy scent.\n“WOW! Such an appropriate name, because I’m blasted light years past the moon. Light speed ahead, on a rocket ship I said, catch me if you can, I’m your spaceman…” –NunoFreak\n  Cosmic Collision\nThis sativa collided Cosmic Charlie with Piña Collision to create a fusion that’s out of this world. Enjoy the pineapple-kiwi flavors of Cosmic Collision and its uplifting, euphoric effects while you ponder exactly how far the universe extends.\n  Carl Sagan\nThe American astronomer, cosmologist, astrophysicist, and astrobiologist dedicated his efforts to researching extraterrestrial life and sent the first physical messages into space. His Carl Sagan strain counterpart offers balanced effects and relaxation.\n  Outer Space\nDefined as the void that exists between celestial bodies, the mystery of outer space will keep scientists hunting for answers well into the next millennium. The sativa Outer Space is widely touted for its creative, uplifting, and energetic effects.\n“Really makes you feel like taking off into space. More of a head uplifting feeling and focus.” – robmorales\n  Nebula\nA nebula is an interstellar cloud comprised of dust, helium, hydrogen, and other ionized gases. Its hybrid Nebula strain version twinkles with THC coating and offers intense, almost psychedelic effects.\n“Out of this world!” – hermantheworm420",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001512/cannabis-strains-for-space-exploration-day.jpg",
            "title": "Celebrate Space Exploration Day With These Cannabis Strains",
            "urlslug": "/news/strains-products/cannabis-strains-for-space-exploration-day"
        },
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1450735260000)/",
            "id": "contentitems-6309",
            "text": "10… 9… 8… 7… 6… 5…\nIt’s New Year’s Eve! And we’re guessing your party planning is already in full swing. Traditionally, the most important element of the evening has been the sparkling wine for a midnight toast. Bringing cannabis into the mix this year is the perfect way to celebrate everything the legalization movement has achieved in 2016, and the delectable pairing virtually guarantees a feel-good start to 2017.\nHow to go about pairing bud with your bubbly? As with any wine pairing, you’ll want to be aware of how the cannabis’s tasting notes will complement those of your sparkling wine. You’ll also want to take into account the effects of the strain you choose — steer clear of anything that might cause you to nod off before midnight!\nWhile everyone’s preferences will vary slightly, read on for four pairing ideas to end the year on a high note.\n \nIf you’re drinking cava…\n\nWine to try: Can Macià Bohigas Cava Brut Penedes ($15, K&L Wine Merchants)\n \nStrain to try: Outer Space\nA style of sparkling wine that has made great gains in popularity of late, cava is Spain’s signature sparkler. This particular iteration from Can Macià reveals crisp apple and sweet pear notes upon popping the cork. For a full range of holiday fruit flavors, pair with a cherry- and berry-flavored sativa like Outer Space. Its cheery, chatty aftereffects are an excellent added bonus.\n \nIf you’re drinking sparkling rosé…\n\nWine to try: Argyle Winery 2012 Brut Rosé ($50, Argyle Winery)\n \nStrain to try: Tangerine Dream\nLooking to sip outside the box this year? Switch out the classic golden bubbles for something a little pinker: sparkling rosé. This particular bottling is a bit spendy at $50, but Argyle’s Brut Rosé has also been served at White House dinners by two different presidential administrations, so you know it’s worth the splurge. Pair it with an equally highly regarded hybrid like the appetizing, award-winning Tangerine Dream.\n \nIf you’re drinking brut…\n\nWine to try: NV Mumm Napa Brut Prestige ($18, BevMo!)\n \nStrain to try: Cactus\nOn the dry end of the sparkling wine spectrum, a brut classification indicates that your bottle of sparkling wine contains hardly any residual sugar. This lets the grapes’ naturally occurring flavor notes shine through. Pair with a relaxed yet chatty indica like Cactus; if big parties aren’t always your cup of tea, an anxiety-quelling strain like this one is a great way to go.\n \nIf you’re drinking demi-sec…\n\nWine to try: Veuve Clicquot Demi-Sec ($31, Total Wine)\n \nStrain to try: Laughing Buddha\nToward the other end of sparkling wine’s sweetness spectrum lie demi-sec Champagnes, which maintain more residual sugar than their drier brut cousins. To offset this sweetness, match a demi-sec wine with the herbal, earthy aromas and giggly, feel-good effects of a sativa like Laughing Buddha. What better way to go into the new year than with a smile on your face?\n\n\nImage Sources: Argyle Winery, Total Wine, Bevmo!, KL Wines, Michael Mina Wine Club",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/29200422/bud-bubbly-pairing-your-new-years-champagne-with-cannabis.jpg",
            "title": "Bud & Bubbly: Pairing Your New Year's Champagne With Cannabis",
            "urlslug": "/news/lifestyle/bud-bubbly-pairing-your-new-years-champagne-with-cannabis"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 77.65151515151514
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 33.68055555555555
        },
        {
            "name": "Asthma",
            "score": 33.33333333333333
        },
        {
            "name": "PMS",
            "score": 33.33333333333333
        },
        {
            "name": "ADD/ADHD",
            "score": 5.934343434343434
        }
    ],
    "description": "<p class=\"p1\">Outer Space is a sativa-dominant strain that is a cross of <a href=\"https://www.leafly.com/sativa/island-sweet-skunk\">Island Sweet Skunk</a> and <a href=\"https://www.leafly.com/sativa/trinity\">Trinity</a> and is known for cerebral and creative effects. It has a citrusy odor that is strong and produces a flavorful smoke. Great as a daytime medicine.</p>\n",
    "descriptionPlain": "Outer Space is a sativa-dominant strain that is a cross of Island Sweet Skunk and Trinity and is known for cerebral and creative effects. It has a citrusy odor that is strong and produces a flavorful smoke. Great as a daytime medicine.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 80.61868686868686
        },
        {
            "name": "Uplifted",
            "score": 58.4280303030303
        },
        {
            "name": "Creative",
            "score": 56.34469696969696
        },
        {
            "name": "Euphoric",
            "score": 54.41919191919191
        },
        {
            "name": "Energetic",
            "score": 53.88257575757575
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 8.017676767676768
        },
        {
            "name": "Sweet",
            "score": 7.133838383838384
        },
        {
            "name": "Pine",
            "score": 5.2398989898989905
        },
        {
            "name": "Pungent",
            "score": 4.3560606060606055
        },
        {
            "name": "Earthy",
            "score": 4.008838383838384
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1386979,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Great great great daytime smoke. Couple hits and you are in... well... Outerspace! This is a strong one and it didn't take much to send me into orbit to party with Major Tom. Seems to make everything outside a hell of lot more colorful and interesting. Certainly in my top 5... and I've plowed through quite a few strains now... 40+. Overall I would give this a 9++  Don't pass this one up if you like a good Sativa!",
            "username": "jlsscbs"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png",
            "id": 1589681,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I’ve been trying to stay away from strong sativas lately, as I have noticed I get significantly anxious and don’t always receive the benefits from the high, but Outer Space is the best sativa I have had the pleasure of smoking to date. The high is powerful and true to its name, but I still feel engaged and comfortable around other people, no anxiety attached. It is truly an uplifting strain and while it can feel potent, the high is controllable. This strain is a must! ",
            "username": "hatsuhi"
        }
    ],
    "id": 13471,
    "name": "Outer Space",
    "negatives": [
        {
            "name": "Dry Eyes",
            "score": 40.30934343434343
        },
        {
            "name": "Dry Mouth",
            "score": 10.984848484848484
        },
        {
            "name": "Anxious",
            "score": 2.967171717171717
        },
        {
            "name": "Headache",
            "score": 2.6199494949494953
        },
        {
            "name": "Paranoid",
            "score": 1.0416666666666665
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/island-sweet-skunk",
            "category": "Sativa",
            "name": "Island Sweet Skunk",
            "permalink": "https://mobileapi.leafly.com/sativa/island-sweet-skunk",
            "slug": "island-sweet-skunk",
            "subtitle": null,
            "symbol": "Iss"
        },
        {
            "applink": "leafly://strain/trinity",
            "category": "Sativa",
            "name": "Trinity",
            "permalink": "https://mobileapi.leafly.com/sativa/trinity",
            "slug": "trinity",
            "subtitle": null,
            "symbol": "Tri"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/outer-space",
    "photoTotalCount": 5,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/sativa/outer-space/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/sativa/outer-space/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/527156/b/outer-space__primary_6bdb.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/outer-space_100x100_d731.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/510159/b/outer-space__primary_bf04.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/outer-space_100x100_97da.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/18635/b/outer-space_825x550_6519.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/outer-space_100x100_b21f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/15119/b/outer-space_825x550_vi5e3rlm.njp.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/outer-space_100x100_4p5qwd5r.sm3.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/9843/b/outer-space_825x550_jpa0ppnm.3l5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/outer-space_100x100_o5yqn040.1bq.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Chicago, IL",
        "Addison, IL",
        "Collinsville, IL",
        "Fulton, IL",
        "Highland Park, IL",
        "Joliet, IL",
        "Las Vegas, NV",
        "Laughlin, NV",
        "Litchfield, IL",
        "Moffat, CO"
    ],
    "rating": 4.66,
    "relatedStrains": [],
    "reviewCount": 65,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "outer-space",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.66153846153846/240",
    "subtitle": null,
    "symbol": "Out",
    "symptoms": [
        {
            "name": "Depression",
            "score": 75.53661616161615
        },
        {
            "name": "Stress",
            "score": 50.410353535353536
        },
        {
            "name": "Pain",
            "score": 47.285353535353536
        },
        {
            "name": "Insomnia",
            "score": 34.722222222222214
        },
        {
            "name": "Fatigue",
            "score": 13.60479797979798
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
