{"sl_translate":"description,descriptionPlain,category","id":184,"slug":"casey-jones","name":"Casey Jones","subtitle":null,"symbol":"Cas","category":"Sativa","description":"\u003cp\u003eChoo choo! Casey Jones is coming down the track! Casey was a famous engineer who was killed in a train wreck in 1900. More recently, he\u0026#39;s also the name of a Teenage Mutant Ninja Turtles character who\u0026#39;s fond of hockey masks and vigilante justice. However, this Casey Jones is a cross between Oriental Express (\u003ca href=\"http://www.leafly.com/hybrid/trainwreck\"\u003eTrainwreck\u003c/a\u003e x \u003ca href=\"http://www.leafly.com/sativa/thai\"\u003eThai\u003c/a\u003e) and \u003ca href=\"http://www.leafly.com/sativa/east-coast-sour-diesel\"\u003eEast Coast Sour Diesel\u003c/a\u003e that provides an \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eearthy\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e palate with subtle hints of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-citrus\"\u003ecitrus\u003c/a\u003e. Casey Jones produces pleasant \u003ca href=\"http://www.leafly.com/sativa\"\u003esativa\u003c/a\u003e effects that are \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e and great for releasing your \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-creative\"\u003ecreativity\u003c/a\u003e.\u003c/p\u003e\n","descriptionPlain":"Choo choo! Casey Jones is coming down the track! Casey was a famous engineer who was killed in a train wreck in 1900. More recently, he\u0026#39;s also the name of a Teenage Mutant Ninja Turtles character who\u0026#39;s fond of hockey masks and vigilante justice. However, this Casey Jones is a cross between Oriental Express (Trainwreck x Thai) and East Coast Sour Diesel that provides an earthy, sweet palate with subtle hints of citrus. Casey Jones produces pleasant sativa effects that are uplifting and great for releasing your creativity.\n","aka":null,"rating":4.2,"highlightedReviews":[{"id":1413907,"username":"iamakay","text":"Coming down is a pretty quick crash to sleepiness, but before the crash I actually had a new person in my house (I\u0027m agoraphobic and suffer from extreme social anxiety disorder) and I wasn\u0027t freaking out about it and I was actually able to join in the conversation and joke and laugh. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1633955,"username":"weekdaybender","text":"• quick onset - nice head high\n• delicious flavors upon inhale and exhale [I recommend: Pax Pod by The Lab Extracts]\n• a laughing strand - social, good for conversation, playing music\n• Crowd pleaser ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-24013","title":"10 Strains You Might Not Know Are Siblings","author":"Lisa Rough","category":null,"date":"\/Date(1491865568000)\/","text":"In honor of National Siblings Day, we decided to take a look at some of the most popular strains in cannabis and their offspring. There are quite a few strains that share genetics, but it just might surprise you to find out which strains are siblings.\n  Granddaddy Purple\nGDP is one of the oldest and most well-known strains. Let’s check out the kiddos!\nCandyland\nThis sativa-dominant hybrid is an award-winning strain from GDP and Bay Platinum Cookies. Its sativa side stems from the Platinum Cookies parent, which was created from OG Kush, Durban Poison, and a third unknown strain. Candyland is a rare sativa known for its relaxing relief from muscle aches with the added benefit of uplifting and stimulating effects.\nCherry Pie\nCherry Pie is renowned for its strong effects and high potency. The offspring of two cannabis heavyweights–GDP and Durban Poison–Cherry Pie has a fruity flavor and a high that can last several hours. Although there are claims that this strain tastes like real cherry pie, others compare the flavor to berries, much like the flavor of GDP. This sweet strain will melt away your stress and bring on a strong craving for your favorite munchies!\n\n  Blueberry\nBlueberry’s fruity genetics provide the backdrop for some of the most common and delicious strains available.\nBlue Dream\nThe “Blue” in this sativa-dominant celebrity strain comes from the Blue in Blueberry, while the “Dream” comes from another champion strain, Haze, a dreamy and euphoric sativa. Blue Dream is easily the most popular strain on Leafly, and its mild, uplifting effects make it the perfect strain for novice smokers.\nBerry White\nBerry White may be the offspring of two legendary strains, but this relaxing indica is famous in its own right for its balanced effects and a euphoric escape from stress and anxiety. With parentage from Blueberry and the epic hybrid White Widow, Berry White tends to taste like overripe sour blueberries and offers such mind-bending effects that you may forget you have arms.\n\n  Trainwreck\nA freight train of a hybrid strain, Trainwreck is sure to knock your socks off. What about its offspring?\nCasey Jones\nA little history lesson for you: Casey Jones is the name of a famous train engineer who was killed in a train wreck in 1900. However, for those of you who were raised on Saturday morning 90s cartoons, the name may sound more familiar as the hockey-masked vigilante from Teenage Mutant Ninja Turtles. Either way, this earthy sativa combines Oriental Express (an offshoot of Trainwreck and Thai) with East Coast Sour Diesel to create a power-packed punch that’s great for inspiring creativity.\nPineapple Express\nAh yes, everyone’s favorite movie-turned-famous-strain is known for its fruity sweet undertones. But did you know that it has roots in the speedy hybrid, Trainwreck? Pineapple Express is more than just a famous name, it combines Trainwreck and Hawaiian for a long-lasting energetic buzz and a sweet mango and pineapple citrus flavor that makes for one golden afternoon.\n\n  GSC (f.k.a Girl Scout Cookies)\nGSC (f.k.a Girl Scout Cookies) is the Genghis Khan of genetic stomp-arounds–these days, it seems like there are Cookies genetics in every new strain.\nSunset Sherbet\nSunset Sherbet is the heir apparent to the GSC throne. It’s known to have the heady, cerebral effects of GSC with an intoxicating boost from a heavy indica known as Pink Panties. Sunset Sherbet is so nicknamed due to its sweet, sherbet-like flavor, and tends to lean more heavily towards its indica roots than the standard GSC, so be prepared for a calm, relaxing high.\nMoon Cookies\nThis intergalactic herb crosses GSC (f.k.a Girl Scout Cookies) with another phenotype of itself to create a complex woody, earthy scent with some strong, heavy indica-leaning relaxation. These buds are hard, dense, resinous rocks that taste like cookie dough and will send you soaring up to the stars. But don’t consume too much Moon Cookies or you just might get lost in space.\n\n  Jack Herer\nOne of the most notorious cannabis activists spawned this world-renowned sativa, and Jack Herer‘s litany of offspring continues to expand with no end in sight.\nXJ-13\nWhat sounds like a top-secret government experiment is actually one of the most delightfully uplifting hybrids you can find. XJ-13 combines Jack Herer’s warm, fuzzy sativa genetics with the dreamy high of G13 Haze to create a stimulating and euphoric experience. It’s not heavy enough to make you feel asleep, but not stimulating enough to cause paranoia, giving consumers a perfectly balanced buzz that is high, happy, and carefree.\nDragon’s Breath\nThis sativa-dominant hybrid was born of two heavyweight strains, Jack Herer and Northern Lights. The name Dragon’s Breath is a reference to the spicy flavor and aroma accompanied by this hazy strain, but it won’t burn you out. Instead, you can expect a clear-headed, energetic, productive high. But be forewarned–too much of the Dragon may leave you feeling a bit paranoid.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/04/10154425/national-sibling-day.jpg","urlslug":"/news/strains-products/10-strains-might-not-know-siblings"},{"id":"contentitems-3561","title":"The Leafly Holiday Survival Guide: 12 Strains to Help You Make It to the New Year","author":"Bailey Rahn","category":null,"date":"\/Date(1416865260000)\/","text":"Winter is coming, and we don’t need every department store nationwide whipping out their Christmas supplies in October to feel it. Whether you love them or despise them with a flaming Grinch-like passion, the holidays are upon us and getting through the madness may require some help from our little green friend. Each chapter of the holidays poses a different challenge, and for this reason, we’ve compiled a handy list of strains to pair with each festivity (and struggle). \nThanksgiving: The Pre-Feast\nIt’s you versus a table full of food. What appetite-stimulating weapon will you choose?\n   Sour OG\nThis Sour Diesel and SFV OG Kush cross dishes out a good balance of uplifting euphoria alongside the hunger rampage, making this hybrid the perfect contender for both appetite loss and the seasonal blues.\n   Afghan Kush\nThis heavy-duty indica is the rocket-launcher equivalent when it comes to fighting appetite loss with cannabis. A little bit of this earthy, relaxing strain and you’ll be inhaling more food than you thought was humanly possible.\nThanksgiving: The Recovery\nYou have just defeated your enemy with the power of sheer gluttony, and now it’s time to deflate. Choose one of these tummy-calming strains to help you harness your full digestive potential:\n   Casey Jones\nJust like the hockey-masked vigilante of the Ninja Turtle world, this Casey Jones will beat any gastointestinal discomfort to a pulp without inducing an early night’s sleep.\n   Headband\nGood for both relaxation and relieving stomach pain, Headband offers long-lasting, carefree effects that will help you accept the feast’s passing as opposed to mourning it. (But seriously, R.I.P., you delicious bowl of stuffing.)\n   Death Star\nThis crushing indica strain will destroy any stomach aches with the choke-hold force of Darth Vader himself. Prepare to die, bloated gut.\nBlack Friday\nBlack Friday could be considered the second major boss fight of the holiday season. Rather than battling the mother ship that is Thanksgiving dinner, Black Friday poses a horde of frenzied consumers looking to get those deals before you do. Luckily, you’ve got quite the psychoactive arsenal to help you get there first:\n   Green Crack\nFew strains can truly be described as energizing, but this sativa is the exception. Green Crack’s active, buzzing effects will have you darting from shelf to shelf like a mad(wo)man for as long as you can remember what you were doing.\n   Lavender\nFor some of us, nothing induces more anxiety than crowds of people flocking around the disarray under those irritating fluorescent lights. You can choose to stay home, or utlize the calming, anti-paranoia properties of Lavender to help you brave the mobs.\nChristmas\nOh, Christmas. This is a day full of different festivities, but whether you’re preparing yourself for Feast Madness: Part II or simply wanting to kick it with that video game you gifted yourself, we’ve got some recommendations for you:\n   Power Plant\n‘Tis the season for obligatory conversation with relatives you see once a year. Power Plant is here to help bring out your more talkative half for those awkward, unnatural exchanges.\n   Chemdawg\nA good, well-rounded hybrid, Chemdawg brings joy, creativity, and sensory elevation to whatever it is you find yourself doing on Christmas Day. Loafing around with your cats? Crafting a masterpiece from snow? Scarfing down an entire tube of raw cinnamon rolls? Chemdawg will make it even better.\nNew Year’s Eve/Day\nNew Year’s Eve and New Year’s Day are literally as different as night and day, so you may want to pick up the entire trifecta here to ensure proper preparation…and recovery:\n   Harlequin\nYou may be the type of person who believes that midnight is an ungodly hour, and for you we suggest Harlequin. This high-CBD sativa provides all the clear-headed energy you’ll need to keep up with those night owl youngsters.\n   Grape Ape\nStaving off a hangover? We recommend ending your holiday season with this indica whose nausea-relieving, restful qualities are sure to bring you back to your baseline.\nImage credit: Martin Cathrae via Photopin cc","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/11/12002842/the-leafly-holiday-survival-guide-15-strains-to-help-you-make-it.jpg","urlslug":"/news/strains-products/the-leafly-holiday-survival-guide-15-strains-to-help-you-make-it"}],"reviewCount":405,"flavors":[{"name":"Citrus","score":23.081294836716079},{"name":"Diesel","score":19.466111269925534},{"name":"Earthy","score":10.325887205455956},{"name":"Sweet","score":9.4539959978764241},{"name":"Woody","score":7.342671621676808}],"effects":[{"name":"Talkative","score":66.636378486543876},{"name":"Uplifted","score":60.135309892323818},{"name":"Energetic","score":59.7116156872354},{"name":"Happy","score":59.27158628387852},{"name":"Creative","score":50.145315201263251}],"symptoms":[{"name":"Stress","score":48.257578851363306},{"name":"Depression","score":45.962483494643415},{"name":"Pain","score":25.4243748383496},{"name":"Muscle Spasms","score":21.009787506295858},{"name":"Inflammation","score":20.673894991900461}],"conditions":[{"name":"Anxiety","score":45.8103619607683},{"name":"PTSD","score":20.961802861382228},{"name":"Gastrointestinal Disorder","score":20.769864281727717},{"name":"Migraines","score":19.361974380964046},{"name":"Arthritis","score":18.162358258123355}],"negatives":[{"name":"Dry Mouth","score":45.042607642150251},{"name":"Paranoid","score":19.849988429234557},{"name":"Anxious","score":19.370141980098278},{"name":"Dry Eyes","score":4.1828317066198384},{"name":"Dizzy","score":1.1516314779270633}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/sativa/casey-jones/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/sativa/casey-jones/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/casey-jones_100x100_9262.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001691/b/casey-jones__primary_41d5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/casey-jones_100x100_f786.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/643274/b/casey-jones__primary_efcc.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/casey-jones_100x100_0646.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/593610/b/casey-jones__primary_8c3a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/casey-jones_100x100_953d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/534164/b/casey-jones__primary_aa02.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/casey-jones_100x100_4220.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/527192/b/casey-jones__primary_385a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/casey-jones_100x100_5a02.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/517389/b/casey-jones__primary_7f21.jpg"}],"photoTotalCount":88,"popularCities":["Portland, OR","Eugene, OR","Denver, CO","Los Angeles, CA","Detroit, MI","Montréal, QC","Vancouver, BC","Colorado Springs, CO","Durango, CO","Edmonton, AB"],"permalink":"https://mobileapi.leafly.com/sativa/casey-jones","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.19506172839506/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Trainwreck","subtitle":null,"slug":"trainwreck","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/trainwreck","symbol":"Tw","applink":"leafly://strain/trainwreck"},{"name":"Thai","subtitle":null,"slug":"thai","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/thai","symbol":"Tha","applink":"leafly://strain/thai"},{"name":"East Coast Sour Diesel","subtitle":null,"slug":"east-coast-sour-diesel","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/east-coast-sour-diesel","symbol":"Eas","applink":"leafly://strain/east-coast-sour-diesel"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":63,"outdoorFinish":null,"height":"Medium","averageYield":"Medium","environment":null,"growNotes":"\n\tPrefers moderate amounts of fertilizer\n\tMay express fruity or diesel-smelling phenotypes\n\tTrains well as a multi-branched plant or with sea of green (SOG) operations\n\tAverage yield falls between 25-30 grams per plant\n\n"}}
