{"sl_translate":"description,descriptionPlain,category","id":97039,"slug":"space-jill","name":"Space Jill","subtitle":null,"symbol":"Spj","category":"Sativa","description":"\u003cp\u003eSpace Jill by TGA Genetics is a recreation of the famed \u003ca href=\"http://www.leafly.com/hybrid/space-queen\"\u003eSpace Queen\u003c/a\u003e \u003ca href=\"http://leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e, which crossed \u003ca href=\"http://www.leafly.com/indica/romulan\"\u003eRomulan\u003c/a\u003e with \u003ca href=\"http://www.leafly.com/hybrid/cinderella-99\"\u003eCinderella 99\u003c/a\u003e. This F2 reincarnation captures the sweet mango and candy aroma remembered by fans of the original Space Queen. Space Jill, a 70% \u003ca href=\"http://leafly.com/sativa\"\u003esativa\u003c/a\u003e strain, induces a high-energy buzz conducive to productivity, but too much can leave the unaccustomed user paranoid.\u003c/p\u003e\n","descriptionPlain":"Space Jill by TGA Genetics is a recreation of the famed Space Queen hybrid, which crossed Romulan with Cinderella 99. This F2 reincarnation captures the sweet mango and candy aroma remembered by fans of the original Space Queen. Space Jill, a 70% sativa strain, induces a high-energy buzz conducive to productivity, but too much can leave the unaccustomed user paranoid.\n","aka":"Space Queen F2, SpaceJill","rating":3.65,"highlightedReviews":[{"id":1383099,"username":"AngelWolf666","text":"I decided to test this strain out on stress-induced migraines. My back was already hurting from doing some yardwork during the day (and I knew it works on pain), so I decided that the next time I started having a migraine, I would smoke some.\r\n\r\nWell, today was the day to test it. One of My acquaintances refused to be civil in a conversation, which raised My stress level to the point of causing a migraine. I went outside, had a little smoke, and within moments, My migraine pains were mellowed out (as were the rest of My pains).\r\n\r\nNow, if I were to take prescription medications for this, I would have to take one for My back, one for My leg, one for My head, one for My stomach, and another couple for the side effects caused by taking so many pills. This way, I smoke a bit, and lean back, maybe use some eye drops, drink some liquid refreshments, and I\u0027m good.\r\n\r\nThis strain doesn\u0027t really give Me the desire to eat anything. I just want to drink something cold, and work on writing reviews or some arts and crafts or something. And I definitely do not want to deal with drama when I use this strain.\r\n\r\nThat, I like.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png"},{"id":1374676,"username":"willywizard","text":"Space Jill has become a favorite strain simply for its uplifting effects.  There is no trace of sleepy couch lock with this one.  It comes on slow and turns into an energetic and talkative high that I\u0027ve found in few other strains.  Maybe not for everyone but this sativa does wonders for my ADD and productivity.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3537","title":"The Best Cannabis Strains for the Holidays (According to Leafly Reviewers)","author":"Brett Konen","category":null,"date":"\/Date(1450897200000)\/","text":"The holidays are fast approaching, so naturally you’re thinking about the perfect cannabis strains to enjoy over the upcoming weeks. Have innumerable aunts, uncles, in-laws, and second cousins coming into town for the long weekend? You’ll probably need something to chill you out after all that family time. Wanting to keep moving in spite of the weather? You’re after something active. Have about a thousand errands left to run? Something to spice up the process would be nice.\nLuckily, Leafly user reviews are a gold mine of suggestions for cannabis strains that fit any scenario, so we’ve compiled a few great user-sourced recommendations for a range of seasonal activities listed below. Whether you’re grocery shopping, cocoa-sipping, or baking some cannabis-infused holiday cookies, try out one of the ideas below and enjoy your holiday celebrations!\n\nFor Coping with Winter\n  “This is the perfect strain to make Seattle winter days productive! A couple hits gives my ambition, creativity and libido a jump-start.” –munin.raven\n \n “My go to for getting my figure back after holiday indulgence!” –grngrazer\n \n “Smooth pull, great taste – exactly what I hoped for…real killer high to cure the inevitable holiday blues.” –hazedandconfused\nFor Spending Time with Family \u0026 Friends\n “Smells like Christmas trees, tastes like pine and lightens the heart and mind…I found it made the whole holiday with ALL the family, very enjoyable. Oh and added benefits of not breaking ornaments or dropping the turkey.” –Free_Byrd\n \n “Smoked this with my Nana and great Uncle Pete while on winter vacation…Made me forget how much my back hurt from sleeping on an air mattress.” –somniumtextrix\n \n “A swift cerebral head high, accompanied by a punch of energy. Best used at a party with friends as is very good for getting you in the mood, to talk, dance, whatever!” –JustAnotherStoner\nFor Curling Up by the Fire\n “I could feel every atom in my body float away in rhythm with the space heater I was sitting next to. Perfect for sitting home on a cold winter evening and then getting a good night sleep.” –Anonymous\n \n “I enjoyed a blunt and hits from my vaporizer along side with a cup of hot chocolate, it was a great combo…pick it up for a stay-at-home type of day.” –kushconnoisseur420\n \n “I’m washing it down with some seasonal ale and it’s the perfect end to a perfect night.” –BudseyXO\nLooks, Smells, and Tastes Like Christmas\n “When I opened the bag I thought I was suddenly on a camping trip. It smelled like a Christmas tree…The taste of pine, clove and earth danced across across my palate.” –robmacpheejr\n \n “Nom nom nom like a Christmas tree with a lifesaver candy cane in your mouth.” –greedyguy\n \n “Feels like I threw a Christmas tree in a wood chipper… lights, ornaments, candy canes – everything – and put it in my Pax to vape it.’” –Midnyte003\nFor Making Spirits Bright\n “This is like that one ‘big’ present hidden behind the tree just when you think you didn’t get what you ‘really’ wanted that year. It’s that good.” –Anonymous\n \n “My brain lit up like Times Square on New Years Eve.” –Grumple\n \n “This strain had me smiling like the Grinch that stole Christmas.” –Skyclub\n \n “Like skating across a frozen lake surrounded by snowflakes in the night.” – bugpowderdustmugwumpjism\n \n “BEST. STRAIN. EVER. Four for you, Sour D, you go Sour D.” –Anonymous\nWhat are some of your favorite strains to enjoy over the holidays? Share in the comments!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12002805/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re.jpg","urlslug":"/news/strains-products/the-best-cannabis-strains-for-the-holidays-according-to-leafly-re"},{"id":"contentitems-3287","title":"New Strains Alert: Frankenstein, Lavender Jones, Purple Paralysis, Space Jill, and Sugar Kush","author":"Kayla Williams","category":null,"date":"\/Date(1409331600000)\/","text":"Based on submissions made by Leafly users, we\u0027ve added Frankenstein, Lavender Jones, Purple Paralysis, Space Jill, and Sugar Kush to the Leafly Explorer. Keep \u0027em coming! Also, we\u0027ve got plently more new strains on the way, so stay tuned. In the meantime, leave a strain review if you\u0027ve had the chance to try any of these new varieties, and let us know which strains you\u0027d love for us to add next so we can make sure we don\u0027t forget any of your favorites!\n1. Frankenstein\nCharacteristics of Frankenstein:\n\n80% indica\nUnknown lineage\nRecommended for consumers with a high cannabis tolerance or patients with severe symptoms\nGenetics gave rise to Opal OG Kush, Copper Kush, Sweet Lafayette, and OG\u0027s Pearl\n\n2. Lavender Jones\nCharacteristics of Lavender Jones:\n\nHybrid strain\nCross between Casey Jones and Purple Urkle\nBuds express themselves in vibrant hues of purple and green\nCan bring deep relaxation paired with dreamy cerebral euphoria\nIndoor flowering time of 7 to 8 weeks\n\n3. Purple Paralysis\nCharacteristics of Purple Paralysis:\n\nSativa-dominant hybrid\nAlso known as Jellyfish Bud\nCross between Power Plant and Lavender\nBreeder: Cream of the Crop\nHashy lavender aroma\nHas potently energizing effects\nIndoor flowering time of about 67 days\n\n4. Space Jill\nCharacteristics of Space Jill:\n\n70% sativa strain\nCross between Romulan and Cinderella 99\nRecreation of the Space Queen strain\nBreeder: TGA Genetics\nSweet mango and candy aroma\nCan bring high-energy, creative, productive effects\n\n5. Sugar Kush\nCharacteristics of Sugar Kush:\n\nIndica-dominant strain\nCross between Kandy Kush and Hash Plant\nIndoor flowering time of 9 weeks","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/08/12002116/new-strains-alert-frankenstein-lavender-jones-purple-paralysis-sp.jpg","urlslug":"/news/strains-products/new-strains-alert-frankenstein-lavender-jones-purple-paralysis-sp"}],"reviewCount":23,"flavors":[],"effects":[{"name":"Creative","score":11.607142857142858},{"name":"Uplifted","score":10.714285714285714},{"name":"Focused","score":10.714285714285714},{"name":"Energetic","score":9.8214285714285712},{"name":"Euphoric","score":8.0357142857142865}],"symptoms":[{"name":"Pain","score":7.1428571428571423},{"name":"Stress","score":7.1428571428571423},{"name":"Depression","score":3.5714285714285712},{"name":"Fatigue","score":3.5714285714285712},{"name":"Nausea","score":0.89285714285714279}],"conditions":[{"name":"Migraines","score":5.3571428571428568},{"name":"Anxiety","score":4.4642857142857144},{"name":"ADD/ADHD","score":0.89285714285714279},{"name":"Hypertension","score":0.89285714285714279}],"negatives":[{"name":"Dry Mouth","score":8.9285714285714288},{"name":"Dry Eyes","score":6.25},{"name":"Dizzy","score":2.6785714285714284},{"name":"Paranoid","score":0.89285714285714279}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/space-jill_100x100_ddab.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/185488/b/space-jill_825x550_98a1.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/space-jill_100x100_4026.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/21207/b/space-jill_825x550_6874.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/space-jill_100x100_d6ed.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/21117/b/space-jill_825x550_667c.jpg"}],"photoTotalCount":3,"popularCities":[],"permalink":"https://mobileapi.leafly.com/sativa/space-jill","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3.65217391304348/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Space Queen","subtitle":null,"slug":"space-queen","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/space-queen","symbol":"Sq","applink":"leafly://strain/space-queen"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":55,"outdoorFinish":null,"height":"Tall","averageYield":"Medium","environment":"Indoor","growNotes":""}}
