{
    "aka": "allenwrench",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1513640241000)/",
            "id": "contentitems-52211",
            "text": "Leafly’s Faves is a series providing a glimpse into the strains, products, and brands that our team of cannabis aficionados is buying, consuming, and enjoying the most every year. Some are entirely new to the market, while others are simply perennial favorites that we can’t recommend enough. Below, find our crew’s favorite cannabis strains of 2017. How many have you tried? What was your favorite strain of 2017? Share with us in the comments below!\n\nPlushberry\nAn introspective indica that won’t put you to sleep, Plushberry is the perfect strain for enjoying some peace and quiet. Relax with the aroma of lavender wrapped up in this cross of two more of our faves: Space Queen and Black Cherry Soda.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\n11 Unsung Cannabis Strains Worth Discovering\n\nLemonder\nFor a light, euphoric strain that offers bright flavors of lemon and pine, track down the balanced Seattle-native hybrid Lemonder. A cross between Lavender, Super Lemon Haze, and OG Kush, we love its mentally stimulating qualities that don’t overwhelm.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\nWhat Are You Smoking? Episode 18\nThe Top THC-Dominant Strains of Washington State in Fall 2017\n\nAllen Wrench\nA child of popular parents (Trainwreck and NYC Diesel), the sour sativa Allen Wrench packs a punch of upbeat energy. We love harnessing its powerful cerebral qualities and energy-boosting characteristics on busy days.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\n6 Cannabis Strains to Help You Stay Productive\nThese Cannabis Strains All Have Unique Cannabinoids\n\n\nDutchberry\nRinging in at around 8% CBD and 27% THC, the giggle-inducing hybrid Dutchberry takes on the best attributes of its Dutch Treat and DJ Short Blueberry parents. A particularly delicious strain, we can’t get enough of the berry and citrus flavors that accompany this happy high.\nAlso featured in: Smoke This, Play That Vol. 4\nSunset Sherbet\nThe potent hybrid Sunset Sherbet is a powerful, full-body strain that will take you to new heights with its cerebral stimulation. We’ve been filling our bongs with a hefty dose to melt away stress and bask in a richly euphoric high.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\nThe 10 Cannabis Strains You Must Try This Summer\nTop Trending Strains of 2015\nTips for Growing Sunset Sherbet Cannabis\n\nDark Side of the Moon\nInspired by the famous Pink Floyd album, Dark Side of The Moon is a sweet indica that we like to reserve for right before bedtime. For the perfect nightcap after a stressful day, we recommend packing your favorite pipe and slipping into an elevated slumber.\nAlso featured in: May the Fourth Be With You: The Best Strains to Celebrate the Galactic Star Wars Holiday\n\nSpace Queen\nWith sweet dessert aromas including notes of vanilla, cherry, and apple, the hybrid Space Queen helped us stay upbeat in 2017. Perfect for daytime use, Space Queen’s sativa qualities deliver a buzzy kick that will keep you going (despite its indica Romulan roots).\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\nCelebrate 10 Famous 4/20 Birthdays With These Strain Pairings\nWhich Cannabis Strain Pairs Best With your Zodiac Sign?\n7 ‘Eye Candy’ Movies to Pair With Your Favorite Strain\n\nWhite Tahoe Cookies\nThe strong indica that is White Tahoe Cookies was practically made for lazy days. With sedative effects that build with each hit, you’ll want to park somewhere comfortable and clear your schedule for a cozy day in (we’ve found White Tahoe Cookies to be very hyggelig).\nHarlequin\nThe CBD-rich sativa Harlequin delivers a stress-melting 5:2 CBD:THC ratio that expertly crushes anxiety and pain without the intoxicating effects. A Columbia Gold and Swiss landrace descendant, Harlequin is a preferred strain for those among us who are medical patients as well as the many of us who simply love CBD.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\nTips for Growing Harlequin Cannabis\n7 High-Energy Strains to Help You Get Active and Fight Fatigue\nHigh CBD Products for Medical Marijuana Patients\nWhat Are the Best Cannabis Stains for Pain?\n\n\nDancehall\nSuitable for social gatherings and celebratory occasions, the hybrid Dancehall is an aptly named energy-boosting strain. We’ve been loading up our vaporizers before concerts, parties, festivals, and all manner of exciting events.\nAlso featured in:\n\nThe 100 Cannabis Strains You Must Try Before You Die\n11 Unsung Cannabis Strains Worth Discovering\n\nPurple Trainwreck\nBorn from the powerhouse combination of Trainwreck and Mendocino Purps, hybrid Purple Trainwreck is the go-to strain for laughing fits and cerebral stimulation. We’ve been keeping it on hand for its tasty notes of pine, lavender, and citrus.\nAlso featured in:\n\nTips for Growing Purple Trainwreck Cannabis\n10 Products to Pick Up Before 4/20\nThe 10 Cannabis Strains You Must Try This Summer\n\nLead image by Julia Sumpter/Leafly",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/18151942/leafly-faves-strains-2017.jpg",
            "title": "Leafly's Faves 2017: Strains",
            "urlslug": "/news/strains-products/leaflys-faves-2017-strains"
        },
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1466571600000)/",
            "id": "contentitems-3800",
            "text": "Cannabis and THC affect people differently. For many first-time users, cannabis can feel very sedative and “stoney,” leading many to believe these relaxing attributes are native to all cannabis. However, more seasoned cannabis consumers may employ many different strains for different situations, using cannabis like an herb or spice to add dimension to whatever activity they’re engaged in and help boost their productivity.\nAs a budtender, I overcome lethargy, insomnia, social anxiety, and writer’s block by pairing specific strains with particular activities so I can feel more productive. In my opinion, productivity is the surplus energy that emerges as the result of taking care of yourself (and your body). Cannabis can be a motivating force that rewards the user as they overcome their own productivity obstacles.\nHere are six strains that may help boost your productivity, giving you the lift you need to exercise, tick off your to-do list, or get through a busy day.\nChemdawg\n \nChemdawg is one of my favorite strains to smoke before going for a run.\nVery calming. Felt productive and active for a bit, then relaxed, not sleepy. –PurmaBurn\nAllen Wrench\n \nAllen Wrench brings clarity to the mind and even more energy to the body. As a budtender, I recommended this as a replacement for a cup of coffee.\nDoes exactly what it’s supposed to do. I was getting a bit stressed and needed something to calm me down while [cheering] me up and this was exactly what I need. Everything was great during my high and I was also still productive! Allen Wrench is now my favorite strain. –Graynug\nJack Herer\n \nThe legendary Jack Herer is similar to Allen Wrench in terms of the mental clarity it offers.\nGood sativa for productivity. Not spacey or dreamy. Sitting makes me bored with this strain. I only vaporize a very small amount in a classic log vape roughly every 1.5 hours while staying busy. Great strain for the odd job around the house you’ve been putting off! (I’ve done a few today and a couple more on tap for a productive Sunday). Pain? What pain? Bummed? Who me? No! –PieceFrog\nCinex\n \nCinex is another clarity-enhancing strain that delivers a sustained burst of energy.\nOne of my favorite strains. Musty earthy aroma with a hint of citrus. Hits hard but quickly subsides to a manageable and productive high. Great strain to open up all the windows, blast music, and get some spring cleaning done! –DJkwonderbread\nDurban Poison\n \nDurban Poison is an African landrace with so much energy, even daily smokers use this sativa with care. If you want that “speedy” feeling, this is your pick.\nI love this strain it uplifts my spirits and allows me to stay productive throughout the day. If you want to get things done, smoke some Durban. –HaysonA\nDutch Treat\n \nDutch Treat is a mid-level hybrid that ultimately transforms into a relaxing euphoria.\nVery pleasant, very earthy flavor. Smoked a joint and had a wonderfully productive morning, but now people have arrived at the office and I’m extra talkative / easily distracted. …. Now after 3 joints my eyes are dry, my mouth is dry and… uhhh.. –Millenion\nLooking for more productive strains? Check out our list and choose one that sounds like it could provide the effects you want.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/16214752/strains-to-help-you-stay-productive.jpg",
            "title": "6 Cannabis Strains to Help You Stay Productive",
            "urlslug": "/news/strains-products/strains-to-help-you-stay-productive"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 36.40591179653679
        },
        {
            "name": "ADD/ADHD",
            "score": 22.66470508658009
        },
        {
            "name": "PTSD",
            "score": 21.399824134199136
        },
        {
            "name": "PMS",
            "score": 11.788081709956712
        },
        {
            "name": "Arthritis",
            "score": 9.481534090909092
        }
    ],
    "description": "<p>A popular strain for sativa-lovers, Allen Wrench presents the best qualities of its parents, <a href=\"http://www.leafly.com/hybrid/trainwreck\">Trainwreck</a> and <a href=\"http://www.leafly.com/hybrid/nyc-diesel\">NYC&nbsp;Diesel</a> with crisp flavors of sour fruit. Its aroma has been characterized as sour&nbsp;and flowery, leaving a lingering scent of fruit.&nbsp;Allen Wrench is known to provide users with a long-lasting cerebral high and fill an entire room with its strong essence. The buds have a dark-green color and dark foliage with orange pistils growing out. Allen Wrench also has a&nbsp;10-11 week&nbsp;flowering time and medium to medium-high THC content.</p>\n",
    "descriptionPlain": "A popular strain for sativa-lovers, Allen Wrench presents the best qualities of its parents, Trainwreck and NYC&nbsp;Diesel with crisp flavors of sour fruit. Its aroma has been characterized as sour&nbsp;and flowery, leaving a lingering scent of fruit.&nbsp;Allen Wrench is known to provide users with a long-lasting cerebral high and fill an entire room with its strong essence. The buds have a dark-green color and dark foliage with orange pistils growing out. Allen Wrench also has a&nbsp;10-11 week&nbsp;flowering time and medium to medium-high THC content.\n",
    "effects": [
        {
            "name": "Focused",
            "score": 74.46732954545453
        },
        {
            "name": "Creative",
            "score": 70.80289502164501
        },
        {
            "name": "Uplifted",
            "score": 69.5988906926407
        },
        {
            "name": "Energetic",
            "score": 67.94338474025975
        },
        {
            "name": "Euphoric",
            "score": 66.32000811688312
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 10.918898809523808
        },
        {
            "name": "Diesel",
            "score": 10.132575757575758
        },
        {
            "name": "Citrus",
            "score": 9.00297619047619
        },
        {
            "name": "Woody",
            "score": 6.138392857142857
        },
        {
            "name": "Pungent",
            "score": 5.915178571428571
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1417317,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "And then there's Allen Wrench. When it comes to the Wrench, don't flail around with grams: go right for an eighter. You'll appreciate the bag of High Times centerfold buds -- compact, rippled with red hairs and powdered with a dusting of white crystals; this is some of da kind that demands your attention. Don't just snap off a bud and cram it in your pipe, you fucking Philistine! No, stop and admire. Breathe in the chemically scent. Give it the ol' pinch-test for density. THEN cram it in your pipe and smoke it! 15 minutes later when you're laughing your ass off at \"Action Bronson Watches Ancient Aliens\", try to give a fuck about something. Protip: you won't be able to! That's because Allen Wrench absorbs 10,000 times its own weight in fucks! Dinner's three hours late? Don't give a fuck. Car's being re-possessed? Don't give a fuck. Cat's speaking Swahili and your third eye is now projecting Dan Deacon videos? I told you to lay off those bathsalts, motherfucker! Who needs that shit when you've got a miracle like Allen Wrench smouldering in your pipe? Hit that shit quick before it all goes up in smoke! \"Waste not the Allen,\" sayth the dude sitting to your right who has been waiting for you to pass that pipe since you started reading this shit. And do you give a fuck? No? Exactly.",
            "username": "StukaFox"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1639490,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "This is an incredible \"get shit done\" strain. It rewards you with great levels of focus and creativity and are really helpful for add. Helped me read and take notes for HOURS",
            "username": "Mimithehamham"
        }
    ],
    "id": 4196,
    "name": "Allen Wrench",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 28.877502705627705
        },
        {
            "name": "Dry Eyes",
            "score": 13.090165043290046
        },
        {
            "name": "Anxious",
            "score": 2.5669642857142856
        },
        {
            "name": "Headache",
            "score": 2.3065476190476186
        },
        {
            "name": "Dizzy",
            "score": 1.3020833333333335
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/trainwreck",
            "category": "Hybrid",
            "name": "Trainwreck",
            "permalink": "https://mobileapi.leafly.com/hybrid/trainwreck",
            "slug": "trainwreck",
            "subtitle": null,
            "symbol": "Tw"
        },
        {
            "applink": "leafly://strain/nyc-diesel",
            "category": "Hybrid",
            "name": "NYC Diesel",
            "permalink": "https://mobileapi.leafly.com/hybrid/nyc-diesel",
            "slug": "nyc-diesel",
            "subtitle": null,
            "symbol": "Nyc"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/allen-wrench",
    "photoTotalCount": 26,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/508787/b/allen-wrench__primary_967c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/allen-wrench_100x100_8b4b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500914/b/allen-wrench__primary_d260.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/allen-wrench_100x100_42e2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/501011/b/allen-wrench__primary_b3af.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/allen-wrench_100x100_e6e2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500850/b/allen-wrench__primary_9c3f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/allen-wrench_100x100_ad4f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/500556/b/allen-wrench__primary_0e09.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/allen-wrench_100x100_c25a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/493037/b/allen-wrench__primary_dcdb.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/allen-wrench_100x100_a840.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Portland, OR",
        "Spokane, WA",
        "Everett, WA",
        "Lynnwood, WA",
        "Bothell, WA",
        "San Diego, CA",
        "Tacoma, WA",
        "Beaverton, OR",
        "Longview, WA"
    ],
    "rating": 4.28,
    "relatedStrains": [],
    "reviewCount": 163,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "allen-wrench",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.2760736196319/240",
    "subtitle": null,
    "symbol": "Aw",
    "symptoms": [
        {
            "name": "Stress",
            "score": 51.1515827922078
        },
        {
            "name": "Depression",
            "score": 39.49370941558441
        },
        {
            "name": "Fatigue",
            "score": 33.70873917748918
        },
        {
            "name": "Pain",
            "score": 32.05323322510822
        },
        {
            "name": "Lack of Appetite",
            "score": 30.490733225108222
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
