{"sl_translate":"description,descriptionPlain,category","id":7741,"slug":"green-haze","name":"Green Haze","subtitle":null,"symbol":"Gnz","category":"Sativa","description":"\u003cp\u003eGreen Haze by A.C.E. Seeds is another version of their sativa Oldtimers Haze and takes after her Thai and South Indian ancestry. Like its Haze parentage, Green Haze is\u0026nbsp;\u003cspan style=\"line-height: 1.6em;\"\u003ealso upbeat and\u0026nbsp;verging on psychedelic for some. This sativa plant is truly for someone who loves growing as it can take a full 16-20 weeks to flower. Green Haze grows tall and is a lookalike of \u003c/span\u003e\u003ca href=\"http://www.leafly.com/sativa/purple-haze\" style=\"line-height: 1.6em; text-decoration: none;\"\u003ePurple Haze\u003c/a\u003e\u003cspan style=\"line-height: 1.6em;\"\u003e except for, of course, the color. The flowers will have a woody smell mixed with fruit. Green Haze has a high potency and is good for tackling pain, though it may also inspire some serious snacking.\u003c/span\u003e\u003c/p\u003e\n","descriptionPlain":"Green Haze by A.C.E. Seeds is another version of their sativa Oldtimers Haze and takes after her Thai and South Indian ancestry. Like its Haze parentage, Green Haze is\u0026nbsp;also upbeat and\u0026nbsp;verging on psychedelic for some. This sativa plant is truly for someone who loves growing as it can take a full 16-20 weeks to flower. Green Haze grows tall and is a lookalike of Purple Haze except for, of course, the color. The flowers will have a woody smell mixed with fruit. Green Haze has a high potency and is good for tackling pain, though it may also inspire some serious snacking.\n","aka":null,"rating":3.81,"highlightedReviews":[{"id":1411099,"username":"Halfbl8d","text":"Great for the price. I swear I saw a tree with a nose.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1480759,"username":"Cameron_Kush","text":"Hard hitting head high. Good taste, made me extremely talkitive and kinda productive good daytime strain","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2973","title":"24 Strains to Prepare You for the Game of Thrones Season 4 Premiere","author":"Rebecca Kelley","category":null,"date":"\/Date(1396641600000)\/","text":"We’re big fans of Game of Thrones here at Leafly and the crew is super stoked for the season 4 debut this Sunday on HBO. If you’re planning on hosting a viewing party to kick off the premiere of one of the best shows on television, why not pick up some of these Game of Thrones-themed strains to properly celebrate?\nHere are 24 strains (some standing solo, some paired together) we feel tie in with the Game of Thrones universe perfectly (spoilers below if you aren’t caught up to season 4 by now). Yes, 24. That’s how much we love both our strains and this show. Even though All Men Must Die, their memories will live on thanks to this list of green.\n1. Mad Dawg \n\nThis earthy hybrid is in honor of Mad King Aerys II Targaryen, the kooky ruler who started this whole mess in the first place. Dude, all you had to do was not murder a bunch of people and threaten to burn down King’s Landing and we wouldn’t even have a Game of Thrones battle royale waging. If only he had a little stash of Mad Dawg to keep him feeling euphoric and relaxed.\n2. 3 Kings\n\nThe hybrid 3 Kings strain may be a fusion of Headband, Sour Diesel, and OG Kush, but it also signifies the three kings currently left standing in Game of Thrones at the start of season 4: Joffrey Lannister (aka The Worst Person Ever), Stannis Baratheon (aka “Stannis the Mannis,” self-proclaimed King of the Andals), and Balon Greyjoy (aka World’s Not-Greatest Dad), king of the Iron Islands. Maybe this pungent strain will clear some of the crazy out of their sinuses.\n3. Permafrost\n\nBecause, as House Stark constantly reminds us, “Winter is coming,” so you might as well hunker down and wait for it to arrive with some piney Permafrost.\nSpeaking of House Stark…\n4. Northern Lights\n\nThe North remembers, and though their numbers are dwindling and the Starks are constantly having George R. R. Martin take a never-ending dump on them, there are still a few scrappy surviving members who have a glimmer of hope shining, however dimly at the moment. Northern Lights is good for combating stress, and I’m guessing the Starks are feeling a little overwhelmed right about now.\n5. Lions Gate\n\nThis royal purple indica is in honor of the proud and wealthy Lannisters, who happen to use a lion as their sigil. The Lannisters appear to be sitting pretty right now – they rule the Seven Kingdoms, Jamie’s been returned (mostly intact), Tywin’s only been moderately cranky – but we’ll see if their good luck streak will continue in season 4. They’ll need the focus that the Lions Gate strain brings.\n6. Richie Rich + Power Kush \n\nSpeaking of Tywin Lannister, if you combine the hybrid Richie Rich with the indica Power Kush, you’ll have a father who loves to play the game more than he loves his own family. I bet he’s sneering in every family portrait that’s been commissioned – it’s the ye olde equivalent of blinking in photos.\n7. Killer Queen + Sour Power \n\nSticking with the Lannisters, let’s shift gears to Cersei, former queen of Westeros and current queen of the “Who farted?” face. A Killer Queen willing to do whatever it takes to get as close to the Iron Throne as possible, this icy blonde beauty has felt her power go a little sour once she realized that her turd of a son can’t be controlled. Talk about a disappointed parent. She really takes after her father, doesn’t she?\n8. Little Devil + Abusive OG\n\nUgh, Joffrey is the worst. We can’t think of a better pairing for the little pissant than the hybrid Little Devil and the indica Abusive OG. If ever King Joffrey’s horrible ways feel a little too heavy for your tastes, just remember that he got b-slapped by the best character ever:\n\nSpeaking of which…\n9. Royal Dwarf \n\nTyrion Lannister is rumored to be one of the characters George R. R. Martin’s wife made him promise he would never kill off. I think every Game of Thrones fan can agree – even though he’s a Lannister, he’s still a Royal Dwarf and one of the best characters on the show.\nAnother favorite character?\n10. Jane Doe + Odyssey \n\nFierce little Arya Stark has seen many of her family members fall victim to the Game of Thrones and now she’s out for blood. This pint-sized warrior in the making has abandoned her identity and gone all Jane Doe in an attempt to take out the people on her shit list. How will her revenge Odyssey pan out?\n11. Critical Mass\n\nSticking with the Starks, we’ve never had a drastic shift in character sympathy than for poor Sansa. Sure, she was a naive, stuck-up teenager in season 1, but she’s had most of her family murdered, been held prisoner, and was nearly forced to marry a psychopath Lannister before being forced to marry another Lannister. Tyrion’s been kind to her so far but honestly, how much more suffering do you have in store for Sansa, George R. R. Martin? She seems to be at Critical Mass right now and could use a little of the happy effects this indica brings.\nKnow who else is feeling a little blue?\n12. Blue Bastard \n\nOh, Jon Snow. The bastard son of Ned Stark has been on his own Odyssey but he can’t seem to make up his mind as to what he wants (maybe he really does know “nuthing”). Is it revenge for the Starks? Does he want to protect the Night’s Watch or defect from them? Or maybe he wants to catch a glimpse of another Ogre with Ygritte (although “Jon Snuhhhh” isn’t exactly in her good graces right now). It’s been a depressing journey for him thus far – good thing Blue Bastard is good for relieving depression.\n13. White Zombie + Snow Monster\n\nWe’ve already seen a few of the horrors that lie north of the Wall, including a White Zombie who looked like a frigid Iggy Pop. Can Jon Snow protect the Seven Kingdoms from the Snow Monsters that are advancing?\n14. Super Sour Widow \n\nPoor Catelyn Stark. Even though she could never love the bastard Jon Snow, she still didn’t deserve to have her entire family either murdered or scattered across the Seven Kingdoms. Talk about a Super Sour Widow.\nAnd to make matters worse…\n15. Red Haze \n\nThat Red Wedding was effed up, yo. Like seriously. After watching that episode, you probably felt as amped up as the effects the sativa Red Haze can bring (and you were likely in a Red Haze of your own once “The Rains of Castamere” started playing).\n16. Blackwater + Green Haze\n\nAnother iconic moment in Game of Thrones, this event was less heart-breaking than the Red Wedding and more awe-inspiring. The Battle of the Blackwater has been the biggest battle in the War of the Five Kings so far. Tyrion’s use of wildfire put Stannis’ army in a Green Haze and protected King’s Landing from being overrun. By combining the indica Blackwater and the sativa Green Haze, you’re creating quite the explosive hybrid strain yourself.\n17. Cherry Bomb\n\nCherry Bomb continue to deliver (both literally and figuratively), or will her influence over him go up in flames?\n \n18. Anesthesia\n\nA little something both Jaime Lannister and Theon Greyjoy could have used throughout season 3, amirite guys? The indica Anesthesia is widely used for pain management, making it an appropriate option for these two whipping boys.\n19. Lifesaver\n\nJaime owes you one, Brienne of Tarth. Why not have him pick up this euphoric hybrid Lifesaver strain while you two bathe and reminisce about the time you both faced off against a friggin’ grizzly bear?\n20. Brains Damage\n\nWhat better way to celebrate the possibly brain-damaged but entertainingly verbose Hodor with this Hodor, I mean hybrid strain that brings sleepiness, Hodor, and Hodor Hodor.\n21. Bordello\n\nAny Game of Thrones viewer is all-too familiar with the show’s numerous “sexposition” scenes that occur in a brothel or during sex scenes to spruce up an otherwise boring plot advancement. Take a taste of the hybrid Bordello whenever a sexposition scene pops up and you’ll feel so relaxed, you’ll forget how shamelessly (and entertainingly) gratuitous these parts actually are.\n22. True OG \n\nWho will end up winning the Game of Thrones? Who do you feel is the rightful ruler of the Seven Kingdoms? Partake in this relaxing indica while you ponder who you feel the “True OG” should be.\nWill it be…\n23. Dream Queen + Triple Diesel\n\nMany Game of Thrones fans are rooting for their “Dream Queen,” Daenerys Targaryen, who’s using her Triple Diesel dragons to kick ass, free slaves, and chew bubblegum (and she’s all out of bubblegum).\nAnd finally…\n24. F*cking Incredible\n\nWhich is exactly what this show is. Happy watching!\nImage credits: mad king, House Lannister","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12001238/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie.jpg","urlslug":"/news/strains-products/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie"},{"id":"contentitems-3183","title":"Luck o\u0027 the Irish: 15 \u0027Green\u0027 Strains to Help You Celebrate St. Patrick\u0027s Day","author":"Rebecca Kelley","category":null,"date":"\/Date(1395091560000)\/","text":"Even if you haven’t got a little Irish in ya, most everyone enjoys celebrating St. Patrick’s Day. After all, it’s an excuse to drink some Guinness, eat some soda bread and corned beef with hash, and pinch forgetful friends who aren’t wearing some hue of green today. This being Leafly, of course, we have a list of strains with a little “green” in them to help you further celebrate a fun little holiday.\nWithout further ado, here are 15 green-themed cannabis strains:\n  1. Green Candy\nType: sativa\nTop flavors: sweet, citrus, minty\nTop effects: happy, euphoric, energetic\nTop medical uses: pain, stress, depression\nSample review:\n“One of the top 5 sativas. I always want this as part of my available medications.” – Crucian1\n  2. Green Crack\nType: sativa\nTop flavors: sweet\nTop effects: euphoric, uplifted, energetic\nTop medical uses: stress, depression, pain\nSample review:\n“I love this strain. Gives me a light, pleasant high that’s perfect to unwind and listen to music to. Especially with friends! Definitely try this, people!” – EmAy55\n  3. Green Crack Extreme\nType: sativa\nTop flavors: sweet, citrus, minty\nTop effects: euphoric, happy, uplifted\nTop medical uses: stress, fatigue, depression\nSample review:\n“Its [sic] a step above most sativa strains and probably some of the best Sativas available.” – Crucian1\n  4. Green Door Kush\nType: hybrid\nTop flavors: lemon, sweet\nTop effects: creative, euphoric, happy\nTop medical uses: nausea, insomnia, muscle spasms\nSample review:\n“Love the taste and smell. Some great stuff even for a long time smoker, but if you a new be, be careful” – KevinlovesBud\n  5. Green Dream\nType: hybrid\nTop flavors: minty, pine, spicy/herbal\nTop effects: euphoric, happy, uplifted\nTop medical uses: stress, depression, pain\nSample review:\n“I love this strain. I was cleaning and organizing my house like crazy. Very talkative and energetic. Amazing day high.” – KSlizzle\n  6. Green Goblin\nType: sativa\nTop flavors: diesel, grapefruit, pine\nTop effects: euphoric, uplifted, happy\nTop medical uses: stress, pain, depression\nSample review:\n“Very good strain. No heavy eyes. No laziness. Very uplifting feeling and sense if [sic] euphoria.” – Anonymous\n  7. Green Haze\nType: sativa\nTop flavors: pine, tea, woody\nTop effects: focused, uplifted, euphoric\nTop medical uses: pain, nausea, stress\nSample review:\n“Great Strain for anxiety, make u feel really up and euphoric great for focusing and just taking on the day” – Eric420\n  8. Green Hornet\nType: hybrid\nTop flavors: none tagged — leave a review!\nTop effects: euphoric, focused, happy\nTop medical uses: depression, pain, stress\nSample review:\n“DELICIOUS!!! My tummy was hurting this morning but after a little green hornet in my bowl I’m feeling ready to take on the day!” – AZCSWestPhx\n  9. Green Kush\nType: indica\nTop flavors: sweet, apricot, honey\nTop effects: euphoric, relaxed, focused\nTop medical uses: pain, depression, stress\nSample review:\n“Very very potent strain, gets you a very heavy body high along with a bit of a head high. Prepare to turn into potato, but great for parties/groups. Very stoned.” – Anonymous\n  10. Green Monster\nType: hybrid\nTop flavors: earthy, pine, pungent\nTop effects: sleepy, relaxed, happy\nTop medical uses: insomnia, stress, depression\nSample review:\n“i either have some strong shit or its [sic] all this good haha at least as good as green crack, mabie [sic] better” – Anonymous\n  11. Green Queen\nType: hybrid\nTop flavors: spicy/herbal, earthy, nutty\nTop effects: happy, uplifted, euphoric\nTop medical uses: stress, nausea, depression\nSample review:\n“Green queen is my go to when I need to be productive. This is the most productive strain I’ve used with the least amount of anxiety. Can also be very giggly.” – ChristWithAY\n  12. Green Ribbon\nType: hybrid\nTop flavors: citrus, pungent, skunk\nTop effects: energetic, happy, uplifted\nTop medical uses: stress, nausea, pain\nSample review:\n“One of only two strains I’ve ever smoked that’s given me energy. I find that my thoughts are very focused, and I can carry on conversations exceptionally well. Great strain for sitting around and talking. Very social strain. It actually made me want to dance!” – Anonymous\n  13. Lime Green Skunk\nType: hybrid\nTop flavors: none tagged — leave a review!\nTop effects: uplifted, happy, euphoric\nTop medical uses: stress, pain, insomnia\nSample review:\n“Have enjoyed this strian very much. A very great energetic high, that really seems to mute grey down feelings both mentally and physically, and bring out higher, more talkitive [sic] sides. Very great for every aspect of enjoyment.” – Anonymous\n  14. Martian Mean Green\nType: hybrid\nTop flavors: sweet, blue cheese, grapefruit\nTop effects: relaxed, euphoric, uplifted\nTop medical uses: inflammation, nausea, stress\nSample review:\n“It creeps up on you, makes you laugh and relieves pain. All around good time for a few hours.” – gurren_lynx\n  15. Super Green Crack\nType: sativa\nTop flavors: spicy/herbal, woody, diesel\nTop effects: energetic, creative, happy\nTop medical uses: stress, pain, fatigue\nSample review:\n“BOMB Very mental.” – PuffPuffington911","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/03/12001842/luck-o-the-irish-15-green-strains-to-help-you-celebrate-the-st-pa.jpg","urlslug":"/news/strains-products/15-green-strains-to-celebrate-st-patricks-day"}],"reviewCount":32,"flavors":[{"name":"Woody","score":14.375},{"name":"Flowery","score":13.75},{"name":"Earthy","score":13.75},{"name":"Spicy/Herbal","score":1.875},{"name":"Tea","score":1.875}],"effects":[{"name":"Happy","score":33.75},{"name":"Talkative","score":31.25},{"name":"Creative","score":31.25},{"name":"Focused","score":20},{"name":"Hungry","score":18.125}],"symptoms":[{"name":"Pain","score":5.625},{"name":"Depression","score":5},{"name":"Stress","score":5},{"name":"Lack of Appetite","score":3.75},{"name":"Nausea","score":3.75}],"conditions":[{"name":"Anxiety","score":5.625},{"name":"ADD/ADHD","score":3.125},{"name":"PTSD","score":2.5},{"name":"Asthma","score":1.25},{"name":"Hypertension","score":1.25}],"negatives":[{"name":"Dry Eyes","score":6.8750000000000009},{"name":"Dry Mouth","score":6.8750000000000009},{"name":"Headache","score":2.5},{"name":"Paranoid","score":1.875},{"name":"Anxious","score":1.875}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_6986.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/452394/b/green-haze__primary_f3cf.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_645e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/431705/b/green-haze__primary_c1d9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_f695.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/271181/b/green-haze__primary_b2ce.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_0d13.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/82023/b/green-haze_825x550_5ef3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_18a8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/28844/b/green-haze_825x550_9f7a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_qa5nn451.0rg.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/17110/b/green-haze_825x550_qatsb4pr.50j.jpg"}],"photoTotalCount":6,"popularCities":["Bothell, WA","Everson, WA"],"permalink":"https://mobileapi.leafly.com/sativa/green-haze","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3.8125/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Haze","subtitle":null,"slug":"haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/haze","symbol":"H","applink":"leafly://strain/haze"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":7741,"slug":"green-haze","name":"Green Haze","subtitle":null,"symbol":"Gnz","category":"Sativa","description":"\u003cp\u003eGreen Haze by A.C.E. Seeds is another version of their sativa Oldtimers Haze and takes after her Thai and South Indian ancestry. Like its Haze parentage, Green Haze is\u0026nbsp;\u003cspan style=\"line-height: 1.6em;\"\u003ealso upbeat and\u0026nbsp;verging on psychedelic for some. This sativa plant is truly for someone who loves growing as it can take a full 16-20 weeks to flower. Green Haze grows tall and is a lookalike of \u003c/span\u003e\u003ca href=\"http://www.leafly.com/sativa/purple-haze\" style=\"line-height: 1.6em; text-decoration: none;\"\u003ePurple Haze\u003c/a\u003e\u003cspan style=\"line-height: 1.6em;\"\u003e except for, of course, the color. The flowers will have a woody smell mixed with fruit. Green Haze has a high potency and is good for tackling pain, though it may also inspire some serious snacking.\u003c/span\u003e\u003c/p\u003e\n","descriptionPlain":"Green Haze by A.C.E. Seeds is another version of their sativa Oldtimers Haze and takes after her Thai and South Indian ancestry. Like its Haze parentage, Green Haze is\u0026nbsp;also upbeat and\u0026nbsp;verging on psychedelic for some. This sativa plant is truly for someone who loves growing as it can take a full 16-20 weeks to flower. Green Haze grows tall and is a lookalike of Purple Haze except for, of course, the color. The flowers will have a woody smell mixed with fruit. Green Haze has a high potency and is good for tackling pain, though it may also inspire some serious snacking.\n","aka":null,"rating":3.81,"highlightedReviews":[{"id":1411099,"username":"Halfbl8d","text":"Great for the price. I swear I saw a tree with a nose.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1480759,"username":"Cameron_Kush","text":"Hard hitting head high. Good taste, made me extremely talkitive and kinda productive good daytime strain","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2973","title":"24 Strains to Prepare You for the Game of Thrones Season 4 Premiere","author":"Rebecca Kelley","category":null,"date":"\/Date(1396641600000)\/","text":"We’re big fans of Game of Thrones here at Leafly and the crew is super stoked for the season 4 debut this Sunday on HBO. If you’re planning on hosting a viewing party to kick off the premiere of one of the best shows on television, why not pick up some of these Game of Thrones-themed strains to properly celebrate?\nHere are 24 strains (some standing solo, some paired together) we feel tie in with the Game of Thrones universe perfectly (spoilers below if you aren’t caught up to season 4 by now). Yes, 24. That’s how much we love both our strains and this show. Even though All Men Must Die, their memories will live on thanks to this list of green.\n1. Mad Dawg \n\nThis earthy hybrid is in honor of Mad King Aerys II Targaryen, the kooky ruler who started this whole mess in the first place. Dude, all you had to do was not murder a bunch of people and threaten to burn down King’s Landing and we wouldn’t even have a Game of Thrones battle royale waging. If only he had a little stash of Mad Dawg to keep him feeling euphoric and relaxed.\n2. 3 Kings\n\nThe hybrid 3 Kings strain may be a fusion of Headband, Sour Diesel, and OG Kush, but it also signifies the three kings currently left standing in Game of Thrones at the start of season 4: Joffrey Lannister (aka The Worst Person Ever), Stannis Baratheon (aka “Stannis the Mannis,” self-proclaimed King of the Andals), and Balon Greyjoy (aka World’s Not-Greatest Dad), king of the Iron Islands. Maybe this pungent strain will clear some of the crazy out of their sinuses.\n3. Permafrost\n\nBecause, as House Stark constantly reminds us, “Winter is coming,” so you might as well hunker down and wait for it to arrive with some piney Permafrost.\nSpeaking of House Stark…\n4. Northern Lights\n\nThe North remembers, and though their numbers are dwindling and the Starks are constantly having George R. R. Martin take a never-ending dump on them, there are still a few scrappy surviving members who have a glimmer of hope shining, however dimly at the moment. Northern Lights is good for combating stress, and I’m guessing the Starks are feeling a little overwhelmed right about now.\n5. Lions Gate\n\nThis royal purple indica is in honor of the proud and wealthy Lannisters, who happen to use a lion as their sigil. The Lannisters appear to be sitting pretty right now – they rule the Seven Kingdoms, Jamie’s been returned (mostly intact), Tywin’s only been moderately cranky – but we’ll see if their good luck streak will continue in season 4. They’ll need the focus that the Lions Gate strain brings.\n6. Richie Rich + Power Kush \n\nSpeaking of Tywin Lannister, if you combine the hybrid Richie Rich with the indica Power Kush, you’ll have a father who loves to play the game more than he loves his own family. I bet he’s sneering in every family portrait that’s been commissioned – it’s the ye olde equivalent of blinking in photos.\n7. Killer Queen + Sour Power \n\nSticking with the Lannisters, let’s shift gears to Cersei, former queen of Westeros and current queen of the “Who farted?” face. A Killer Queen willing to do whatever it takes to get as close to the Iron Throne as possible, this icy blonde beauty has felt her power go a little sour once she realized that her turd of a son can’t be controlled. Talk about a disappointed parent. She really takes after her father, doesn’t she?\n8. Little Devil + Abusive OG\n\nUgh, Joffrey is the worst. We can’t think of a better pairing for the little pissant than the hybrid Little Devil and the indica Abusive OG. If ever King Joffrey’s horrible ways feel a little too heavy for your tastes, just remember that he got b-slapped by the best character ever:\n\nSpeaking of which…\n9. Royal Dwarf \n\nTyrion Lannister is rumored to be one of the characters George R. R. Martin’s wife made him promise he would never kill off. I think every Game of Thrones fan can agree – even though he’s a Lannister, he’s still a Royal Dwarf and one of the best characters on the show.\nAnother favorite character?\n10. Jane Doe + Odyssey \n\nFierce little Arya Stark has seen many of her family members fall victim to the Game of Thrones and now she’s out for blood. This pint-sized warrior in the making has abandoned her identity and gone all Jane Doe in an attempt to take out the people on her shit list. How will her revenge Odyssey pan out?\n11. Critical Mass\n\nSticking with the Starks, we’ve never had a drastic shift in character sympathy than for poor Sansa. Sure, she was a naive, stuck-up teenager in season 1, but she’s had most of her family murdered, been held prisoner, and was nearly forced to marry a psychopath Lannister before being forced to marry another Lannister. Tyrion’s been kind to her so far but honestly, how much more suffering do you have in store for Sansa, George R. R. Martin? She seems to be at Critical Mass right now and could use a little of the happy effects this indica brings.\nKnow who else is feeling a little blue?\n12. Blue Bastard \n\nOh, Jon Snow. The bastard son of Ned Stark has been on his own Odyssey but he can’t seem to make up his mind as to what he wants (maybe he really does know “nuthing”). Is it revenge for the Starks? Does he want to protect the Night’s Watch or defect from them? Or maybe he wants to catch a glimpse of another Ogre with Ygritte (although “Jon Snuhhhh” isn’t exactly in her good graces right now). It’s been a depressing journey for him thus far – good thing Blue Bastard is good for relieving depression.\n13. White Zombie + Snow Monster\n\nWe’ve already seen a few of the horrors that lie north of the Wall, including a White Zombie who looked like a frigid Iggy Pop. Can Jon Snow protect the Seven Kingdoms from the Snow Monsters that are advancing?\n14. Super Sour Widow \n\nPoor Catelyn Stark. Even though she could never love the bastard Jon Snow, she still didn’t deserve to have her entire family either murdered or scattered across the Seven Kingdoms. Talk about a Super Sour Widow.\nAnd to make matters worse…\n15. Red Haze \n\nThat Red Wedding was effed up, yo. Like seriously. After watching that episode, you probably felt as amped up as the effects the sativa Red Haze can bring (and you were likely in a Red Haze of your own once “The Rains of Castamere” started playing).\n16. Blackwater + Green Haze\n\nAnother iconic moment in Game of Thrones, this event was less heart-breaking than the Red Wedding and more awe-inspiring. The Battle of the Blackwater has been the biggest battle in the War of the Five Kings so far. Tyrion’s use of wildfire put Stannis’ army in a Green Haze and protected King’s Landing from being overrun. By combining the indica Blackwater and the sativa Green Haze, you’re creating quite the explosive hybrid strain yourself.\n17. Cherry Bomb\n\nCherry Bomb continue to deliver (both literally and figuratively), or will her influence over him go up in flames?\n \n18. Anesthesia\n\nA little something both Jaime Lannister and Theon Greyjoy could have used throughout season 3, amirite guys? The indica Anesthesia is widely used for pain management, making it an appropriate option for these two whipping boys.\n19. Lifesaver\n\nJaime owes you one, Brienne of Tarth. Why not have him pick up this euphoric hybrid Lifesaver strain while you two bathe and reminisce about the time you both faced off against a friggin’ grizzly bear?\n20. Brains Damage\n\nWhat better way to celebrate the possibly brain-damaged but entertainingly verbose Hodor with this Hodor, I mean hybrid strain that brings sleepiness, Hodor, and Hodor Hodor.\n21. Bordello\n\nAny Game of Thrones viewer is all-too familiar with the show’s numerous “sexposition” scenes that occur in a brothel or during sex scenes to spruce up an otherwise boring plot advancement. Take a taste of the hybrid Bordello whenever a sexposition scene pops up and you’ll feel so relaxed, you’ll forget how shamelessly (and entertainingly) gratuitous these parts actually are.\n22. True OG \n\nWho will end up winning the Game of Thrones? Who do you feel is the rightful ruler of the Seven Kingdoms? Partake in this relaxing indica while you ponder who you feel the “True OG” should be.\nWill it be…\n23. Dream Queen + Triple Diesel\n\nMany Game of Thrones fans are rooting for their “Dream Queen,” Daenerys Targaryen, who’s using her Triple Diesel dragons to kick ass, free slaves, and chew bubblegum (and she’s all out of bubblegum).\nAnd finally…\n24. F*cking Incredible\n\nWhich is exactly what this show is. Happy watching!\nImage credits: mad king, House Lannister","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12001238/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie.jpg","urlslug":"/news/strains-products/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie"},{"id":"contentitems-3183","title":"Luck o\u0027 the Irish: 15 \u0027Green\u0027 Strains to Help You Celebrate St. Patrick\u0027s Day","author":"Rebecca Kelley","category":null,"date":"\/Date(1395091560000)\/","text":"Even if you haven’t got a little Irish in ya, most everyone enjoys celebrating St. Patrick’s Day. After all, it’s an excuse to drink some Guinness, eat some soda bread and corned beef with hash, and pinch forgetful friends who aren’t wearing some hue of green today. This being Leafly, of course, we have a list of strains with a little “green” in them to help you further celebrate a fun little holiday.\nWithout further ado, here are 15 green-themed cannabis strains:\n  1. Green Candy\nType: sativa\nTop flavors: sweet, citrus, minty\nTop effects: happy, euphoric, energetic\nTop medical uses: pain, stress, depression\nSample review:\n“One of the top 5 sativas. I always want this as part of my available medications.” – Crucian1\n  2. Green Crack\nType: sativa\nTop flavors: sweet\nTop effects: euphoric, uplifted, energetic\nTop medical uses: stress, depression, pain\nSample review:\n“I love this strain. Gives me a light, pleasant high that’s perfect to unwind and listen to music to. Especially with friends! Definitely try this, people!” – EmAy55\n  3. Green Crack Extreme\nType: sativa\nTop flavors: sweet, citrus, minty\nTop effects: euphoric, happy, uplifted\nTop medical uses: stress, fatigue, depression\nSample review:\n“Its [sic] a step above most sativa strains and probably some of the best Sativas available.” – Crucian1\n  4. Green Door Kush\nType: hybrid\nTop flavors: lemon, sweet\nTop effects: creative, euphoric, happy\nTop medical uses: nausea, insomnia, muscle spasms\nSample review:\n“Love the taste and smell. Some great stuff even for a long time smoker, but if you a new be, be careful” – KevinlovesBud\n  5. Green Dream\nType: hybrid\nTop flavors: minty, pine, spicy/herbal\nTop effects: euphoric, happy, uplifted\nTop medical uses: stress, depression, pain\nSample review:\n“I love this strain. I was cleaning and organizing my house like crazy. Very talkative and energetic. Amazing day high.” – KSlizzle\n  6. Green Goblin\nType: sativa\nTop flavors: diesel, grapefruit, pine\nTop effects: euphoric, uplifted, happy\nTop medical uses: stress, pain, depression\nSample review:\n“Very good strain. No heavy eyes. No laziness. Very uplifting feeling and sense if [sic] euphoria.” – Anonymous\n  7. Green Haze\nType: sativa\nTop flavors: pine, tea, woody\nTop effects: focused, uplifted, euphoric\nTop medical uses: pain, nausea, stress\nSample review:\n“Great Strain for anxiety, make u feel really up and euphoric great for focusing and just taking on the day” – Eric420\n  8. Green Hornet\nType: hybrid\nTop flavors: none tagged — leave a review!\nTop effects: euphoric, focused, happy\nTop medical uses: depression, pain, stress\nSample review:\n“DELICIOUS!!! My tummy was hurting this morning but after a little green hornet in my bowl I’m feeling ready to take on the day!” – AZCSWestPhx\n  9. Green Kush\nType: indica\nTop flavors: sweet, apricot, honey\nTop effects: euphoric, relaxed, focused\nTop medical uses: pain, depression, stress\nSample review:\n“Very very potent strain, gets you a very heavy body high along with a bit of a head high. Prepare to turn into potato, but great for parties/groups. Very stoned.” – Anonymous\n  10. Green Monster\nType: hybrid\nTop flavors: earthy, pine, pungent\nTop effects: sleepy, relaxed, happy\nTop medical uses: insomnia, stress, depression\nSample review:\n“i either have some strong shit or its [sic] all this good haha at least as good as green crack, mabie [sic] better” – Anonymous\n  11. Green Queen\nType: hybrid\nTop flavors: spicy/herbal, earthy, nutty\nTop effects: happy, uplifted, euphoric\nTop medical uses: stress, nausea, depression\nSample review:\n“Green queen is my go to when I need to be productive. This is the most productive strain I’ve used with the least amount of anxiety. Can also be very giggly.” – ChristWithAY\n  12. Green Ribbon\nType: hybrid\nTop flavors: citrus, pungent, skunk\nTop effects: energetic, happy, uplifted\nTop medical uses: stress, nausea, pain\nSample review:\n“One of only two strains I’ve ever smoked that’s given me energy. I find that my thoughts are very focused, and I can carry on conversations exceptionally well. Great strain for sitting around and talking. Very social strain. It actually made me want to dance!” – Anonymous\n  13. Lime Green Skunk\nType: hybrid\nTop flavors: none tagged — leave a review!\nTop effects: uplifted, happy, euphoric\nTop medical uses: stress, pain, insomnia\nSample review:\n“Have enjoyed this strian very much. A very great energetic high, that really seems to mute grey down feelings both mentally and physically, and bring out higher, more talkitive [sic] sides. Very great for every aspect of enjoyment.” – Anonymous\n  14. Martian Mean Green\nType: hybrid\nTop flavors: sweet, blue cheese, grapefruit\nTop effects: relaxed, euphoric, uplifted\nTop medical uses: inflammation, nausea, stress\nSample review:\n“It creeps up on you, makes you laugh and relieves pain. All around good time for a few hours.” – gurren_lynx\n  15. Super Green Crack\nType: sativa\nTop flavors: spicy/herbal, woody, diesel\nTop effects: energetic, creative, happy\nTop medical uses: stress, pain, fatigue\nSample review:\n“BOMB Very mental.” – PuffPuffington911","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/03/12001842/luck-o-the-irish-15-green-strains-to-help-you-celebrate-the-st-pa.jpg","urlslug":"/news/strains-products/15-green-strains-to-celebrate-st-patricks-day"}],"reviewCount":32,"flavors":[{"name":"Woody","score":14.375},{"name":"Flowery","score":13.75},{"name":"Earthy","score":13.75},{"name":"Spicy/Herbal","score":1.875},{"name":"Tea","score":1.875}],"effects":[{"name":"Happy","score":33.75},{"name":"Talkative","score":31.25},{"name":"Creative","score":31.25},{"name":"Focused","score":20},{"name":"Hungry","score":18.125}],"symptoms":[{"name":"Pain","score":5.625},{"name":"Depression","score":5},{"name":"Stress","score":5},{"name":"Lack of Appetite","score":3.75},{"name":"Nausea","score":3.75}],"conditions":[{"name":"Anxiety","score":5.625},{"name":"ADD/ADHD","score":3.125},{"name":"PTSD","score":2.5},{"name":"Asthma","score":1.25},{"name":"Hypertension","score":1.25}],"negatives":[{"name":"Dry Eyes","score":6.8750000000000009},{"name":"Dry Mouth","score":6.8750000000000009},{"name":"Headache","score":2.5},{"name":"Paranoid","score":1.875},{"name":"Anxious","score":1.875}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_6986.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/452394/b/green-haze__primary_f3cf.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_645e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/431705/b/green-haze__primary_c1d9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_f695.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/271181/b/green-haze__primary_b2ce.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_0d13.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/82023/b/green-haze_825x550_5ef3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_18a8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/28844/b/green-haze_825x550_9f7a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_qa5nn451.0rg.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/17110/b/green-haze_825x550_qatsb4pr.50j.jpg"}],"photoTotalCount":6,"popularCities":["Bothell, WA","Everson, WA"],"permalink":"https://mobileapi.leafly.com/sativa/green-haze","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3.8125/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Haze","subtitle":null,"slug":"haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/haze","symbol":"H","applink":"leafly://strain/haze"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":7741,"slug":"green-haze","name":"Green Haze","subtitle":null,"symbol":"Gnz","category":"Sativa","description":"\u003cp\u003eGreen Haze by A.C.E. Seeds is another version of their sativa Oldtimers Haze and takes after her Thai and South Indian ancestry. Like its Haze parentage, Green Haze is\u0026nbsp;\u003cspan style=\"line-height: 1.6em;\"\u003ealso upbeat and\u0026nbsp;verging on psychedelic for some. This sativa plant is truly for someone who loves growing as it can take a full 16-20 weeks to flower. Green Haze grows tall and is a lookalike of \u003c/span\u003e\u003ca href=\"http://www.leafly.com/sativa/purple-haze\" style=\"line-height: 1.6em; text-decoration: none;\"\u003ePurple Haze\u003c/a\u003e\u003cspan style=\"line-height: 1.6em;\"\u003e except for, of course, the color. The flowers will have a woody smell mixed with fruit. Green Haze has a high potency and is good for tackling pain, though it may also inspire some serious snacking.\u003c/span\u003e\u003c/p\u003e\n","descriptionPlain":"Green Haze by A.C.E. Seeds is another version of their sativa Oldtimers Haze and takes after her Thai and South Indian ancestry. Like its Haze parentage, Green Haze is\u0026nbsp;also upbeat and\u0026nbsp;verging on psychedelic for some. This sativa plant is truly for someone who loves growing as it can take a full 16-20 weeks to flower. Green Haze grows tall and is a lookalike of Purple Haze except for, of course, the color. The flowers will have a woody smell mixed with fruit. Green Haze has a high potency and is good for tackling pain, though it may also inspire some serious snacking.\n","aka":null,"rating":3.81,"highlightedReviews":[{"id":1411099,"username":"Halfbl8d","text":"Great for the price. I swear I saw a tree with a nose.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"},{"id":1480759,"username":"Cameron_Kush","text":"Hard hitting head high. Good taste, made me extremely talkitive and kinda productive good daytime strain","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2973","title":"24 Strains to Prepare You for the Game of Thrones Season 4 Premiere","author":"Rebecca Kelley","category":null,"date":"\/Date(1396641600000)\/","text":"We’re big fans of Game of Thrones here at Leafly and the crew is super stoked for the season 4 debut this Sunday on HBO. If you’re planning on hosting a viewing party to kick off the premiere of one of the best shows on television, why not pick up some of these Game of Thrones-themed strains to properly celebrate?\nHere are 24 strains (some standing solo, some paired together) we feel tie in with the Game of Thrones universe perfectly (spoilers below if you aren’t caught up to season 4 by now). Yes, 24. That’s how much we love both our strains and this show. Even though All Men Must Die, their memories will live on thanks to this list of green.\n1. Mad Dawg \n\nThis earthy hybrid is in honor of Mad King Aerys II Targaryen, the kooky ruler who started this whole mess in the first place. Dude, all you had to do was not murder a bunch of people and threaten to burn down King’s Landing and we wouldn’t even have a Game of Thrones battle royale waging. If only he had a little stash of Mad Dawg to keep him feeling euphoric and relaxed.\n2. 3 Kings\n\nThe hybrid 3 Kings strain may be a fusion of Headband, Sour Diesel, and OG Kush, but it also signifies the three kings currently left standing in Game of Thrones at the start of season 4: Joffrey Lannister (aka The Worst Person Ever), Stannis Baratheon (aka “Stannis the Mannis,” self-proclaimed King of the Andals), and Balon Greyjoy (aka World’s Not-Greatest Dad), king of the Iron Islands. Maybe this pungent strain will clear some of the crazy out of their sinuses.\n3. Permafrost\n\nBecause, as House Stark constantly reminds us, “Winter is coming,” so you might as well hunker down and wait for it to arrive with some piney Permafrost.\nSpeaking of House Stark…\n4. Northern Lights\n\nThe North remembers, and though their numbers are dwindling and the Starks are constantly having George R. R. Martin take a never-ending dump on them, there are still a few scrappy surviving members who have a glimmer of hope shining, however dimly at the moment. Northern Lights is good for combating stress, and I’m guessing the Starks are feeling a little overwhelmed right about now.\n5. Lions Gate\n\nThis royal purple indica is in honor of the proud and wealthy Lannisters, who happen to use a lion as their sigil. The Lannisters appear to be sitting pretty right now – they rule the Seven Kingdoms, Jamie’s been returned (mostly intact), Tywin’s only been moderately cranky – but we’ll see if their good luck streak will continue in season 4. They’ll need the focus that the Lions Gate strain brings.\n6. Richie Rich + Power Kush \n\nSpeaking of Tywin Lannister, if you combine the hybrid Richie Rich with the indica Power Kush, you’ll have a father who loves to play the game more than he loves his own family. I bet he’s sneering in every family portrait that’s been commissioned – it’s the ye olde equivalent of blinking in photos.\n7. Killer Queen + Sour Power \n\nSticking with the Lannisters, let’s shift gears to Cersei, former queen of Westeros and current queen of the “Who farted?” face. A Killer Queen willing to do whatever it takes to get as close to the Iron Throne as possible, this icy blonde beauty has felt her power go a little sour once she realized that her turd of a son can’t be controlled. Talk about a disappointed parent. She really takes after her father, doesn’t she?\n8. Little Devil + Abusive OG\n\nUgh, Joffrey is the worst. We can’t think of a better pairing for the little pissant than the hybrid Little Devil and the indica Abusive OG. If ever King Joffrey’s horrible ways feel a little too heavy for your tastes, just remember that he got b-slapped by the best character ever:\n\nSpeaking of which…\n9. Royal Dwarf \n\nTyrion Lannister is rumored to be one of the characters George R. R. Martin’s wife made him promise he would never kill off. I think every Game of Thrones fan can agree – even though he’s a Lannister, he’s still a Royal Dwarf and one of the best characters on the show.\nAnother favorite character?\n10. Jane Doe + Odyssey \n\nFierce little Arya Stark has seen many of her family members fall victim to the Game of Thrones and now she’s out for blood. This pint-sized warrior in the making has abandoned her identity and gone all Jane Doe in an attempt to take out the people on her shit list. How will her revenge Odyssey pan out?\n11. Critical Mass\n\nSticking with the Starks, we’ve never had a drastic shift in character sympathy than for poor Sansa. Sure, she was a naive, stuck-up teenager in season 1, but she’s had most of her family murdered, been held prisoner, and was nearly forced to marry a psychopath Lannister before being forced to marry another Lannister. Tyrion’s been kind to her so far but honestly, how much more suffering do you have in store for Sansa, George R. R. Martin? She seems to be at Critical Mass right now and could use a little of the happy effects this indica brings.\nKnow who else is feeling a little blue?\n12. Blue Bastard \n\nOh, Jon Snow. The bastard son of Ned Stark has been on his own Odyssey but he can’t seem to make up his mind as to what he wants (maybe he really does know “nuthing”). Is it revenge for the Starks? Does he want to protect the Night’s Watch or defect from them? Or maybe he wants to catch a glimpse of another Ogre with Ygritte (although “Jon Snuhhhh” isn’t exactly in her good graces right now). It’s been a depressing journey for him thus far – good thing Blue Bastard is good for relieving depression.\n13. White Zombie + Snow Monster\n\nWe’ve already seen a few of the horrors that lie north of the Wall, including a White Zombie who looked like a frigid Iggy Pop. Can Jon Snow protect the Seven Kingdoms from the Snow Monsters that are advancing?\n14. Super Sour Widow \n\nPoor Catelyn Stark. Even though she could never love the bastard Jon Snow, she still didn’t deserve to have her entire family either murdered or scattered across the Seven Kingdoms. Talk about a Super Sour Widow.\nAnd to make matters worse…\n15. Red Haze \n\nThat Red Wedding was effed up, yo. Like seriously. After watching that episode, you probably felt as amped up as the effects the sativa Red Haze can bring (and you were likely in a Red Haze of your own once “The Rains of Castamere” started playing).\n16. Blackwater + Green Haze\n\nAnother iconic moment in Game of Thrones, this event was less heart-breaking than the Red Wedding and more awe-inspiring. The Battle of the Blackwater has been the biggest battle in the War of the Five Kings so far. Tyrion’s use of wildfire put Stannis’ army in a Green Haze and protected King’s Landing from being overrun. By combining the indica Blackwater and the sativa Green Haze, you’re creating quite the explosive hybrid strain yourself.\n17. Cherry Bomb\n\nCherry Bomb continue to deliver (both literally and figuratively), or will her influence over him go up in flames?\n \n18. Anesthesia\n\nA little something both Jaime Lannister and Theon Greyjoy could have used throughout season 3, amirite guys? The indica Anesthesia is widely used for pain management, making it an appropriate option for these two whipping boys.\n19. Lifesaver\n\nJaime owes you one, Brienne of Tarth. Why not have him pick up this euphoric hybrid Lifesaver strain while you two bathe and reminisce about the time you both faced off against a friggin’ grizzly bear?\n20. Brains Damage\n\nWhat better way to celebrate the possibly brain-damaged but entertainingly verbose Hodor with this Hodor, I mean hybrid strain that brings sleepiness, Hodor, and Hodor Hodor.\n21. Bordello\n\nAny Game of Thrones viewer is all-too familiar with the show’s numerous “sexposition” scenes that occur in a brothel or during sex scenes to spruce up an otherwise boring plot advancement. Take a taste of the hybrid Bordello whenever a sexposition scene pops up and you’ll feel so relaxed, you’ll forget how shamelessly (and entertainingly) gratuitous these parts actually are.\n22. True OG \n\nWho will end up winning the Game of Thrones? Who do you feel is the rightful ruler of the Seven Kingdoms? Partake in this relaxing indica while you ponder who you feel the “True OG” should be.\nWill it be…\n23. Dream Queen + Triple Diesel\n\nMany Game of Thrones fans are rooting for their “Dream Queen,” Daenerys Targaryen, who’s using her Triple Diesel dragons to kick ass, free slaves, and chew bubblegum (and she’s all out of bubblegum).\nAnd finally…\n24. F*cking Incredible\n\nWhich is exactly what this show is. Happy watching!\nImage credits: mad king, House Lannister","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12001238/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie.jpg","urlslug":"/news/strains-products/24-strains-to-prepare-you-for-the-game-of-thrones-season-4-premie"},{"id":"contentitems-3183","title":"Luck o\u0027 the Irish: 15 \u0027Green\u0027 Strains to Help You Celebrate St. Patrick\u0027s Day","author":"Rebecca Kelley","category":null,"date":"\/Date(1395091560000)\/","text":"Even if you haven’t got a little Irish in ya, most everyone enjoys celebrating St. Patrick’s Day. After all, it’s an excuse to drink some Guinness, eat some soda bread and corned beef with hash, and pinch forgetful friends who aren’t wearing some hue of green today. This being Leafly, of course, we have a list of strains with a little “green” in them to help you further celebrate a fun little holiday.\nWithout further ado, here are 15 green-themed cannabis strains:\n  1. Green Candy\nType: sativa\nTop flavors: sweet, citrus, minty\nTop effects: happy, euphoric, energetic\nTop medical uses: pain, stress, depression\nSample review:\n“One of the top 5 sativas. I always want this as part of my available medications.” – Crucian1\n  2. Green Crack\nType: sativa\nTop flavors: sweet\nTop effects: euphoric, uplifted, energetic\nTop medical uses: stress, depression, pain\nSample review:\n“I love this strain. Gives me a light, pleasant high that’s perfect to unwind and listen to music to. Especially with friends! Definitely try this, people!” – EmAy55\n  3. Green Crack Extreme\nType: sativa\nTop flavors: sweet, citrus, minty\nTop effects: euphoric, happy, uplifted\nTop medical uses: stress, fatigue, depression\nSample review:\n“Its [sic] a step above most sativa strains and probably some of the best Sativas available.” – Crucian1\n  4. Green Door Kush\nType: hybrid\nTop flavors: lemon, sweet\nTop effects: creative, euphoric, happy\nTop medical uses: nausea, insomnia, muscle spasms\nSample review:\n“Love the taste and smell. Some great stuff even for a long time smoker, but if you a new be, be careful” – KevinlovesBud\n  5. Green Dream\nType: hybrid\nTop flavors: minty, pine, spicy/herbal\nTop effects: euphoric, happy, uplifted\nTop medical uses: stress, depression, pain\nSample review:\n“I love this strain. I was cleaning and organizing my house like crazy. Very talkative and energetic. Amazing day high.” – KSlizzle\n  6. Green Goblin\nType: sativa\nTop flavors: diesel, grapefruit, pine\nTop effects: euphoric, uplifted, happy\nTop medical uses: stress, pain, depression\nSample review:\n“Very good strain. No heavy eyes. No laziness. Very uplifting feeling and sense if [sic] euphoria.” – Anonymous\n  7. Green Haze\nType: sativa\nTop flavors: pine, tea, woody\nTop effects: focused, uplifted, euphoric\nTop medical uses: pain, nausea, stress\nSample review:\n“Great Strain for anxiety, make u feel really up and euphoric great for focusing and just taking on the day” – Eric420\n  8. Green Hornet\nType: hybrid\nTop flavors: none tagged — leave a review!\nTop effects: euphoric, focused, happy\nTop medical uses: depression, pain, stress\nSample review:\n“DELICIOUS!!! My tummy was hurting this morning but after a little green hornet in my bowl I’m feeling ready to take on the day!” – AZCSWestPhx\n  9. Green Kush\nType: indica\nTop flavors: sweet, apricot, honey\nTop effects: euphoric, relaxed, focused\nTop medical uses: pain, depression, stress\nSample review:\n“Very very potent strain, gets you a very heavy body high along with a bit of a head high. Prepare to turn into potato, but great for parties/groups. Very stoned.” – Anonymous\n  10. Green Monster\nType: hybrid\nTop flavors: earthy, pine, pungent\nTop effects: sleepy, relaxed, happy\nTop medical uses: insomnia, stress, depression\nSample review:\n“i either have some strong shit or its [sic] all this good haha at least as good as green crack, mabie [sic] better” – Anonymous\n  11. Green Queen\nType: hybrid\nTop flavors: spicy/herbal, earthy, nutty\nTop effects: happy, uplifted, euphoric\nTop medical uses: stress, nausea, depression\nSample review:\n“Green queen is my go to when I need to be productive. This is the most productive strain I’ve used with the least amount of anxiety. Can also be very giggly.” – ChristWithAY\n  12. Green Ribbon\nType: hybrid\nTop flavors: citrus, pungent, skunk\nTop effects: energetic, happy, uplifted\nTop medical uses: stress, nausea, pain\nSample review:\n“One of only two strains I’ve ever smoked that’s given me energy. I find that my thoughts are very focused, and I can carry on conversations exceptionally well. Great strain for sitting around and talking. Very social strain. It actually made me want to dance!” – Anonymous\n  13. Lime Green Skunk\nType: hybrid\nTop flavors: none tagged — leave a review!\nTop effects: uplifted, happy, euphoric\nTop medical uses: stress, pain, insomnia\nSample review:\n“Have enjoyed this strian very much. A very great energetic high, that really seems to mute grey down feelings both mentally and physically, and bring out higher, more talkitive [sic] sides. Very great for every aspect of enjoyment.” – Anonymous\n  14. Martian Mean Green\nType: hybrid\nTop flavors: sweet, blue cheese, grapefruit\nTop effects: relaxed, euphoric, uplifted\nTop medical uses: inflammation, nausea, stress\nSample review:\n“It creeps up on you, makes you laugh and relieves pain. All around good time for a few hours.” – gurren_lynx\n  15. Super Green Crack\nType: sativa\nTop flavors: spicy/herbal, woody, diesel\nTop effects: energetic, creative, happy\nTop medical uses: stress, pain, fatigue\nSample review:\n“BOMB Very mental.” – PuffPuffington911","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/03/12001842/luck-o-the-irish-15-green-strains-to-help-you-celebrate-the-st-pa.jpg","urlslug":"/news/strains-products/15-green-strains-to-celebrate-st-patricks-day"}],"reviewCount":32,"flavors":[{"name":"Woody","score":14.375},{"name":"Flowery","score":13.75},{"name":"Earthy","score":13.75},{"name":"Spicy/Herbal","score":1.875},{"name":"Tea","score":1.875}],"effects":[{"name":"Happy","score":33.75},{"name":"Talkative","score":31.25},{"name":"Creative","score":31.25},{"name":"Focused","score":20},{"name":"Hungry","score":18.125}],"symptoms":[{"name":"Pain","score":5.625},{"name":"Depression","score":5},{"name":"Stress","score":5},{"name":"Lack of Appetite","score":3.75},{"name":"Nausea","score":3.75}],"conditions":[{"name":"Anxiety","score":5.625},{"name":"ADD/ADHD","score":3.125},{"name":"PTSD","score":2.5},{"name":"Asthma","score":1.25},{"name":"Hypertension","score":1.25}],"negatives":[{"name":"Dry Eyes","score":6.8750000000000009},{"name":"Dry Mouth","score":6.8750000000000009},{"name":"Headache","score":2.5},{"name":"Paranoid","score":1.875},{"name":"Anxious","score":1.875}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_6986.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/452394/b/green-haze__primary_f3cf.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_645e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/431705/b/green-haze__primary_c1d9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_f695.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/271181/b/green-haze__primary_b2ce.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_0d13.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/82023/b/green-haze_825x550_5ef3.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_18a8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/28844/b/green-haze_825x550_9f7a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/green-haze_100x100_qa5nn451.0rg.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/17110/b/green-haze_825x550_qatsb4pr.50j.jpg"}],"photoTotalCount":6,"popularCities":["Bothell, WA","Everson, WA"],"permalink":"https://mobileapi.leafly.com/sativa/green-haze","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3.8125/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Haze","subtitle":null,"slug":"haze","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/haze","symbol":"H","applink":"leafly://strain/haze"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
