{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Gage Peake",
            "category": null,
            "date": "/Date(1491602964000)/",
            "id": "contentitems-23870",
            "text": "The official Bob Marley cannabis brand, Marley Natural, will launch its official collection of premium cannabis flowers and oils next week in Washington state, joining an ever-growing group of celebrity cannabis companies that are now competing in the market.\nMarley Natural (owned by Privateer Holdings, the parent company of Leafly) came into existence with the blessing of the late reggae pioneer’s surviving family, and is dedicated to preserving the memory of Bob Marley’s Jamaican roots. First selling its products in California, Marley Natural has now made its way up through Oregon and now, beginning on April 10th, the Seattle and Tacoma area in Washington state.\nTwo of Bob’s granddaughters, Zuri and Shacia, attended the launch party at the cannabis dispensary Have a Heart, in downtown Seattle Friday afternoon. Both granddaughters were excited to show off their family’s products, as they exclaimed to customers some of the nuances of the Marley products.\nThe product line that will be offered in Washington includes four categories of cannabis flower, pre-rolls, and oil cartridges. Other available items include body care products and smoking accessories made from sustainably grown American Black Walnut wood and heat-resistant, hand-blown glass.\n[table id=67 /]\nMarley Natural joins several other cannabis businesses owned or endorsed by celebrities that are making strides within the industry. Companies like Willie’s Reserve, Chong’s Choice, and Whoopi & Maya have also recently launched, and expanding cannabis companies are exploring strong ties to celebrities.\nWillie Nelson’s celebrated cannabis brand, Willie’s Reserve, made its debut last July in Washington state cannabis dispensaries before expanding to Colorado. Within a year of its launch, customers can now purchase Willie’s Reserve in four different states, as Oregon and Nevada now supply Willie’s special nugs.\nTommy Chong’s brand Chong’s Choice, which launched its products in February of 2016, has already expanded into six states, including medicinal-only states Montana and Arizona.\nFinally, Whoopi Goldberg’s cannabis company, Whoopi & Maya Medical Cannabis, is also progressing nicely since its launch last year. Goldberg teamed up with Maya Elisabeth, one of the leading “canna-businesswomen” in the field, to develop a line of products designed to provide relief from menstrual cramps.\nThough Whoopi & Maya has not expanded into any other states outside of California, the company is giving back to the community by advocating the use of its products instead of using painkillers to combat ailments like cramps and headaches.\n\nGiving back to the local communities for these celebrity-owned cannabis brands seems to be helping all parties expand their businesses. As previously stated, Goldberg has been advocating the use of her creams instead of painkillers, while Willie’s Reserve puts a heavy emphasis on using independent local farmers that follow the Farm Aid mission to support environmentally safe growing practices.\nThe same can be said about Marley Natural, as the brand has been giving back to the local communities where its products are being sold. Its Rise Up program, established to support positive social change, environmental sustainability, and empowering local communities harmed by cannabis prohibition, has so far been both successful and rewarding according to Interim Director of Marketing Berrin Noorata.\n“Rise Up is our social impact initiative, and what we do is we support programs that are kind of based on Bob’s ideals, such as creating social change and supporting different environmental causes. In every market we go into we give back to that market,” Noorata said. “In Washington we partnered with the Minority Cannabis Business Association (MCBA) to work on programs to help people beat their cannabis convictions.”\nMarley Natural worked on a similar initiative in Oregon, according to Noorata.\n\n“In Oregon, we were able to expunge about 30 records. In Washington, they don’t expunge fully, they vacate here,” she told Leafly. “We are working with people to help [individuals] that have been harmed by cannabis prohibition, so [we think of it as] giving back to the community as legalization is building in the country. We want to help support those people that have been harmed.”\nNoorata said that Marley Natural hopes to launch the Rise Up program in Washington state on April 29.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/04/07141222/marley-natural.jpg",
            "title": "Launch of Bob Marley Cannabis in WA Heralds Continued Rise of Celeb Cannabis Brands",
            "urlslug": "/news/industry/launch-bob-marley-cannabis-wa-heralds-continued-rise-celeb-cannabis-brands"
        },
        {
            "author": "The Associated Press",
            "category": null,
            "date": "/Date(1484341609000)/",
            "id": "contentitems-15730",
            "text": "NASHVILLE, Tenn. (AP) — Willie Nelson wants his friend Loretta Lynn, who recently revealed that she tried marijuana for the first time at the age of 84 for her glaucoma but didn’t like it, to give cannabis a second chance.\n“She’s got a lot of guts,” Nelson said during a recent interview with The Associated Press in Nashville, Tennessee. “She’ll try anything. Maybe I should help her.”\nThe 83-year-old outlaw country icon actually wants to help a lot of people give marijuana a try. He’s attached his name to a line of legal cannabis being sold in Colorado and Washington called “Willie’s Reserve,” after decades of personally advocating for legalization.\nThe incoming administration under President-elect Donald Trump has some advocates fearful of a federal crackdown on the states that have legalized cannabis for medical or recreational purposes. Trump’s nominee for attorney general, Jeff Sessions, has said weed should not be legalized.\n\nBut the “Crazy” songwriter remains hopeful for his latest business venture under the new Trump administration.\n“I think people would be smarter than that,” Nelson said. “You look and see the benefits. You weigh them against the things that might possibly happen. I think marijuana is probably the safest medicine you can take. These new guys that are coming in there trying to shut it down, I don’t think they will be successful. People will say, ‘Hey wait a minute. Heroin, cocaine, OK. But it grows in the ground. It seems to be normal. Let it alone.'”\nThe singer-songwriter behind hits such as “On the Road Again” and “Always On My Mind” will have a new album out this spring called “God’s Problem Child,” with his longtime producer Buddy Cannon. The album features a song written by Cannon’s 92-year-old mother and includes some of the last recordings by musician Leon Russell, who died in November.\nBecause Nelson maintains a rigorous touring schedule throughout the year, Nelson and Cannon co-write their songs via text messages.\n“I can come up with a few lines, send them to him and he’ll come up with another one,” Nelson said. “The next thing you know, he’ll go into the studio and put a melody to it and record it and then put his voice on there. Then when I get a chance, I put my voice on there and it seems to be working.”\n\nIn the meantime, fans can hear a new song from Nelson in a film he’s starring in called “Lost in London LIVE,” directed by and also starring Nelson’s friend, Woody Harrelson. The roughly two-hour film will be shot in multiple locations in London in a single take and will be live-streamed in real time to over 500 movie theaters in the United States on the evening of Jan. 19, the first time a film has been live-streamed to movie theaters as it’s being shot.\nNelson said he’ll be performing the song live during the film.\n“He has some idea about doing it live,” said Nelson. “That’s pretty ballsy, I think.”",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/13125048/Music-Willie-Nelson_Mart.jpg",
            "title": "Willie Nelson Wants Loretta Lynn to Try Cannabis Again",
            "urlslug": "/news/lifestyle/willie-nelson-wants-loretta-lynn-try-cannabis"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 10.130718954248366
        },
        {
            "name": "PTSD",
            "score": 6.6993464052287575
        },
        {
            "name": "Arthritis",
            "score": 6.209150326797385
        },
        {
            "name": "ADD/ADHD",
            "score": 4.57516339869281
        },
        {
            "name": "PMS",
            "score": 3.594771241830065
        }
    ],
    "description": "<p class=\"p1\">Willie Nelson is a mostly sativa cannabis strain that is lauded for its euphoric, creative effects. The&nbsp;plants are sativa in their growing characteristics and should flower between 10 and 14 weeks. Flowers will be large&nbsp;but somewhat dense. Winner of the 2005 <em>High Times</em> Cannabis Cup in the sativa category, Willie Nelson has a fan base to rival its namesake&rsquo;s. Consumers love that this strain leaves them clear-headed, allowing them to perform artistic or social activities.</p>\n",
    "descriptionPlain": "Willie Nelson is a mostly sativa cannabis strain that is lauded for its euphoric, creative effects. The&nbsp;plants are sativa in their growing characteristics and should flower between 10 and 14 weeks. Flowers will be large&nbsp;but somewhat dense. Winner of the 2005 High Times Cannabis Cup in the sativa category, Willie Nelson has a fan base to rival its namesake&rsquo;s. Consumers love that this strain leaves them clear-headed, allowing them to perform artistic or social activities.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 58.00653594771242
        },
        {
            "name": "Creative",
            "score": 57.51633986928105
        },
        {
            "name": "Euphoric",
            "score": 55.228758169934636
        },
        {
            "name": "Energetic",
            "score": 54.411764705882355
        },
        {
            "name": "Focused",
            "score": 52.614379084967325
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 9.477124183006534
        },
        {
            "name": "Sweet",
            "score": 1.7973856209150325
        },
        {
            "name": "Pungent",
            "score": 1.4705882352941175
        },
        {
            "name": "Woody",
            "score": 1.4705882352941175
        },
        {
            "name": "Pine",
            "score": 1.3071895424836601
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 77,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png",
            "id": 1412736,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Very uplifting. Color: dark green, almost grey-ish. I have severe depression and suicidal ideations, this is a AMAZING bud for depression. No others have worked like this one for me. was very happy and laughing, not long lasting but what an amazing stone.  dense buds for a Sativa which is always a +.",
            "username": "rentonHIGHlands"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1625149,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Clear headed & focused, good for artistic and social activities.\n2005 Cannabis Cup\nGood for depression ",
            "username": "Danklilnugget"
        }
    ],
    "id": 2039,
    "name": "Willie Nelson",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 10.947712418300654
        },
        {
            "name": "Dry Eyes",
            "score": 5.88235294117647
        },
        {
            "name": "Headache",
            "score": 3.2679738562091503
        },
        {
            "name": "Paranoid",
            "score": 1.4705882352941175
        },
        {
            "name": "Anxious",
            "score": 0.49019607843137253
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/nepalese",
            "category": "Sativa",
            "name": "Nepalese",
            "permalink": "https://mobileapi.leafly.com/sativa/nepalese",
            "slug": "nepalese",
            "subtitle": null,
            "symbol": "Np"
        },
        {
            "applink": "leafly://strain/south-asian-sativa",
            "category": "Sativa",
            "name": "South Asian Sativa",
            "permalink": "https://mobileapi.leafly.com/sativa/south-asian-sativa",
            "slug": "south-asian-sativa",
            "subtitle": null,
            "symbol": "Sas"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/willie-nelson",
    "photoTotalCount": 35,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/648463/b/willie-nelson__primary_e72e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/willie-nelson_100x100_8897.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/622098/b/willie-nelson__primary_ef2e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/willie-nelson_100x100_0e1e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/522833/b/willie-nelson__primary_651c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/willie-nelson_100x100_8bc9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/518474/b/willie-nelson__primary_c951.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/willie-nelson_100x100_7ae9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502458/b/willie-nelson__primary_6c7f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/willie-nelson_100x100_8be7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/493731/b/willie-nelson__primary_d026.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/willie-nelson_100x100_e7e2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Airway Heights, WA",
        "Cumberland, RI",
        "Denver, CO",
        "Detroit, MI",
        "Lansing, MI",
        "Los Angeles, CA",
        "Ritzville, WA",
        "Spokane Valley, WA",
        "Spokane, WA",
        "Springfield, OR"
    ],
    "rating": 4.28,
    "relatedStrains": [],
    "reviewCount": 122,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "willie-nelson",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.27868852459016/240",
    "subtitle": null,
    "symbol": "Wln",
    "symptoms": [
        {
            "name": "Stress",
            "score": 50.326797385620914
        },
        {
            "name": "Pain",
            "score": 40.52287581699346
        },
        {
            "name": "Depression",
            "score": 39.37908496732027
        },
        {
            "name": "Fatigue",
            "score": 7.8431372549019605
        },
        {
            "name": "Insomnia",
            "score": 3.758169934640523
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
