{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1520633843000)/",
            "id": "contentitems-60063",
            "text": "Spring is in the air, bringing fresh flowers, warmer days, and cleansing rain. But through the waxing evenings and lazy Sundays, intensive spring cleaning, an exhaustive daylight saving switch-up, and the stress of pre-summer planning tends to make spring a tiring season. Thankfully, these trying activities don’t have to be so daunting with a little cannabis on hand.\n\nEnjoy preparing your garden or tackling that over-stuffed closet with some energizing strains that will get you in tune with the changing season. Below, discover our go-to strains for springtime activities and ease yourself into the months ahead.\nDon’t Let Daylight Saving Time Leave You Exhausted\n(anyaberkut/iStock)\nAM Strain Recommendation: Grapefruit Diesel\nPM Strain Recommendation: King Louis XIII\nDaylight Saving Time is a twice-yearly event that leads to a physical and mental adjustment for most of the country. While “spring ahead” means more sunshine, it also signals the loss of an hour of coveted sleep. Make the best of this change and avoid morning grogginess by going to bed early and giving yourself a mental boost for the morning.\nTo help you transition to this shift in time, choose a relaxing indica when you’re ready for bed. We love King Louis XIII, known for its insomnia benefits, to help the body ease into sleep an hour early. In the morning, the hybrid Grapefruit Diesel will give you a burst of energy that will leave you bright-eyed and bushy-tailed as you get ready for the day right on schedule.\nFind Grapefruit Diesel Nearby\nFind King Louis XVIII Nearby\n\nMake Spring Cleaning Fun by Putting Some Pep in Your Step\n(Peopleimages/iStock)\nStrain Recommendation: Super Lemon Haze\nSpring cleaning might seem like a huge undertaking, but there’s something so satisfying about throwing open your windows and clearing the dust off your shelves in the fresh spring air. Jumping into this task is well worth it—in the end you’ll feel refreshed, your place will be spotless, and you can finally breathe a big sigh of relief.\nTo help you stay motivated as you clean top to bottom, try a stimulating sativa such as Super Lemon Haze. The lively, euphoric effects encourage focus, so you’ll be happily absorbed in your work and the spring cleaning will be done before you know it.\nFind Super Lemon Haze Nearby\n\nRelieve Lingering Winter Blues and Get Hyped for Spring\n(eclipse_images/iStock)\nStrain Recommendation: Bubbleberry\nAfter months of darkness, the beginning of spring is a welcome relief, but it isn’t enough to instantly kick the winter blues. While waiting for sunshine and warmth to steadily return and revive you, manage rainy weather blues with some TLC and the proper strain.\nBubbleberry is an excellent pick for relieving stress, depression, and inflammatory pain that can be aggravated by rainy weather. This hybrid provides a giggly, happy high that will make you feel closer to the sun while waiting for spring showers to bring on the other kind of flowers.\nFind Bubbleberry Nearby\n\nPair the Right Greens With Your Gardening Routine\n(eclipse_images/iStock)\nStrain Recommendation: Green Crack\nOne of the most magical times of the year is the beginning of spring since it kicks off the start of the growing season. After browsing the seed catalogue and planting your share, it’s time to prepare your garden. Lugging heavy soil and pots, raking the earth, and organizing your fruits and veggies is a lot of work, but the end result makes it all worth it.\n\nBy adding another plant to the mix, you can give yourself a physical boost while getting in a mental zone. Consider the sativa Green Crack; with a mental buzz and the sharp uptick of energy it provides, you’ll power through the laborious aspects while enjoying the pleasurable ones, such as when you plant that first seedling in some fresh soil.\nFind Green Crack Nearby",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/09101911/4-springtime-activities-1.jpg",
            "title": "4 Springtime Activities Enhanced With Cannabis",
            "urlslug": "/news/lifestyle/4-springtime-activities-enhanced-with-cannabis"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1488305017000)/",
            "id": "contentitems-19710",
            "text": "Some people choose a cannabis strain based on its name. Others by its THC content. Personally, I’m a sucker for aroma and flavor; whether it’s a flower, dabbable wax, or an oil cartridge, bad/bland/harsh flavor is a big turn-off. And with flavors ranging from sweet roses to earthy diesel, who wouldn’t want to explore the vast spectrum of tastes and smells cannabis has to offer?\n\nAlthough flavor has everything to do with how a product is grown, cured, stored, and processed, genetics play a role as well. Over the years, these strains have proven to be top contenders in the flavor game, consistently showing off rich terpene profiles that not only govern a strain’s smell, but enhance the strain’s effects as well.\n\nTangie is a citrus dream crafted by the masterminds at DNA Genetics. There’s no strain I’d sooner rely on for good flavor than this sativa; popping the lid of a jar of Tangie and filling your nose with the smell of fresh orange zest can be somewhat of a religious experience of wonderment. With the sweet smell of citrus and fruit medley, Tangie lets you drift upwards slowly and steadily into euphoria, where bad moods don’t stand a chance.\n\nDominated by gassy, diesel notes you might be surprised to enjoy, GG4 (f.k.a Gorilla Glue #4)’s aroma is balanced by sweet-and-sour skunk and refreshing pine. The smell of well-grown GG4 (f.k.a. Gorilla Glue #4) can completely conquer a room when opened, so if you’re practicing discretion, consider holding off on GG4 until you reach open air.\n\n\nKyle Kushman never would have guessed that the sad-looking clone he held in a paper bag would one day become the famous award-winning Strawberry Cough. But thank goodness he passed this one to his left and shared the strawberry goodness with all of us. This uplifting, creative sativa strain smells like it grew wild in a strawberry patch, radiating with the distinct aroma of ripe berries and rich earthy soil.\n\nSpeaking of strains that smell exactly like fruit, this list would never be complete without the mention of Blueberry. Without Blueberry, there would be no Blue Dream, no Blue Cheese, no Blue Cookies; “Blue” hybrids simply wouldn’t exist. You’ll notice all of these strains carry a blueberry-like smell, but few can match the original Blueberry’s uncanny resemblance to a bushel of overripe blueberries plucked straight from the branch.\n\n\nFlavors of lemon candy, sharp pine, and fresh herbs twist together to create the complex aroma of Dutch Treat. A budtender has never had to twist my arm when upselling Dutch Treat; it’s been hard to find a lackluster example of the flavorful strain after all these years. Beyond the obvious notes of citrus and pine, this strain endlessly offers subtle nuances of sage, mint, and pepper.\n\nBursting with flavors of lemon, lime, and pear, XJ-13 is a strain I can hardly ever turn down. Its aroma has a sour bite that seems to almost fizzle in your nose like a fruity spritzer on a hot summer day.\n\nLavender is a beautifully intricate indica strain that smells like – oh, you guessed it – lavender. Like an all-in-one bouquet, Lavender also offers up sweet accents of wildflower, rose, and violet underneath a layer of woody earthiness.\n\n\nGrapefruit is a fantastic wake-and-bake strain not only because of its awakening, high-energy high, it also tastes like a bowl of ripe red grapefruit sweetened with honey. I don’t often see it on dispensary shelves, but it’s a cherished rarity, especially when enjoyed on warm summer weekend mornings.\n\nRed Headed Stranger is a strain I’ve loved getting to know in both flower and oil form. Upon inhale, the palate is dowsed with sweet flavors that seem citrusy at first, but then you notice some of the quieter flavors of mint and pine giving the strain a fresh, herbaceous finish. Coupled with effects that soothe the body while letting the mind run unencumbered, Red Headed Stranger is a perfect afternoon smoke that can easily replace or enhance your favorite citrusy, hoppy beer.\n\n\nSchrom is somewhat of a local legend here in Seattle, but I simply can’t find it in my heart to neglect mentioning this glorious sativa strain that smells exactly like 7-Up. Herbal notes subtly underscore the pungent, unmistakable flavors of lemon-lime so strong, they monopolize the palate.\nThese are the strains that have been kindest to my nose, but what strains have a smell and/or flavor that make you swoon? Let me know what I’m missing out on in the comments section below!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/02/27165411/orange-cannabis.jpg",
            "title": "Leafly Staff Picks: The Best-Tasting Cannabis Strains",
            "urlslug": "/news/strains-products/best-tasting-and-smelling-marijuana-strains"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 34.62241022929385
        },
        {
            "name": "Arthritis",
            "score": 12.219030909003509
        },
        {
            "name": "PTSD",
            "score": 9.758328125751094
        },
        {
            "name": "ADD/ADHD",
            "score": 9.22475123780224
        },
        {
            "name": "Asthma",
            "score": 5.8322117002355425
        }
    ],
    "description": "<p>This potent <a href=\"http://www.leafly.com/sativa\">sativa</a> was developed by crossing <a href=\"http://www.leafly.com/hybrid/cinderella-99\">Cinderella 99</a> with a fast-flowering sativa selected for its rich <a href=\"http://www.leafly.com/explore#!/explore/flavors-grapefruit\">grapefruit</a> flavor. The <a href=\"http://www.leafly.com/explore#!/explore/flavors-tropical\">tropical</a>, <a href=\"http://www.leafly.com/explore#!/explore/flavors-citrus\">citrus</a> smell of Grapefruit mixes with <a href=\"http://www.leafly.com/explore#!/explore/tags-energetic\">energetic</a> effects to give you a <a href=\"http://www.leafly.com/explore#!/explore/tags-happy\">happy</a> <a href=\"http://www.leafly.com/explore#!/explore/symptoms-stress\">stress-reliever</a> that also works well for battling <a href=\"http://www.leafly.com/explore#!/explore/conditions-migraines\">migraine</a> <a href=\"http://www.leafly.com/explore#!/explore/symptoms-headaches\">headaches</a>.</p>\n",
    "descriptionPlain": "This potent sativa was developed by crossing Cinderella 99 with a fast-flowering sativa selected for its rich grapefruit flavor. The tropical, citrus smell of Grapefruit mixes with energetic effects to give you a happy stress-reliever that also works well for battling migraine headaches.\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 71.05826082776522
        },
        {
            "name": "Happy",
            "score": 68.36261596885065
        },
        {
            "name": "Energetic",
            "score": 56.720424938710764
        },
        {
            "name": "Focused",
            "score": 50.618540595106474
        },
        {
            "name": "Euphoric",
            "score": 47.21806950920541
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 51.002499639475076
        },
        {
            "name": "Grapefruit",
            "score": 50.09866365428063
        },
        {
            "name": "Sweet",
            "score": 36.75671778108927
        },
        {
            "name": "Lavender",
            "score": 5.1279863481228665
        },
        {
            "name": "Pungent",
            "score": 3.179228957361919
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "\n\tBest results with excellent air circulation\n\tClearing lower branches can improve circulation and air flow\n\tGrows best in temperatures between 70 to&nbsp;80&deg;F (21 to 27&deg;C) and at 50% humidity\n\n",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png",
            "id": 1417901,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I had obtained Grapefruit from my provider due to them not having my usual strains in stock a few months back. Their lineup is all outstanding, so I was more than content trying something new.\nUpon getting home and opening the bag, I was overwhelmed with a strong, bitter citrus aroma that was obviously the cause for it's name. Mouthwatering and almost beckons you to bring your nose closer again for multiple whiffs.\nVisually, this sample was beautiful. Outstanding trichome production, nice sized & dense nug structure, with shades of green, royal purple, pastel yellow, & burnt orange pistils.\nThe flavor brought with it the same bitter citrus from the scent that was sweet/tart, again, reminiscent of real grapefruit. The effects were extremely sativa with a powerful head change, boost of energy, uplifted mood, increased creativity, focus, and even encouraged me to talk-ramble far more than usual, lol.\nOverall, this strain is absolutely outstanding. I'm more of an indica guy personally, but this is an incredible strain for wake & bake early in the morning. Roll a joint at night so you can wake up at sunrise with it ready to go (preferably in the Spring as I did). I sat outside on my porch watching the sun come up with a cup of coffee, a cool & fresh breeze on my face, with the sun's glare glistening off the dew still resting on the grass. An absolutely beautiful experience that was greatly improved by the cannabis. I'm sure it would be great in many other situations, but that morning will be embedded within my memory for the rest of my life. I will be picking this strain up again in the Summer for my morning/day time smoke while out on the lake. If you find a well-grown example with the characteristics I listed, pick some up and use it in rotation with 1-2 other strains throughout the day. You'll be happy you did and excited every morning which is something that doesn't happen to me often! Pictures will be posted of the sample I consumed here on Leafly soon (nugs will be set on a bright blue background for quick reference). Enjoy!",
            "username": "PieRomania"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1637685,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Amazing cerebral buzz - daytime strain obviously...hits harder than you think and keeps you happy as hell",
            "username": "shumz420"
        }
    ],
    "id": 1778,
    "name": "Grapefruit",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 37.339085708792
        },
        {
            "name": "Anxious",
            "score": 16.963058212757776
        },
        {
            "name": "Dry Eyes",
            "score": 15.099024179204921
        },
        {
            "name": "Headache",
            "score": 7.7952699129933185
        },
        {
            "name": "Paranoid",
            "score": 7.432341489208287
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/cinderella-99",
            "category": "Hybrid",
            "name": "Cinderella 99",
            "permalink": "https://mobileapi.leafly.com/hybrid/cinderella-99",
            "slug": "cinderella-99",
            "subtitle": null,
            "symbol": "C99"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/grapefruit",
    "photoTotalCount": 112,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/sativa/grapefruit/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/sativa/grapefruit/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/660279/b/grapefruit__primary_8e97.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/grapefruit_100x100_ede1.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/653162/b/grapefruit__primary_de99.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/grapefruit_100x100_d38c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/642865/b/grapefruit__primary_e113.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/grapefruit_100x100_1713.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/639947/b/grapefruit__primary_3d91.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/grapefruit_100x100_773b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/627723/b/grapefruit__primary_40eb.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/grapefruit_100x100_7729.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/627474/b/grapefruit__primary_b43f.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/grapefruit_100x100_c8dd.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Los Angeles, CA",
        "Seattle, WA",
        "Eugene, OR",
        "Medford, OR",
        "Spokane, WA",
        "Salem, OR",
        "Bend, OR",
        "Vancouver, BC",
        "Calgary, AB"
    ],
    "rating": 4.27,
    "relatedStrains": [],
    "reviewCount": 472,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "grapefruit",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.26694915254237/240",
    "subtitle": null,
    "symbol": "Grf",
    "symptoms": [
        {
            "name": "Stress",
            "score": 43.32848627601788
        },
        {
            "name": "Depression",
            "score": 30.384199394318127
        },
        {
            "name": "Fatigue",
            "score": 14.40970052396289
        },
        {
            "name": "Headaches",
            "score": 13.257823390857087
        },
        {
            "name": "Pain",
            "score": 12.936956208239195
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
