{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1463781600000)/",
            "id": "contentitems-3299",
            "text": "Get down with some strangely named strains this weekend, like Moose and Lobsta from Moss Crossing in Eugene, OR, or Grimmdica from the prodigal breeders at Brothers Grimm. These were just uploaded to Leafly's strain database, which means they're ready for your user reviews. Let us know which ones you're on the hunt for, or which ones you've tried already!\n \n   1. Green Avenger\n\nThe celebrated breeder Subcool is well-known for his fondness of Brothers Grimm genetics, having used several of their strains in his breeding projects. As a thank you for championing their genetics while they were on a long hiatus from the seed business, the now active Brothers Grimm named a special hybrid after his seed company TGA (The Green Avengers). After finding a special male in a pack of TGA’s Vortex, they decided to cross it with their Genius, one of the most sought after Apollo 11 phenotypes. The result is Green Avenger, a squat, branchy plant with long, sticky colas of tropical, fruity smelling flowers. With notes of pineapple and citrus, Green Avenger delivers a speedy, euphoric rush.\n\n \n   2. Grimmdica\n\nLegendary Canadian breeders Brothers Grimm Seeds are back at it, reworking some of their original genetics and re-releasing classic seed lines that are hoarded and coveted by those in the know. With Grimmdica, they have crossed their heirloom Sensi Hash Plant with their favorite Afghani male to produce a truly old-school indica hybrid. The blissful, tranquilizing euphoria and rich, acrid hash flavor with hints of pine are sure to please lovers of classic indica strains everywhere.\n\n \n   3. Higher Power\n\nHigher Power is a cross between the hybrid strain Geezus and the sativa African Queen bred by Wild Oregon Weed. It has a delicious odor akin to grape Froot Loops and has been measured at 24% THC. This sativa offers a truly stimulating high that will leave you energized and bursting with creativity.\n\n \n   4. Shark Bite\n\nA hybrid from Archive Seed Bank, Shark Bite combines Great White Shark with a Face Off OG backcross into one fast-finishing, easy-to-grow strain. Its fat, sticky colas emit a delicious candied fruit aroma with a hint of skunky OG flavor for good measure. Considered a 50/50 hybrid, Shark Bite typically comes in between 18% and 24% THC and makes excellent concentrates.\n\n \n   5. Hashbar OG\n\nIn the old days of clandestine growing, people found many strains to be unsuitable for stealthy indoor grows. Sativa strains were too large and took too long, while many indica strains smelled too strongly to go unnoticed. Enter the Pacific Northwest Hash Plant, a compact, quick-flowering, low-odor plant that still delivers large yields and tons of resin. Archive Seed Bank crossed this plant with their favorite male, the Face Off OG backcross, to create Hashbar OG, a 70% indica-dominant hybrid that generates THC levels between 20% and 24%. While the smell of this strain is light, it still delivers a nice OG flavor when smoked.\n\n \n   6. Moose and Lobsta\n\nMoose and Lobsta is a 70% sativa-dominant hybrid that produces heavy yields of high-potency flowers in about nine to ten and a half weeks of flowering. It smells strongly of skunk and tropical fruit and has a similar taste with undertones of diesel fuel. Moose and Lobsta provides a very intense high that starts in the head and quickly spreads through the body and limbs, and can be beneficial in treating pain, anxiety, depression, and loss of appetite.\n\n \n   7. 5th Element\n\nElemental Seeds crossed Blackberry with All Spark OG to create this impressive strain. 5th Element produces huge yields of sticky buds that feature a powerful earthy, lemony smell and flavor. The effects are quite strong with a good mix of cerebral and body highs.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/05/12002134/new-strains-alert-green-avenger-moose-and-lobsta-5th-element-red.png",
            "title": "New Strains Alert: Green Avenger, Moose and Lobsta, 5th Element, Higher Power, and More",
            "urlslug": "/news/strains-products/new-strains-alert-green-avenger-moose-and-lobsta-5th-element-red"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Migraines",
            "score": 44.82905982905983
        },
        {
            "name": "PTSD",
            "score": 40.427350427350426
        },
        {
            "name": "Arthritis",
            "score": 33.84615384615385
        },
        {
            "name": "ADD/ADHD",
            "score": 33.24786324786325
        },
        {
            "name": "Fibromyalgia",
            "score": 30.512820512820515
        }
    ],
    "description": "<p>Moose and Lobsta is a 70% sativa-dominant hybrid that produces heavy yields of high-potency flowers in about nine to ten and a half weeks of flowering. It smells strongly of skunk and tropical fruit and has a similar taste with undertones of diesel fuel. Moose and Lobsta provides a very intense high that starts in the head and quickly spreads through the body and limbs, and can be beneficial in treating pain, anxiety, depression, and loss of appetite.</p>\n",
    "descriptionPlain": "Moose and Lobsta is a 70% sativa-dominant hybrid that produces heavy yields of high-potency flowers in about nine to ten and a half weeks of flowering. It smells strongly of skunk and tropical fruit and has a similar taste with undertones of diesel fuel. Moose and Lobsta provides a very intense high that starts in the head and quickly spreads through the body and limbs, and can be beneficial in treating pain, anxiety, depression, and loss of appetite.\n",
    "effects": [
        {
            "name": "Energetic",
            "score": 105.85470085470085
        },
        {
            "name": "Uplifted",
            "score": 89.14529914529913
        },
        {
            "name": "Creative",
            "score": 82.52136752136752
        },
        {
            "name": "Happy",
            "score": 67.991452991453
        },
        {
            "name": "Tingly",
            "score": 65.98290598290599
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 41.53846153846154
        },
        {
            "name": "Skunk",
            "score": 34.35897435897436
        },
        {
            "name": "Earthy",
            "score": 27.22222222222222
        },
        {
            "name": "Grapefruit",
            "score": 25.555555555555557
        },
        {
            "name": "Pungent",
            "score": 18.162393162393162
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1410013,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "If I could give Moose and Lobsta six stars, I would. In fact, I decided to post this review only after I went back to the dispensary and stocked up on more of this wonderful strain. It has become my new favorite sativa, edging out Casey Jones, Jack Herer and Sour Diesel. First, let me tell you how skeptical I was about Moose&Lobsta: A 5-star rating with less than 10 reviews at the time of this writing? That didn’t seem credible to me: A) It’s not a very big sample and B) A grower and a few friends could skew the voting to make a mediocre strain appear better than it is. But that’s not the case here. Moose&Lobsta is unlike anything I have ever smoked. They should really call this strain “Ecstasy” or “Sexy Fun Time” strain because that was the way it hit us. First, we both got very tactile, aroused and energized. I was very tired right before I smoked afraid any weed would just put me to sleep. I loved touching my partner, dancing, and playing together before we moved on activities better not to post in a review like this ☺. It heighten sensations while dulling pain, which is a neat trick. It also lasted a very long time. I smoked it about 6:30 PM and was still fairly high at 10:30 PM before falling asleep. I wouldn’t call this a bedtime strain by any means, but I was able to sleep on it just fine. Also, this is one sativa that doesn’t produce any anxiety or paranoia, which is something I am prone to experience some sativas. It’s also a very creative strain. My partner has more experience with this strain than I do, but she agrees that Moose&Lobsta continues to surprise and delight her even after smoking it for more than a week now with wonderful effects every time. The only downside with Moose And Lobsta are terrible, ravenous munchies. Be prepared to have some healthy snacks on hand with this one unless need help with your appetite.",
            "username": "IandI"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/GEtHqRvcLixj2OsxtSEc504cRSE=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fvjiAEprhRMyG4ul8blLT_DSCN3022.JPG",
            "id": 1622442,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Moose and Lobsta One of My Favorite.I love the effect it gives me .The energy is insane.For sure Morn Smoke:)  The Medicine Wheel    always have the out this world strains,Ty Medicine Wheel.It a crazy feeling your eyes feel the effect then it goes down to your body with tingly feeling .Very good for Pain",
            "username": "Diane57"
        }
    ],
    "id": 226321,
    "name": "Moose and Lobsta",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 32.17948717948718
        },
        {
            "name": "Dry Eyes",
            "score": 6.068376068376068
        },
        {
            "name": "Dizzy",
            "score": 4.957264957264957
        },
        {
            "name": "Headache",
            "score": 0.5555555555555556
        },
        {
            "name": "Paranoid",
            "score": 0.5555555555555556
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/sativa/moose-and-lobsta",
    "photoTotalCount": 4,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/704942/b/moose-and-lobsta__primary_04b1.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/moose-and-lobsta_100x100_3a4c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/705072/b/moose-and-lobsta__primary_54cd.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/moose-and-lobsta_100x100_0967.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/653067/b/moose-and-lobsta__primary_60ca.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/moose-and-lobsta_100x100_156c.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/572623/b/moose-and-lobsta__primary_f4f2.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/moose-and-lobsta_100x100_803e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Tucson, AZ",
        "Gresham, OR",
        "Anchorage, AK",
        "Apache Junction, AZ",
        "Beaverton, OR",
        "Bend, OR",
        "Brunswick, ME",
        "Eugene, OR",
        "Mesa, AZ",
        "New River, AZ"
    ],
    "rating": 4.86,
    "relatedStrains": [],
    "reviewCount": 49,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "moose-and-lobsta",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.85714285714286/240",
    "subtitle": null,
    "symbol": "Mlb",
    "symptoms": [
        {
            "name": "Stress",
            "score": 56.41025641025641
        },
        {
            "name": "Depression",
            "score": 49.27350427350427
        },
        {
            "name": "Pain",
            "score": 44.871794871794876
        },
        {
            "name": "Headaches",
            "score": 44.27350427350427
        },
        {
            "name": "Muscle Spasms",
            "score": 32.17948717948718
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
