{"sl_translate":"description,descriptionPlain,category","id":124,"slug":"white-shark","name":"Great White Shark","subtitle":null,"symbol":"Gws","category":"Sativa","description":"\u003cp\u003eGreat White Shark\u0026nbsp;is a potent strain that is known for its ability to provide a strong indica body buzz very quickly. For this reason it\u0026rsquo;s often recommended medically to treat chronic pain ailments. The sativa qualities of this strain keep this heavy hitter from being a complete knockout, but it isn\u0026rsquo;t recommended for days when a lot of work needs to get done. Great White Shark plants grow best indoors and will flower between 8 and 10 weeks. It has a strong fruity aroma that also alludes to its \u003ca href=\"http://www.leafly.com/hybrid/super-skunk\" style=\"text-decoration:none;\"\u003eSuper Skunk\u003c/a\u003e lineage. The buds themselves should be examples of the \u0026ldquo;white\u0026rdquo; part of its moniker, with a blanket of crystals and burnt orange to brown hairs. Also known as Peacemaker or just White Shark, this strain won the 1997 \u003cem\u003eHigh Times \u003c/em\u003eCannabis Cup.\u003c/p\u003e\n","descriptionPlain":"Great White Shark\u0026nbsp;is a potent strain that is known for its ability to provide a strong indica body buzz very quickly. For this reason it\u0026rsquo;s often recommended medically to treat chronic pain ailments. The sativa qualities of this strain keep this heavy hitter from being a complete knockout, but it isn\u0026rsquo;t recommended for days when a lot of work needs to get done. Great White Shark plants grow best indoors and will flower between 8 and 10 weeks. It has a strong fruity aroma that also alludes to its Super Skunk lineage. The buds themselves should be examples of the \u0026ldquo;white\u0026rdquo; part of its moniker, with a blanket of crystals and burnt orange to brown hairs. Also known as Peacemaker or just White Shark, this strain won the 1997 High Times Cannabis Cup.\n","aka":"White Shark, Peacemaker, Peace Maker","rating":4.21,"highlightedReviews":[{"id":1417949,"username":"brutusbuckeye","text":"one of my new found favs...rolled up a joint and stubbed it out half way..let the high creep in..I made the mistake and stopped the channel surfing on the golf channel...45 mins later I woke up in a puddle of drool..knocked out haha...great bud, Def goes with the mood..if it\u0027s a rainy day, your gonna know...but to could go to a park just the same...","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"},{"id":1634063,"username":"Microskunk","text":"Strongest Sativa i have come across yet! rolled a blunt of Great white and never smoked for the rest of the day due to the how strong of the strain it is. Very pungent smell and taste and perkey head high. 5 star!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/nXDMny3ziZYzAXTq72CnSk_ytNs=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2fymJiURN7YeKaxdGhZ5kI_TLTSX0%3d%2f120x120%2fhttps%253A%252F%252Fs3.amazonaws.com%252Fleafly%252Fbin%252FqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2993","title":"6 Shark-Themed Cannabis Strains That Pack a Powerful Bite","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1466976600000)\/","text":"The most highly anticipated stretch of summer is here: Shark Week. It\u0027s a seven day-long marathon where we gather around our televisions to gawk, mouth agape with terror, at the aquatic beasts staring back at use with their dead eyes and rows of razor-sharp teeth. To more adequately prepare you for a week-long bout with the only sea creature to ever kill Samuel L. Jackson, here are a few strains that will have you saying, “We need a bigger boat\" (or bowl).\n  Great White Shark\nThe Great White Shark is the mob boss of the deep blue sea. Having survived for millions of years on the flesh of others, this creature doesn’t only have a taste for blood, it lives for it. If you manage to get your hands on its ravenous strain counterpart, take note of its fruity odor and dense coating of crystals. Indulge in this strain\u0027s pleasant olfactory and visual stimuli, because it will likely be your last, right before Great White Shark takes a bite right out of your dome-piece.\n  Shark Shock\nWhen I think of Shock Shark, I think of some electrified abomination with gleaming bone saws for teeth and a devil-may-care attitude. This particular strain is more stunning than shocking, leaning toward full indica genetics that stink of skunks devoured by this carnivorous lightning rod floating just below the water’s placid surface.\n  OG Shark\nOG Shark makes more sense than people give it credit for. Ocean Grown Shark is the only kind of shark I’ve seen. So, knowing OG Shark began in Canada makes this cartilaginous predator slightly more polite, but it will still bite you right in the face. Canadian or not, this shark only knows mind-altering ferocity.\n  CBD Shark\nCBD Shark, the only CBD strain to make the shark list, is like the squeaky rubber shark toy you might play with in the bath, except it weights two thousand pounds. While it may be less intimidating by way of its supplementary anti-inflammatory and anti-anxiety effects, this 80/20 indica will straight bite your legs off, making leaving the couch or bed or floor slightly more difficult. But don’t even sweat it — you\u0027ll be so lit on CBD Shark you’ll barely notice your missed appendages.\n  Shark Bite\nShark Bite is one of Leafly’s more literal shark strains. This strain is a cross of Great White Shark and Face Off OG, which is a suitable combination for this week-long television holiday dedicated to ocean predators that have the ability to remove body parts from unsuspecting victims.\n  Shark Attack\nShark Attack is a beautiful indica-dominant cross with rather conventional genetics. Crossing Super Skunk and White Widow, one hit of this strain will have you hearing John William’s Jaws score. Every dark corridor or unlit room become a vast, inky ocean full of razor-sharp teeth. This munchie-inducing strain will have you thanking your fridge manufacturer for the tiny interior light. (Just kidding, your fridge is full of sharks, too.)\nShark Week may only happen one week a year, but you can find potent strains that will take a bite out of your anxiety, depression, chronic pain, and laziness any time at Leafly — just check our Strain Explorer for options, or take a peek at some of our recommendations for strong cannabis strains.\n.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/06/12001315/6-shark-themed-cannabis-strains-that-pack-a-powerful-bite.jpg","urlslug":"/news/strains-products/6-shark-themed-cannabis-strains-that-pack-a-powerful-bite"},{"id":"contentitems-2985","title":"5 Sativa Cannabis Strains for Indica Lovers","author":"Bailey Rahn","category":null,"date":"\/Date(1457388000000)\/","text":"There are a number of reasons to align yourself with Team Indica: the tranquil mindsets, relaxed muscles, dreamy highs, sharpened appetites, and restful nights keep us coming back to pacifying varieties like Granddaddy Purple, Northern Lights, and Bubba Kush. Sativa strains, with their racing cerebral energy, can cause more anxiety and paranoia in some individuals, which may be why you exclusively look for that indica purple while browsing Leafly. But not all sativa-dominant strains act as you might think.\n\nJust as there are indicas that behave more like sativa strains, some sativa strains elicit more relaxed effects that can even help you transition into sleep. We chose these five based on user-submitted strain reviews, but mind you, every strain may affect you differently based on the following factors:\n\nYour personal physiology and brain chemistry\nYour mood and energy level\nHow the strain was grown and which genetic traits that particular plant expressed (cannabis nerds, see this primer on genotypes and phenotypes)\nDelivery method and dose\nExpectation of effects\nAccuracy of strain labeling\n\nThat being said, the below strains are good starting points for indica-lovers looking for a daytime sativa experience that doesn’t stray too far from those lovably relaxing indica effects.\n\n1. Jack Herer\n \nJack Herer is one of those brilliantly versatile strains that can bring you energy or relaxation depending on when you use it. Though its sharp, fresh pine aroma and invigorating effects make a great morning pick-me-up, Jack’s uplifting buzz tends to fade into mellow relaxation perfect for chilling out with a movie or book, snuggling up with your partner, or even a good night’s sleep.\n\n“Made me quite sleepy after an hour. Slept like a baby. Not a good strain for public use.”\n2. Great White Shark\n \nOne minute you may feel revitalized and wakeful, and then out of the blue, Great White Shark gets you. Perhaps it’s the indica influence of its parent Super Skunk, but Great White Shark can surprise you with its hefty “creeper” effects – meaning it can take some time for you to feel this strain’s strength. It may not knock you into sleep, but if you’re looking for a sativa with that relaxing counterweight, the Shark may just be what you’ve been looking for.\n\n“Rolled up a joint and stubbed it out half way…45 minutes later I woke up in a puddle of drool. Knocked out.”\n3. Strawberry\n \nThis Dutch-bred sativa is perfect for the consumer looking for a relaxing experience without the high-speed cerebral effects that so often give rise to anxiety and paranoia. With the added benefit of smelling just like the berry it was named after, Strawberry is prized by patients for its ability to treat physical ailments like pain and nausea while also easing stress and other psychological distress.\n\n“A few bong hits do the job just fine, one too many and it brings on the drowsy euphoric state where you just want to chill out, listen to some oldies, and take a nap. Also, bring on the munchies!”\n4. Silver Haze\n \nParented by the sativa Haze and the indica Northern Lights, Silver Haze was bred to lean toward the Haze side of the family in its effects. However, its indica qualities persist, and that becomes apparent when scrolling through its user reviews. While it certainly provides the focus and creativity you might want during the day, Silver Haze is counterbalanced by a breezy, composed mindset that keeps you relaxed in both mind and body.\n\n“I liked this strain because it made me VERY sleepy when the high starts wearing off. Really good for insomnia. Have a drink handy…causes extreme dry mouth.”\n5. Amnesia\n \nAmnesia is a common wake-and-bake sativa – it tends to pique interest and engagement with an almost psychedelic quality – but its high-energy effects come with a ceiling. That is to say that in larger doses, Amnesia can really zonk you out in a manner that is in no way active or functional, much like an indica. Save this one for a day where you want to be physically relaxed, but mentally present. You know, those days where all you want to do is curl up with your video game or kick back with your next artistic endeavor.\n\n“It makes me pretty chilled. I don’t feel like doing much, I just really enjoy the comfort of the couch and tea…You still can do things, just not that energetic and driven. Nice one to lie in bed with and watch South Park.”","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/03/12001300/5-sativa-cannabis-strains-for-indica-lovers.jpg","urlslug":"/news/strains-products/5-sativa-cannabis-strains-for-indica-lovers"}],"reviewCount":378,"flavors":[{"name":"Earthy","score":33.722330395572861},{"name":"Pungent","score":22.622036619525858},{"name":"Sweet","score":15.667486506797841},{"name":"Citrus","score":15.515047482407597},{"name":"Skunk","score":14.818610370977659}],"effects":[{"name":"Happy","score":69.406299105007847},{"name":"Relaxed","score":62.588389014142244},{"name":"Uplifted","score":59.417913506866157},{"name":"Euphoric","score":33.493885359021661},{"name":"Energetic","score":31.156486985037919}],"symptoms":[{"name":"Stress","score":40.717445514791279},{"name":"Pain","score":33.56476737036278},{"name":"Depression","score":26.690920270547242},{"name":"Fatigue","score":18.979299036687845},{"name":"Muscle Spasms","score":17.135085741613718}],"conditions":[{"name":"Anxiety","score":26.828414292546288},{"name":"ADD/ADHD","score":12.780966044954566},{"name":"Cancer","score":12.248069959691193},{"name":"PTSD","score":9.1642754662840744},{"name":"Bipolar Disorder","score":7.3200621712099476}],"negatives":[{"name":"Dry Mouth","score":29.338320694131312},{"name":"Dry Eyes","score":12.07556193208991},{"name":"Dizzy","score":3.7033715925394546},{"name":"Headache","score":2.5197274031563843},{"name":"Anxious","score":2.4689143950263031}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/great-white-shark_100x100_7d1f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001391/b/great-white-shark__primary_2f81.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/great-white-shark_100x100_1ea3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/707828/b/great-white-shark__primary_0bc5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/great-white-shark_100x100_06d8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/665291/b/great-white-shark__primary_4a0e.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/great-white-shark_100x100_92b0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645996/b/great-white-shark__primary_89c5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/great-white-shark_100x100_4fbb.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/633786/b/great-white-shark__primary_f60d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/great-white-shark_100x100_92ca.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/633037/b/great-white-shark__primary_ce41.jpg"}],"photoTotalCount":117,"popularCities":["Vancouver, BC","Montréal, QC","Calgary, AB","Toronto, ON","Winnipeg, MB","Hamilton, ON","Edmonton, AB","Everett, WA","Mississauga, ON","Ottawa, ON"],"permalink":"https://mobileapi.leafly.com/sativa/white-shark","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.21428571428571/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Super Skunk","subtitle":null,"slug":"super-skunk","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/super-skunk","symbol":"Ssk","applink":"leafly://strain/super-skunk"},{"name":"South American","subtitle":null,"slug":"south-american","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/south-american","symbol":"Sam","applink":"leafly://strain/south-american"},{"name":"South Indian","subtitle":null,"slug":"south-indian","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/south-indian","symbol":"Sin","applink":"leafly://strain/south-indian"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":68,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
