{
    "aka": "Thai Stick, Thailand",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Hannah Meadows",
            "category": null,
            "date": "/Date(1527115215000)/",
            "id": "contentitems-66794",
            "text": "A relaxing wake and bake is my go-to weekend morning ritual. If you’re like me, you love pairing a particularly buzzy strain with a strong cup of coffee to get the most out of this classic stoney day starter. But if you’re cutting caffeine or just want to double up on the scent of a freshly brewed mug, fragrant cannabis can be the answer to your coffee cravings.\n\nBelow, some tips on pairing certain cannabis scents with your favorite coffee aroma. Now you too can take your regularly scheduled wake and bake to the next level.\nFind a Dispensary Nearby\nChocolate Thai\n\nA coffee and cannabis lover’s dream lies in the uplifting Chocolate Thai strain. With a strong mix of coffee and chocolate flavors, pungent nugs of this classic landrace firmly puts the “bake” in “wake and bake.” Load up a bong, crush those coffee beans, pet your dog, and spend the morning making your favorite breakfast to celebrate a much needed day off. \nFind Chocolate Thai Nearby\nMalawi\n\nMalawi wears a coat of resin that, when smoked, produces extra energetic effects. A strain that’s truly spirited, this flower-forward number will enhance your exercise routine or give you that extra pop of intensity for crushing work assignments. A touch of coffee follows the finish to end your wake and bake on a high note.\nFind Malawi Nearby\n\nChocolope\n\nStress is no match for the earthy and delicious Chocolope. With sweet coffee notes imbedded in its make-up, roll up a joint with this vivid and cerebral strain for a day packed with creativity, focus, and charm. You may find Chocolope’s optimistic effects lingering throughout the day for hours of cheery relaxation.\nFind Chocolope Nearby\nCaramel Candy Kush\n\nSkip the sugar-high mochas and reach for Caramel Candy Kush to start your day on the sweet side—or treat yo’self and go for both! Notes of caramel and fruit hit your senses first, and a light coffee finish carries you off before tackling the remainder of the day.\nFind Caramel Candy Kush Nearby\n\nTangilope\n\nJust like a strong cup of coffee, Tangilope will leave you bursting with energy and ready to take on the day. It’s a great choice for weekends spent running errands, doing chores, and getting back on track. A hint of coffee accompanies heavy citrus flavors for a truly buzzy taste. Keep this strain in your repertoire for particularly busy days.\nFind Tangilope Nearby\nBubba Kush\n\nBubba Kush offers a mouthwatering blend of chocolate and coffee in its sweeter notes. Light this strain up for an extra-chill morning and bask in euphoric mentals and a relaxing body ease. Leafly users love this tasty classic and its penchant for delivering dreamy bliss. \nFind Bubba Kush Nearby",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/05/23144021/coffee-and-cannabis.jpg",
            "title": "Next Level Wake 'n' Bake With Coffee-ish Strains",
            "urlslug": "/news/strains-products/next-level-wake-bake-coffee-strains"
        },
        {
            "author": "Trevor Hennings",
            "category": null,
            "date": "/Date(1488564927000)/",
            "id": "contentitems-19993",
            "text": "As you develop your farming craft and become more comfortable in your cannabis garden, you might find yourself looking for a new challenge. One option is to explore strains that are regarded as difficult to grow. If growing for personal use, you may try to conquer strains that are not popular among commercial farms because of their long flowering periods, low yields, and specific feeding requirements. Large grow operations tend to avoid tackling difficult or risky strains because they’re often not worth the additional time, money, and labor.\n\nGenerally, growers tackle these issues by crossbreeding plants for high yields, short flowering cycles, and low-maintenance feeding requirements. For this reason, many strains that are regarded as difficult to grow are landrace strains. “Landrace” refers to feral strains that have long grown in one geographic location without hybridization. These varieties often have varying and specific needs, making them some of the more complicated plants to grow. However, plenty of modern hybrids can prove to be challenging as well.\n\nHere are five examples of hard-to-grow strains that ambitious growers may consider if they’re looking for a challenge.\nColombian Gold\nColombian Gold is a landrace sativa hailing from the Santa Marta mountains of Colombia. Made famous over the century as a high-quality cannabis export to the United States, it made a comeback when its genetics were used in the creation of Skunk #1.\n\nWhat makes Colombian Gold a difficult strain to grow is its large stature and long flowering periods. To produce this strain indoors, you must be on top of your pruning game; its growth takes off and will quickly overrun your space. The lengthy flowering cycle also increases the chance of error, but if you can bridle this strain, you will be rewarded with a classic quality landrace strain with an exceptional high that electrifies the senses.\nSan Fernando Valley OG\nA beautiful California native, the SFV OG hybrid can be a tricky strain to tame. It has specific feeding needs and a flowering period that extends longer than normal.\nOG genetics often require heavy feeding – specifically, they’re known for consuming large amounts of calcium and magnesium (also known as “Cal Mag”). You need to be able to read the plant deficiencies to ensure you don’t over or underfeed this strain. Additionally, SFV OG is a dense plant that will benefit from pruning and topping at an early age. If successful, you will be rewarded with dense, beautiful colas that offer a pungent taste and powerful high.\n\nDr. Grinspoon\nThis landrace sativa strain is named after longtime cannabis advocate and professor at Harvard, Dr. Grinspoon. The genetics are held by Barney’s Farm in Amsterdam and are well known amongst connoisseurs for its cerebral effects and quality of flavor. It is also known for its strange bud structure.\nDr. Grinspoon is difficult to grow because of this bud structure. It can take ages for it to flower and for the airy buds to develop any weight. “When mature, the colas resemble compact green and reddish brown beads,” Barney’s describes. “These loosely hang on thin stems.” The stems and buds are brittle, but the end product is something you will rarely ever see.\n\nChocolate Thai\nThai landrace genetics are being kept alive by a breeder in California by the name of DarwoH, and Chocolate Thai is a nostalgic strain commonly associated with the famed Thai sticks of the 1970s and 80s. Cannabis from this region of the world has always been celebrated and cherished for its unique cerebral effects.\nThe difficulty of this strain can be attributed to its lengthy flowering cycle. Similar to all southeast Asian landrace strains, flowering may take up to 14 weeks. If you have the space, time, and skill to produce a decently yielding Chocolate Thai or any other southeast Asian landrace strain, you have something to be very proud of and will be sure to impress anyone who fondly remembers days spent with Thai sticks.\nHeadband\nHeadband has become a very popular strain in the past years. With its high-THC content, Headband provides relaxing effects while holding onto the flavors of its parents OG Kush and Sour Diesel.\nWhat makes Headband difficult to produce is its bud structure. Where OG strains are commonly known for their dense, large colas, Headband produces smaller buds that blanket the plant. Because of this, getting a decent yield with consistent quality can be difficult. Being able to use the SCROG (screen of green) method can help overcome this obstacle.\n\nWhich cannabis strains have you had difficulty growing? Leave your stories and tips below so other growers can benefit!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/03/02151756/hardest-strains-to-grow.jpg",
            "title": "5 of the Hardest Cannabis Strains to Grow",
            "urlslug": "/news/growing/hardest-marijuana-strains-to-grow"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 6.125954198473282
        },
        {
            "name": "ADD/ADHD",
            "score": 4.408396946564886
        },
        {
            "name": "PTSD",
            "score": 1.9083969465648856
        },
        {
            "name": "Arthritis",
            "score": 1.3358778625954197
        },
        {
            "name": "Migraines",
            "score": 1.3358778625954197
        }
    ],
    "description": "<p>Thai refers to a cannabis variety that grows natively in Thailand and was brought to the U.S. in the 70s and 80s. This pure sativa <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\">landrace</a> is sometimes called &ldquo;Thai Sticks&rdquo; because of the way its buds are traditionally dried and tied into long sticks. This original Thai variety has given rise to many strains we commonly see on the market today, including <a href=\"http://www.leafly.com/sativa/voodoo\">Voodoo</a>, <a href=\"http://www.leafly.com/hybrid/juicy-fruit\">Juicy Fruit</a>, and the classic <a href=\"http://www.leafly.com/sativa/haze\">Haze</a>. Thai induces powerful but comfortable effects and has a distinct fruity, citrus aroma. This strain is a challenge for growers outside tropical climates, but greenhouse gardens make this grow possible for experts patient enough for Thai&rsquo;s long growth cycle and slow flowering.</p>\n",
    "descriptionPlain": "Thai refers to a cannabis variety that grows natively in Thailand and was brought to the U.S. in the 70s and 80s. This pure sativa landrace is sometimes called &ldquo;Thai Sticks&rdquo; because of the way its buds are traditionally dried and tied into long sticks. This original Thai variety has given rise to many strains we commonly see on the market today, including Voodoo, Juicy Fruit, and the classic Haze. Thai induces powerful but comfortable effects and has a distinct fruity, citrus aroma. This strain is a challenge for growers outside tropical climates, but greenhouse gardens make this grow possible for experts patient enough for Thai&rsquo;s long growth cycle and slow flowering.\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 52.70356234096692
        },
        {
            "name": "Happy",
            "score": 38.32697201017811
        },
        {
            "name": "Euphoric",
            "score": 34.12849872773536
        },
        {
            "name": "Energetic",
            "score": 31.399491094147578
        },
        {
            "name": "Focused",
            "score": 30.06361323155216
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 7.843511450381679
        },
        {
            "name": "Pungent",
            "score": 4.599236641221374
        },
        {
            "name": "Woody",
            "score": 4.2175572519083975
        },
        {
            "name": "Tobacco",
            "score": 3.072519083969466
        },
        {
            "name": "Tar",
            "score": 2.6908396946564883
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1414154,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I'm just going to tell a little story about this stain in its natural habitat. \n\nThis past January I was doing some work on a tiny island off the coast of Malaysia, quite close to the Thai border. I didn't think I'd be smoking at all since I didn't have any connections and drugs carry such a stiff penalty (life in jail or execution!) but luckily for me, the native islander I was working for was quite the affianado. he had a friend on the mainland who would get weed in from over the Thai border and we'd pick up on resupply trips. for about $20 you'd get a 5 inch rectangle of highly compressed weed wrapped up in masking tape and plastic wrap. it was so dense, you'd have to slice off a piece with a knife and chop it up. with a reduced tolerance, it was heaven. it's hard to guage the effects because the setting was so magical, but I'll always associate Thai weed with wandering around a rainforest dripping with life or bobbing in the gentle lapping waves of lukewarm water as the setting sun turned the sky above and the water below to rose, gold, and purple. \n\nThis strain will forever hold a place I  my heart. ",
            "username": "TokinTravels"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/6JtRYzNa_Crn3HLHkGRhZHY-NBQ=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fh8unm5dQQ4ePFKljVHdm_babywithheadphones.jpg",
            "id": 1641836,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I got my Cannabis wings on Tha.  Totally nice.  Powerful and you may have more sex with it.  Just say yes when you find it.  Best bs",
            "username": "bean_sprout"
        }
    ],
    "id": 65042,
    "name": "Thai",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 23.174300254452923
        },
        {
            "name": "Headache",
            "score": 5.381679389312977
        },
        {
            "name": "Dry Eyes",
            "score": 3.263358778625954
        },
        {
            "name": "Dizzy",
            "score": 2.881679389312977
        },
        {
            "name": "Anxious",
            "score": 1.3358778625954197
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/sativa/thai",
    "photoTotalCount": 16,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/508564/b/thai__primary_38e8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/thai_100x100_d683.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/497653/b/thai__primary_6bbc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/thai_100x100_afa9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/463568/b/thai__primary_d168.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/thai_100x100_c328.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/417356/b/thai__primary_31ea.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/thai_100x100_2c74.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/413617/b/thai__primary_d5aa.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/thai_100x100_eb09.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/413243/b/thai__primary_38e5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/thai_100x100_eabb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Bellingham, WA",
        "Chicago, IL",
        "Los Angeles, CA",
        "Tacoma, WA",
        "Boulder, CO",
        "Colorado Springs, CO",
        "Effingham, IL",
        "Freeland, WA",
        "Granite Falls, WA",
        "Justice, IL"
    ],
    "rating": 4.22,
    "relatedStrains": [],
    "reviewCount": 119,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "thai",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.21848739495798/240",
    "subtitle": null,
    "symbol": "Tha",
    "symptoms": [
        {
            "name": "Lack of Appetite",
            "score": 18.956743002544528
        },
        {
            "name": "Depression",
            "score": 9.770992366412214
        },
        {
            "name": "Pain",
            "score": 9.007633587786259
        },
        {
            "name": "Stress",
            "score": 8.225190839694656
        },
        {
            "name": "Headaches",
            "score": 4.026717557251908
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
