{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1514495213000)/",
            "id": "contentitems-52994",
            "text": "New Year’s resolutions are an excellent way to jump-start your goals and keep you focused for the year ahead. But they can also be difficult to maintain as time moves forward—motivation wanes and life gets in the way. We get it, so to help you accomplish your goals, we gathered a few cannabis strains that will keep you on the right track (long past January).\n\nWhether you want to get fit, obtain a healthy weight, increase your productivity, get more sleep, or lower your stress levels, there’s a strain that can help you stay on top of these resolutions and enhance your overall well-being. Head to your favorite dispensary to load up on these picks before the clock strikes midnight on December 31st.\nWhat strains do you use to stay motivated? Tell us about them in the comments.\nUp Your Fitness Game With Green Crack\nIf your goals include running a 10K, bench pressing your partner, or simply increasing your confidence, there are plenty of reasons why working out is such a popular New Year’s resolution. It can be hard to stay motivated when it comes to fitness, so choosing a strain that offers an abundance of energy is a great way to boost morale and steer you away from winter hibernation.\nStrain Recommendation: Green Crack is the perfect strain for spiking your energy, holding your focus, and warding off fatigue. With a fruity, sweet flavor that pairs perfectly with a healthy breakfast, this bright sativa will kick you into high gear and stick with you on your morning run.\n\nEmbrace Self Care and Get More Sleep With Northern Lights\nIt’s a busy world, and too many of us get so wrapped up in our responsibilities that we forget about one of the most important things we can do for our health: sleep. Lack of sleep increases your risk for a variety of health issues, while quality sleep can improve focus, concentration, memory, and physical well-being. The first step to a great day is a good night’s sleep; to ensure you are performing at your best, avoid strains that will keep you wired into the late evening and opt for ones that promote a healing slumber.\nStrain Recommendation: Northern Lights is the optimal strain for bedtime bliss. This pure indica melts into the body and calms the mind. Make a cup of tea, light up a joint, and sink into pure alleviation.\nStay Focused and Be Productive With Durban Poison\nIf you’re like me, you’re constantly thinking about how to be a more productive person, but maintaining focus doesn’t always come easy. The New Year is the perfect time to reassess your productivity goals so you can be your best self in work, school, or any other important obligations. If this is your goal, reach for a strain that complements and enhances a sharp mind.\nStrain Recommendation: Durban Poison is the cure for de-motivation. Known for its energizing properties and aid to creativity, this sativa will uplift your mood and give you the push you need to become a productivity machine.\n\nObtain a Healthy Weight With Remedy and Banana OG\nOne of the top goals on everyone’s New Year’s resolutions lists is to lose weight. But for some, it can be equally important to maintain or put on a few pounds. Whatever your goal, reaching a healthy weight can seem a daunting task that is especially difficult to sustain. With a little help from cannabis, you may be able to cross this resolution off your list sooner than you think.\nStrain Recommendation: Remedy is a great strain for avoiding the munchies. A high-CBD indica, this strain has trace amounts of THC, but packs a powerful punch against pain, anxiety, and superfluous hunger. Its sweet, floral, and citrus notes will leave you free to indulge in a tasty treat—without all the calories.\nBanana OG steps up to the plate for those who need a little help stimulating their appetite. If you have a hard time keeping weight on or maintaining your weight without the scale dropping, Banana OG will open you up to the munchies and keep you feeling comfortable in indulging. This strong hybrid suits its name with powerful banana flavors and a 25% THC content that will get your stomach rumbling in no time.\n\nLower Your Stress Levels With Blue Dream\nWhen looking back over the past year, with all of its trials and tribulations, you may feel that all you did was stress. You’re not alone, and that’s why the promise of a new year can bring renewed peace and tranquility for so many. If your New Year’s resolution is to stress less and live more, then you’ll want a cannabis strain that can take the edge off.\nStrain Recommendation: Blue Dream is a legendary strain for a reason, and when it comes to conquering stress, few do it as well as a bowl packed with this long-time favorite. This buzzy hybrid works wonders for embracing full-body relaxation without a sedating mental fog—replacing stress with euphoric calm.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/12/28130345/strains-new-year-resolution.jpg",
            "title": "5 Strains to Help You Reach Your Goals in the New Year",
            "urlslug": "/news/strains-products/5-strains-goals-in-the-new-year"
        },
        {
            "author": "Leafly Staff",
            "category": null,
            "date": "/Date(1498153188000)/",
            "id": "contentitems-31877",
            "text": "Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Durban Poison is a South African landrace sativa strain that offers a focused and motivating high. Its flavor profile is sweet, earthy, and sharp with spice. With effects that are cerebral and energizing, this strain can stand in for a cup of coffee before a day of chores or creative projects.\nGrow Techniques: Growing outside in soil will allow this sativa to take off and grow toward the sky. Watch for its large stretches during flowering that will require ample trellising to support the buds. Prune aggressively, sending the energy outwards to the bud sites that will receive the most sunlight.\nFlowering Time: 8-10 weeks\nYield: Moderate\nGrow Difficulty: Easy to moderate\nClimate: Can withstand a variety of climates, but thrives between 65 and 85 degrees Fahrenheit.\nIndoor/Outdoor: With lifespans spent in both Northern and Southern hemispheres, Durban Poison has become resilient to all types of weather. This sativa is a great strain for outdoor gardens where she can stretch tall, whether the climate is warm or cold.\nFeeding: With sativas, you can generally go lighter on the feeding. Watch for nitrogen burn and flush your soils if you see any issues. Silica can help strengthen the tall lanky plant as well.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/06/28141238/durban-poison-strain.jpg",
            "title": "Tips for Growing Durban Poison Cannabis",
            "urlslug": "/news/growing/how-to-grow-durban-poison-marijuana"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 27.55051316427786
        },
        {
            "name": "ADD/ADHD",
            "score": 19.20066271287068
        },
        {
            "name": "PTSD",
            "score": 17.281731716774786
        },
        {
            "name": "Bipolar Disorder",
            "score": 7.6527557964267
        },
        {
            "name": "Migraines",
            "score": 7.640173284941729
        }
    ],
    "description": "<p>This pure <a href=\"http://www.leafly.com/sativa\">sativa</a> originates from the South African port city of Durban. It has gained popularity&nbsp;worldwide for its <a href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\">sweet</a> smell and <a href=\"http://www.leafly.com/explore#!/explore/tags-energetic\">energetic</a>, <a href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\">uplifting</a> effects. <a href=\"http://www.leafly.com/sativa/durban-poison\">Durban Poison</a> is the perfect strain to help you stay productive through a busy day, when exploring the outdoors, or to lend a spark of <a href=\"http://www.leafly.com/explore#!/explore/tags-creative\">creativity</a>.&nbsp;<span style=\"line-height: 1.6em;\">Growers and concentrate enthusiasts will both enjoy the over-sized resin glands which make this strain a quality choice for concentrate extraction. The buds are round and chunky, and leave a thick coating of </span><a href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-anatomy-the-parts-of-the-plant\" style=\"line-height: 1.6em;\">trichomes</a><span style=\"line-height: 1.6em;\"> on almost all areas of the plant.</span></p>\n",
    "descriptionPlain": "This pure sativa originates from the South African port city of Durban. It has gained popularity&nbsp;worldwide for its sweet smell and energetic, uplifting effects. Durban Poison is the perfect strain to help you stay productive through a busy day, when exploring the outdoors, or to lend a spark of creativity.&nbsp;Growers and concentrate enthusiasts will both enjoy the over-sized resin glands which make this strain a quality choice for concentrate extraction. The buds are round and chunky, and leave a thick coating of trichomes on almost all areas of the plant.\n",
    "effects": [
        {
            "name": "Energetic",
            "score": 76.37149258177668
        },
        {
            "name": "Uplifted",
            "score": 63.96973761774859
        },
        {
            "name": "Happy",
            "score": 62.87594077777438
        },
        {
            "name": "Focused",
            "score": 60.08380033384872
        },
        {
            "name": "Euphoric",
            "score": 54.67043730531245
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 21.64641288142146
        },
        {
            "name": "Sweet",
            "score": 19.808758345340358
        },
        {
            "name": "Pine",
            "score": 16.53810803771325
        },
        {
            "name": "Citrus",
            "score": 11.52897376739127
        },
        {
            "name": "Diesel",
            "score": 10.017661851453935
        }
    ],
    "growInfo": {
        "averageYield": "Medium",
        "difficulty": "Easy",
        "environment": null,
        "floweringDays": 60,
        "growNotes": "",
        "height": "Tall",
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png",
            "id": 1417851,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Durban Poison is like the \"espresso\" of cannabis. The raciest sativa I know of, it's a stimulating and clearheaded high with no trace of numbing or \"stoning.\" It wakes you up, cuts through the bleary fog and leaves you clearheaded and bright, gives you energy to go and seize the day. Gives tons of energy and also an intense emotional euphoria... where everything is vibrating and you can't take the smile off your face. Can cause anxiety and paranoia if you are upset, it doesn't make you numb. Recommended for mountain biking, jogging, driving, studying, reading, and partying / socializing with smart people. My sample had purple leaf overtones, a licorice / anise smell and taste. FIRE.",
            "username": "MrTibet"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1640610,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "great strain for anxiety and depression!",
            "username": "michaelwilliam90"
        }
    ],
    "id": 52,
    "name": "Durban Poison",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 31.1251627296029
        },
        {
            "name": "Dry Eyes",
            "score": 16.83105350027485
        },
        {
            "name": "Dizzy",
            "score": 11.339021546651415
        },
        {
            "name": "Anxious",
            "score": 8.290328800969204
        },
        {
            "name": "Paranoid",
            "score": 5.688864275496098
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/african",
            "category": "Sativa",
            "name": "African",
            "permalink": "https://mobileapi.leafly.com/sativa/african",
            "slug": "african",
            "subtitle": null,
            "symbol": "Afr"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/durban-poison",
    "photoTotalCount": 374,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/sativa/durban-poison/primary?width=1024",
            "thumb": "https://d3ix816x6wuc0d.cloudfront.net/sativa/durban-poison/primary?width=200",
            "uploaded": "/Date(1397952000000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000398/b/durban-poison__primary_4091.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/durban-poison_100x100_83ce.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/708909/b/durban-poison__primary_df78.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/durban-poison_100x100_b81e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/708298/b/durban-poison__primary_9afd.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/durban-poison_100x100_afb2.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/676467/b/durban-poison__primary_dec8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/durban-poison_100x100_0993.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/655885/b/durban-poison__primary_9c39.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/durban-poison_100x100_69cc.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/645643/b/durban-poison__primary_f113.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/durban-poison_100x100_96b4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Denver, CO",
        "Phoenix, AZ",
        "Seattle, WA",
        "Eugene, OR",
        "Los Angeles, CA",
        "Toronto, ON",
        "Salem, OR",
        "Spokane, WA",
        "Colorado Springs, CO"
    ],
    "rating": 4.46,
    "relatedStrains": [],
    "reviewCount": 2426,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "durban-poison",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.46001648804617/240",
    "subtitle": null,
    "symbol": "Dp",
    "symptoms": [
        {
            "name": "Depression",
            "score": 40.5298871359192
        },
        {
            "name": "Stress",
            "score": 37.51329684851585
        },
        {
            "name": "Fatigue",
            "score": 25.469067275922246
        },
        {
            "name": "Pain",
            "score": 18.54260795147797
        },
        {
            "name": "Headaches",
            "score": 11.75220613719062
        }
    ],
    "testGraph": "https://leafly.s3.amazonaws.com/strains/testing/OXz2lmTcR3pDznospvCv_durban-poison.png",
    "videoUrl": null,
    "weakDescription": false
}
