{"sl_translate":"description,descriptionPlain,category","id":159887,"slug":"summertime-squeeze","name":"Summertime Squeeze","subtitle":null,"symbol":"Ssq","category":"Sativa","description":"\u003cp\u003eSummertime Squeeze is a sativa-dominant strain whose aroma brings to mind fresh citrus and tropical fruit. Its high-energy, active effects make it a perfect choice for getting outside, socializing, or indulging in creative activities.\u003c/p\u003e\n","descriptionPlain":"Summertime Squeeze is a sativa-dominant strain whose aroma brings to mind fresh citrus and tropical fruit. Its high-energy, active effects make it a perfect choice for getting outside, socializing, or indulging in creative activities.\n","aka":"Summer Time Squeeze, Ssq","rating":4.38,"highlightedReviews":[{"id":1409987,"username":"lemonhaze","text":"This is a very deceiving strain, it reminds me of a strong citrus green tea that lures you in with its mild profile and subtle come up but 3 cups in your ears are ringing with a full blown caffeine buzz stronger than a coffee.  This strain does the same thing luring you in with its summertime breeze and mild palate, a few joints in  and your fully contemplating the notion of multi deminsional beings comically observing our  excessive drama as a society and tuning into our world strictly for comic releaf, with the THC buzz serving as the transitional silence that saturates a group of conversing individuals like a wave as they realize another group or being is easedropping into their conversation and quickly revert to introspective thought.  The strain had legs","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"},{"id":1342565,"username":"blxckmale","text":"Idk if it\u0027s just me, but I get a green tea vibe from this strain, from smell to taste. But it was pretty good, didn\u0027t really do anything for body pains but it made just a regular chill sesh with my team overly hilarious ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3417","title":"New Strains Alert: Sweet Pebbles, Blue Wreck, Scott\u0027s OG, CBD Mango Haze, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1432057680000)\/","text":"Have you checked out Leafly\u0027s newest strain additions? These are just a few of the recently added newcomers, and there are plenty more for you to browse in Leafly\u0027s Explorer.\nLooking for something else? Use our advanced search filters to sort strain by flavors, effects, and medical benefits. Take your discovery one step further and check the \"Availability\" tab on a strain\u0027s page to find out if a shop near you is carrying it. Happy strain hunting!\n \n   1. Sweet Pebbles\n\nSweet Pebbles, bred by Fire Bros. in Washington, is an aromatic hybrid strain with uplifting, happy effects. Those of you who love the strains Fruity Pebbles and Sour Pebbles are likely to appreciate the similar flavor profile of Sweet Pebbles, whose aroma is more floral than that of its sour-smelling relatives. Be prepared for Sweet Pebbles’ dreamy euphoria to lull your body into elevated relaxation while the mind wanders freely with creativity and focus.\n\nSweet Pebbles is available at Have a Heart Cafe in Seattle, WA\n \n   2. B.B. King\n\nB.B. King, named in honor of the Blues musician and songwriter, is an indica-dominant strain bred by MTG Seeds that crosses Blackberry Kush and Space Monster. A sweet and earthy flavor ushers in B.B. King’s sedating effects, which lull both body and mind into deep relaxation. If sleep doesn’t hit you first, be prepared to address a ravenous appetite. This indica typically blooms with dark purple-tipped flowers, highlighting its contrasting blanket of white crystal resin.\n\n \n   3. CBD Mango Haze\n\nCBD Mango Haze is a high-CBD strain released by CBD Crew in 2013. This pleasant and aromatic blend combines the tropical flavors of Mango Haze with the added benefits from high levels of cannabidiol. The buds of CBD Mango Haze express themselves with spicy and sweet notes reminiscent of mango, pineapple, and black pepper. Its CBD:THC ratio can range anywhere from 1:1 – 2:1 and the uplifting sativa-dominant effects draw many medical cannabis consumers to CBD Mango Haze.\n\n \n   4. Blue Wreck\n\nBlue Wreck, also called Blueberry Trainwreck, is a hybrid strain primarily led by its sativa influence. A cross between Blueberry and Trainwreck, Blue Wreck’s flavor is a complex mix of sweet berry, sour fruit, and tangy skunk. Its effects are typically described as clear-headed and active, with a burst of calm euphoria that can help you maintain a positive outlook throughout the day.\n\n \n   5. Tyson\n\nNamed after former undisputed heavyweight champion Mike Tyson, this strain is sure to knock you out. With a pungent diesel aroma, Tyson delivers a punch of indica effects known to fully relax the body while dulling pain, stress, insomnia, and appetite loss. This strain is not intended for first time users, and should only be consumed by indica connoisseurs. Tyson has been Canna Clinic\u0027s signature strain since its inauguration in 2011.\n\n \n   6. Summertime Squeeze\n\nSummertime Squeeze is a sativa-dominant strain whose aroma brings to mind fresh citrus and tropical fruit. Its high-energy, active effects make it a perfect choice for getting outside, socializing, or indulging in creative activities.\n\n \n   7. Scott\u0027s OG\n\nScott’s OG is an indica-dominant hybrid strain bred by Rare Dankness Seeds, who crossed Triangle Kush with their Rare Dankness #1 to create this prominent OG variety. Designed with the veteran in mind, Scott’s OG has potently euphoric effects that a novice or occasional consumer might find jarring. A thick blanket of crystal trichomes covers its buds like a fur coat, which should serve as a warning of this strain’s intense effects. True to its OG heritage, Scott’s OG gives off an earthy, sour aroma that is sweetened by citrusy lemon flavors.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/05/12002425/new-strains-alert-sweet-pebbles-blue-wreck-scotts-og-cbd-mango-ha.png","urlslug":"/news/strains-products/new-strains-alert-sweet-pebbles-blue-wreck-scotts-og-cbd-mango-ha"}],"reviewCount":8,"flavors":[{"name":"Earthy","score":5.5555555555555554},{"name":"Tea","score":5.5555555555555554},{"name":"Spicy/Herbal","score":2.7777777777777777},{"name":"Sage","score":2.7777777777777777},{"name":"Pepper","score":2.7777777777777777}],"effects":[{"name":"Creative","score":8.3333333333333321},{"name":"Aroused","score":5.5555555555555554},{"name":"Uplifted","score":5.5555555555555554},{"name":"Focused","score":5.5555555555555554},{"name":"Happy","score":5.5555555555555554}],"symptoms":[{"name":"Fatigue","score":2.7777777777777777}],"conditions":[{"name":"Anxiety","score":2.7777777777777777}],"negatives":[{"name":"Dry Eyes","score":2.7777777777777777},{"name":"Dry Mouth","score":2.7777777777777777},{"name":"Paranoid","score":2.7777777777777777}],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/summertime-squeeze_100x100_5d32.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/647726/b/summertime-squeeze__primary_81a0.jpg"}],"photoTotalCount":1,"popularCities":["Wayne, MI"],"permalink":"https://mobileapi.leafly.com/sativa/summertime-squeeze","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.375/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
