{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Gage Peake",
            "category": null,
            "date": "/Date(1468301400000)/",
            "id": "contentitems-3071",
            "text": "Have you noticed more people walking around your neighborhood swiping on their cell phone in an almost zombie-like-state recently? Chances are, that person is trying to catch ‘em all on the new gaming app Pokémon GO, which his already been installed more times in its first week than the dating app Tinder in its five years of existence. After a few of us here at Leafly were wandering around the office trying to capture a creature, we figured we’d give our tired legs a break and come up with a list of the best cannabis strains to pair with your next Pokémon GO session.\nPick up one of these strain options before you get back out there and start playing right Meowth.\n  Fire OG\nFire OG is an ideal choice for the next time you and your friends are out trying to catch the fire-breathing Charizard. Powerful in its own right, Charizard’s flame is so hot, it can melt boulders, making it the perfect match for the strongest of the OG strains that sports red hairs (which gives this hybrid its “Fire” name).\n“Fire OG is NOT to be underestimated. As a super- sativa afficanado [sic] I’m usually somewhat [relatively] underwhelmed by decent, but dime a dozen “OG’s.” This however, is a kick in the face and a ripping sativa one at that. Fire OG and its crosses Firewalker (fire x skywalker) and Fire King (x king louis) are all superior, (while I believe the latter to be the strongest) this is fucking intense and uplifting until you start to feel your eyes seal. Once that happens (an hour thirty in) you ARE going to relax… fetally. 10/10.” – Jackboothe\n  Durban Poison\nFeeling a little sleepy while on your walk? Don’t end up feeling like a Snorlax The pure sativa Durban Poison will be the perfect strain to help you stay in tune with your surroundings.\n“Does not get any better than this,exactly what you would expect from a sativa, energizing uplifting and a very tasty sweet pine and citrus flavor, definitely one of my top 5 favorite strains.” – RiPpEdCiTy\n  707 Headband\nAnother strain that can help treat some tension and anxiety you might face when trying to catch ‘em all, Headband 707 brings a strong hybrid high that leaves consumers feeling “heady” and creative rather than sleepy.\n“With its strong, sweet aroma, headband is a sensation for even the most critical of cannabis pundits. I enjoy the creative/anxiolytic effects that come up, makes my dreams appear as if I am a young Pokemon master. The old Pokemon, not this new crap.” – Dwarren\n  Poison Haze\nWhile out trying to catch the poison/ground type Nidoqueen, this Poison Haze strain with its sweet, citrus aroma will help you take her and her powerful tail down in battle. Its energetic and happy high will help any adult Pokémon fan through his or her voyage in catching the characters.\n“This is an extremely potent strain with a intense powerful high. The high was similar to the high from durban poison, except it lasted a hell of a lot longer. It was a very enjoyable high. Got rushes of energy and these wierd phycadelic [sic] -like experiences which were coming and going as i was smoking the blunt. I wouldnt say i was tripping, as that is impossible from consuming marijaunna [sic], but it was just odd. great and extremely enjoyable, but odd. the only downside to this bud is the high didnt last that long, and wore off after about an hour or so. On the positive side there was no burnout, and the bud had a nice fruity lemony taste to it. I would definately [sic] recommend this bud. the high it provided me with was very unique and pleasant. This is not for new smokers. This bud also made me very active but, due to the short duration of the high, could be smoked before bed.” – patrickbasler\n  Super Silver Haze\nAre you at the point in your Pokémon GO journey where all you want to do is get blasted with Blastoise? The four-time High Times Cannabis Cup winner Super Silver Haze will do the job with its energetic, long-lasting body high.\n“The strongest sativa. Especially from a skilled grower, it lives up to and exceeds high expectations. Incredible mood-enhancement, legendary taste and smell.” – nolovedeepweb\n  Agent Orange\nFeeling a bit crabby on your walk to capture Pokémon? Don’t end up like Krabby! Instead, try the hybrid Agent Orange strain to help bring an uplifting, happy high to your journey.\n“pretty potent strain have a munch pack ready( I spent 10 bucks Worth of muchies [sic] it smelled just like sunny d to me(x this strain had me very talkative, had me going through so many detailed stories I’d say this is a good strain for anyone going through depression, as it is very high in euphoria” – happy0102\n  Incredible Hulk\nNeed a little extra kick on your final push in finding Pokémon characters? The Incredible Hulk sativa will help you not end up like Slowpoke, giving a creative and social energy boost while the blueberry, pineapple, and earthy flavors overwhelm the palate.\n“good sativa. smokes smooth and makes you feel really euphoric and uplifted. gives a very energetic and doesn’t make you tired as most strains will. This is a great sativa but you’ll always want an indica or hybrid around for the nighttime full body relaxation.” – MahoneyMcLeaf",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001528/catch-these-7-cannabis-strains-for-your-next-pokemon-go-session.jpg",
            "title": "Catch These 7 Cannabis Strains for Your Next Pokémon GO Session",
            "urlslug": "/news/strains-products/catch-these-7-cannabis-strains-for-your-next-pokemon-go-session"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 10.1010101010101
        },
        {
            "name": "Arthritis",
            "score": 5.555555555555555
        },
        {
            "name": "ADD/ADHD",
            "score": 2.272727272727273
        },
        {
            "name": "Asthma",
            "score": 2.272727272727273
        },
        {
            "name": "Crohn's Disease",
            "score": 2.272727272727273
        }
    ],
    "description": "<p>Orange Durban is a citrus-heavy version of the African landrace strain&nbsp;<a href=\"https://www.leafly.com/sativa/durban-poison\">Durban Poison</a>. Parent strains Orange Juice Bud and Durban Poison come together to offer consumers notes of sweet orange intermixed with pine and earthy undertones. This strain&rsquo;s bright, fruity flavors are underpinned by a stimulating physical energy that encourages activity. The mental state is generally uplifted, with effects that cater to creative pursuits like drawing and dancing. Enjoy Orange Durban during the day&nbsp;to capitalize on the immense burst of energy native to this plant&rsquo;s genetics. &nbsp; &nbsp;</p>\n",
    "descriptionPlain": "Orange Durban is a citrus-heavy version of the African landrace strain&nbsp;Durban Poison. Parent strains Orange Juice Bud and Durban Poison come together to offer consumers notes of sweet orange intermixed with pine and earthy undertones. This strain&rsquo;s bright, fruity flavors are underpinned by a stimulating physical energy that encourages activity. The mental state is generally uplifted, with effects that cater to creative pursuits like drawing and dancing. Enjoy Orange Durban during the day&nbsp;to capitalize on the immense burst of energy native to this plant&rsquo;s genetics. &nbsp; &nbsp;\n",
    "effects": [
        {
            "name": "Energetic",
            "score": 140.15151515151513
        },
        {
            "name": "Focused",
            "score": 129.04040404040404
        },
        {
            "name": "Creative",
            "score": 124.4949494949495
        },
        {
            "name": "Aroused",
            "score": 107.82828282828282
        },
        {
            "name": "Uplifted",
            "score": 34.5959595959596
        }
    ],
    "flavors": [
        {
            "name": "Orange",
            "score": 18.939393939393938
        },
        {
            "name": "Sweet",
            "score": 13.383838383838384
        },
        {
            "name": "Citrus",
            "score": 13.383838383838384
        },
        {
            "name": "Spicy/Herbal",
            "score": 5.555555555555555
        },
        {
            "name": "Pineapple",
            "score": 5.555555555555555
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1391815,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Wow let's just say you should definitely take a heavy dose of this before hitting up a Costco shopping trip. There's so much shit to look at right now that I don't even know how to begin. I should probably go back out and tab a cart, after my eye appointment.\n\nDat sample selection. Can't wait :) Mmnnmmmmmn.... samples... mmmmMmmMmmmmmMMMmMmmmm...\n\n-_-    <---- ME\n\n\n🔹➖🔹",
            "username": "spaceodyssey333"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1612745,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Not good enough to nudge Blue Dream off my favorites list, but a nice daytime strain.  Mental processes and communication ability not disrupted, only enhanced.",
            "username": "seriouscanna"
        }
    ],
    "id": 253871,
    "name": "Orange Durban",
    "negatives": [
        {
            "name": "Dry Eyes",
            "score": 18.939393939393938
        },
        {
            "name": "Dry Mouth",
            "score": 10.1010101010101
        },
        {
            "name": "Headache",
            "score": 2.272727272727273
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/durban-poison",
            "category": "Sativa",
            "name": "Durban Poison",
            "permalink": "https://mobileapi.leafly.com/sativa/durban-poison",
            "slug": "durban-poison",
            "subtitle": null,
            "symbol": "Dp"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/orange-durban",
    "photoTotalCount": 1,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/589836/b/orange-durban__primary_5f2b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/orange-durban_100x100_2cfd.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Bellingham, WA",
        "Berkeley, CA",
        "Hayward, CA",
        "Oakland, CA",
        "Point Arena, CA"
    ],
    "rating": 4.67,
    "relatedStrains": [],
    "reviewCount": 9,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "orange-durban",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.66666666666667/240",
    "subtitle": null,
    "symbol": "Odb",
    "symptoms": [
        {
            "name": "Depression",
            "score": 24.494949494949495
        },
        {
            "name": "Fatigue",
            "score": 13.383838383838384
        },
        {
            "name": "Headaches",
            "score": 13.383838383838384
        },
        {
            "name": "Eye Pressure",
            "score": 7.828282828282829
        },
        {
            "name": "Muscle Spasms",
            "score": 7.828282828282829
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
