{
    "aka": "Nepal, Nepali",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1454097600000)/",
            "id": "contentitems-3237",
            "text": "It's time to kick off the weekend with some cannabis strains you've maybe never tried before. We've just added some new varieties to the Leafly Explorer — go check them out and see if any are in stock at a shop near you! Remember to leave a review if you've tried any of these so the rest of us know what to expect!\n \n   1. Boss Hogg\n\nBoss Hogg by Cali Connection is an indica-dominant hybrid cross between two early classics, Chemdawg 91 and Pre-98 Bubba Kush. In a show of its OG Kush heritage, Boss Hogg carries a strong earthy, hashy aroma that mixes with the funky sour diesel notes of its Chemdawg parent. This true hybrid delivers a balance of mind and body effects that ease the body into relaxation while the mind is lifted to a happy, euphoric state. Despite its heavy body effects, Boss Hogg is cerebrally stimulating and sharpens the senses to help you stay engaged and creative.\n\nClick here for a full list of locations currently carrying Boss Hogg\n \n   2. Kerala Krush\n\nKerala Krush by Flying Dutchmen is an 85% sativa strain that unites genetics from Skunk #1 and a South Indian sativa. This uplifting sativa delivers a very smooth, clear cerebral buzz with flavors of mango fruit and warm spice. Patients may gravitate to this strain for relief of menstrual cramps and nausea.\n\nClick here for a full list of locations currently carrying Kerala Krush\n \n   3. Caramella\n\nCaramella is an 80/20 indica-dominant strain recommended for late nights out with friends as it provides an uplifting and social high. This robust strain produces long colas, deep green leaves, and sticky resin scattered around the plant like fairy dust. This easy-to-grow indica finishes flowering in about 8 to 9 weeks.\n\n \n   4. Brian Berry Cough\n\nBrian Berry Cough from TGA Genetics is a balanced 50/50 hybrid strain that crosses Strawberry Cough and Space Queen. Bred for flavor as well as potency, this strain inherits a loud strawberry and cherry aroma with traces of candied fruit. Its powerful, high-velocity effects center themselves cerebrally at first and then quickly spread to relax the rest of the body. Knots of lavender and green calyxes burst from the tall plants, crowned with deep purple-tipped fan leaves.\n\nClick here for a full list of locations currently carrying Brian Berry Cough\n \n   5. Oregon Pinot Noir\n\nThis Hawaiian Purple Kush and Pitbull cross was bred among the grapes of a respected Pinot Noir vineyard in Oregon. Taking its name from the breeding location and its deep purple buds, this versatile plant gives off the taste of sweet grapes with a spicy hint of Haze. Though a 80/20 sativa-dominant strain, Oregon Pinot Noir gives the effects of a couch-locking indica, providing a noticeable body high best served for nighttime consumption.\n\nClick here for a full list of locations currently carrying Oregon Pinot Noir \n \n   6. Kiwiskunk\n\nIn the late 1980s, the Skunk invasion landed on New Zealand’s shores. Kiwiskunk was introduced when a New Zealand Skunk variety met NYC Diesel, adding a little something extra to its flavor profile. This 75/25 indica-dominant strain gives off a very potent skunky smell with sweet and citrus flavor. You’ll likely be left with a happy but couch-locked feeling best enjoyed while curling up to a comedy movie.\n\n \n   7. Nepalese Jam\n\nBred by ACE Seeds, a Nepalese female plant was crossed with a Jamaican ’85 male to create this hybrid, Nepalese Jam. If you’re looking for a strain that provides a long-lasting buzz without too much mental fogginess, Nepalese Jam is the hybrid for you. With good resistance to mold, fungus, and adverse weather conditions, Nepalese Jam requires only 9 weeks of flowering to produce dense and resinous buds.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week's newest additions!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/12002002/new-strains-alert-boss-hogg-brian-berry-cough-kerala-krush-kiwisk.png",
            "title": "New Strains Alert: Boss Hogg, Brian Berry Cough, Kerala Krush, Kiwiskunk, and More",
            "urlslug": "/news/strains-products/new-strains-alert-boss-hogg-brian-berry-cough-kerala-krush-kiwisk"
        },
        {
            "author": "Lisa Rough",
            "category": null,
            "date": "/Date(1420420620000)/",
            "id": "contentitems-3171",
            "text": "As 2014 has come to a close, we look back and reflect on the strain reviews of yesteryear. We laughed, we cried, and we never underestimated the power of the munchies in some of our more vocal Leafly users. Here are our favorite strain reviews from 2014:\n10. GSC (f.k.a Girl Scout Cookies)\nThis review sums up the glory, the deliciousness, and the pungency of cannabis (Lil’ Wayne, though? Seriously?)\n\nCannabis has many things to be proud of and this strain is it.. pretty sure leafly was created on it.. god created yoga pants on it, the oceans grew, the gods bathe in it, its little waynes cologne… well maybe\n\n9. Ed Rosenthal Super Bud\nHas the Space Coyote helped you find your soulmate yet?\n\nThis stuff knocks me out, not in the sleepy way, but in the \"Homer Simpson meets the Space Coyote\" sort of way.\n\n8. Blueberry Headband\nGross, but points for being descriptive.\n\nGave me a warm happy feeling. Kind of like peeing in a hot tub.\n\n7. Green Crack\nOne of Leafly’s most popular strains inspired this poetic ode to cannabis.\n\nMind=bent \nLovely scent \nDank lament \nGo cannabis\n\n6. Blueberry\nCannabis: saving the world by relieving PMS.\n\nIt is good for pms all of my homicidal thoughts have gone away as well as pain I am high right now. nobody has to die tonight. Thanks pot :)\n\n5. Nepalese\nSometimes you inhale cannabis and exhale sunshine and rainbows and it’s just….it’s just great.\n\nThis stuff made me like everyone and positive and upbeat like I ate a cloud and rainbows or something.\n\n4. Sour Diesel\nOne of our most WTF strain reviews in 2014 was short and sweet and completely baffling.\n\nInstructions not clear Dick stuck in fan\n\n3. Super Lemon Haze\nAny experiences toker will tell you, Super Lemon Haze is a fun, upbeat, and energetic strain. Add tequila at your own discretion.\n\nKicks you right in the ass if paired with tequila. And by kicked in the ass i mean set on fire and dancing naked.  \n\n2. Banana OG\nI think we’ve all felt this before – so enamored with the joy of your munchies when all of the mesmerizing flavors combine in your mouth, it’s just one blissful, delicious hug.\n\n\"Smoked this. About 20 mins later I felt like a little girl skipping through a wheat field towards an ice cream with arms n legs before a choc chip cookie, also with arms and legs, skipped towards us making the happiest group hug I've ever had inside a baskin robbins. =)\"\n\n1. Purple Haze\nEasily our favorite strain review from 2014, the compelling tale of an adventurer and his crustacean companion won our hearts and made us wish that we, too, had a little crawdad friend.\n\nTook me from down in the dumps to having a cool time. Went on an adventure and found a crawdad. I subsequently made friends with said crawdad and hung out with him. Man I miss Craymond.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/01/12001824/leafly-strain-review-hall-of-fame-2014-year-in-review-edition.jpg",
            "title": "The Leafly Strain Reviews Hall of Fame: 2014 Year In Review Edition",
            "urlslug": "/news/strains-products/leafly-strain-review-hall-of-fame-2014-year-in-review-edition"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 24.761904761904763
        },
        {
            "name": "Bipolar Disorder",
            "score": 20.595238095238095
        },
        {
            "name": "Migraines",
            "score": 8.630952380952381
        },
        {
            "name": "ADD/ADHD",
            "score": 7.440476190476191
        },
        {
            "name": "Fibromyalgia",
            "score": 7.440476190476191
        }
    ],
    "description": "<p>Nepalese&nbsp;refers to any strain that grows natively in the Nepal region. These indigenous vareities (also called <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\">landraces</a>) tend to be <a href=\"https://www.leafly.com/explore/category-sativa\">sativa</a>&nbsp;in growth structure, however the buds and effects more closely resemble <a href=\"https://www.leafly.com/explore/category-indica\">indica</a> varieties.&nbsp;<span style=\"line-height: 20.7999992370605px;\">Native Nepalese strains tend to be resinous and hashy in aroma, with buds growing dense toward the top of these sparsely branched plants.</span></p>\n",
    "descriptionPlain": "Nepalese&nbsp;refers to any strain that grows natively in the Nepal region. These indigenous vareities (also called landraces) tend to be sativa&nbsp;in growth structure, however the buds and effects more closely resemble indica varieties.&nbsp;Native Nepalese strains tend to be resinous and hashy in aroma, with buds growing dense toward the top of these sparsely branched plants.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 98.0952380952381
        },
        {
            "name": "Euphoric",
            "score": 92.73809523809524
        },
        {
            "name": "Creative",
            "score": 89.76190476190476
        },
        {
            "name": "Uplifted",
            "score": 87.08333333333333
        },
        {
            "name": "Relaxed",
            "score": 76.30952380952381
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 68.63095238095238
        },
        {
            "name": "Earthy",
            "score": 58.45238095238095
        },
        {
            "name": "Flowery",
            "score": 44.166666666666664
        },
        {
            "name": "Berry",
            "score": 40
        },
        {
            "name": "Spicy/Herbal",
            "score": 28.035714285714285
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png",
            "id": 1414162,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "World peace.  No wonder they are all hippie love peace sit under a tree and meditate over in Nepal.   This stuff made me like everyone and positive and upbeat like I ate a cloud and rainbows or something.  DANK DANK DANK.  I barely even took two hits and I was already like smiling.",
            "username": "splifroll22"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/XRYqzYK3o4q7eiqa4tRKs0rwo7Q=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fW7fVX5AQLmXra7zAGlYf_wayfarers-red.png",
            "id": 1627917,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "What a trip;) Bought 5grams of Nepal Hash (I smoked this strain in hash n not flower) for only £20 here in den haag Coffeeshop Jansen..Really Good deal for the type of hash I got, Dark Brown on the Outside,Golden Brown on the Inside, it was a lil Hard to break up but it probably was because of the cold weather so I warmed it up and it was pretty sticky and flexible...really nice Sweet Hashy And very aromatic Smell !! and when smoked in a pipe the taste was PURE AND STRONG , wow, I smoked pipes the whole day, and kept on getting a very nice stony,  Up lifted and positive high that I could feel throughout my Body and mind...very Potent especially when smoked in a pipe!!! Must get it for mood Enhancement and stress, to just chill n smoke some good ,affordable hashish",
            "username": "AaronOblock"
        }
    ],
    "id": 100719,
    "name": "Nepalese",
    "negatives": [
        {
            "name": "Dry Eyes",
            "score": 50.416666666666664
        },
        {
            "name": "Dry Mouth",
            "score": 23.57142857142857
        },
        {
            "name": "Anxious",
            "score": 20
        },
        {
            "name": "Dizzy",
            "score": 2.380952380952381
        },
        {
            "name": "Headache",
            "score": 0.5952380952380952
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/sativa/nepalese",
    "photoTotalCount": 12,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002859/b/nepalese__primary_ead8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nepalese_100x100_e4c8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002858/b/nepalese__primary_7ad5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nepalese_100x100_a64b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000522/b/nepalese__primary_3774.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nepalese_100x100_4a63.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/573645/b/nepalese__primary_78ee.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nepalese_100x100_0b42.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/505699/b/nepalese__primary_df83.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nepalese_100x100_cd83.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/496998/b/nepalese__primary_9770.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/nepalese_100x100_aefa.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Calgary, AB",
        "Edmonton, AB",
        "Eugene, OR",
        "Halifax, NS",
        "Las Vegas, NV",
        "Saskatoon, SK",
        "Vernon, BC",
        "Victoria, BC",
        "Winnipeg, MB"
    ],
    "rating": 4.38,
    "relatedStrains": [],
    "reviewCount": 40,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "nepalese",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.375/240",
    "subtitle": null,
    "symbol": "Np",
    "symptoms": [
        {
            "name": "Stress",
            "score": 90.35714285714286
        },
        {
            "name": "Lack of Appetite",
            "score": 85.5952380952381
        },
        {
            "name": "Depression",
            "score": 83.51190476190476
        },
        {
            "name": "Headaches",
            "score": 73.0952380952381
        },
        {
            "name": "Nausea",
            "score": 62.916666666666664
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
