{"sl_translate":"description,descriptionPlain,category","id":38991,"slug":"cinex","name":"Cinex","subtitle":null,"symbol":"Cnx","category":"Sativa","description":"\u003cp\u003eCinex, a \u003ca href=\"http://www.leafly.com/hybrid\"\u003ehybrid\u003c/a\u003e of parents \u003ca href=\"http://www.leafly.com/hybrid/cinderella-99\"\u003eCinderella 99\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/sativa/vortex\"\u003eVortex\u003c/a\u003e, has a mixture of flavors ranging from \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-citrus\"\u003ecitrus\u003c/a\u003e to \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eearthy\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-skunk\"\u003eskunk\u003c/a\u003e. The effects are clear-headed and \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e, perfect for building a positive mindset and stimulating \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-creative\"\u003ecreative\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergy\u003c/a\u003e. Consumers enjoy Cinex for its ability to improve mood.\u003c/p\u003e\n","descriptionPlain":"Cinex, a hybrid of parents Cinderella 99 and Vortex, has a mixture of flavors ranging from sweet citrus to earthy skunk. The effects are clear-headed and uplifting, perfect for building a positive mindset and stimulating creative energy. Consumers enjoy Cinex for its ability to improve mood.\n","aka":"Cynex, Cenex","rating":4.34,"highlightedReviews":[{"id":1417116,"username":"Beardly","text":"A morning bowl of this and I\u0027m ready to get the kids off to school, wife off to work, and get my morning workout in and I keep going strong all day. Eases the pain of my back and helps me think straight. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png"},{"id":1639904,"username":"Shagatron","text":"Wow! Definitely my second favorite strain I\u0027ve come across. Excellent for an enhanced audio experience.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-12470","title":"The 5 Easiest Cannabis Strains to Grow for Beginners","author":"Trevor Hennings","category":null,"date":"\/Date(1480454152000)\/","text":"All cannabis strains are not created equal. Because of this, it’s important for novice growers to consider which strains might be best as they develop their skills in the garden. Some strains exhibit better resilience to drought, mold, disease, and insects. Others require less nutrients than others. As a beginner grower, it’s best to steer towards genetics that are more forgiving and easier to find while still offering high yields and a quality product.\n\nBut where to start? These five strains are known to demand less than some of their pickier, more finicky ancestors, and they tend to be easier to grow. If you’re a beginner grower, consider locating seeds or clones of the following cannabis varieties.\n   Blue Dream\nThe most popular strain among consumers, Blue Dream is also a great strain for novice growers. Its effects strike a balance between physical relaxation and a mellow, blissful high. These light-footed qualities make Blue Dream a popular choice for daytime relief of aches, pains, and bad moods.\nClones and seeds of this California-bred hybrid are easy to find, given the strain’s widespread popularity. Blue Dream is also great against powdery mildew and root rot, which make up two of the most common issues found in a cannabis garden.\n\nThough Blue Dream is one of the most common cannabis strains out there, it’s for a reason. This classic strain has a lot to offer to any consumer and grower as a high-yielding, potent varietal with approachable effects and an enticing berry flavor.               \n   Green Crack\nGreen Crack is another California strain great for those trying to find their green thumb. A long-standing popular strain in the outdoor California scene, Green Crack is a fantastic choice for anyone seeking a strong sativa-dominant plant. The sweet citrus aroma and high-energy effects of this strain blend perfectly, giving rise to an uplifted, motivational high.\n\nWhile most sativa strains are difficult to grow due to their long flowering time and upward stretch, Green Crack is one that can be managed. Its sativa traits stand strong in the strain’s upbeat effects, but its indica genetics give it a quick flowering time and improved yields. Unfortunately Green Crack is a clone-only strain, making it a little more difficult to find, especially outside the West Coast.\n   GG4 (f.k.a Gorilla Glue #4)\nA hybrid strain with an aroma as strong as its euphoria, GG4 (f.k.a Gorilla Glue #4) is a great choice for the novice grower looking to cultivate a sedating, flavorful strain. The genetics were developed by GG Strains and took the world by storm in 2014 after winning multiple Cannabis Cups.\nGG4 (f.k.a Gorilla Glue #4) has a very bushy growth pattern, making it an ideal strain for anyone looking to grow in a small space and explore the screen of green (SCROG) technique. Generally speaking, this strain offers up a lot of bang for its buck by producing a quality product without having to worry too much about specific nutrient needs. Also, due to its heavy resin production, this plant is a great option for those wanting to explore concentrate and hash production with their trim. The only concern are the groans that will come from trimmers as their scissors gunk up almost immediately.\n\n   Dutch Treat\nDutch Treat is a classic strain hailing from Amsterdam that has made its way around the world, landing predominantly in the Pacific Northwest. It’s a sweet-tasting hybrid that lands on the indica side of the spectrum while still holding onto its cerebrally activating effects.\nLike GG4 (f.k.a Gorilla Glue #4), Dutch Treat is a great indica-dominant plant for growing indoors. It offers high yields and a quality product that presents a uniquely candy-like aroma. If you’re a gardener in the PNW, this should be an easy strain to find and a pleasure to both grow and consume.\n\n   Cinex\nCinex is a sativa-dominant strain that can offer a THC level up to around 22%. Its genetics come from Cinderella 99 and Vortex, inheriting a high-energy euphoria that feeds creativity and productivity. Cinderella 99’s genetics have always been well-known for offering high yields, bushy plants, and high THC levels. Vortex is a sativa-dominant strain cherished for its intensely euphoric traits. The two combined results in a sturdy strain perfect for novice gardeners looking for something different.\nBecause of its Cindy 99 genetics, Cinex is suitable for the SCROG technique in smaller spaces while still offering quality sativa effects. Cinex is also armed with mold and mildew-resistant genetics, allowing more room for error.\n\nWhat’s the first strain you ever tried to grow? Would you recommend it to a first-time grower? Share your “first grow” story in the comments section below, so other blossoming farmers can learn from your experiences.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/11/29101502/five-strains-for-first-time-growers.jpg","urlslug":"/news/growing/easiest-cannabis-strains-to-grow-beginners"},{"id":"contentitems-39133","title":"Tips for Growing Cinex Cannabis","author":"Leafly Staff","category":null,"date":"\/Date(1503705076000)\/","text":"Ever wanted to grow your favorite strain? Leafly and Botanicare are teaming up on a series of grow guides that will equip you with all the tips and tricks you need to grow different strains successfully.\n\nStrain Overview: Cinex is a popular sativa that was bred by crossing parent strains Cinderella 99 and Vortex. It is known to be a clear-headed strain that alleviates pain while promoting focus and energy. Fruity citrus and earthy aromas make Cinex a perfect option for those looking for something light and pleasant in both high and flavor.\nGrow Techniques: Grow Cinex in a greenhouse or indoors hydroponically to maximize your yield. Using clones and the SOG (sea of green) method will ensure a beautiful canopy. This strain is relatively easy to prune and trim, making it popular for large productions.\nFlowering Time: 7-9 weeks\nYield: Moderate to high\nGrow Difficulty: Easy\nClimate: This Washington state-bred strain does well at handling slightly colder temperatures, but will ideally be kept between 65 and 80 degrees Fahrenheit.\nIndoor/Outdoor: Thrives both outdoors and indoors.\nFeeding: Feed moderately. In the few first weeks of vegging, feed with increased amounts of nitrogen to get the plants healthy and strong before switching to flowering.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/08/25101630/cinex-strain.jpg","urlslug":"/news/growing/how-to-grow-cinex-marijuana"}],"reviewCount":829,"flavors":[{"name":"Earthy","score":23.503863409770688},{"name":"Woody","score":14.036640079760717},{"name":"Pungent","score":10.575772681954138},{"name":"Citrus","score":8.2153539381854443},{"name":"Lemon","score":7.1554087736789622}],"effects":[{"name":"Focused","score":70.510343968095711},{"name":"Energetic","score":64.0677966101695},{"name":"Uplifted","score":58.660892323030907},{"name":"Creative","score":52.871385842472584},{"name":"Happy","score":48.227193419740772}],"symptoms":[{"name":"Depression","score":50.954012961116653},{"name":"Stress","score":45.495388833499504},{"name":"Fatigue","score":27.664506480558327},{"name":"Pain","score":27.235169491525426},{"name":"Lack of Appetite","score":17.159770687936192}],"conditions":[{"name":"Anxiety","score":29.633599202392823},{"name":"Migraines","score":15.760219341974077},{"name":"ADD/ADHD","score":11.975324027916251},{"name":"PTSD","score":10.226819541375873},{"name":"Arthritis","score":7.5542123629112661}],"negatives":[{"name":"Dry Eyes","score":29.472831505483548},{"name":"Dry Mouth","score":20.621884346959121},{"name":"Anxious","score":17.811565304087736},{"name":"Dizzy","score":13.787387836490527},{"name":"Paranoid","score":4.5974576271186436}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cinex_100x100_57ed.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/618827/b/cinex__primary_dbe6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cinex_100x100_a4cf.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/614062/b/cinex__primary_f5a8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cinex_100x100_bf36.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/612332/b/cinex__primary_8775.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cinex_100x100_8093.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/605706/b/cinex__primary_9b27.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cinex_100x100_291e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/565468/b/cinex__primary_94db.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/cinex_100x100_c457.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/565431/b/cinex__primary_f417.jpg"}],"photoTotalCount":113,"popularCities":["Portland, OR","Seattle, WA","Eugene, OR","Spokane, WA","Everett, WA","Bellingham, WA","Toronto, ON","Bend, OR","Lincoln City, OR","Beaverton, OR"],"permalink":"https://mobileapi.leafly.com/sativa/cinex","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.33655006031363/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Cinderella 99","subtitle":null,"slug":"cinderella-99","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/cinderella-99","symbol":"C99","applink":"leafly://strain/cinderella-99"},{"name":"Vortex","subtitle":null,"slug":"vortex","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/vortex","symbol":"Vor","applink":"leafly://strain/vortex"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":null,"growNotes":""}}
