{"sl_translate":"description,descriptionPlain,category","id":207920,"slug":"sputnik","name":"Sputnik","subtitle":null,"symbol":"Spu","category":"Sativa","description":"\u003cp\u003eWhat happens when you cross a space-themed \u003ca href=\"https://www.leafly.com/hybrid/apollo-13\"\u003eApollo 13\u003c/a\u003e strain with \u003ca href=\"https://www.leafly.com/indica/black-russian\"\u003eBlack Russian\u003c/a\u003e? You get Sputnik, a strain named after the satellite the Soviet Union launched into a quick orbit around the Earth in 1957. Sputnik has an aroma of a sweet fruit with hints of sour and diesel when exhaled.\u0026nbsp;Patients typically look to Sputnik for relief of chronic pain, anxiety, and insomnia.\u003c/p\u003e\n","descriptionPlain":"What happens when you cross a space-themed Apollo 13 strain with Black Russian? You get Sputnik, a strain named after the satellite the Soviet Union launched into a quick orbit around the Earth in 1957. Sputnik has an aroma of a sweet fruit with hints of sour and diesel when exhaled.\u0026nbsp;Patients typically look to Sputnik for relief of chronic pain, anxiety, and insomnia.\n","aka":null,"rating":4.53,"highlightedReviews":[{"id":1248423,"username":"w33dUSR","text":"Excellent! Got a gram of this on special at Harvest of Tempe ($11). My new fav.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"},{"id":1362646,"username":"BiggyTalls","text":"I love Sputnik. It has such a good flavor and keeps me active. It is an intense head high that I really enjoy if I\u0027m going out and doing things. Don\u0027t tend to get the munchies or anything on this, but cotton mouth is a factor. Still, the high is great. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3061","title":"Celebrate Space Exploration Day With These Cannabis Strains","author":"Leafly Staff","category":null,"date":"\/Date(1469051100000)\/","text":"Space: the final frontier. The massively empty wonder which has tantalized the imagination of mankind since first gazing upwards to witness the brilliance of the celestial. Whether for discovery, in reaction to climate change, or because you’re an overly excited core that wants to go to space, exploration is more relevant and possible than ever. With private space companies reigniting the torch of space travel and helmed by incredibly smart and innovative individuals (like Elon Musk, founder of SpaceX, or Sir Richard Branson of Virgin Galactic), it’s not hard to believe we are entering a golden age of cosmological discovery.\nOn the shoulders of giants we stride forward into a future not grounded on Earth. Here at Leafly, we’d like to reengage the booster switch and combust a little propellant in honor of the men and women around the world making the dream of space exploration a reality. We’ve compiled a list of outer space-themed cannabis strains to help you celebrate the scientists, star formations, conspiratorial UFO hunters, Apollo missions, and others on this Space Exploration Day.\n  Project Blue Book\nOriginating in 1952, Project Blue Book kicked off a series of studies conducted by the U.S. Air Force to determine if UFOs were a threat to national security. Its strain counterpart is a sativa-leaning hybrid offering a serene body high and calm, focused effects that are perfect for star-gazing.\n  Sputnik\nThis rocket was used by the Soviet Union to perform the world’s first satellite launch in 1957. Strain-wise, the spunky Sputnik sativa (say that three times fast!) has hints of sour and diesel, perhaps from that rocket boost of uplifting effects you may experience.\n“2 hits to liftoff. Decent buzz out of the launchpad. mid buzz nice and headize, no burn out at the end. good strain to kick back, and rate strains.” – sonofabrokenman\n  Apollo 11\nThe first space flight that brought humans on the Moon, Apollo 11 is the reason we’re celebrating this date today since it occurred on July 20th, 1969. Neil Armstrong and Buzz Aldrin took one small step for man and one giant leap for mankind. The strain, meanwhile, offers strong cerebral effects that are good for treating stress and moderate pain.\n“I love this strain. It takes you on a cosmic journey while leaving you grounded on planet earth. –symbol9991\n  Stephen Hawking Kush\nThe iconic theoretical physicist brought us predictions on black holes, gravitational singularity theorems, and cosmology. His strainsake, Stephen Hawking Kush, is an indica-dominant offering that helps with pain, nausea, and relaxation.\n“Healing codes from the universe immediately came to me when I smoked a hit of this high 11.4 CBD strain. Absolutely Smiles and TOTAL RELEIF are endrenching me in this dream. My love of indica just got greater because I have had a crush on Stephen Hawking and now I can smoke bud named after his fine ass and mind. WOW I think this strain will make me more intelligent. It is so much stonier and higher than I thought it …” – StellarStoner\n  Apollo 13\nThe seventh manned mission in the Apollo space program, Apollo 13 was the United States’ third intended Moon landing. Unfortunately, an oxygen tank exploded and crippled the Service Module. The crew managed to cobble together some makeshift repairs and return safely to Earth on April 17th. Not only did this historical event result in a blockbuster film of the same name, it also inspired the popular Apollo 13 hybrid strain featuring cerebral, energizing effects and an appropriately earthy scent.\n“WOW! Such an appropriate name, because I’m blasted light years past the moon. Light speed ahead, on a rocket ship I said, catch me if you can, I’m your spaceman…” –NunoFreak\n  Cosmic Collision\nThis sativa collided Cosmic Charlie with Piña Collision to create a fusion that’s out of this world. Enjoy the pineapple-kiwi flavors of Cosmic Collision and its uplifting, euphoric effects while you ponder exactly how far the universe extends.\n  Carl Sagan\nThe American astronomer, cosmologist, astrophysicist, and astrobiologist dedicated his efforts to researching extraterrestrial life and sent the first physical messages into space. His Carl Sagan strain counterpart offers balanced effects and relaxation.\n  Outer Space\nDefined as the void that exists between celestial bodies, the mystery of outer space will keep scientists hunting for answers well into the next millennium. The sativa Outer Space is widely touted for its creative, uplifting, and energetic effects.\n“Really makes you feel like taking off into space. More of a head uplifting feeling and focus.” – robmorales\n  Nebula\nA nebula is an interstellar cloud comprised of dust, helium, hydrogen, and other ionized gases. Its hybrid Nebula strain version twinkles with THC coating and offers intense, almost psychedelic effects.\n“Out of this world!” – hermantheworm420","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001512/cannabis-strains-for-space-exploration-day.jpg","urlslug":"/news/strains-products/cannabis-strains-for-space-exploration-day"},{"id":"contentitems-3337","title":"New Strains Alert: Mai Tai Cookies, Purple Tangie, Sputnik, Go Time, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1455303660000)\/","text":"This week\u0027s newly added strains are a mix of Los Angeles Cannabis Cup winners, classic genetics, and varieites that are fairly new to the game. Find out if they\u0027re available near you by checking the links below, and don\u0027t forget to leave reviews for the ones you\u0027ve tried.\n \n   1. Mai Tai Cookies\n\nMai Tai Cookies is a CBD-rich hybrid strain bred by Terraform Genetics, who crossed Alien Orange Cookies and ACDC. She took 1st place for “Best CBD Flower” at the 2016 High Times Cannabis Cup in Los Angeles. This hybrid is very frosty compared to most CBD strains and has a unique aroma of cherries and orange peels. With a high that is very relaxing and yet functional, patients would typically choose this strain for pain and anxiety. Her flowers have a dense structure similar to that of GSC (f.k.a Girl Scout Cookies) and are ready for harvest after a flowering cycle of 50-55 days.\n\n \n   2. Purple Tangie\n\nA spin on the citrus-loaded Tangie sativa, Purple Tangie is a flavorful strain that invigorates the spirit with uplifting euphoria. In a show of its quality, Purple Tangie took 1st place in the “Best Medical Sativa Concentrate” category at the 2016 High Times Cannabis Cup in Los Angeles. You may find that Purple Tangie offers an energetic kick to your social skills, but this strain can certainly be enjoyed in isolation, especially when you’re occupied by creative projects.\n\n \n   3. P-51\n\nP-51 is a piney, earthy indica strain that crosses a Tahoe OG male and a Blackberry mother. Created by Clint Pipkin, a grower in both Humboldt County and Northwestern Washington, the male was flowered in a window sill on the Key Peninsula in Pierce County. Thousands of seeds were created during this cross, and Washington producer Rootworx narrowed this strain down to the best cut from 70 phenotypes. This has become Rootworx’s signature strain, resulting in DOPE Magazine’s “Strain of the Month” in June 2015. This deeply relaxing indica has also been deemed “The Tranquilizer Dart” in recreational retail shops throughout Washington state.\n\nClick here for a full list of locations currently carrying P-51\n \n   4. Go Time\n\nGo Time is a sativa-dominant hybrid strain bred by JinxProof Genetics. A cross between Norton and JOG Kush, this uplifting strain is perfect for perking up moods, stimulating focus, and coercing arousal. Zesty lemon aromas combine with sour, skunky diesel notes with an earthy, hashy finish. As pretty as it is potent, Go Time flowers erupt with bulging calyxes of pastel purples, pinks, and greens underneath a snow-white coat of crystal resin.\n\n \n   5. Sputnik\n\nWhat happens when you cross a space-themed Apollo 13 strain with Black Russian? You get Sputnik, a strain named after the satellite the Soviet Union launched into a quick orbit around the Earth in 1957. Sputnik has an aroma of a sweet fruit with hints of sour and diesel when exhaled. Patients typically look to Sputnik for relief of chronic pain, anxiety, and insomnia.\n\nClick here for a full list of locations currently carrying Sputnik\n \n   6. KC 36\n\nCultivated by KC Brains, KC 36 is an indica strain bred specifically to flourish at high latitudes. A cross between White Widow and KC 606, these frosty and compact buds deliver full-on body relaxation alongside a sweet and spicy floral aroma. The peaceful, introspective qualities of KC 36 make this indica a perfect pair for meditation and enjoying nature.\n\n \n   7. Queso\n\nCreated in 2011 by Kannabia Seeds using Cheese and Afghani genetics, Queso (Spanish for “cheese”) is a hybrid strain that provides powerful body effects and mood elevation. This potent strain is typically used to relieve pain, stress, anxiety, and insomnia. Growers, take note: Queso requires a minimum flowering cycle of 7 weeks , but optimal yields arrive after 8 weeks.\n\nClick here for a full list of locations currently carrying Queso\n \nBrowse through other new strains that were added recently to the Leafly Explorer or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/12002229/new-strains-alert-mai-tai-cookies-purple-tangie-sputnik-go-time-a.png","urlslug":"/news/strains-products/new-strains-alert-mai-tai-cookies-purple-tangie-sputnik-go-time-a"}],"reviewCount":19,"flavors":[{"name":"Sweet","score":3.2608695652173911},{"name":"Flowery","score":3.2608695652173911},{"name":"Tea","score":3.2608695652173911},{"name":"Spicy/Herbal","score":2.1739130434782608},{"name":"Sage","score":2.1739130434782608}],"effects":[{"name":"Uplifted","score":8.695652173913043},{"name":"Happy","score":8.695652173913043},{"name":"Relaxed","score":7.608695652173914},{"name":"Creative","score":6.5217391304347823},{"name":"Energetic","score":6.5217391304347823}],"symptoms":[{"name":"Depression","score":5.4347826086956523},{"name":"Pain","score":4.3478260869565215},{"name":"Stress","score":4.3478260869565215},{"name":"Cramps","score":3.2608695652173911},{"name":"Headaches","score":3.2608695652173911}],"conditions":[{"name":"Fibromyalgia","score":3.2608695652173911},{"name":"PMS","score":3.2608695652173911},{"name":"PTSD","score":3.2608695652173911},{"name":"Anorexia","score":2.1739130434782608},{"name":"Anxiety","score":2.1739130434782608}],"negatives":[{"name":"Dry Mouth","score":5.4347826086956523},{"name":"Dry Eyes","score":4.3478260869565215},{"name":"Dizzy","score":1.0869565217391304},{"name":"Headache","score":1.0869565217391304},{"name":"Paranoid","score":1.0869565217391304}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sputnik_100x100_363a.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506380/b/sputnik__primary_ee07.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sputnik_100x100_65e0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506288/b/sputnik__primary_aaea.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sputnik_100x100_f3f4.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506252/b/sputnik__primary_d40b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sputnik_100x100_245c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506287/b/sputnik__primary_5aa4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sputnik_100x100_5a93.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/458096/b/sputnik__primary_e050.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/sputnik_100x100_e920.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/455378/b/sputnik__primary_8cf2.jpg"}],"photoTotalCount":6,"popularCities":[],"permalink":"https://mobileapi.leafly.com/sativa/sputnik","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.52631578947368/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Apollo 13","subtitle":null,"slug":"apollo-13","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/apollo-13","symbol":"A13","applink":"leafly://strain/apollo-13"},{"name":"Black Russian","subtitle":null,"slug":"black-russian","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/black-russian","symbol":"Bru","applink":"leafly://strain/black-russian"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":60,"outdoorFinish":"mid September","height":null,"averageYield":null,"environment":null,"growNotes":""}}
