{
    "aka": null,
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1511894705000)/",
            "id": "contentitems-49877",
            "text": "As we explored recently with our list of 9 Most Overhyped Cannabis Strains, a few of the best-known cannabis varieties on the market are a little overrated. Correspondingly, it’s no surprise that there are some underrated cannabis strains out there, too.\n\nThe following represent 11 varieties of cannabis that we think get less love than they deserve, based on Leafly review data, regional availability, and the personal experiences of our cannabis expert team. This is far from an exhaustive list—with thousands of strains available in the world, it’s virtually impossible to give all of them the attention we wish we could. Nevertheless, take the following as just a few recommendations of lesser-known types you should keep an eye out for—who knows? You just might find your new favorite strain among them.\nTahoe OG Kush\nStrain type: Hybrid\nParent strains: OG Kush, SFV OG Kush\nWhy it’s underrated: “Tahoe OG isn’t underrated in the traditional sense of the word. In fact, most people I know who’ve come across this select OG Kush phenotype will share their excitement for the pungent, piney sweetness and the strain’s dynamic mix of deep relaxation and profound euphoria. However, when I think of the OG family tree, the Tahoe cut doesn’t seem to get quite the same notoriety that some of its relatives. The SFV, Larry, and Fire OGs manage to capture a lot of the buzz, while other cuts, like the Ghost and WiFi OGs, have somewhat cult followings. This leaves room for Tahoe OG to stand on its own, which is OK by me. I love its dank, complex aroma and the sedating effects, so the less hype there is for Tahoe OG, the more of this delicious strain is available for me!” —Will Hyde\n\nLodi Dodi\nStrain type: Hybrid\nParent strains: Undisclosed\nWhy it’s underrated: “This strain is a mainstay in the Pacific Northwest, but still flies beneath the radar outside the region. Sativa-dominant in effect, this unknown cultivar has been propagated throughout the Evergreen State for decades. Lodi Dodi’s airy physical lightness and uplifting mental buzz allow the consumer to metaphorically levitate two inches above their problems and their pain. I personally enjoy working out after consuming this strain for its stimulating aura and a mental haze that allows me to fade into my headphones and run forever. It’s equally satisfying on the dancefloor or in the bedroom, as long as you mind your dosage. Lodi Dodi came to party—it don’t cause trouble or bother nobody.” —Jeremiah Wilhelm\nChocolope Kush\nStrain type: Hybrid\nParent strains:  Chocolope, Kosher Kush\nWhy it’s underrated: “This is, weirdly, one of the lowest-rated strains on Leafly (yep, a four-star rating is on the low end—Leafly reviewers give most cannabis pretty high marks), but riddle me this: How can a marriage of superstars like Chocolope and Kosher Kush possibly be bad? Those parent strains are two of our all-time faves (in fact, both landed on our Top 100 Strains list) and given that the apple rarely falls far from the tree, this super-low rating for Chocolate Kush is undeserved.” —Brett Konen\n\nDancehall\nStrain type: Hybrid\nParent strains: Juanita La Lagrimosa, Kalijah\nWhy it’s underrated: “Dancehall is an exceptional CBD-dominant strain that doesn’t get much recognition by comparison to CBD hallmarks like Harlequin, ACDC, Charlotte’s Web, and Cannatonic. With a near 21:1 CBD:THC ratio, Dancehall delivers soothing, easygoing effects with just enough sativa-dominant influence to elevate mood, which makes it a constant companion for consumers who like to stay level and clearheaded while enjoying cannabis. The terpene profile also offers deeper, skunkier notes than the usual grassy, hay-like aroma CBD strains are known for. Whether you’re enjoying it for what it is, or blending with your THC-dominant strains, Dancehall adds something special and drastically underappreciate to any joint or bowl.” —Jeremiah Wilhelm\nBay Dream\nStrain type: Sativa\nParent strains: Blue Dream, Bay 11\nWhy it’s underrated: “Bay Dream is an uplifting strain with sharp citrus notes and subtle earthiness. It seems to be overlooked because of its polarizing parent strain, Blue Dream, but in combination with the sweet, skunky flavors and focused headspace of Bay 11 the mix is a pleasant surprise. I appreciate that Bay Dream trades some of Blue Dream’s fruit notes for a deeper, more poignant Kush-like palate of flavors. So, if you’re in the ‘Blue Dream is overrated’ crowd, don’t shy away from Bay Dream—you might be amazed by how much this strain expresses its individuality.” —Will Hyde\n\nSour Urkle\nStrain type: Hybrid\nParent strains: Sour Diesel, Purple Urkle\nWhy it’s underrated: “Sour Urkle is the potent union of pungent, polar opposites. Created from Sour Diesel and Purple Urkle, this funky and surprisingly affordable bud packs the best of both strains into one frosty package. This strain emits an odd floral and chemical aroma that is contrasted against a latent but tangible sweetness brought forth by the fruitiness of Purple Urkle. This flavor profile can be challenging for some, but the effects are undeniably heady while draping the body in a soothing, mellow aura.” —Jeremiah Wilhelm\nPresidential Kush\nStrain type: Indica\nParent strains: Bubble Gum, OG Kush\nWhy it’s underrated: “Easily one of the more picturesque strains I’ve come across, Presidential Kush (also known as Presidential OG) expresses itself with deep green and purple hues. A thick blanket of trichomes adds another dimension to the strain’s aesthetic, but PK is so much more than just a pretty flower. It’s a potent, complex, and flavorful experience that only takes a puff or two before you feel the comforting weight of deep relaxation wash over you. The piney, diesel flavors make it hard to put down, and I still find myself embarking on epic journeys just to track down this beautiful bud. In my opinion, genetics this compelling should be easier to find and should be garnering more attention in the cannabis community, so for that reason, I’d like to encourage more growers to add this strain to their stable, and if you find it at your local dispensary as a consumer, definitely do not overlook it!” —Will Hyde\n\nDurban Poison\nStrain type: Sativa\nParent strains: African\nWhy it’s underrated: “Landrace strains, including Durban Poison, are hard to find and often faked. As such, many people have had a less-enjoyable-than-average experience with a strain they believed, mistakenly, to be the landrace advertised on the packaging. Durban Poison is a fantastic pure sativa that many people, including myself, loved at first smoke, so if Durban Poison didn’t wow you the first time around, give it another chance—that first batch might have been something else that was merely masquerading as this iconic strain.” —Brett Konen\nApple Jack\nStrain type: Hybrid\nParent strains: Jack Herer, White Widow\nWhy it’s underrated: “Apple Jack hasn’t gained much in the way of ratings on Leafly, but that doesn’t mean it’s a dud. It blends two well-known cuts together (Jack Herer x White Widow) to create something greater than the sum of its parts. Apple Jack’s initially clear-headed high relieves stress while elevating the mind and encouraging creativity. The happy effects and accessible THC concentration make it a friendly flower for consumers of all potency levels. And even though its flavor doesn’t always live up the name, Apple Jack’s sweet, earthy terpene profile still offers satisfying flavors alongside a productive buzz.” —Jeremiah Wilhelm\n\nPlushberry\nStrain type: Indica\nParent strains: Black Cherry Soda, Space Queen\nWhy it’s underrated: “Plushberry is an incredible strain that’s underrated simply because it hasn’t appeared to travel beyond the Pacific Northwest. Wrapped in beautiful lavender foliage, it smells like sweet wildflowers and mixed berries, and if you have the chance to try it while you’re in the area, Plushberry is a strain you won’t soon forget.” —Bailey Rahn\nSkunk No. 1\nStrain type: Hybrid\nParent strains: Afghani, Acapulco Gold, Colombian Gold\nWhy it’s underrated: “Even if you don’t love the flavor of the flower itself, you’ve got to respect a strain that’s given us so many of our favorites on the market—I’m talking Green Crack, Island Sweet Skunk, Amnesia, Pineapple Chunk, UK Cheese, and so many more. Skunk No. 1 is a true original among cannabis strains, and while its skunky flavor is an acquired taste, you’re smoking a piece of history with Skunk No. 1—so respect your elders.” —Brett Konen",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/11/28103218/most-underrated-cannabis-strains.jpg",
            "title": "11 Unsung Cannabis Strains Worth Discovering",
            "urlslug": "/news/strains-products/11-underrated-marijuana-strains"
        },
        {
            "author": "Lisa Rough",
            "category": null,
            "date": "/Date(1448568000000)/",
            "id": "contentitems-2967",
            "text": "After you’ve devoured every last ounce of gravy your stomach can handle, doused your pumpkin pie in whipped cream, and are now lying on the couch feeling somewhere between extremely satiated and \"I hate myself,” as Louis CK would put it, I’ll bet you’re thinking what I’m thinking: Some cannabis would be mighty fine right about now.\nAfter a hefty meal loaded with (delicious, delicious) carbs, you’re bound to be feeling bloated, possibly even a little bit nauseous. You think about counteracting your discomfort with some cannabis, but which strains will offer the best digestive aid?\nDon't worry, we're hear to help! Here are some strains to ease your aching tummy after a huge holiday meal.\n \n   Thin Mint GSC (f.k.a Girl Scout Cookies)\nThis hybrid cross has some pretty impressive origins – we all know the famous GSC (f.k.a Girl Scout Cookies) of legendary status. Cross that with Durban Poison from a continent away in South Africa, and you’ve got a powerhouse combination that will knock any uncomfortable indigestion out solid (although it might knock you out, too). As an added bonus, this strain tastes like a nice minty after-dinner treat!\n \n   SFV OG Kush\nSFV OG Kush is a heavy indica to top all heavy indicas. Of Afghani origins, crossed with OG Kush and SFV OG, this indica has a spicy citrus kick followed by a sleepy stone. Don’t hit this bad boy unless you’re ready to go down for the count.\n \n   Bay Dream\nLooking for something that’ll settle your tummy but won’t leave you in a coma? Check out this savory sativa. A cross of Blue Dream and Bay 11, Bay Dream has a soothing effect on the stomach, with a cerebral burst of euphoria. This is also an excellent strain if you’re looking for a creative boost to get some work done.\n \n   Ringo’s Gift\nRingo's Gift is best for those looking for a dose of pain relief with their relaxation. This peppery strain crosses Harle-Tsu and ACDC for a powerful full-body pain reliever without the stoney couchlock effect. The body buzz is strong, but the cerebral effects are subtle – you might be talking someone’s ear off for 20 minutes before you notice.\n \n   Chemo\nThis strain’s name really says it all. It was conceived to counteract the side effects of chemotherapy, and this is easily the top strain for anyone dealing with nausea, stomach cramping, or a loss of appetite. Keep in mind that Chemo is P-O-T-E-N-T, but it's the perfect choice if you’re looking for a comfy after-dinner snooze.\n \n   Blue Hawaiian\nFor a more subtle approach, this combination of the classic Blue Dream and Hawaiian Sativa will smooth out your stomach and give you a happy head high. It's a balanced hybrid, offering a tropical taste of pineapple and a sweet burst of blueberry. After a few puffs, you’ll be feeling super mellow without a care in the world.\n \n   Strawberry\nStrawberry flavors highlight another stomach-soothing sativa strain you can try. It's especially good for those who might be prone to anxiety, as Strawberry offers a calm, relaxing buzz without the paranoia that is often common in sativa strains. This one is also a great choice for those who have social anxiety, particularly if your relatives are *ahem* out-staying their welcome.\n \n   Pure Kush\nTried and true, this indica is a favorite for those looking to stop their pain dead in its tracks. This is the strain you’ll want if you’re looking to sedate yourself into a sleepy stupor. It starts with a little sativa surge for the first few minutes, followed immediately by a pleasant pressure in your head and face. Once you settle yourself after a little dose of Pure Kush, don’t make any plans because you won’t be moving from your spot for a while.\n \n   Maui Bubble Gift\nWith a name like that, this strain sounds a bit discombobulated, but that’s really just because it’s a delightful hybrid composed of the best of all worlds. With origins in Maui Waui, Bubble Gum, and God’s Gift, this strain really is a gift. It's This usually high in CBD, with a pleasantly cerebral buzz from Maui Waui, a blast of pain relief from Bubble Gum, and a gentle, caressing body stone that swoops in at the last minute. Your tummy troubles will soon be forgotten with Maui Bubble Gift!\n \n   Hashberry\nThis is a nice indica to try as an indigestion aid that won’t knock you out. Hashberry has resinous buds covered in sticky trichomes, so keep in mind that it’s not a strain for beginners. It has a soothing effect on muscles as well as offers full body relaxation while still allowing some degree of sociability. You’ll be giggly and relaxed without being comatose.\nThere you have it! By now, hopefully you've got your feet up, a smile on your face, and are experiencing blissful satisfaction (hopefully while wearing comfy, stretchy pants). Happy Turkey Day!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12001229/10-strains-to-aid-digestion-after-a-big-meal.jpg",
            "title": "10 Cannabis Strains to Aid Digestion After a Big Meal",
            "urlslug": "/news/strains-products/10-strains-to-aid-digestion-after-a-big-meal"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 32.80632411067194
        },
        {
            "name": "Bipolar Disorder",
            "score": 26.902173913043477
        },
        {
            "name": "PTSD",
            "score": 14.130434782608695
        },
        {
            "name": "Arthritis",
            "score": 13.315217391304348
        },
        {
            "name": "Migraines",
            "score": 5.632411067193676
        }
    ],
    "description": "<p>Granddaddy Purp&rsquo;s Bay Dream is a dreamy <a href=\"http://leafly.com/sativa\">sativa</a> cross between the esteemed <a href=\"http://www.leafly.com/hybrid/blue-dream\">Blue Dream</a> and <a href=\"http://www.leafly.com/sativa/bay-11\">Bay 11</a>. Blue Dream passes on a subtle <a href=\"http://www.leafly.com/explore#!/explore/flavors-pine\">pine</a> aroma coupled with <a href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\">sweet</a> <a href=\"http://www.leafly.com/explore#!/explore/flavors-lemon\">lemon</a>. Patients needing an <a href=\"http://www.leafly.com/explore#!/explore/symptoms-lack-of-appetite\">appetite</a> boost tend to find relief in Bay Dream, and its cerebrally-focused <a href=\"http://www.leafly.com/explore#!/explore/tags-euphoric\">euphoria</a> provides a steady buzz that begins to feel intoxicating with increased doses. The effects are fast-paced and active, so Bay Dream may not be the best choice for <a href=\"http://www.leafly.com/explore#!/explore/conditions-anxiety\">anxiety</a>-prone consumers. Bay Dream&rsquo;s heavy yields make this sativa a favorite among growers, who wait 9 to 10 weeks for it to flower indoors. Outdoor plants sown at the beginning of June will finish flowering near the end of October with heights that stretch as tall as 10 feet.</p>\n",
    "descriptionPlain": "Granddaddy Purp&rsquo;s Bay Dream is a dreamy sativa cross between the esteemed Blue Dream and Bay 11. Blue Dream passes on a subtle pine aroma coupled with sweet lemon. Patients needing an appetite boost tend to find relief in Bay Dream, and its cerebrally-focused euphoria provides a steady buzz that begins to feel intoxicating with increased doses. The effects are fast-paced and active, so Bay Dream may not be the best choice for anxiety-prone consumers. Bay Dream&rsquo;s heavy yields make this sativa a favorite among growers, who wait 9 to 10 weeks for it to flower indoors. Outdoor plants sown at the beginning of June will finish flowering near the end of October with heights that stretch as tall as 10 feet.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 103.23616600790514
        },
        {
            "name": "Uplifted",
            "score": 91.9713438735178
        },
        {
            "name": "Euphoric",
            "score": 85.10375494071147
        },
        {
            "name": "Hungry",
            "score": 81.29940711462451
        },
        {
            "name": "Energetic",
            "score": 77.29743083003953
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 28.532608695652172
        },
        {
            "name": "Citrus",
            "score": 25.666996047430832
        },
        {
            "name": "Sweet",
            "score": 17.391304347826086
        },
        {
            "name": "Spicy/Herbal",
            "score": 17.317193675889328
        },
        {
            "name": "Flowery",
            "score": 13.043478260869565
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1416683,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Bay Dream is wicked...couple of puffs is all ya need...go for a walk or a jog after you partake & get focused...then hit the couch with your pad & charcoal & get messy. Or maybe catch some Game of Thrones or Californication action. Or go fishing. Or go for a swim. Point being its a great high to mate with just about any activity you're into.\nTastes and smells truly excellent...kinda sweet yet zesty...maybe a lil grape taste...Its skunky aroma can be smelled through 2 baggies & can be tasted en la boca for quite awhile after smoking...beautiful coloration with irridescent greens, lovely purple striations, and the legendary blue hue of love....\nSome of the better stuff I've seen in Connecticut (via Rhode Island) recently..respect to RI who always keeps it one hunned....well done sirs A+",
            "username": "ECCMassive"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1630010,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I like it when it comes to the psychoactive effects but I was surprised by the earthy taste.",
            "username": "Roaming_hippie"
        }
    ],
    "id": 81332,
    "name": "Bay Dream",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 25.666996047430832
        },
        {
            "name": "Dizzy",
            "score": 13.58695652173913
        },
        {
            "name": "Headache",
            "score": 4.817193675889328
        },
        {
            "name": "Dry Eyes",
            "score": 3.260869565217391
        },
        {
            "name": "Paranoid",
            "score": 1.9021739130434785
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/sativa/bay-dream",
    "photoTotalCount": 20,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/505959/b/bay-dream__primary_f901.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bay-dream_100x100_e871.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/501428/b/bay-dream__primary_dd9d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bay-dream_100x100_25c9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/496836/b/bay-dream__primary_2f4a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bay-dream_100x100_51e7.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/494548/b/bay-dream__primary_0d1d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bay-dream_100x100_6b17.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/494545/b/bay-dream__primary_f295.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bay-dream_100x100_4b06.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/457221/b/bay-dream__primary_2fa4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/bay-dream_100x100_1830.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Seattle, WA",
        "Colorado Springs, CO",
        "Shoreline, WA",
        "Spokane, WA",
        "Bellingham, WA",
        "Bremerton, WA",
        "Covington, WA",
        "Ellensburg, WA",
        "Everett, WA",
        "Kirkland, WA"
    ],
    "rating": 4.3,
    "relatedStrains": [],
    "reviewCount": 92,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "bay-dream",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.30434782608696/240",
    "subtitle": null,
    "symbol": "Bay",
    "symptoms": [
        {
            "name": "Stress",
            "score": 42.391304347826086
        },
        {
            "name": "Depression",
            "score": 30.434782608695652
        },
        {
            "name": "Lack of Appetite",
            "score": 27.445652173913043
        },
        {
            "name": "Pain",
            "score": 27.445652173913043
        },
        {
            "name": "Insomnia",
            "score": 25.543478260869566
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
