{
    "aka": "Shrom",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1488305017000)/",
            "id": "contentitems-19710",
            "text": "Some people choose a cannabis strain based on its name. Others by its THC content. Personally, I’m a sucker for aroma and flavor; whether it’s a flower, dabbable wax, or an oil cartridge, bad/bland/harsh flavor is a big turn-off. And with flavors ranging from sweet roses to earthy diesel, who wouldn’t want to explore the vast spectrum of tastes and smells cannabis has to offer?\n\nAlthough flavor has everything to do with how a product is grown, cured, stored, and processed, genetics play a role as well. Over the years, these strains have proven to be top contenders in the flavor game, consistently showing off rich terpene profiles that not only govern a strain’s smell, but enhance the strain’s effects as well.\n\nTangie is a citrus dream crafted by the masterminds at DNA Genetics. There’s no strain I’d sooner rely on for good flavor than this sativa; popping the lid of a jar of Tangie and filling your nose with the smell of fresh orange zest can be somewhat of a religious experience of wonderment. With the sweet smell of citrus and fruit medley, Tangie lets you drift upwards slowly and steadily into euphoria, where bad moods don’t stand a chance.\n\nDominated by gassy, diesel notes you might be surprised to enjoy, GG4 (f.k.a Gorilla Glue #4)’s aroma is balanced by sweet-and-sour skunk and refreshing pine. The smell of well-grown GG4 (f.k.a. Gorilla Glue #4) can completely conquer a room when opened, so if you’re practicing discretion, consider holding off on GG4 until you reach open air.\n\n\nKyle Kushman never would have guessed that the sad-looking clone he held in a paper bag would one day become the famous award-winning Strawberry Cough. But thank goodness he passed this one to his left and shared the strawberry goodness with all of us. This uplifting, creative sativa strain smells like it grew wild in a strawberry patch, radiating with the distinct aroma of ripe berries and rich earthy soil.\n\nSpeaking of strains that smell exactly like fruit, this list would never be complete without the mention of Blueberry. Without Blueberry, there would be no Blue Dream, no Blue Cheese, no Blue Cookies; “Blue” hybrids simply wouldn’t exist. You’ll notice all of these strains carry a blueberry-like smell, but few can match the original Blueberry’s uncanny resemblance to a bushel of overripe blueberries plucked straight from the branch.\n\n\nFlavors of lemon candy, sharp pine, and fresh herbs twist together to create the complex aroma of Dutch Treat. A budtender has never had to twist my arm when upselling Dutch Treat; it’s been hard to find a lackluster example of the flavorful strain after all these years. Beyond the obvious notes of citrus and pine, this strain endlessly offers subtle nuances of sage, mint, and pepper.\n\nBursting with flavors of lemon, lime, and pear, XJ-13 is a strain I can hardly ever turn down. Its aroma has a sour bite that seems to almost fizzle in your nose like a fruity spritzer on a hot summer day.\n\nLavender is a beautifully intricate indica strain that smells like – oh, you guessed it – lavender. Like an all-in-one bouquet, Lavender also offers up sweet accents of wildflower, rose, and violet underneath a layer of woody earthiness.\n\n\nGrapefruit is a fantastic wake-and-bake strain not only because of its awakening, high-energy high, it also tastes like a bowl of ripe red grapefruit sweetened with honey. I don’t often see it on dispensary shelves, but it’s a cherished rarity, especially when enjoyed on warm summer weekend mornings.\n\nRed Headed Stranger is a strain I’ve loved getting to know in both flower and oil form. Upon inhale, the palate is dowsed with sweet flavors that seem citrusy at first, but then you notice some of the quieter flavors of mint and pine giving the strain a fresh, herbaceous finish. Coupled with effects that soothe the body while letting the mind run unencumbered, Red Headed Stranger is a perfect afternoon smoke that can easily replace or enhance your favorite citrusy, hoppy beer.\n\n\nSchrom is somewhat of a local legend here in Seattle, but I simply can’t find it in my heart to neglect mentioning this glorious sativa strain that smells exactly like 7-Up. Herbal notes subtly underscore the pungent, unmistakable flavors of lemon-lime so strong, they monopolize the palate.\nThese are the strains that have been kindest to my nose, but what strains have a smell and/or flavor that make you swoon? Let me know what I’m missing out on in the comments section below!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/02/27165411/orange-cannabis.jpg",
            "title": "Leafly Staff Picks: The Best-Tasting Cannabis Strains",
            "urlslug": "/news/strains-products/best-tasting-and-smelling-marijuana-strains"
        },
        {
            "author": "Brett Konen",
            "category": null,
            "date": "/Date(1470524400000)/",
            "id": "contentitems-3033",
            "text": "Before the heat dies down and the sunsets start to shorten, it’s time to make the most out of your summer. And just as rosé is the perfect summer sipper, these 10 strains might as well have been bred expressly for summer fun with friends, whether out in the sun or under the stars.\nFrom sweet, citrusy sativas to sticky, sunset-hued hybrids, don’t miss a single one of the following cannabis strains this season.\n\nSchrom | Sativa\n \nAroma and flavor | Lemon-limey as a soda pop with extra squeezes of fresh-sliced citrus.\nExperience | Frequently tricky to hunt down, this 70% sativa delivers a breezy, buoyant, clear-headed elevation that’s completely worth the search. An axiom frequently uttered around the Leafly office: “Schrom is bomb.”\nWhat you need it for | Chilling on the back patio with your favorite people.\nIntake | Bong, with an ice pinch.\nGolden Pineapple | Hybrid\n \nAroma and flavor | Pineapple upside-down cake, fresh out of the oven, two inches from your nose. Somewhere nearby, a fruit basket overflows with papayas, ripe bananas, and mangoes.\nExperience | Gp is liquid sunshine, in the form of unadulterated happiness. You’ll want to dance, hum, and hug someone.\nWhat you need it for | Your friend’s backyard barbecue; pair it with a couple of teriyaki kebabs.\nIntake | Vaporizer that supports dry herb.\nRed-Headed Stranger | Sativa\n \nAroma and flavor | Subtly spicy, tangy and herbal.\nExperience | Zippy, jazzy, energetic.\nWhat you need it for | Day hike motivation. The view from the top of that mountain is going to look better than ever.\nIntake | Pipe, tincture, or baked into an edible.\nSunset Sherbet | Hybrid\n \nAroma and flavor | Sweetness underscores berry flavors on the inhale, then jumps out to steal the whole show on the exhale.\nExperience | GSC (f.k.a Girl Scout Cookies) may be legendary, but Sunset Sherbet is its heir apparent. The hybrid builds on Gsc’s all-star ancestry (grandparents: Cherry Pie, OG Kush, and Durban Poison), and weaves in a few indica-dominant characteristics all its own.\nWhat you need it for | A sandy beach at – you guessed it – sunset.\nIntake | Joint.\nIngrid | Indica\n \nAroma and flavor | Sweet, skunky, earthy.\nExperience | Not all indicas are made for summer, but Ingrid is the free-wheeling hippie kid who got cool in college, came home over summer vacation, and knocked everyone’s socks off. Side effects include a desire to snuggle up in a hammock and smile around at everyone and everything.\nWhat you need it for | Your next lakeside campout; break out a jar once you’ve settled by the campfire for the evening.\nIntake | Pipe.\nTangie | Sativa\n \nAroma and flavor | A tangerine dream come true. If aromas could drip citrus juice, this one would.\nExperience | Slow and shy to come on at first, Tg’s high tends to hit as soon as you look the other way. It’s a tingly rush of cool, creative energy, and you’re going to want to get up and do stuff.\nWhat you need it for | You know how you’ve been meaning to tackle that art project? Get on it.\nIntake | Concentrate; a li’l dab’ll do ya for the afternoon.\nSuper Silver Haze | Sativa\n \nAroma and flavor | Earthy with hints of pine, like gardening in an evergreen forest.\nExperience | With numerous coveted first-place awards, Ss is one of the most decorated strains out there, and its energetic, euphoric high is among the most classic. It’s a solid strain year-round, but its effects shine brightest from July through September.\nWhat you need it for | Your Labor Day backpacking trip.\nIntake | Pre-roll; no need to get fancy.\nJillybean | Hybrid\n \nAroma and flavor | Orange candy meets a creamsicle in a fruity, delicious flavor-splosion.\nExperience | Chatty and cheerful for hours on end.\nWhat you need it for | Sitting on your front porch (preferably on a porch swing) with a glass of iced tea in one hand.\nIntake | Time-to-time tokes off your concentrate pen.\nMercury OG | Indica\n \nAroma and flavor | Mer expresses a complex array of gorgeous floral characteristics; you’ll have a hard time taking your nose out of the jar long enough to load a bowl.\nExperience | Get ready to relax, breathe easy, and relish a deeply pleasurable body high.\nWhat you need it for | Your family vacation.\nIntake | Bong or dab rig – go for a big hit.\nPurple Trainwreck | Hybrid\n \nAroma and flavor | Think fragrant California wine grapes, freshly picked and about to be pressed.\nExperience | This bold yet balanced hybrid heightens everything you love about summer. There’s also a good chance it’ll bring on a bout of the giggles.\nWhat you need it for | An outdoor concert or afternoon of beach volleyball.\nIntake | Shatter, wax, or a classic joint.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/08/12001430/best-summer-cannabis-strains-2016.jpg",
            "title": "The 10 Cannabis Strains You Must Try This Summer",
            "urlslug": "/news/strains-products/best-summer-cannabis-strains-august-2016"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 2.586206896551724
        },
        {
            "name": "ADD/ADHD",
            "score": 1.7241379310344827
        },
        {
            "name": "Alzheimer's",
            "score": 1.7241379310344827
        },
        {
            "name": "Anorexia",
            "score": 1.7241379310344827
        },
        {
            "name": "Tourette's Syndrome",
            "score": 1.7241379310344827
        }
    ],
    "description": "<p>Schrom is a 70% <a href=\"http://leafly.com/sativa\">sativa</a> strain that delivers a clear-headed buzz with a <a href=\"http://www.leafly.com/explore#!/explore/flavors-pungent\">pungent</a> <a href=\"http://www.leafly.com/explore#!/explore/flavors-lemon\">lemon</a> and <a href=\"http://www.leafly.com/explore#!/explore/flavors-lime\">lime</a> aroma. Its genetics are subject to debate, but many believe this sativa was parented by <a href=\"http://www.leafly.com/indica/romulan\">Romulan</a> and either <a href=\"http://www.leafly.com/sativa/silver-haze\">Silver Haze</a> or Santa Marta <a href=\"http://www.leafly.com/sativa/colombian-gold\">Colombian Gold</a>. Its aroma fills the room with an enticing <a href=\"http://www.leafly.com/explore#!/explore/flavors-citrus\">citrus</a> aroma, but arguably Schrom&rsquo;s greatest merit is the mental clarity and functional buzz to come. During the day, Schrom <a href=\"http://www.leafly.com/explore#!/explore/tags-relaxed\">relaxes</a> the body without slowing the mind and leaves you alert enough to <a href=\"http://www.leafly.com/explore#!/explore/tags-focused\">focus</a> on the day&rsquo;s tasks. However, enjoying this strain late in the evening may be all it takes to fall into a good night&rsquo;s <a href=\"http://www.leafly.com/explore#!/explore/tags-sleepy\">sleep</a>.</p>\n",
    "descriptionPlain": "Schrom is a 70% sativa strain that delivers a clear-headed buzz with a pungent lemon and lime aroma. Its genetics are subject to debate, but many believe this sativa was parented by Romulan and either Silver Haze or Santa Marta Colombian Gold. Its aroma fills the room with an enticing citrus aroma, but arguably Schrom&rsquo;s greatest merit is the mental clarity and functional buzz to come. During the day, Schrom relaxes the body without slowing the mind and leaves you alert enough to focus on the day&rsquo;s tasks. However, enjoying this strain late in the evening may be all it takes to fall into a good night&rsquo;s sleep.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 22.844827586206897
        },
        {
            "name": "Uplifted",
            "score": 21.982758620689655
        },
        {
            "name": "Creative",
            "score": 21.120689655172413
        },
        {
            "name": "Euphoric",
            "score": 17.67241379310345
        },
        {
            "name": "Aroused",
            "score": 15.948275862068964
        }
    ],
    "flavors": [
        {
            "name": "Lemon",
            "score": 6.0344827586206895
        },
        {
            "name": "Citrus",
            "score": 5.172413793103448
        },
        {
            "name": "Lime",
            "score": 3.4482758620689653
        },
        {
            "name": "Pine",
            "score": 3.4482758620689653
        },
        {
            "name": "Sweet",
            "score": 2.586206896551724
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1394569,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Since finding Schrom, I can now officially report that I have a favorite strain. I have been reviewing strains on Leafly for nearly a year now, and have tried oodles from dispensaries in the Seattle area. None have stuck out in my memory so well as Schrom.\n\nI first tried this strain 1-2 months ago, and got the batch from Have a Heart Cafe by way of Kevin's Gardens. I came in looking for a sativa and the smell of Schrom took my heart right away. It's piney aroma is peppered with a touch of lemon-lime; it smells like a delicious all natural soda. The taste is even better. This is, without a doubt, the most delicious strain I've ever tasted.\n\nThe effects leave nothing to be desired. This strain can really do all the description says; it's as if it acclimates to your needs and desires. If used early in the day, it provides a calm high (body and mind) that doesn't disrupt clarity, but instead amplifies creativity and motivation. If used in the evening, it adjusts to your pace, slowing down for relaxation that eventually gives way to dreamy slumbers.\n\nWith Romulan as a parent, it adequately provides pain relief, soothing muscles and calming nerves, without being overburdened with the heavy indica tendency to promote constant drowsiness. \n\nIf you can find Schrom in your area, do yourself a favorite and TRY IT RIGHT NOW.",
            "username": "piccadilley"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/vxUbGC-GL2sfGs57ZqS403X6QwY=/fit-in/300x300/https%3a%2f%2fs3-us-west-2.amazonaws.com%2fleafly-images%2fuser-profile%2fx6D4xtSwTxqvdXWOLHPH_20180121_151358.jpg.png",
            "id": 1641151,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "A great sativa! I got it at Tsunami off W26 & the flower was grown in Astoria, OR. Yay for local bud! It smells awesom...lots of lemon. It drlivers a nice clear cerebral-buzz! I'm enjoying it for the first time out in the sun! ",
            "username": "theORherb"
        }
    ],
    "id": 88111,
    "name": "Schrom",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 3.4482758620689653
        },
        {
            "name": "Headache",
            "score": 1.7241379310344827
        },
        {
            "name": "Dry Eyes",
            "score": 0.8620689655172413
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/sativa/schrom",
    "photoTotalCount": 3,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/471690/b/schrom__primary_4a07.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/schrom_100x100_0ac0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/465156/b/schrom__primary_7d58.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/schrom_100x100_0c5a.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/176840/b/schrom_825x550_f9dc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/schrom_100x100_0e48.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Boston, MA",
        "Brockton, MA",
        "Denver, CO",
        "Granite Falls, WA",
        "Mundelein, IL",
        "Ocean Shores, WA"
    ],
    "rating": 4.38,
    "relatedStrains": [],
    "reviewCount": 24,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "schrom",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.375/240",
    "subtitle": null,
    "symbol": "Shr",
    "symptoms": [
        {
            "name": "Depression",
            "score": 17.67241379310345
        },
        {
            "name": "Stress",
            "score": 6.0344827586206895
        },
        {
            "name": "Pain",
            "score": 3.4482758620689653
        },
        {
            "name": "Lack of Appetite",
            "score": 2.586206896551724
        },
        {
            "name": "Muscle Spasms",
            "score": 2.586206896551724
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
