{"sl_translate":"description,descriptionPlain,category","id":2515,"slug":"asian-fantasy","name":"Asian Fantasy","subtitle":null,"symbol":"Asi","category":"Sativa","description":"\u003cp\u003eAfter repeated rumors that this strain suffered extinction thanks to a secretive breeder, enough sightings occur regularly to ensure that while rare, the Asian Fantasy strain does still exist. Its genetics, however, remain a mystery. What\u0026rsquo;s clear is that this strain has a healthy dose of sativa in it that will get ideas and creativity flowing. It\u0026rsquo;s also a beauty, with large, curled buds that have a covering of brick red hairs. The flowers emit a sweet and sour fragrance while the taste has a healthy dose of spice.\u003c/p\u003e\n","descriptionPlain":"After repeated rumors that this strain suffered extinction thanks to a secretive breeder, enough sightings occur regularly to ensure that while rare, the Asian Fantasy strain does still exist. Its genetics, however, remain a mystery. What\u0026rsquo;s clear is that this strain has a healthy dose of sativa in it that will get ideas and creativity flowing. It\u0026rsquo;s also a beauty, with large, curled buds that have a covering of brick red hairs. The flowers emit a sweet and sour fragrance while the taste has a healthy dose of spice.\n","aka":null,"rating":4.32,"highlightedReviews":[{"id":1384816,"username":"mrwizard7","text":"This stuff is great for gaming and watching movies, even maybe for going out. I was able to stay attentive and didn\u0027t fall asleep for once. The downside for me was the red eyes. So red I could hardly see any white and they felt like they were literally going to pop out of my head, still enjoyed it though. Overall 6/10.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/3/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1637414,"username":"Nivekw420","text":"this strain is the best feeling sativa I\u0027ve had in a awhile without the anxiety feeling for me I\u0027m the anxiety type and I\u0027m an indica guy but this is fireeeeee by barefarms they are doing great things go check them out!!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sPaGuIbcIjKwcF8O7kQXXoAFJ6s=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fkfmswExdS0yqeEmdLkUQ_nerd-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3177","title":"Leafly’s Dirtiest, Most NSFW Cannabis Strains","author":"Bailey Rahn","category":null,"date":"\/Date(1429632000000)\/","text":"The cannabis industry is well on its way to becoming a legitimate and respectable contributor to medicine, the economy, and popular culture in the United States. We’ve come a long way since the dawn of stoner stigmas, and Leafly’s primary goal is to promote worldwide acceptance of marijuana consumption beyond the usual stereotypes. But the market hasn’t always been as polished and PC as it is today, and we still have a lot of work to do.\nBrowse our database of strains and you’ll notice a few that stick out like sore thumbs amidst marketable monikers like Blue Dream, White Lotus, and Strawberry Kush. Some cannabis breeders are much less serious when it comes time to name their new genetic creation, and this list showcases the best of the worst – the dirtiest, the weirdest, the most NSFW strains in the history of cannabis.\n \n1. Wet Dream\n\nThere are a ton of strains out there that induce severe horniness in some individuals (trust us, we read enough detailed and personal strain reviews to know). But, as far as we know, this sativa strain didn’t get its name from a night of magical, sexy, THC-fueled dreams. Wet Dream is just a cleverly named genetic cross between parent strains Blue Dream and Ocean Beach Haze.\n \n2. MILF\n\nThe MILF strain was popularized by the Showtime series “Weeds” as the main character’s signature product, but it’s also a strain that exists in the real world. After hearing the way some growers talk about their “sexy ladies” in the garden, you might suspect that MILF was created by some dendrophiliac who gets off to marijuana plants nearing the end of their maturation cycle. Nope. It’s just a cheeky acronym for “Marijuana I’d Like to Flower.”\n \n3. Purple Monkey Balls\n\nThe history of Purple Monkey Balls is, for the most part, shrouded in mystery. But if we were to guess how its birth story went, it probably went something like:\n\"Once upon a time, there lived a dude that thought poop jokes and penis cartoons were the best thing ever. One day while tending his pot garden, the dude noticed his plants blooming with large, round, purple buds covered in wiry orange pistil hairs. ‘How testicular and primate-like these are,’ he noted with impeccable perception. ‘…Purple Monkey Balls. Yes. Who wouldn\u0027t smoke that?\u0027 And it was so.\"\n \n4. XXX OG\n\nWARNING: this strain contains somewhat hardcore levels of THC. Consumer discretion is advised. So yeah, this is a super potent indica strain that\u0027s said to have aphrodisiac qualities, but take in too much XXX OG and you’re more likely to find yourself uselessly slumped on the couch than in the bedroom making sexy times.\n \n5. Dirty Girl\n\nNot sure if people just expect arousal with a name like Dirty Girl, but there are enough horndog Leafly reviews to question the power of placebo. It’s easy to see Dirty Girl having a positive influence on the libido, though: the effects are energizing, functional, and just euphoric enough to turn a good night into a really, really, really ridiculously good night.\n \n6. Alaskan Thunder Fuck\n\nDespite having a name that would offend all those who keep a swear jar in their home, Alaskan Thunder Fuck remains a timeless classic that won’t be leaving the market any time soon. Some medical marijuana dispensaries abbreviate it to “ATF” on their menus to keep up appearances, but one might argue that this doesn’t provide fair warning of the thundering cerebral mindf*ck to come.\n \n7. Asian Fantasy\n\nYeah, there’s no exciting back story to Asian Fantasy. Her name\u0027s the only reason she\u0027s on this list.\n \nHave you come across any other cringe-tastic, dirty, or downright NSFW strains? Leave a comment with your favorites!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/04/12001833/leaflys-dirtiest-most-nsfw-cannabis-strains.jpg","urlslug":"/news/strains-products/leaflys-dirtiest-most-nsfw-cannabis-strains"},{"id":"contentitems-3127","title":"11 Arousing Strains to Help You Celebrate Valentine\u0027s Day Right","author":"Rebecca Kelley","category":null,"date":"\/Date(1392406680000)\/","text":"There’s nobody we’d rather spend Valentine’s Day with than all of you Leafly fans. Thanks for making our website and app such a success! You fill the buds in our heart.\nTo celebrate this amorous day, here are a few strains you might want to pick up for you and your honey, as they’ve been tagged by Leafly visitors as having an “arousing” effect. Enjoy!\nTo Kick the Evening Off\n\nYou don’t have to be of the Asian “persuasian” to enjoy this titillating sativa. Though Asian Fantasy is a somewhat rare find, this strain delivers arousing, energetic, and relaxing effects, as well as flavors of apples and cheese.\n“this strain smells and taste so good with a more sativa buzz to it” – lazytoke\n\nSweet and citrusy, Ultimate Trainwreck is rated high in arousal, focus, and happiness, which sounds like a recipe for a fun evening with your loved one.\n“By far one of my favorite strains. Just make sure you have a couch nearby, because you won’t be leaving it for a few hours. Smelled like an Angel’s Lady Parts, after they’d been put through 4 Quarters of an NFL game. I wouldn’t have it any other way.” – Sinsation\nTo Keep Things Going Right\n\nThis pretty Purple Princess has berry flavors and will leave you feeling creative, energetic, and euphoric — a perfect combination for trying out some new moves on your own prince or princess.\n“really nice head high, noticed a little cough so I broke it up and noticed that was a better idea. this girl has allot of branches tucked in her, not a terrible pain though because it’s easier to decipher flower because of her dark purple color. the feeling i instantly have after smoking it is it makes me feel happy in my head, really nice to listen to music on or some sexual adventure, I can see too. I donated a 25 and to my surprise she hits hard as a cerebral high and could have a couch lock feel if you let it.” – DevyantByson\n\nSour Dream is a beautiful hybrid of Blue Dream and Sour Diesel, resulting in an earthy, pungent experience that will spark arousal, euphoria, and a touch of the giggles. Keep you and your honey’s mood in amorous spirits with this Dream.\n“Just picked up and was surprised by the high I got. It smokes smooth and the high is even smoother. Drops you in some giggle fits and some longs conversations. Very social, functional, and fun high. Highly recommended if you want to uplift your day and go out and do something.” – Anonymous/a\u003e\nTo Take You Straight to Cuddle Town\n\nWhile it’s another somewhat rare find, Yumboldt is a potent strain that will help you and your drift off to sleep after a night of sexy shenanigans feeling happy and relaxed.\n“This is an effective strain of cannabis that provides a smooth, mellow, and pain relieving high. It has a very pleasant scent, with a great taste.. along with thick, beautiful orange hairs on the buds. As a veteran smoker, I will say that it’s one of the very best.” – Anonymous\n\nSome people can’t celebrate Valentine’s Day without a piece of chocolate, so Chocolate Chunk is a perfect way to cap off your special night. With flavors most commonly described as nutty, earthy, and coffee, this strain offers a rich way to help you both drift off to sleep.\n“I enjoy this strain before I end the day. It really helps me unwind all my stress after a long busy day.” – jakeyodice\nRecommended By Leafly Users\nLooking to stock up on even more sexy strains? Here are some Leafly visitor reviews that highlight some of our strains’ seductive sides:\n\n“Seriously, the sex on this strain has been… the BEST ever. My wife and I love it. My only complaint about GC is it doesn’t allow a solid night’s sleep. Instead, I can be restless and wake up feeling and looking tired. Oh well, not a big deal for weekends. And did I mention the sex? Wow.” – Synthie\n\n“Had great sex \u0026 amazing orgasm. Great daytime/sexytime strain” – koesherbacon\n\n“Wow, best sex of my life after this stuff! Great overall high, only down part is the scary dry eyes it’s typically gives.” – Anonymous\n\n“STRONG. extremely aroused… uncontrollable sex drive pain relief. head high is psychedlic and introspective but not euphoric. – georgeeliot\nLast, but certainly not least, this offering seems to be quite the popular arousing strain among our visitors:\n\n“I love it. Great high, great smell, awsome taste and an amazing high. Great to have sex while using. I recommend this strain to anyone.” – Long_live12\n“You won’t need Viagra with this awesome strain.” – ZenKat\n“This one makes both the male and female hormone go a little wild and if your lucky the sex better.” – McLovin94","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/02/12001707/happy-valentines-day-from-leafly.jpg","urlslug":"/news/strains-products/happy-valentines-day-from-leafly"}],"reviewCount":44,"flavors":[{"name":"Earthy","score":68.427230046948353},{"name":"Sweet","score":41.532528504359483},{"name":"Apple","score":34.741784037558681},{"name":"Spicy/Herbal","score":34.389671361502344},{"name":"Tobacco","score":33.333333333333329}],"effects":[{"name":"Creative","score":114.18511066398391},{"name":"Uplifted","score":87.290409121395015},{"name":"Relaxed","score":78.739101274312532},{"name":"Aroused","score":71.948356807511729},{"name":"Hungry","score":70.187793427230034}],"symptoms":[{"name":"Stress","score":73.004694835680738},{"name":"Depression","score":70.187793427230034},{"name":"Muscle Spasms","score":67.723004694835666},{"name":"Lack of Appetite","score":67.018779342723},{"name":"Nausea","score":66.666666666666657}],"conditions":[{"name":"Gastrointestinal Disorder","score":67.018779342723},{"name":"Anxiety","score":44.349429912810187},{"name":"PTSD","score":42.236753856472156},{"name":"PMS","score":41.884641180415819},{"name":"ADD/ADHD","score":35.093896713615017}],"negatives":[{"name":"Dry Mouth","score":49.3796109993293},{"name":"Dry Eyes","score":42.236753856472156},{"name":"Paranoid","score":34.037558685446008},{"name":"Anxious","score":33.685446009389665},{"name":"Dizzy","score":1.056338028169014}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/asian-fantasy_100x100_30ef.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002979/b/asian-fantasy__primary_7bc9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/asian-fantasy_100x100_0b0b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/311316/b/asian-fantasy__primary_9f72.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/asian-fantasy_100x100_70ea.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/311315/b/asian-fantasy__primary_99ea.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/asian-fantasy_100x100_e6ed.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/311249/b/asian-fantasy__primary_1959.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/asian-fantasy_100x100_08f3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/263402/b/asian-fantasy__primary_5bd0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/asian-fantasy_100x100_f6de.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/215124/b/asian-fantasy__primary_9e64.jpg"}],"photoTotalCount":11,"popularCities":["Los Angeles, CA","West Hollywood, CA"],"permalink":"https://mobileapi.leafly.com/sativa/asian-fantasy","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.31818181818182/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
