{"sl_translate":"description,descriptionPlain,category","id":65424,"slug":"candyland","name":"Candyland","subtitle":null,"symbol":"Cld","category":"Sativa","description":"\u003cp class=\"p1\"\u003eCandyland, a gold medalist of the 2012 KushCon, is a sativa-dominant hybrid bred from \u003ca href=\"http://www.leafly.com/indica/granddaddy-purple\"\u003e\u003cspan class=\"s1\"\u003eGranddaddy Purple\u003c/span\u003e\u003c/a\u003e and Bay \u003ca href=\"http://www.leafly.com/hybrid/platinum-girl-scout-cookies\"\u003e\u003cspan class=\"s1\"\u003ePlatinum Cookies\u003c/span\u003e\u003c/a\u003e. Golden hairs weave through Candyland\u0026rsquo;s thick coat of sugar-like trichomes and highlight the compact, camouflage-colored buds. This strain grows well indoors and out, and patients turn to Candyland when trying to moderate pain, muscle tension, and sour moods. Strong sativa genetics give Candyland uplifting and stimulating effects, making it a perfect strain for social gatherings or creative pastimes.\u003c/p\u003e\n","descriptionPlain":"Candyland, a gold medalist of the 2012 KushCon, is a sativa-dominant hybrid bred from Granddaddy Purple and Bay Platinum Cookies. Golden hairs weave through Candyland\u0026rsquo;s thick coat of sugar-like trichomes and highlight the compact, camouflage-colored buds. This strain grows well indoors and out, and patients turn to Candyland when trying to moderate pain, muscle tension, and sour moods. Strong sativa genetics give Candyland uplifting and stimulating effects, making it a perfect strain for social gatherings or creative pastimes.\n","aka":"Candy Land, Kandyland, Kandy Land","rating":4.6,"highlightedReviews":[{"id":1417639,"username":"runwaybeauty","text":"Love at first hit 💜 no dry eyes or dry mouth if I had a boyfriend he would be in trouble because it makes me horny ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png"},{"id":1642984,"username":"QueenPegasus","text":"a day favorite","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/ZtQxS6XT_MjOwMadRkRsU9ZNU-I=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fX2q7eTOS7WxMAnwrLSBM_wide-brim-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-66121","title":"Try These Strains Before Attending Your Next Sporting Event","author":"Dante Jordan","category":null,"date":"\/Date(1526423695000)\/","text":"If you don’t get high before attending a sporting event, then you’re doing it all wrong. I mean, sure, you can have a good time while being sober, but you can have a great time while being lifted.\nSo with that said, I curated a list of suggested strains for you to indulge in, depending on which sport you’re going to see. Peep the list, use Leafly’s Finder to locate the dispensaries stocking these strains, purchase, and enjoy some good ol’ sportsball.\nStrains to Pair With Exciting Sports (Basketball, Football, Soccer, Hockey)\nSports that fall under this category are the types of sports that include constant back and forth action, which keeps you engaged from start to finish. A big play is always looming, so you’re stuck to the edge of your seat because you don’t want to miss that big dunk or the chance to yell “GOOOOAAALLLLL” in the face of whoever’s sitting next to you. For that reason, you should indulge in strains that’ll have you uplifted and energetic, feeling hyped and ready for that big moment.\n  Candyland\nCandyland’s a high-THC, sativa-dominant hybrid that’ll have you super smacked without the paranoia. As a mix of Grandaddy Purple and Platinum GSC, it’s got an earthy type of scent and a sweet flavor, with effects that will have you uplifted, engaged, and in a whole entire world of euphoria. Smoke these before an exciting sport and those big plays will feel that much bigger.\nFind Candyland Nearby\n  Green Crack\nEveryone knows how good, energized, and focused Green Crack can make you feel. It’s one of those strains that you can smoke and power through the day like you drank 84 cold brews, so it’s perfect to smoke before a sporting event that you want to be locked into.\nFind Green Crack Nearby\n  Cotton Candy Kush\nCotton Candy Kush is another high-THC strain that leaves you feeling good, feeling great, feeling great, feeling good, like Outkast on “GhettoMusick.” As a mix of Power Plant and Lavender, its powerful effects are relaxing yet still energetic while inducing happiness, freedom, and overall euphoria, so you’ll be that much more excited when you see that Ronaldo bicycle kick for the game-winning goal live and in person.\nFind Cotton Candy Kush Nearby\n  Stardawg\nStardawg is one of the best smelling, best tasting, most euphoric, most energetic, most everything strains I’ve ever come across. Gifted to me by LTRMN in Portland, I smoked this and walked around the city for hours, falling in love with everything and everybody. It’s definitely a strain I’d recommend smoking before a sporting event, because every single dunk, touchdown, and goal will likely feel like the greatest moment in sports history for you.\nFind Stardawg Nearby\nStrains to Pair With Chill Sports (Baseball, Golf, Tennis)\nSports that fall under this category tend to be a lot more laid-back and reserved. Baseball games can be long and boring, and golf and tennis matches require damn near complete silence, with light clapping being the most excited you can get, so if you’re overly hyped at any of them, you may feel a bit uncomfortable or out-of-place. These strains will help you lean a little more towards the indica side of things.\n  Obama Kush\nObama Kush is a great indica with a relatively mild THC percentage that’ll chill you out without knocking you out. I smoked a gram joint of Obama Kush a few weeks ago and knocked out the entire first season of Girls Incarcerated on Netflix, which is still shorter than one full-length baseball game.\nFind Obama Kush Nearby\n  Larry OG\nLarry OG is a hybrid of OG Kush and SFV OG, whose indica effects will overtake your body and have you with your feet in the air like your Cares-to-Give Meter is at zero. Smoke a little of this and you’ll have no problem sitting through an entire round of golf, where the most exciting thing possible is a fox running across the course.\nFind Larry OG Nearby\n  Cheese\nCheese is an indica-dominant hybrid that:\n\nactually smells like Cheese, which is wild; and\nwill have you feeling relaxed while avoiding the sleepy sleepy nap nap state of mind.\n\nYou can smoke some Cheese and kick back in comfort for hours, so if you’re going to see one of the chill sports where everything’s deathly silent and calm, Cheese is a good strain to indulge in beforehand.\nFind Cheese Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/05/15152818/strains-before-sports-event.jpg","urlslug":"/news/strains-products/try-these-strains-before-attending-your-next-sporting-event"},{"id":"contentitems-24013","title":"10 Strains You Might Not Know Are Siblings","author":"Lisa Rough","category":null,"date":"\/Date(1491865568000)\/","text":"In honor of National Siblings Day, we decided to take a look at some of the most popular strains in cannabis and their offspring. There are quite a few strains that share genetics, but it just might surprise you to find out which strains are siblings.\n  Granddaddy Purple\nGDP is one of the oldest and most well-known strains. Let’s check out the kiddos!\nCandyland\nThis sativa-dominant hybrid is an award-winning strain from GDP and Bay Platinum Cookies. Its sativa side stems from the Platinum Cookies parent, which was created from OG Kush, Durban Poison, and a third unknown strain. Candyland is a rare sativa known for its relaxing relief from muscle aches with the added benefit of uplifting and stimulating effects.\nCherry Pie\nCherry Pie is renowned for its strong effects and high potency. The offspring of two cannabis heavyweights–GDP and Durban Poison–Cherry Pie has a fruity flavor and a high that can last several hours. Although there are claims that this strain tastes like real cherry pie, others compare the flavor to berries, much like the flavor of GDP. This sweet strain will melt away your stress and bring on a strong craving for your favorite munchies!\n\n  Blueberry\nBlueberry’s fruity genetics provide the backdrop for some of the most common and delicious strains available.\nBlue Dream\nThe “Blue” in this sativa-dominant celebrity strain comes from the Blue in Blueberry, while the “Dream” comes from another champion strain, Haze, a dreamy and euphoric sativa. Blue Dream is easily the most popular strain on Leafly, and its mild, uplifting effects make it the perfect strain for novice smokers.\nBerry White\nBerry White may be the offspring of two legendary strains, but this relaxing indica is famous in its own right for its balanced effects and a euphoric escape from stress and anxiety. With parentage from Blueberry and the epic hybrid White Widow, Berry White tends to taste like overripe sour blueberries and offers such mind-bending effects that you may forget you have arms.\n\n  Trainwreck\nA freight train of a hybrid strain, Trainwreck is sure to knock your socks off. What about its offspring?\nCasey Jones\nA little history lesson for you: Casey Jones is the name of a famous train engineer who was killed in a train wreck in 1900. However, for those of you who were raised on Saturday morning 90s cartoons, the name may sound more familiar as the hockey-masked vigilante from Teenage Mutant Ninja Turtles. Either way, this earthy sativa combines Oriental Express (an offshoot of Trainwreck and Thai) with East Coast Sour Diesel to create a power-packed punch that’s great for inspiring creativity.\nPineapple Express\nAh yes, everyone’s favorite movie-turned-famous-strain is known for its fruity sweet undertones. But did you know that it has roots in the speedy hybrid, Trainwreck? Pineapple Express is more than just a famous name, it combines Trainwreck and Hawaiian for a long-lasting energetic buzz and a sweet mango and pineapple citrus flavor that makes for one golden afternoon.\n\n  GSC (f.k.a Girl Scout Cookies)\nGSC (f.k.a Girl Scout Cookies) is the Genghis Khan of genetic stomp-arounds–these days, it seems like there are Cookies genetics in every new strain.\nSunset Sherbet\nSunset Sherbet is the heir apparent to the GSC throne. It’s known to have the heady, cerebral effects of GSC with an intoxicating boost from a heavy indica known as Pink Panties. Sunset Sherbet is so nicknamed due to its sweet, sherbet-like flavor, and tends to lean more heavily towards its indica roots than the standard GSC, so be prepared for a calm, relaxing high.\nMoon Cookies\nThis intergalactic herb crosses GSC (f.k.a Girl Scout Cookies) with another phenotype of itself to create a complex woody, earthy scent with some strong, heavy indica-leaning relaxation. These buds are hard, dense, resinous rocks that taste like cookie dough and will send you soaring up to the stars. But don’t consume too much Moon Cookies or you just might get lost in space.\n\n  Jack Herer\nOne of the most notorious cannabis activists spawned this world-renowned sativa, and Jack Herer‘s litany of offspring continues to expand with no end in sight.\nXJ-13\nWhat sounds like a top-secret government experiment is actually one of the most delightfully uplifting hybrids you can find. XJ-13 combines Jack Herer’s warm, fuzzy sativa genetics with the dreamy high of G13 Haze to create a stimulating and euphoric experience. It’s not heavy enough to make you feel asleep, but not stimulating enough to cause paranoia, giving consumers a perfectly balanced buzz that is high, happy, and carefree.\nDragon’s Breath\nThis sativa-dominant hybrid was born of two heavyweight strains, Jack Herer and Northern Lights. The name Dragon’s Breath is a reference to the spicy flavor and aroma accompanied by this hazy strain, but it won’t burn you out. Instead, you can expect a clear-headed, energetic, productive high. But be forewarned–too much of the Dragon may leave you feeling a bit paranoid.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/04/10154425/national-sibling-day.jpg","urlslug":"/news/strains-products/10-strains-might-not-know-siblings"}],"reviewCount":776,"flavors":[{"name":"Sweet","score":49.3232960342594},{"name":"Earthy","score":18.149482400551577},{"name":"Flowery","score":15.061589398672966},{"name":"Pungent","score":11.26747357881686},{"name":"Woody","score":10.681279483120896}],"effects":[{"name":"Happy","score":78.6619765549041},{"name":"Uplifted","score":77.463890382723633},{"name":"Euphoric","score":68.04712878185282},{"name":"Energetic","score":59.602726558620176},{"name":"Relaxed","score":51.445756774567059}],"symptoms":[{"name":"Depression","score":37.980500787614048},{"name":"Stress","score":34.009614875214723},{"name":"Fatigue","score":22.06854357527612},{"name":"Pain","score":22.005627829207619},{"name":"Headaches","score":12.206779083501571}],"conditions":[{"name":"Anxiety","score":32.449422524351625},{"name":"PTSD","score":17.093473570431904},{"name":"ADD/ADHD","score":12.809781202227196},{"name":"Migraines","score":9.6443654818852576},{"name":"Bipolar Disorder","score":7.8003424110632622}],"negatives":[{"name":"Dry Mouth","score":22.861045672467657},{"name":"Dry Eyes","score":14.58353263481578},{"name":"Paranoid","score":8.788947638625217},{"name":"Dizzy","score":7.1550724974625979},{"name":"Anxious","score":6.2417889377291331}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/candyland_100x100_8bfc.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1004785/b/candyland__primary_561a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/candyland_100x100_79ff.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003020/b/candyland__primary_3f47.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/candyland_100x100_07aa.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002753/b/candyland__primary_e1c4.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/candyland_100x100_d0e5.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1000736/b/candyland__primary_fed6.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/candyland_100x100_ad77.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/707885/b/candyland__primary_8ce8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/candyland_100x100_e563.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/708080/b/candyland__primary_31e5.jpg"}],"photoTotalCount":229,"popularCities":["Portland, OR","Seattle, WA","Eugene, OR","Los Angeles, CA","Phoenix, AZ","Detroit, MI","Spokane, WA","China","San Francisco, CA","Toronto, ON"],"permalink":"https://mobileapi.leafly.com/sativa/candyland","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.59536082474227/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Granddaddy Purple","subtitle":null,"slug":"granddaddy-purple","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/granddaddy-purple","symbol":"Gdp","applink":"leafly://strain/granddaddy-purple"},{"name":"Platinum GSC","subtitle":null,"slug":"platinum-gsc","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/platinum-gsc","symbol":"Pgs","applink":"leafly://strain/platinum-gsc"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":63,"outdoorFinish":null,"height":"Medium","averageYield":"High","environment":null,"growNotes":""}}
