{
    "aka": "ECSD",
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Jeremiah Wilhelm",
            "category": null,
            "date": "/Date(1475690456000)/",
            "id": "contentitems-8012",
            "text": "I grew up watching Adam West and Burt Ward thwart evildoers after school. Back then I would saunter into the living room and settle down in front of our JC Penney television to admire the collected demeanor of gentleman millionaire Bruce Wayne and his eager ward/sidekick as they unraveled the nefarious tapestry of evil that had been subtly stitched together with sinister subterfuge. (Apparently alliteration attracted audiences back then; or, if nothing else, it gave the dialogue a poetic quality.)\nOne of the most famous turns-of-phrase that came out of the dynamic duo of the mid-60s was Robin’s, “Holy ___, Batman!” This particular set of words arises hilariously often in strain reviews, so without further ado, here’s a small sampling of some of my favorites. Holy strain reviews, Batman!\nHybrid Cannabis Strains\n   GSC (f.k.a Girl Scout Cookies)\n\n“Holy carp fish, batman. This is magic. Definitely gives you a floaty, yet energized feel. You feel it creeping up behind your eyes and in two shakes of a lambs tail, you’re high as goddamn ever.” – Anonymous\n\n   Fruity Pebbles\n\n“Holy hand grenade of Antioch, Batman. Smoking this is like watching high speed film of a remote detonation. But a detonation of giggles and time slippage. Bring this to game-night at the beach. I did, and I’m very happy about that. Social, happy, very fast acting. The super-high phase came on within 5 minutes and lasted about 10-20 minutes. After words a really happy normal to low key high kicked in and took the wheel for around 3 hours. Two of us fell asleep during this time and three of us had energy to spare.  A very solid night sleep followed for me.” – ChestyMcDeathrack\n\n   Chemdawg\n\n“Holy space balls batman. I think we’ve got a winner right here. Toked a small bowl last after a month of FireOG and White Widow. Let me tell you I nearly tripped my balls out. I had a legit out of body experience lying in bed with my wife after smoking. Needless to say I couldn’t sleep. Headed down to TV land, Jay Leno’s new show is pretty good.” – jamtastic\n\nIndica Cannabis Strains\n   Superman OG\n\n“Holy sh*t Batman, I just found one of the newest to my Top 10!!! Dare I say to the coveted #1 slot?!? Honestly, I love ALL strains but you know the standouts and this strain STANDS out! When the description uses the word ‘pungent’, yep, it IS pungent and smokes the same. I usually cough during a bowl but the HIGH it totally worth it!! Definitely agree with many, this is NOT for beginners starting on meds like this but for everyone else, if you come across Superman, GET YOU SOME, you will not be disappointed!!! Believe it or not, this doesn’t really knock me out like others I know that have came across it but DAMN, I love the deeply euphoric, giggly, happy, relaxing high, one the best I’ve felt. Thank you GROWERS of this strain, your the BEST!!!” – dhlvisdrt\n\n   SFV OG Kush\n\n“Holy amazing sleep, Batman! SLEEPIES!! This knocked my ass OUT – I haven’t slept in 2 days and this let me sleep for 7 hours straight, didn’t even move. Super important different between this ‘Kush’ and regular OG…. Smelled like pine, a bit pungent, woody, lemon/citrus, and a slight herbal scent with a little spicy kick. This OG Kush combination is an amazingly super light and smooth smoke! Packed 1/2 a bowl and it tasted like sweet flowers, pine, dankish, and herbal, like tearing open a packet of tea. Went straight to my head and my face was nuuuuumb. Helped my spine amazingly well 5/5, took my kidney stone pain down to 30%, felt cold spots in my back where it hurts, helped with my tendon pain 3/5, and a little bit of nerve pain 2/5 – noticeable enough. No munchies, I passed out – definitely a night time use, great for insomnia. Hits heavy, so I wouldn’t use this as a beginner unless you have insomnia – this is your golden ticket!” – Midnyte003\n\n   G-13\n\n“uuuuuuhhhhh…. I don’t remember what I was doing. or anything at all for that matter. where am i, who am i. it’s about like that. lol. by far the best escape from reality I’ve ever experienced personally if u wanna sit back and chill and just not give a shit about a freaking thing period simply cause u can’t remember a freaking thing. this one is an absolute must try to believe what it can actually achieve for you. review does no justice cause it simply cannot be explained in words properly. has to be experienced personally to know. I just got my first experience with it and will definitely be getting again any and every time I have chance. HOLY MOLY COW BATMAN!!!!” – 247kushpuffer\n\nSativa Cannabis Strains\n   Crystal Coma\n\n“Holy high, Batman! This is some amazing product! Awesome high, good upper, and I’m not a space cadet either! Perfect for a ‘getting shit done but still would like to smoke’ day.” – Anonymous\n\n   Sour Diesel\n\n“Holy racing heart beat and heart pounding out of my chest batman! Everyone has the same experience.” – Anonymous\n\n   East Coast Sour Diesel\n\n“Holy Batman! This thing is like a triple dose of espresso for me! Makes me so hyper I cannot sit still LOL.! Energetic for sure, good for picking up the afternoon blehs. Also gives you an appetite. I don’t think I’ll smoke this at night or I’ll be sleepless!” – HappilyPainFree\n\n   Alaskan Thunder Fuck\n\n“Holy sweet jumped up sativa, Batman. This has to be the most aptly named strain yet. As powerful and as potent as being screwed by an angry Thor. Good if unique taste, rather a sweet note. Has good legs, at 5 to 6. Definitely worth getting when possible. Extraordinary body effects for a sativa. Get some and have intimate relations with the God of Thunder today!” – doobwalker\n\n\n“Leaping caribou, Batman! If this bud doesn’t embody the cold, rugged, wintery majesty that is the Alaskan wilderness, then I dont know what does. With notes of pine trees and freedom, this kush is optimum for white water rafting, eating a raw salmon, fighting a bear, or a combination of the three. Would ride a dog sled for miles in the dead of winter to get ahold of this weed. As in the words of the Eskimos this is some ‘ˈtʃaknaχ ˈhwaʁiχ’.” – wespeterson24\n\nLead image: Twentieth Century Fox Film Corporation",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/10/04153114/holy-cannabis-strain-reviews-batman.jpg",
            "title": "These Cannabis Strains Are So Good, They'll Make You Utter \"Holy ___, Batman!\"",
            "urlslug": "/news/strains-products/holy-cannabis-strains-batman"
        },
        {
            "author": "Rebecca Kelley",
            "category": null,
            "date": "/Date(1383253500000)/",
            "id": "contentitems-3629",
            "text": "Last night, the Boston Red Sox beat the St. Louis Cardinals in a 4-2 series to clinch their eighth World Series title in franchise history. For those of you cannabis consumers who are also fans of The Sawx (or for BoSox fans who are also cannabis consumers — after all, you did have a player on your team named Smoky Joe Wood), what better way to celebrate your beloved team's third World Series win in 10 seasons than with the following strains:\n1. Cherry Pie\n\nThey say baseball is as American as apple pie, but in honor of Boston's red-hued winners, we think you should opt for cherry this go around. \n2. East Coast Sour Diesel\n\nNot only do the Sox rule the east coast, they reign supreme over the entire nation.\n3. Dynamite\n\nTo celebrate a dynamite season, of course.\n4. Lifesaver\n\nKnowing how die-hard Boston sports fans are, the Sox's win may very well have lifted their spirits out of some hard times. \n5. Jillybean\n\nFor Beantown, duh.\n6. Euphoria\n\nRide that wave straight to the victory parade!\n7. Red Haze\n\nI'm guessing this is the current state of the entire city of Boston. \n8. King Kush\n\nThis one's in honor of the \"King of October,\" David Ortiz, who was awarded MVP.  \n9. Holy Grail Kush\n\nWhat bigger Holy Grail exists in baseball other than a World Series win? \nAnd, of course: \n10. F*cking Incredible\n\nCongratulations, Red Sox! And congrats to the city of Boston. As a native Michigander, I will continue to weep over the Tigers' continued inability to execute in the playoffs. \nphoto credits: nancydowd, Werner Kunz, kim.rossi, Werner Kunz, Aero Racer E, bunkosquad, sea turtle, ctsilva, joyosity, B Rosen via photopin cc",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2013/10/12003036/wicked-awesome-10-strains-to-celebrate-the-boston-red-sox-world-s.jpg",
            "title": "Wicked Awesome: 10 Strains to Celebrate the Boston Red Sox World Series Win",
            "urlslug": "/news/strains-products/wicked-awesome-10-strains-to-celebrate-the-boston-red-sox-world-s"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 8.412363891815946
        },
        {
            "name": "Arthritis",
            "score": 6.340007024938531
        },
        {
            "name": "ADD/ADHD",
            "score": 5.216016859852476
        },
        {
            "name": "PTSD",
            "score": 4.759395855286266
        },
        {
            "name": "Migraines",
            "score": 4.645240604144714
        }
    ],
    "description": "<p>East Coast Sour Diesel is a fast-acting attitude lifter that patients love for its truly sativa effects. This strain has a sour lemon smell and taste that&rsquo;s crisp and uplifting. East Coast Sour Diesel is powerful so new patients should be cautious. Those looking to alleviate anxiety or get some sleep may want to skip this high energy medicine.</p>\n",
    "descriptionPlain": "East Coast Sour Diesel is a fast-acting attitude lifter that patients love for its truly sativa effects. This strain has a sour lemon smell and taste that&rsquo;s crisp and uplifting. East Coast Sour Diesel is powerful so new patients should be cautious. Those looking to alleviate anxiety or get some sleep may want to skip this high energy medicine.\n",
    "effects": [
        {
            "name": "Energetic",
            "score": 73.83210396909027
        },
        {
            "name": "Happy",
            "score": 57.96452406041447
        },
        {
            "name": "Relaxed",
            "score": 54.86476993326308
        },
        {
            "name": "Hungry",
            "score": 42.86968739023533
        },
        {
            "name": "Euphoric",
            "score": 40.95539164032314
        }
    ],
    "flavors": [
        {
            "name": "Diesel",
            "score": 20.6357569371268
        },
        {
            "name": "Pungent",
            "score": 6.7000351246926595
        },
        {
            "name": "Lemon",
            "score": 6.5683175272216365
        },
        {
            "name": "Earthy",
            "score": 5.330172110994029
        },
        {
            "name": "Chemical",
            "score": 4.531085353003161
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 63,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1410569,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "so , a quick distinction between east and west coast  sour. just from a physical point of view , the west coast sours seem to be a bit chunkier in bud width , compared to the foxtaily dense motherfu****s that are ECSD buds . also on the west coast it seems that their \"sour\" has prodiminatly white hairs compared to the shorter maroon hairs of the ECSD. now that, that is out of the way , ECSD is my shit . so bomb if it's legit to its name . I will literally be pissed off in my apartment squandering through music being anti-social. light up some East Coast SourD and I'm babbling my mouth off like I'm a freakin' motivational speaker . NOT a couch locker, be prepared to move, If not your body , than your mouth !",
            "username": "EastCoastPaul"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1640182,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "Sent me into a fit of happiness and giggles such as I have never seen. Included a good head buzz too. Very good strain if you don't need to sleep anytime soon. Had me singing to myself too...",
            "username": "Lfan1985"
        }
    ],
    "id": 5090,
    "name": "East Coast Sour Diesel",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 28.029504741833506
        },
        {
            "name": "Dizzy",
            "score": 22.453459782226904
        },
        {
            "name": "Dry Eyes",
            "score": 7.2708113804004215
        },
        {
            "name": "Paranoid",
            "score": 5.101861608710924
        },
        {
            "name": "Headache",
            "score": 4.531085353003161
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/sour-diesel",
            "category": "Sativa",
            "name": "Sour Diesel",
            "permalink": "https://mobileapi.leafly.com/sativa/sour-diesel",
            "slug": "sour-diesel",
            "subtitle": null,
            "symbol": "Sd"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/east-coast-sour-diesel",
    "photoTotalCount": 54,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/707604/b/east-coast-sour-diesel__primary_5fa7.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/east-coast-sour-diesel_100x100_3ad9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/626859/b/east-coast-sour-diesel__primary_df99.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/east-coast-sour-diesel_100x100_3010.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/583414/b/east-coast-sour-diesel__primary_abc9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/east-coast-sour-diesel_100x100_d186.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/583413/b/east-coast-sour-diesel__primary_0dba.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/east-coast-sour-diesel_100x100_6f88.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/519119/b/east-coast-sour-diesel__primary_738e.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/east-coast-sour-diesel_100x100_7223.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/502092/b/east-coast-sour-diesel__primary_57f0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/east-coast-sour-diesel_100x100_65ae.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Portland, OR",
        "Denver, CO",
        "Ann Arbor, MI",
        "Colorado Springs, CO",
        "Eugene, OR",
        "Missoula, MT",
        "Toronto, ON",
        "Trinidad, CO",
        "Abbotsford, BC",
        "Addison, IL"
    ],
    "rating": 4.29,
    "relatedStrains": [],
    "reviewCount": 177,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "east-coast-sour-diesel",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.29378531073446/240",
    "subtitle": null,
    "symbol": "Eas",
    "symptoms": [
        {
            "name": "Stress",
            "score": 49.34141201264488
        },
        {
            "name": "Depression",
            "score": 30.962416578854935
        },
        {
            "name": "Lack of Appetite",
            "score": 19.845451352300664
        },
        {
            "name": "Pain",
            "score": 12.258517737969793
        },
        {
            "name": "Headaches",
            "score": 8.719704952581665
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
