{"sl_translate":"description,descriptionPlain,category","id":11131,"slug":"candy-jack","name":"Candy Jack","subtitle":null,"symbol":"Caj","category":"Sativa","description":"\u003cp\u003eCandy Jack is a mostly \u003ca href=\"http://leafly.com/sativa\"\u003esativa\u003c/a\u003e strain that provides a swift boost to your mood alongside a \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet/\"\u003esweet\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-citrus/\"\u003ecitrus\u003c/a\u003e aroma. The fragrant smell is inherited from its \u003ca href=\"http://www.leafly.com/hybrid/skunk-1\"\u003eSkunk #1\u003c/a\u003e parent, while \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-creative/\"\u003ecreative\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-focused/\"\u003efocused\u003c/a\u003e effects stem from the \u003ca href=\"http://leafly.com/sativa/jack-herer\"\u003eJack Herer\u003c/a\u003e side of the family. While its complex terpene profile may impress even the most hardened connoisseur, patients typically appreciate Candy Jack\u0026rsquo;s ability to counter stress, depression, and appetite loss. With a few Cannabis Cup wins already under its belt, Candy Jack\u0026rsquo;s potency, flavor, and effects have won this sativa a sterling reputation in the cannabis world.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Candy Jack is a mostly sativa strain that provides a swift boost to your mood alongside a sweet, citrus aroma. The fragrant smell is inherited from its Skunk #1 parent, while creative and focused effects stem from the Jack Herer side of the family. While its complex terpene profile may impress even the most hardened connoisseur, patients typically appreciate Candy Jack\u0026rsquo;s ability to counter stress, depression, and appetite loss. With a few Cannabis Cup wins already under its belt, Candy Jack\u0026rsquo;s potency, flavor, and effects have won this sativa a sterling reputation in the cannabis world.\u0026nbsp;\n","aka":null,"rating":4.35,"highlightedReviews":[{"id":1392544,"username":"daaaisychaaain","text":"I\u0027m smoking it right now and it\u0027s making me want to build a birdhouse ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png"},{"id":1635020,"username":"RJtheCunning","text":"Oftentimes the effects of cannabis are akin to surfing. Out on the ocean with your board, you may find yourself in rhythm with the waves as they curl. Other times, you may find yourself in an anxious panic, fighting the unforgiving sea. What\u0027s important to remember in this situation, as with cannabis, is that it too shall pass, and one cannot fight the sea, but rather flow with it. Paddle out with Candy Jack and the first wave you\u0027ll find is a gentle physical relaxation, supplemented by a mental \"clearing of the cache.\" The second wave brings energy and motion, with sparks of creativity. It\u0027s that feeling of when you\u0027re deep in the tube, brah.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-62050","title":"5 Fantastic Instrumental Albums to Listen to While High","author":"Rae Lland","category":null,"date":"\/Date(1522705256000)\/","text":"Instrumental music exists outside the realm of vocalists, with guitar, horns, and keys filling the space with innovative instrumentation (known as instrumental interludes) where lyrics would normally reside. Though commonly associated with jazz, instrumental music is not limited to any single genre, and can even transcend genre altogether.\nThe beauty in instrumental music is its ability to push the boundaries of sound—exploring and weaving in and out of its structure—with an ease not afforded to lyrical constructs.\n\nBelow, discover five fantastic instrumental albums paired with the perfect strain and explore the vast range of sounds and possibilities instrumental music provides.\nFeeling Good by Dorothy Ashby\n\nStrain Pairing Recommendation: Euforia\nReleased posthumously in 2015, Feeling Good is an incredible collection of harpist Dorothy Ashby’s music that can’t be missed. The 30-track album runs for nearly two hours and will leave no question as to why Ashby’s prowess makes her one of the top instrumental artists to know and love. Her light, lovely, and versatile sound relaxes yet enlivens. Feeling Good is a feel-good instrumental jazz album with a fresh twist, as Ashby demonstrates the harp’s use as a bebop instrument that is as engaging as any saxophone.\nFind Euforia Nearby\nJuice by Medeski, Martin, Scofield \u0026 Wood\n\nStrain Pairing Recommendation: Candy Jack\nJuice, released in 2014, is the latest album from the dynamite quartet, Medeski, Martin, Scofield \u0026 Wood. The album contains all the signature versatility that Medeski, Martin \u0026 Wood bring to their albums, with the expert finesse and precision of legendary guitarist John Scofield. The eclectic 10-track album will keep you on your toes as it bends and twists through experimental and improvisational jazz fusion. Medeski’s wizard-like ability to manipulate the keys and organ provokes creativity and a sense of playfulness that will keep you guessing and surprised from “Sham Time” to “The Times They Are A-Changing.”\nFind Candy Jack Nearby\n\nNomad (Remastered) by Lotus\n\nStrain Pairing Recommendation: Fortune Cookies\nNomad was originally released in 2005, but the latest remastered and live version—released in 2014—is here to remind us all over again why we will always love this album. With funky, upbeat stylings and a full, rounded sound, Nomad wastes no time pulling you into its world—and what a joyful world it is. Songs such as “Travel” incorporate light, melodic vocalizations, blended seamlessly so that they become a sort of instrumentation of their own. Nomad traverses landscapes, delivering transcendental bliss and danceable rhythms in a single album.\nFind Fortune Cookies Nearby\nMigration by Bonobo\n\nStrain Pairing Recommendation: 303 OG\nBonobo’s Migration, released in 2017, is an extension of his unique sound and musical stylings. Each song is masterfully manipulated and crafted, flowing from one track to the next with versatility. Though Migration is electronically styled, Bonobo’s use of real instruments creates a depth and soul within the music that is often lacking amongst electronic artists. And while the album incorporates lyrics on a few tracks, it is deftly woven into the soundscape the way any other instrument is intertwined. Migration explores a range of sounds and feelings, from upbeat tribal rhythms to soft, melodic, wordless ballads, making it an album that tells endless stories with every note.\nFind 303 OG Nearby\n\nGentlemen, I Neglected To Inform You You Will Not Be Getting Paid by Charlie Hunter\n\nStrain Pairing Recommendation: Sweet Cheese\nWith a title reflecting the playfulness instilled in this instrumental album, Gentlemen, I Neglected To Inform You You Will Not Be Getting Paid is a modern jazz collection with a funky twist. Released in 2010, the album runs short at only 38 mins, but the pointed, swampy vibe and full sound, makes up for it. Hunter’s guitar sails beside  a medley of drums, horns, and bass, creating a sound that is both precisely orchestrated and experimentally fun. This album will leave your mind stimulated even as you relax into every note.\nFind Sweet Cheese Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/04/02132016/best-instrumental-albums-to-listen-to-while-high-header.jpg","urlslug":"/news/lifestyle/5-instrumental-albums-to-listen-to-while-high"},{"id":"contentitems-15904","title":"How to Use a Cannabis Yes-No-Maybe List","author":"Ashley Manta","category":null,"date":"\/Date(1484696151000)\/","text":"In the sex education world, you’ll hear people frequently refer to Yes/No/Maybe lists. The idea is that you sit down with a list of sexual acts and assign each one as a “yes,” “no,” or “maybe” to indicate your level of interest in each one. Once you complete that portion on your own, you can share it with a partner or prospective partners so that they know what’s on the table, what’s negotiable, and what’s off limits. It’s a great jumping-off tool for negotiation and I highly recommend it as an exercise for any sexually active adult. If you want a great sexual Yes/No/Maybe list, check out this one from Sunny Megatron, host of Showtime’s Sex with Sunny Megatron.\nRecently, it occurred to me that we don’t have anything like that in the cannabis industry. Since my favorite thing is combining sex and cannabis, I thought it might be interesting to take a sexual tool like the Yes/No/Maybe list and give it a cannabis twist. I envision it working in two distinct but equally important ways.\n\nMaking a Yes/No/Maybe List\nFirst, a Yes/No/Maybe list can act as a way of communicating to your partner or even budtender what effects you’re looking for. Think about the effects listed in Leafly’s strain database, and decide which matter most to you:\n\nAroused\nCreative\nEnergetic\nEuphoric\nFocused\nGiggly\nHappy\nHungry\nRelaxed\nSleepy\nTalkative\n\n…and so on. You can also list potential negatives that you want to be sure to avoid in a No column; for instance, while a cancer patient may be searching specifically for strains that induce hunger and put this characteristic on their Yes list, someone with a new year’s resolution to watch their weight may put “hungry” on their No list.\n\nOther negatives you may have experienced before and want to avoid can include:\n\nAnxious\nDizzy\nDry Eyes\nDry Mouth\nHeadache\n\nNow imagine you have this written out on a sheet of paper that you can give to your budtender and ask them to make a recommendation based on the things you want and need. Or if you or your partner are particularly cannabis savvy, you can use that list as a jumping-off point to plan your evening together and choose from strains and products you already have on hand.\nQuestions to Ask Before Consuming Cannabis\nYou also might consider asking pertinent questions before enjoying cannabis either on your own or with others. When did you eat last? How much do you typically consume and how’s your tolerance? When you have bad reactions, how do they tend to manifest?\nI can imagine another variation of this – a Yes/No/Maybe list for methods of consumption. There are so many out there, it’d be good to get on the same page with your partner or friends. Some people never do edibles. Others avoid dabs at all costs. Some are equal opportunity consumers and are more than happy to enjoy cannabis in whatever method it’s presented. Comparing lists with friends offers a way of creating a Venn diagram to see how you might best consume with others.\n\nThis past weekend, I was in Los Angeles for the Adult Novelty Manufacturing Expo. I brought four W Vapes pens, my Firefly 2 with some Deviant Dabs wax preloaded, low dose edibles, Foria, Hepburns ice water hash-infused pre-rolls, and a nug of Candy Jack. That’s more than most people carry on them, I suspect, but I wanted to have options for my friends.\nIf I’d thought of this cannabis Yes/No/Maybe list sooner, it would have been lovely to pull out a little sheet of paper where people could let me know their typical consumption preferences and what mood they were going for, so I could make suggestions accordingly. I would have also loved having a section where they could indicate the last time they’d had a meal, how often and how much they usually consume, any medical conditions that may be a factor, or even just how they typically react when they’ve had more than their body prefers.\nApplying the Yes/No/Maybe Concept to Cannabis\nSince the list is just a concept at the moment, I had to give recommendations on the fly at the conference. Luckily, everything worked out. That said, the cannabis industry can learn a lot from the sexuality education community: many sexuality tools and frameworks have been developed and honed over the last several decades, whereas the cannabis industry is just getting started.\nThe concepts of consent, negotiation, clear communication, boundaries, and intention setting can be easily applied to cannabis education, and it’s important for everyone to be mindful with their cannabis use. Every time you pass someone a joint or offer a dab, you’re impacting how they view the world of cannabis. Employing tools that facilitate mindful consumption will help shape the way the cannabis industry is viewed by those who might criticize it. Patient education will be more important than ever in the years to come, and offering frameworks will allow people to customize their experience and make it replicable.\nWould you use a cannabis Yes/No/Maybe list? Tell us why in the comments!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/01/17153210/using-cannabis-yes-no-maybe-lists.jpg","urlslug":"/news/lifestyle/how-to-use-a-cannabis-yes-no-maybe-list"}],"reviewCount":221,"flavors":[{"name":"Sweet","score":25.783486586406298},{"name":"Citrus","score":16.387572281732869},{"name":"Tropical","score":10.975684899042564},{"name":"Pine","score":5.4718456725755988},{"name":"Pungent","score":5.1068821689259645}],"effects":[{"name":"Happy","score":85.129396151293946},{"name":"Energetic","score":60.837046165513321},{"name":"Uplifted","score":56.40013271400133},{"name":"Focused","score":45.544364394729357},{"name":"Euphoric","score":41.226656555123704}],"symptoms":[{"name":"Depression","score":35.267323916958951},{"name":"Stress","score":30.921651341359372},{"name":"Pain","score":15.871409612285525},{"name":"Lack of Appetite","score":15.47516352260878},{"name":"Fatigue","score":6.0505735140771639}],"conditions":[{"name":"Anxiety","score":33.382548108825482},{"name":"Fibromyalgia","score":10.793203147217747},{"name":"Spinal Cord Injury","score":10.701962271305337},{"name":"Migraines","score":10.277040477770406},{"name":"ADD/ADHD","score":4.2257559958289885}],"negatives":[{"name":"Dry Mouth","score":24.109157266091575},{"name":"Anxious","score":14.289032135747465},{"name":"Paranoid","score":13.772869466300124},{"name":"Dizzy","score":5.1981230448383728},{"name":"Dry Eyes","score":4.7132429614181444}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/candy-jack_100x100_df47.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1002286/b/candy-jack__primary_774a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/candy-jack_100x100_01e6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/615574/b/candy-jack__primary_af0b.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/candy-jack_100x100_e78f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/614193/b/candy-jack__primary_38c0.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/candy-jack_100x100_c5d2.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/607626/b/candy-jack__primary_5eb8.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/candy-jack_100x100_d239.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/584143/b/candy-jack__primary_b027.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/candy-jack_100x100_f2f6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/584079/b/candy-jack__primary_d50a.jpg"}],"photoTotalCount":67,"popularCities":["Los Angeles, CA","San Francisco, CA","Portland, OR","San Diego, CA","Santa Ana, CA","Calgary, AB","Winnipeg, MB","Edmonton, AB","Long Beach, CA","Montréal, QC"],"permalink":"https://mobileapi.leafly.com/sativa/candy-jack","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.34841628959276/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Jack Herer","subtitle":null,"slug":"jack-herer","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jack-herer","symbol":"Jh","applink":"leafly://strain/jack-herer"},{"name":"Skunk #1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
