{
    "aka": null,
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "The Associated Press",
            "category": null,
            "date": "/Date(1527287697000)/",
            "id": "contentitems-67015",
            "text": "JUNEAU, Alaska (AP) — The police chief recently named to the board that regulates Alaska’s legal marijuana industry said the fight that has long been waged against pot in this country has been a “waste of time” and a waste of law enforcement resources.\nJeff Ankerfelt, who is police chief in the southeast Alaska city of Sitka, told The Associated Press on Friday that he wants to contribute to the successful implementation of well thought-out industry regulations. During his career in law enforcement, he came to the conclusion that “our war on marijuana was really a waste of time and counterproductive, particularly as there was increasing evidence that there was some medical benefits to the use of marijuana.”\n\nAnkerfelt said he is interested in investigating the medical benefits.\nThe U.S. Centers for Disease Control and Prevention say the marijuana plant has chemicals that may help symptoms for some health problems. But the agency says there’s insufficient research on whether the plant works to treat or cure those conditions.\nAnkerfelt was appointed by Gov. Bill Walker to the Marijuana Control Board’s public safety seat, replacing Travis Welch, who only served for about two months.\nPrior to Welch, Soldotna Police Chief Pete Mlynarik held the seat. He resigned in January after the U.S. Department of Justice shifted from a more lenient stance on marijuana enforcement.\n\nMlynarik said the department’s decision removed the underpinning on which Alaska’s industry is based and did away with the federal government “looking the other way” in states that have legalized marijuana.\nAlaska Gov. Bill Walker has said he’s committed to upholding the will of Alaskans, who voted in 2014 to legalize adult use of marijuana.\nCary Carrigan, executive director of the Alaska Marijuana Industry Association, said he’s interested in learning more about Ankerfelt and encouraged by what he’s heard so far.\n“I think Mlynarik saw it as, he was still in the drug war, Mlynarik was,” Carrigan said.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/05/25152801/iStock-880421068.jpg",
            "title": "Alaska Police Chief: War on Cannabis a 'Waste of Time'",
            "urlslug": "/news/politics/alaska-police-chief-war-on-cannabis-a-waste-of-time"
        },
        {
            "author": "NYVapeShop.com",
            "category": null,
            "date": "/Date(1453839960000)/",
            "id": "contentitems-6321",
            "text": "This article is sponsored by NYVapeShop.com, a top online retailer for vaporizers, domeless nails and other cool accessories. With years of manufacturing experience, the owners of NYVapeShop.com use their know-how to produce high-quality products at very affordable prices. They offer a ton of options including over 500 color combos and FREE shipping on all orders.\n\nThe United States contains an incredible range of awe-inspiring locations, landmarks and scenery, and there are countless among them that strike us as worthy of a vape session. Whether you’re looking out over a natural wonder, chowing down on exceptional grub, relishing a performance at a music venue, or simply executing everyday activities, a compact, unobtrusive vape is capable of elevating the experience.\nSo with the help of NYVapeShop.com co-founders Joe and Greg, we picked out just seven great vape-worthy times and places, based on the natural beauty of the location or the circumstances that surround it. Trust us, narrowing them down wasn’t easy. Do you agree with our choices? Which ones would you add to the list?\nGrabbing a slice in NYC\n\nThough Joe is unaffiliated with Joe’s Pizza, he’d put their pies up against any others in the city, at least in terms of the ‘regular slice’ – and since he and NYVapeShop.com co-founder Greg are both from New York, they’ve tried their fair share of local pizza. “I believe [Joe’s] only makes regular and maybe pepperoni pies and slices,” says Joe. “It's a small place, very fast-paced, and they can be rude but they get away with it…Everyone loves pizza, and they have the best.” \nLooking out over the Grand Canyon in Arizona\n\nThe Grand Canyon is among the most visit-worthy and photo-worthy places in the nation, and there’s no question that it makes the list of most vape-worthy places, too. It’s especially beautiful at sunset, with golden rays bouncing off an already staggering range of canyon colors. Tote a vape pen along to heighten the experience (as if it needed heightening).\nOutside the Buckhorn Exchange in Denver\n\nSays Joe of Denver’s oldest restaurant, whose walls have been gathering hunting trophies since 1893, “I'm an animal lover, but they have the heads of every animal you can think of, some killed over 80 years ago, and some even by Teddy Roosevelt. Check this place out – amazing food, and very nice people run it.”\nWatching a home game in Seattle\n\nWhether you're watching the home team at their open-air stadium or catching aerial coverage from the comfort of your own couch, seeing Seattle sports games play out in the Emerald City is a memorable experience. For the sake of team spirit, make your vape pen blue or green.\nOn a glacier day cruise in Alaska\n\nAlaska’s brand of untouched natural beauty is peerless nationwide, and few activities make that more apparent than glacier-centric sightseeing cruises. Prince William Sound, a short drive south of Anchorage, is a great place to go – hop on one of many boats offering this sort of day trip with a vape pen in your coat pocket (in a subtle Snow Camo color scheme, perhaps?) and settle in for a day of wildlife sightings and incomparable scenery.\nRelishing the music at South by Southwest in Austin\n\nFew places offer more good music than Austin, Tex. – especially during its legendary annual festival, South by Southwest. We’re of the mind that standing in the crowd waiting for any of the festival headliners to come onstage would be a good time for a vape sesh. Amidst throngs of colorful people, a colorful vape pen promises to fit in perfectly.\nHailing a cab in New York\n\nBringing it back to NYVapeShop.com’s hometown, from where Joe and Greg send vape pens to all fifty states and beyond via free shipping, Joe says that hailing a cab in New York is typically the point when you’re transitioning from one activity or bar to another, so it’s a perfect time to get a vape session in. “The process can be frustrating at times so a vape can help with the situation,” explains Joe, “plus after the session you won't smell getting into the cab and heading to your next destination.”\nFind the perfect vaporizer for any location at NYVapeShop.com.\n\nImage Sources: William Bigelis (cropped) and Anthony Quintano (curves, cropped) via Flickr Creative Commons",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/01/29200438/7-of-the-most-vape-worthy-places-in-the-us.jpg",
            "title": "7 of the Most Vape-Worthy Places in the U.S.",
            "urlslug": "/news/lifestyle/7-of-the-most-vape-worthy-places-in-the-us"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 25.397727272727273
        },
        {
            "name": "ADD/ADHD",
            "score": 24.488636363636363
        },
        {
            "name": "Bipolar Disorder",
            "score": 20.90909090909091
        },
        {
            "name": "PTSD",
            "score": 4.488636363636363
        },
        {
            "name": "PMS",
            "score": 3.125
        }
    ],
    "description": "<p>Alaska, developed by Tikun Olam, is an Israeli strain comprised of 70%&nbsp;sativa genetics. With uplifting effects intended for daytime consumption, Alaska has been found to successfully treat an array of medical symptoms including inflammation, pain, nausea, insomnia, and gastrointestinal disorders.&nbsp;</p>\n",
    "descriptionPlain": "Alaska, developed by Tikun Olam, is an Israeli strain comprised of 70%&nbsp;sativa genetics. With uplifting effects intended for daytime consumption, Alaska has been found to successfully treat an array of medical symptoms including inflammation, pain, nausea, insomnia, and gastrointestinal disorders.&nbsp;\n",
    "effects": [
        {
            "name": "Happy",
            "score": 79.31818181818181
        },
        {
            "name": "Energetic",
            "score": 78.4090909090909
        },
        {
            "name": "Creative",
            "score": 68.125
        },
        {
            "name": "Euphoric",
            "score": 63.75
        },
        {
            "name": "Relaxed",
            "score": 61.07954545454545
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 37.5
        },
        {
            "name": "Pine",
            "score": 23.125
        },
        {
            "name": "Sweet",
            "score": 20.454545454545453
        },
        {
            "name": "Lemon",
            "score": 20
        },
        {
            "name": "Cheese",
            "score": 20
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/zpAejlDOaSOf3oYP9foiJu8Grk4=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fwRzDidxTTBOUgBueztBj_goggles-purple.png",
            "id": 1413196,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "not everyday you get to smoke a bud with 29.1% thc and what a bud it is!\n\nfirst flight after two weeks dry was amazing even reminded acid trip little bit :) yet its not getting to the aroused-giggly feeling (maybe its just meh)\n\nhelps smoothing the bi-polar episodes, mood swings are less swingy and general mood is much better, ppl at work are finally tolerable.\n\nthe insomnia seems to be gone, sleeping is so much enjoyable now (hitting one right before bed - not a good idea lol)\n\nnot sure yet if it is my cup of tea but here in Israel we get what we get and for that we say thank you :P come legalization!",
            "username": "Valiko"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/iR6IuKvNS4kfUN8_zPVWuv2RQhI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fzZcIzCLFRUK1wTKghrMN_aviator-red.png",
            "id": 1607061,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "It's a great tasting Sativa for sure with a high potency and being from Alaska it feels meant to be haha ",
            "username": "bjones907"
        }
    ],
    "id": 62959,
    "name": "Alaska",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 44.94318181818182
        },
        {
            "name": "Paranoid",
            "score": 4.488636363636363
        },
        {
            "name": "Anxious",
            "score": 3.5795454545454546
        },
        {
            "name": "Headache",
            "score": 3.125
        },
        {
            "name": "Dizzy",
            "score": 1.8181818181818181
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/sativa/alaska",
    "photoTotalCount": 9,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/613174/b/alaska__primary_8fb3.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/alaska_100x100_9787.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/610986/b/alaska__primary_9564.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/alaska_100x100_56bb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/564666/b/alaska__primary_0d37.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/alaska_100x100_e147.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/563116/b/alaska__primary_b426.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/alaska_100x100_d22f.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/402414/b/alaska__primary_6584.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/alaska_100x100_00d8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/367988/b/alaska__primary_190c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/alaska_100x100_4c07.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Spokane, WA",
        "Anchorage, AK",
        "Las Vegas, NV",
        "North Las Vegas, NV"
    ],
    "rating": 4.54,
    "relatedStrains": [],
    "reviewCount": 54,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "alaska",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.53703703703704/240",
    "subtitle": null,
    "symbol": "Ala",
    "symptoms": [
        {
            "name": "Stress",
            "score": 48.57954545454545
        },
        {
            "name": "Depression",
            "score": 47.67045454545455
        },
        {
            "name": "Pain",
            "score": 22.272727272727273
        },
        {
            "name": "Lack of Appetite",
            "score": 21.363636363636363
        },
        {
            "name": "Fatigue",
            "score": 20.90909090909091
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
