{
    "aka": "Arjans Ultra Haze #1, Arjan's Ultra Haze 1, Arjans Ultra Haze 1",
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1426877820000)/",
            "id": "contentitems-3271",
            "text": "Friday has arrived, and you know what that means: time to kick back and relax with a bowl of your favorite strain! We've just added some new strains to the Leafly Explorer, so if you feel like branching out and trying something new, keep on reading. Maybe you've tried one of these. Maybe you're an overachieving champion and have tried ALL of these. If so, go get started on those strain reviews!\nWondering if these strains are being offered at a location near you? Search our site or use the \"Availability\" tab on the strain's page to find out!\n \n   1. Bandana\nCharacteristics of Bandana:\n\nBandana is a hybrid strain that combines Banana OG and 707 Headband, inheriting from its parents a sweet banana aroma and the buzzing cerebral sensation that first lent Headband its name. On the exhale, Bandana unleashes its fruity flavor over subtle earthy and sour notes. Powerful, heady euphoria awakens blissful relaxation in the mind while leaving the body feeling light and free of couchlocked sedation. It should be noted that AlphaKronik Genes bred a 70% sativa variation of Bandana that combines 707 Headband with a backcrossed Snowdawg.\n\n \n   2. Buffalo Bill\nCharacteristics of Buffalo Bill:\n\nBuffalo Bill is a sativa-dominant cross between Willie’s Wonder and Killer Ken bred by New House Seeds and grown by Doc and Yeti’s in Washington State. A blanket of crystal resin envelops the dense buds, almost hiding its interweaving green and lavender hues. Though 70% sativa by genetics, Buffalo Bill can hit with a force that leaves you anchored to your seat while the mind freely roams blissful euphoria. A sweet, earthy pine aroma floats from its kief-caked jar, sending your senses straight to a wintery tundra.\n\n \n   3. Dream Lotus\nCharacteristics of Dream Lotus:\n\nDream Lotus by Bodhi Seeds is a hybrid strain that was designed to recreate the widely cherished qualities of Blue Dream, but with an accentuated chunky bud structure. This rendition combines a Santa Cruz cut of Blue Dream with Bodhi’s Snow Lotus, resulting in a strain that maintains uplifting< effects and a fragrant blueberry aroma. Hashy spice and sweet herbal notes can be detected on the exhale in a flavor that ushers in blissful effects perfect for stress relief any time of the day.\n\n \n   4. Silver Kush\nCharacteristics of Silver Kush:\n\nSilver Kush is a sativa-dominant mix of Silver Bubble and OG #18 genetics bred by DNA Genetics under their Reserva Privada label. The uplifting effects of Silver Bubble blend with the potent relaxing force of OG #18 to create a strong sativa-driven hybrid that won’t overstimulate you with a heady buzz. Instead, you should find yourself happy, giggly, and balanced as your stress dissipates. It should be noted that a genetic variation of Silver Kush is marketed by some as a cross of Super Silver Haze and OG Kush.\n\n \n   5. Arjan's Ultra Haze #1\nCharacteristics of Arjan's Ultra Haze #1:\n\nArjan’s Ultra Haze #1 is a Dutch sativa bred by Green House Seeds, who combined Neville’s Haze with landrace strains from Cambodia and Laos. With mellow effects that stay cerebrally centered, this strain is perfect for those seeking introspective, meditative moments or a light, active buzz. Four Cannabis Cup placements have won Arjan’s Ultra Haze #1 a sterling reputation, but growers will have to wait with agonizing patience for its buds to finish their 13 weeks of flowering.\n\n \n   6. Alpine Star\nCharacteristics of Alpine Star:\n\nAlpine Star, often labeled as Alpine OG, is an earthy, citrus mix of Tahoe OG and Sensi Star genetics. Zesty lemon flavors lead Alpine Star’s wave of relaxing indica effects. The pain relieving properties of Alpine Star radiate from the head and neck, calming anxieties and muscle tension as the effects descend to the lower extremities.\n\n \n   7. Juicy Jack\nCharacteristics of Juicy Jack:\n\nJuicy Jack combines the tropical flavors of Juicy Fruit with the therapeutic attributes of Jack Herer. This hybrid is balanced between its indica and sativa heritage but its effects lean towards the creative, uplifting buzz associated with sativas. Juicy Jack creates a flavorful mouthful of sweet berry notes that mingle with a spiced, earthy musk to usher in a euphoric burst of heady effects.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/03/12002053/new-strains-alert-dream-lotus-juicy-jack-buffalo-bill-silver-kush.png",
            "title": "New Strains Alert: Dream Lotus, Juicy Jack, Buffalo Bill, Silver Kush, and More",
            "urlslug": "/news/strains-products/new-strains-alert-dream-lotus-juicy-jack-buffalo-bill-silver-kush"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "ADD/ADHD",
            "score": 22.22222222222222
        },
        {
            "name": "Anxiety",
            "score": 22.22222222222222
        },
        {
            "name": "PTSD",
            "score": 11.11111111111111
        },
        {
            "name": "Asthma",
            "score": 5.555555555555555
        },
        {
            "name": "Crohn's Disease",
            "score": 5.555555555555555
        }
    ],
    "description": "<p>Arjan&rsquo;s Ultra Haze #1 is a Dutch <a href=\"http://www.leafly.com/explore/category-sativa\">sativa</a> bred by Green House Seeds, who combined <a href=\"http://www.leafly.com/hybrid/nevilles-haze\">Neville&rsquo;s Haze</a> with <a href=\"http://www.leafly.com/news/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\">landrace strains</a> from Cambodia and Laos. With mellow effects that stay cerebrally centered, this strain is perfect for those seeking introspective, meditative moments or a light, <a href=\"http://www.leafly.com/explore/tags-energetic\">active</a> buzz. Four Cannabis Cup placements have won Arjan&rsquo;s Ultra Haze #1 a sterling reputation, but growers will have to wait with agonizing patience for its buds to finish their 13 weeks of flowering.</p>\n",
    "descriptionPlain": "Arjan&rsquo;s Ultra Haze #1 is a Dutch sativa bred by Green House Seeds, who combined Neville&rsquo;s Haze with landrace strains from Cambodia and Laos. With mellow effects that stay cerebrally centered, this strain is perfect for those seeking introspective, meditative moments or a light, active buzz. Four Cannabis Cup placements have won Arjan&rsquo;s Ultra Haze #1 a sterling reputation, but growers will have to wait with agonizing patience for its buds to finish their 13 weeks of flowering.\n",
    "effects": [
        {
            "name": "Euphoric",
            "score": 36.111111111111114
        },
        {
            "name": "Focused",
            "score": 33.33333333333333
        },
        {
            "name": "Energetic",
            "score": 30.555555555555554
        },
        {
            "name": "Relaxed",
            "score": 30.555555555555554
        },
        {
            "name": "Creative",
            "score": 24.999999999999996
        }
    ],
    "flavors": [
        {
            "name": "Mint",
            "score": 27.777777777777775
        },
        {
            "name": "Earthy",
            "score": 16.666666666666664
        },
        {
            "name": "Pepper",
            "score": 8.333333333333332
        },
        {
            "name": "Sweet",
            "score": 8.333333333333332
        },
        {
            "name": "Woody",
            "score": 8.333333333333332
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 91,
        "growNotes": "\n\tIndoor yields around 700 grams per meter squared\n\tOutdoor yields around 1150 grams per plant\n\tIdeal for LST (low stress training)\n\tPrefers&nbsp;equatorial, tropical, subtropical and temperate climates\n\n",
        "height": "Tall",
        "outdoorFinish": "Early November",
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png",
            "id": 1416862,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Back in the day when this weird strain first came out and I saw Arjan and Franko publish their grow video  I was dying to try what they said was the best smoke, with the best taste, and the best feeling... I wasn't aware of how difficult it would be to get my hands on such a long-flowering strain. Fast forward about a decade... after a failed grow attempt I finally managed to get one mature organic, california-grown AU#1. It took almost 10 months to mature... This had better be good.\nI just rolled an Amsterdam tulip with AUH#1. Lit, toking... toking... taste.... nice Spicy, cheesy, minty, sweet-bell pepper-ish... no hint of anything fruity but a fennel-like sweetness in the aftertaste- this is perfect! not over pungent, not too strong, not harsh at all... literally the best balance to date I've ever tried. I could smoke this all day long, and love that sweet floral nose.\nI have experience. Other varieties I can compare this too are my organic Kali Mist, Arjan's Haze #3, Super Silver Haze but with greater sophistication and many subtle flavors and smells. Unlike these its very balanced with no one scent or flavor dominating the palate. Truly world-class connisseur cannabis.\nThe high... that surprised me. I felt a very mild sensation for about 10 minutes. So I smoked another. Then BAM! The biggest creeper ever! Im chilling sitting back on my chair and then I'm off into my thought world more clearly and more deeply then I have been in ages. This is serious stuff! But perfectly clear. \nI love to meditate, and for that many of the other verieties cloud my thinking. Not this, its like my internal mental fog is removed and I can think without anxiety and without pressure. This is by far the best strain I have tried. Not the strongest, the best.",
            "username": "LogiQ"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/kJc1LyLawlfeJ9xGeaJMdVhCp9U=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fmstpXGgRuu3rPFHmtQHb_aviator-green.png",
            "id": 1508576,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "First smell very fresh carrot with earth , taste theory minty also earthy.",
            "username": "SMEK"
        }
    ],
    "id": 146223,
    "name": "Arjan's Ultra Haze #1",
    "negatives": [
        {
            "name": "Dizzy",
            "score": 8.333333333333332
        },
        {
            "name": "Paranoid",
            "score": 8.333333333333332
        },
        {
            "name": "Dry Eyes",
            "score": 5.555555555555555
        },
        {
            "name": "Dry Mouth",
            "score": 5.555555555555555
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/nevilles-haze",
            "category": "Hybrid",
            "name": "Neville's Haze",
            "permalink": "https://mobileapi.leafly.com/hybrid/nevilles-haze",
            "slug": "nevilles-haze",
            "subtitle": null,
            "symbol": "Nhz"
        },
        {
            "applink": "leafly://strain/south-asian-sativa",
            "category": "Sativa",
            "name": "South Asian Sativa",
            "permalink": "https://mobileapi.leafly.com/sativa/south-asian-sativa",
            "slug": "south-asian-sativa",
            "subtitle": null,
            "symbol": "Sas"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/arjans-ultra-haze-1",
    "photoTotalCount": 2,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/339916/b/arjan-s-ultra-haze--1__primary_c0e8.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/arjan-s-ultra-haze--1_100x100_43a4.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/305739/b/arjan-s-ultra-haze--1__primary_0a7d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/arjan-s-ultra-haze--1_100x100_c5dd.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Toronto, ON",
        "Las Vegas, NV",
        "Vancouver, BC"
    ],
    "rating": 4.83,
    "relatedStrains": [],
    "reviewCount": 12,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "arjans-ultra-haze-1",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.83333333333333/240",
    "subtitle": null,
    "symbol": "Auh",
    "symptoms": [
        {
            "name": "Stress",
            "score": 16.666666666666664
        },
        {
            "name": "Headaches",
            "score": 13.888888888888888
        },
        {
            "name": "Depression",
            "score": 11.11111111111111
        },
        {
            "name": "Lack of Appetite",
            "score": 8.333333333333332
        },
        {
            "name": "Fatigue",
            "score": 5.555555555555555
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
