{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Hannah Meadows",
            "category": null,
            "date": "/Date(1487715733000)/",
            "id": "contentitems-19058",
            "text": "Since the dawn of the silver screen, music and movies have gone together like Thelma and Louise. In the old films of yesteryear, when audio technology for spoken dialogue was not yet established, music brought to life the actions and scenes presented to an audience without the use of speech. Since then, tunes in movies have played a large part in manipulating audience emotion and setting tones for dramatic, comedic, horrific, and all manner of theatrical movements.\nTo celebrate the upcoming Oscars awards ceremony (which airs Sunday, February 26), we compiled a range of movie soundtracks to listen to while high. From past Academy Award winners to general good beats, turn off your screens and instead opt for a pair of headphones to truly soak in these incredible scores.\nThe Lord of the Rings\n\nThis entire adventure series was composed, conducted, produced, and orchestrated by Howard Shore, who contributed more than 10 hours of music for the epic saga. The films’ scores were so enigmatic that two of them took home Academy awards for Best Original Score – one for The Fellowship of the Ring (2002) and one for The Return of the King (2004).\nBased on our own personal experience, we couldn’t possibly turn our noses up at one of the best and most emotional instrumental scores punctuating The Lord of the Rings series. From the moment we hear those familiar Hobbit-inspired flutes to the dramatic deep strings regaling Sauron’s lair, listening to this broad soundtrack is a mix of nostalgia and a new sense of adventure. Clear your schedule for hours of bold and beautiful tunes, and be sure to pair this daring collection with the hybrid Hobbit.\nPretty in Pink\n\nThough this film’s soundtrack didn’t take home any awards, it’d be a mistake not to include it in our collection of picks. You’ll be bringing back the ’80s with now-classics (considered “new wave” at the time) played in one of John Hughes’ biggest hits. From bands New Order to The Smiths, we don’t think you’ll mind getting any of these tracks stuck in your head. Dance your heart out and pair this movie soundtrack with the sweet hybrid Pink Kush.\nWilly Wonka and the Chocolate Factory\n\nThis 1971 children’s classic gave audiences around the world a wild ride that also extends to its assorted soundtrack. From sticky-sweet “The Candy Man” to Charlie’s mother’s lamenting “Cheer-Up Charlie,” all the way to the odd fear-driven track accompanying the infamous tunnel scene, the original Willy Wonka touches on all facets of human emotion. Gather up your favorite candy and pair this soundtrack with its perfect match, sativa Willy Wonka.\nLife of Pi\n\nWorldly, charismatic, and just plain beautiful, the Life of Pi score won the 2013 Academy Award for Best Original Music Score as well as the Golden Globe for the same title (composed by Mychael Danna). Cranking up this soundtrack is sure to transport you to faraway lands. We recommend pairing Life of Pi’s gorgeous pieces with the cerebral indica Tiger’s Milk.\nForrest Gump\n\nReaching gold and platinum status from countries around the world, the Forrest Gump soundtrack is flanked with its own original score as well as a huge array of classic rock pieces. It was nominated for Best Music and Original Score in 1995 (beat out by The Lion King), and it’s definitely not difficult to see why. From Scott McKenzie’s “San Francisco” to Simon and Garfunkel’s “Mrs. Robinson,” be sure to light up the hybrid Jenny Kush and sink into the various tunes of the late greats.\nInterstellar\n\nIf you’re looking to smoke up alongside tracks that could transport you across planes of time, look no further than the music of Interstellar. We recommend you invest in a little star projector, shut off all the lights in your room, and bask in the mind-blowing complexities of the universe while the Interstellar score quietly plays in your ears. Pair this haunting soundtrack with the indica StarBud or the intense sativa Timewreck.\nHave your own soundtrack suggestions? Leave them in the comments below!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2017/02/21142338/soundtracks-to-listen-to.jpg",
            "title": "6 Movie Soundtracks to Listen to While High",
            "urlslug": "/news/lifestyle/6-movie-soundtracks-listen-high"
        },
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1398281400000)/",
            "id": "contentitems-3511",
            "text": "Extracts and concentrates are quickly becoming a central pillar of the cannabis market, so much so that the High Times Cannabis Cup hosted five concentrate categories this year in Denver. The champions were a mix of familiar classics like Durban Poison and newer strains you probably haven’t heard of until now. Leafly needs your help furnishing these strains with user reviews, so be sure to share your opinion if you’ve had the opportunity to try one of these champs.\nDon't forget to also check out Denver’s winning flowers from this 4/20 weekend!\n \nBest Medical Non-Solvent Hash\n\n1st Place: Blueberry Waltz from Natural Mystic Cannabis Caregivers\n2nd Place: Sour Lemon OG Solventless from Essential Extracts & Trill Alternatives\n3rd Place: HGH Cookies Solventless from HGH Extractions & Pure Medical\n \nBest U.S. Non-Solvent Hash\n\n1st Place: White OG Solventless Wax from Essential Extracts & Down With Dirt\n2nd Place: Boss Ice Wax from Infuzionz\n3rd Place: Bruce Banner #3 from RiverRock Adult Use & Trichome Heavy Extractions\n \nBest Medical Concentrate\n\n1st Place: Sour Jilly from Green Dream & TC Labs\n2nd Place: Jilly Bean from Stay Concentrated Extracts\n3rd Place: South African Durban Poison Wax from Advanced Medical Alternatives & Dab City Concentrates\n \nBest U.S. Concentrate\n\n1st Place: 303 OG Nug Run Sugar Budder from The Clinic\n2nd Place: Lemon Walker OG from TC Labs & Gold Coast Collective\n3rd Place: Willy Wonka Sativa BHO from High Class Concentrates\n \nPeople’s Choice Cup\n\n1st Place: Golden Goat Shatter – Infuzionz powered by The Green Solution\n2nd Place: Jilly Bean Shatter from 710 Labs/ Bud Med Health Center\n3rd Place: K1 Shatter from New Age Medical",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/04/12002719/the-2014-denver-cannabis-cup-winning-concentrates.jpg",
            "title": "The 2014 Denver Cannabis Cup Winning Concentrates",
            "urlslug": "/news/strains-products/the-2014-denver-cannabis-cup-winning-concentrates"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 11.904761904761903
        },
        {
            "name": "Hypertension",
            "score": 9.226190476190474
        },
        {
            "name": "Tinnitus",
            "score": 8.779761904761903
        },
        {
            "name": "ADD/ADHD",
            "score": 2.232142857142857
        },
        {
            "name": "PTSD",
            "score": 1.7857142857142856
        }
    ],
    "description": "<p>Willy Wonka is a <a href=\"http://leafly.com/sativa\">sativa</a> strain that took third place in the <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-great-wide-world-of-cannabis-concentrates\">concentrates</a> category of the 2014 Denver Cannabis Cup.</p>\n",
    "descriptionPlain": "Willy Wonka is a sativa strain that took third place in the concentrates category of the 2014 Denver Cannabis Cup.\n",
    "effects": [
        {
            "name": "Euphoric",
            "score": 41.81547619047619
        },
        {
            "name": "Talkative",
            "score": 32.14285714285714
        },
        {
            "name": "Relaxed",
            "score": 32.14285714285714
        },
        {
            "name": "Energetic",
            "score": 24.25595238095238
        },
        {
            "name": "Focused",
            "score": 22.916666666666664
        }
    ],
    "flavors": [
        {
            "name": "Sweet",
            "score": 12.797619047619047
        },
        {
            "name": "Tree Fruit",
            "score": 8.333333333333332
        },
        {
            "name": "Earthy",
            "score": 3.125
        },
        {
            "name": "Tropical",
            "score": 2.232142857142857
        },
        {
            "name": "Sage",
            "score": 1.3392857142857142
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1391665,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "why just the one star rating if you liked it and called it a keeper? lol, I got myself some WW a few years back and it was quite a treat.  Very Euphoric and Heady, with a dark chocolate musky aftertaste with every puff. It stopped my anxiety and panic attacks well and chilled my racing head and I could accomplish the days missions. My favorite feature with this lovely treat is the smell it leaves to linger in your jar or bag. I will try n describe this sweet dank herb. Close your eyes and Imagine what a Scrum-Diddly-Ump-Ches bar would smell like being created with A grade ganja butter that has been churning with a real running waterfall, the only waterfall in the world that churns it's  ..... ok ok ok maybe I'm a bit bias because I'm an fan of the (original) film and book. But I don't think that it effected my sense of smell which was telling my sense of thought was Wonkalicious! and fizzy lifting drinks. I think I will end my first review here on leafy on a high and head south for the winter. Peace!",
            "username": "frostinthewindow"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1457990,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Very nice head high, not too overwhelming. Helped with my headache and made me more productive. ",
            "username": "discocutie"
        }
    ],
    "id": 74258,
    "name": "Willy Wonka",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 18.00595238095238
        },
        {
            "name": "Dry Eyes",
            "score": 17.559523809523807
        },
        {
            "name": "Headache",
            "score": 9.672619047619046
        },
        {
            "name": "Dizzy",
            "score": 8.779761904761903
        },
        {
            "name": "Paranoid",
            "score": 0.4464285714285714
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/sativa/willy-wonka",
    "photoTotalCount": 16,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/673292/b/willy-wonka__primary_390d.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/willy-wonka_100x100_631b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/525866/b/willy-wonka__primary_90d4.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/willy-wonka_100x100_01f9.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503094/b/willy-wonka__primary_4674.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/willy-wonka_100x100_11db.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/447196/b/willy-wonka__primary_8df9.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/willy-wonka_100x100_2f3b.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/442578/b/willy-wonka__primary_e32b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/willy-wonka_100x100_6439.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/427228/b/willy-wonka__primary_5bdd.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/willy-wonka_100x100_0652.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Everett, WA",
        "Gold Bar, WA",
        "Seattle, WA",
        "Lake Stevens, WA",
        "Lynnwood, WA",
        "Sequim, WA"
    ],
    "rating": 4.5,
    "relatedStrains": [],
    "reviewCount": 40,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "willy-wonka",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.5/240",
    "subtitle": null,
    "symbol": "Wnk",
    "symptoms": [
        {
            "name": "Stress",
            "score": 21.13095238095238
        },
        {
            "name": "Eye Pressure",
            "score": 8.779761904761903
        },
        {
            "name": "Depression",
            "score": 4.910714285714286
        },
        {
            "name": "Pain",
            "score": 3.125
        },
        {
            "name": "Nausea",
            "score": 2.6785714285714284
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
