{"sl_translate":"description,descriptionPlain,category","id":4274,"slug":"island-sweet-skunk","name":"Island Sweet Skunk","subtitle":null,"symbol":"Iss","category":"Sativa","description":"\u003cp\u003eIsland Sweet Skunk, sometimes called Sweet Island Skunk,\u0026nbsp;is a \u003ca href=\"http://leafly.com/sativa\"\u003esativa\u003c/a\u003e strain that users enjoy for its \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-energetic\"\u003eenergetic\u003c/a\u003e effects. The flavor is most easily described as \u0026ldquo;\u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-skunk\"\u003eskunk\u003c/a\u003e,\u0026rdquo; where \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-tropical\"\u003etropical\u003c/a\u003e fruit flavors take the lead. Often the fruity aroma is likened to \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-grapefruit\"\u003egrapefruit\u003c/a\u003e. Originally bred by Federation Seed Company in Canada, this strain is a descendant of \u003ca href=\"http://www.leafly.com/sativa/skunk-1\"\u003eSkunk #1\u003c/a\u003e and grows tall, straight, high-yielding\u0026nbsp;plants. Some varieties of Island Sweet Skunk have a heightened \u003ca href=\"http://www.leafly.com/news/lifestyle/whats-the-deal-with-these-high-cbd-strains\"\u003eCBD\u003c/a\u003e content to help patients treating \u003ca href=\"http://www.leafly.com/explore#!/explore/conditions-anxiety\"\u003eanxiety\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-inflammation\"\u003einflammation\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-muscle-spasms\"\u003emuscle spasms\u003c/a\u003e.\u0026nbsp;Flowering occurs at 7 to 8 weeks and buds will have bright yellow-orange hairs. They will remain loose and fluffy, so make sure they don\u0026rsquo;t get too dried out.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Island Sweet Skunk, sometimes called Sweet Island Skunk,\u0026nbsp;is a sativa strain that users enjoy for its energetic effects. The flavor is most easily described as \u0026ldquo;sweet skunk,\u0026rdquo; where tropical fruit flavors take the lead. Often the fruity aroma is likened to grapefruit. Originally bred by Federation Seed Company in Canada, this strain is a descendant of Skunk #1 and grows tall, straight, high-yielding\u0026nbsp;plants. Some varieties of Island Sweet Skunk have a heightened CBD content to help patients treating anxiety, inflammation, and muscle spasms.\u0026nbsp;Flowering occurs at 7 to 8 weeks and buds will have bright yellow-orange hairs. They will remain loose and fluffy, so make sure they don\u0026rsquo;t get too dried out.\u0026nbsp;\n","aka":"Sweet Island Skunk, ISS","rating":4.29,"highlightedReviews":[{"id":1417947,"username":"GlobalMacro","text":"I was a non-believer. I figured all of this talk about different strains for different issues was total BS, just another excuse to get high. Until I had the Sweet Isle Skunk. I am a 52 year old private equity professional on Wall Street, suffering from extreme neurological pain in my feet and legs. Nobody can figure it out, been to a half dozen specialists. My high-end concierge MD, finally  gave up on all the terrible things we were trying (like real narcotics) and said we should try the cheeba. I have been trying different strains, and sure when I am on them my legs don\u0027t bother me. But I can\u0027t get anything done. Until Sweet Island. I did some in a pre-filled vape pen yesterday and it was like I was in this perfect zone of pain relief and great motivation. I am writing all of this so that if you are like me, initially a huge skeptic, maybe I can save you some time. Stop thinking about this subject in the way it has been force fed to you. Use your head, try it out, tell a friend. We all know people who would be better off with this plant if they could just get over themselves. I did.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png"},{"id":1642800,"username":"Captain_Sativa","text":"I just picked up 7 grams of Local’s Island Sweet Skunk at Oz. in Fremont.  They have a nice display of information by strain that is very user friendly.  The staff was kind and knowledgeable.  Definitely a place I will buy from again.  As for the weed, the package was a glass jar with bamboo top that seals up nice.  The buds were medium sized and tight.  They had that classic Island Sweet Skunk aroma and taste.  So smooth it makes for a great daily smoke.  Nice head high that allows you to get into your favorite binge TV show or get busy and get your chores done without dragging you down.  Highly recommended, very unique and pungent taste!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-59696","title":"6 International Cannabis Strains Worth Seeking Abroad","author":"David Bienenstock","category":null,"date":"\/Date(1520360124000)\/","text":"Updated 3/9/18\n“Travel is like cannabis; it broadens your perspectives…personally, culturally, and politically,” according to bestselling guidebook author and acclaimed PBS host Rick Steves. “Suddenly, the palette with which we paint the story of our lives has more colors.”\nFor a cannabis enthusiast, this idea of expanding our palettes rings especially true, because even in our current heady era of rapidly advancing legalization, many of the world’s finest and most exotic cannabis strains can only be found in their regions of origin. So if we think of each varietal of the plant as its own unique hue, then we must travel widely to truly experience the species in all its technicolored glory.\n\nMuch as your local liquor store carries wine and beer from around the world, we should be able to sample the finest cannabis available anywhere without leaving home. Another way to look at this is as an opportunity to get out and do some exploring.\nAs a longtime cannabis journalist, I’ve had the good fortune to travel widely in parts of the world where the love of this plant flourishes, and I can report back that each place comes complete with a particular cannabis strain that’s a point of local pride. Some among the finest I’ve ever sampled.\nSo what are we waiting for?\n\nCannatonic\nOrigin: Barcelona, Spain\nMuch like the coffeeshops in the Netherlands, the cannabis social clubs that have cropped up in Barcelona and elsewhere in Spain over the last decade aren’t really legal, they’re just tolerated—for the most part. Clubs have been busted by the authorities in the past, and the Spanish legal system is still grappling with how to enforce (or not) a set of cannabis laws that allow for “personal” consumption in a “private” setting, without ever defining those terms.\n\nThe city itself, of course, is one of the world’s ideal places to be stoned. Tapas is the ultimate stoner cuisine, and Gaudi is the best architect ever when you’re high. The most popular local strain when I was there some years ago was Jack Herer, an Dutch-bred varietal that most assuredly flourishes beneath a Spanish sun. But to experience a truly homegrown phenomenon, take the time to track down Cannatonic, a high-CBD strain bred by Spanish seed bank Resin Seeds.\nWith THC rarely above 7% and CBD potentially above 15%, it’s a cross of MK Ultra and G13 Haze with a “slight earthy odor and a mild, sweet, vaguely citrusy flavor.” While not providing much of a high due to its elevated CBD profile, the strain offers profound therapeutic relief for pain, inflammation, and anxiety. It’s the perfect way to unwind after a long hot day wandering La Rambla.\n\nDr. Grinspoon\nOrigin: Amsterdam, Netherlands\nAs a travel destination, Amsterdam offers up many charms, from the picturesque canals and lively nightlife to the parks and museums and a place called Febo, where you can buy deep fried cheese out of a coin-operated automat in the middle of the night. The city’s also been a refuge for cannabis consumers and cannabis itself for decades.\nNot only have Amsterdam’s famed coffeeshops attracted visitors from around the world since they opened in the 1970s, they’ve also served as a safe haven for cannabis strains from every continent to escape prohibition.\nIf you’re fortunate enough to make a visit, definitely sample some Neville’s Haze or any of its Haze cousins, and don’t miss out on the wide array of imported, traditionally made hashishes available from Morocco, Nepal, Afghanistan, and other distant lands. But if I had to recommend just one smoke in town, I’d say make an appointment with Dr. Grinspoon, a pure sativa heirloom strain bred by Barney’s Farm, a cannabis seed bank associated with one of Amsterdam’s top coffeeshops.\n\nLike all purebred sativas, the strain (named for medical cannabis advocate Dr. Lester Grinspoon) takes a long time to harvest and doesn’t yield very well—but who cares? You’re not growing it, you’re smoking it. And the soaring, cerebral, invigorating high will set you off on an adventure to remember (or forget) in one of the world’s most beautiful cities.\n\nLamb’s Bread\nOrigin: Jamaica\nJamaica has long been associated with ganja, a local word for cannabis that derives from an ancient Sanskrit word that reached the Caribbean in the mid 1800s, brought along by indentured servants freshly arrived from India. In time ganja spread to native born Jamaicans. In particular, the Indians’ use of cannabis as a spiritual sacrament would be adopted by Jamaica’s Rastafarian community.\nAdd in the global impact of reggae music, and the indelible idea of Jamaica as a cannabis paradise took root in the public’s imagination. Even though, until recently, cannabis remained highly illegal and the laws against it seriously enforced.\n\nHappily, however, that all began to change in 2015, when a new law decriminalized up to two ounces of cannabis and made personal grows legal.\nSo how best to celebrate if you happen to be lucky enough to make a pilgrimage? Well, nothing could be more appropriate than rolling up a joint of Lamb’s Bread—the definitive Jamaican cannabis strain, and purportedly Bob Marley’s favorite throughout his life. A bright, green, sticky heirloom sativa, it’s an uplifting, inspiring, energizing high that pairs nicely with a cup of local Blue Mountain coffee if you really want to get your day started right.\nMalawi Gold\nOrigin: Malawi\nRevered as a food, fiber, and medicine, cannabis flourished throughout Malawi until 1964, when the newly independent republic joined the United Nations and adopted the UN’s Single Convention on Narcotic Drugs.\n\nFifty years of mandated federal enforcement later, what the locals call chumba, and the world calls Malawi Gold, remains a vital cash crop throughout the impoverished African nation, but growers now plant their seeds in remote mountain clearings, hoping to elude the authorities. According to a 2011 report from the World Bank, Malawian farmers harvest around 150,000 pounds of remarkably potent cannabis in this manner every year, the vast majority bound for Europe. The plant remains illicit to this day, but there’s a strong movement in Malawi to legalize both cannabis and hemp.\nFamous throughout Africa for its potency, Malawi Gold is a pure sativa strain that’s slow to mature, with a flowering time of up to 120 days before it’s ready to harvest. But it’s worth the wait to smoke the long, resin-coated buds that have made the strain famous far beyond Malawi’s borders.\n\n\nCheese\nOrigin: United Kingdom\nBritain’s cannabis scene isn’t well known for producing high quality cannabis or award-winning strains, with one notable exception. An indica-dominant hybrid named for its sharply sour aroma, Cheese has been the herbal pride of the United Kingdom since the late 1980s. Local legend has it the original Cheese (sometimes called Original Cheese) descended from a Skunk #1 phenotype that was selected for future breeding based on its incredibly pungent aroma.\n\nThe most popular modern version comes from Big Buddha Seeds, and features the same pungent funky aroma plus the addition of Afghani indica genetics to increase trichome production and yield. Big Buddha’s version put Cheese on the global map when it took home top honors in the Sativa category at the 2006 Cannabis Cup and has been spreading out geographically ever since.\nBut it’s still best enjoyed at home, in Merry Old England, paired with a cup of Earl Grey and some tasty crumpets.\nIsland Sweet Skunk\nOrigin: Vancouver Island\nBritish Columbia—Canada’s westernmost province—stretches from the ocean to the Rocky Mountains. The region became a hotbed for cannabis cultivation starting back in the 1960s, when the ranks of the area’s homegrown farmers were swelled by the arrival of draft resisters from the US who began fleeing to Canada to avoid service in the Vietnam War. With Vancouver eventually earning the nickname Vansterdam for its tolerance of cannabis coffeeshops, and the entire province boasting vast stretches of remote land in which to grow cannabis, a culture of tolerance and acceptance took hold in BC even in the darkest days of Canada’s cannabis prohibition.\nAnd now that it’s set to be legalized nationwide this summer (with the recreational market functional by late summer/early fall), British Columbia will remain the ultimate Canadian cannabis travel destination, a place of natural beauty and vibrant culture. Island Sweet Skunk was originally bred on Vancouver Island, a 290-mile long, largely undeveloped stretch of coastlines and mountains just off the Pacific coast. A sativa with an electric buzz and a flavor profile that mixes classic skunky notes with ripe grapefruit undertones, the strain is a descendant of Skunk #1 and grows tall, straight, high-yielding plants.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/03/05153822/6-international-strains-abroad.jpg","urlslug":"/news/strains-products/6-international-cannabis-strains-worth-seeking-abroad"},{"id":"contentitems-8357","title":"Top 10 Cannabis Strains on Leafly and the Best Vapes for Each","author":"Brett Konen","category":null,"date":"\/Date(1475263683000)\/","text":"This article is sponsored by VaporNation – Your Online Vaporizer Superstore. Save 15% off your entire order at VaporNation with coupon code LEAFLY at checkout.\n\nWhether you’re a casual consumer or consider yourself a connoisseur, there’s never been a better time to be a cannabis enthusiast. Leafly currently has over 2,000 cannabis strains in its database, up from 779 since 2014, and thanks to growers taking serious control over genetics, there’s a virtually endless variety of indicas, sativas, and hybrids to be found, with new buds cropping up all the time.\nOne could dedicate their entire life to a quest for the dankest, but choosing a single strain as the best would be a very subjective decision, and at the end of the day, individual opinions are as unique as the strains themselves. Instead, the adventure lies in profiling each unique flavor, from popular hybrids like GSC (f.k.a Girl Scout Cookies) to Chem Dog’s classic Sour Diesel sativa.\nWe decided to explore 10 of the most popular strains (in both flower and concentrate form) listed on Leafly and paired them with an arsenal of 10 high-performing portable and desktop vaporizers. Since the flavor characteristics of herb quickly diminish when smoking, we tested them by vaping at each vaporizer’s lower temperature ranges so a full spectrum of flavor could be extracted from each bud.\n1. Blue Dream + DaVinci Ascent\n\nDaVinci, the company behind the Ascent, understands the relationship between high-quality materials and vapor quality, utilizing a retractable glass-on-glass air path—essentially two internal glass sleeves sliding snugly into one another. That, paired with a glass-lined ceramic heating chamber, means your cannabis only comes into contact with inert materials that won’t adulterate flavor. This highlights the notes of blueberry and all-around sweetness of the sativa-dominant hybrid Blue Dream, whether in flower or in concentrate form.\nThe other key to the Ascent’s pure vaporization is in its precise temperature control feature, which runs up to 450˚F. Temperature settings can be toggled in real time while you’re vaping, letting you find a temp that’s ideal for your herb. Using this sweet science, you’ll find the taste of Blue Dream is reminiscent of a berry lollipop when vaping below 350°.\nVisit DaVinci website: http://www.davincivaporizer.com/ \n2. Sour Diesel + KandyPens Gravity\n\nA coil-less atomizer design and four temperature options make each sleek, handmade KandyPens Gravity a powerhouse for vaping concentrates. The pen’s ceramic surface keeps material from ever making contact with a heating element, producing delectable vapor clouds.\nWith the Gravity, the flavors of a Sour Diesel rosin seem to melt on your palate with each draw. Sour D is one of the most widely vaped strains for a reason, with its distinct aroma of lemon and high-octane fuel energizing the consumer. To get even more out of this intoxicating herb, you can switch out the Gravity’s ceramic plate atomizer for the dual quartz rod atomizer that comes with it. This amplifies the concentrate’s powerful taste in shorter, but more poignant, puffs.\nVisit KandyPens website: http://kandypens.com/ \n3. GSC (f.k.a Girl Scout Cookies) + Firefly 2\n\nIn addition to temperature, the length of time your cannabis is heated affects its flavor. The Firefly 2 is capable of vaporizing flower within five seconds, allowing for “flash vaporization” of the terpenes responsible for cannabis aromatics. By just briefly holding the Firefly 2’s innovative touch sensors, you can avoid overheating your herb and taste what you’ve been missing in conduction vapes and pipe hits.\nThe convection design and glass bowl and air path of the Firefly 2 let you truly taste the pungent, earthy sugariness of GSC (f.k.a Girl Scout Cookies). And with your device connected to the Firefly app, you can customize the flavor of GSC to suit your personal preference.\nVisit Firefly website: https://www.thefirefly.com/ \n4. Green Crack + Herbalizer\n\nWith precision controls and lightning-fast heat up time, the Herbalizer is often touted as a medical quality device. This desktop vape works at varying temperature levels, and by starting at the low end of the spectrum and utilizing the fan function for quick spurts of hot air, the tanginess of Green Crack’s tropical, citrusy scent can actually be tasted.\nIn combination with the glass steamroller attachment, the Herbalizer generates intensely flavorful, unadulterated vapor. The halogen heating element is insanely quick, zipping from cold to 380° in no more than five seconds, and soon dense clouds of GC’s sweet, mango-scented vapor come billowing up the glass shaft.\nVisit Herbalizer website: https://www.herbalizer.com/ \n5. White Widow + SOURCE Nail\n\nWhile the earliest generations of dabbers relied on blow torches and titanium nails to crudely vaporize cannabis concentrates, today SOURCEvapes sets the standard for electronic dab rigs and portable eNails that take the torch out of the equation, instead offering temperature-controlled batteries that make truly flavorful dabs a reality.\nThe SOURCE Nail delivered the woody profile of White Widow like a shot of flavor directly to the palate, especially when using the included quartz nail attachment. This portable, lightweight dabbing device (more compact than most e-nails) heats up quickly to produce lung-expanding hits with an earthy bouquet. As for effects, White Widow vaped with the SOURCE Nail sparked both creativity and conversation.\nVisit SOURCEvapes website: https://www.sourcevapes.com/ \n6. Granddaddy Purple + Magic Flight Launch Box\n\nThe Magic Flight Launch Box gives you total control over the heating process, and thus over effects and flavor. Its rapid heat is produced by simply pressing a rechargeable NiMH battery into a port, which magically transforms even minuscule amounts of cannabis into substantial amounts of tasty vapor.\nFilling the trench with just a fine grind of Granddaddy Purple releases a grape explosion that gets sweeter and sweeter with each breath. A quick tap of the MFLB shakes the ground herb up perfectly to prevent overheating. Granddaddy Purps’ complex berry aroma presents itself strikingly in the MFLB’s milky vapor, delivering a combination of pleasure and relaxation.\nVisit Magic Flight website: https://www.magic-flight.com/\n7. Island Sweet Skunk + Pulsar APX\n\nIf like your cannabis to reflect the taste of freshly sliced mango, vape Island Sweet Skunk. In combo with the APX, a lightweight portable unit from Pulsar Vaporizers, you can start your day off right with the tropical taste and invigorating qualities of this singular strain.\nEquipped with five preset temperature options and an intuitive single-button interface, the APX delivers quality rips with easy operation. Waves of sweet island tanginess wash over your palate, building with mild intensity after each hit, all with just a few pushes of a button. Those flavorful puffs come thanks to the APX’s ceramic herb chamber, which ensures true vaporization unmarred by the burnt flavor combustion can bring.\nVisit Pulsar website: http://www.pulsarvaporizers.com/ \n8. Master Kush + #ThisThingRips OG Four 2.0\n\nWhen it comes to wax pen vaporizers, many people contend that quartz is king. If you’ve ever used an OG Four 2.0 from #ThisThingRips, it’s easy to see why. Its lava quartz heats cleaner than other materials, preserving the flavor construct of the concentrate. The taste is clean and pure, and the depth of the chamber means you can vape a lot in one go.\nThe OG Four 2.0 exhibits the sweet earthiness of Master Kush crumble vividly thanks to the low temperature calibration of its atomizer. Its see-through polycarbonate heating chamber is visually enticing—you can watch a surge of vapor rush to the mouthpiece as you take a hit. Couple that with MK’s relaxing aroma, redolent of incense and citrus, and you get a full sensory experience that is mellowing and euphoric.\nVisit #ThisThingRips website: http://www.thisthingrips.com/ \n9. Lemon Haze + Vaped FOB Vaporizer\n\nThe Vaped FOB Vaporizer’s discreet car key design blends in with everyday life so you can keep it on hand (or keychain) at all times. The unit’s power and temperature controls are smartly disguised as “lock,” “unlock,” and “trunk open” buttons, and each of six preset temperatures is indicated by its own LED-lit color.\nThis sneaky vape partners beautifully with a citrusy herb like Lemon Haze, whose subtle aroma is less likely to blow your cover than ultra-skunky strains. The FOB Vaporizer’s lowest temp is excellent for terpenoid vaporization, releasing a blast of Lemon Haze’s tangy notes. Cranking the heat up releases a fragrant scope of flavors ranging from light and sweet to a pungent, almost overly ripe lemon barrage. A quick vape sesh on the go leaves you feeling uplifted, energetic, and a little euphoric.\nVisit Vaped website: http://www.ruvaped.com/ \n10. OG Kush + 7th Floor Super Surfer\nFor an old school company like 7th Floor, it only made sense to taste test some OG Kush through the Super Surfer vaporizer. Although this desktop vape is capable of filling up balloon bags, direct draws through the whip are the way to go for full flavor.\nThe hot air from the ceramic heating element rushes through the OG Kush, instantly releasing a strong piney taste followed by woody notes. The Super Surfer’s forced air filtration system, which cleans the air used to heat your herb or concentrate before it even enters the unit, lends an added purity to the thick and earthy clouds of OGK.\nVisit 7th Floor website: http://7thfloorvapes.com/","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/30122433/Header-no-text.jpg","urlslug":"/news/strains-products/best-vapes-for-top-cannabis-strains"}],"reviewCount":695,"flavors":[{"name":"Sweet","score":44.993265993265993},{"name":"Skunk","score":40.168350168350166},{"name":"Tropical","score":30.666843877370191},{"name":"Citrus","score":23.039695197589932},{"name":"Grapefruit","score":17.514974304447986}],"effects":[{"name":"Uplifted","score":71.146198830409347},{"name":"Energetic","score":57.861244019138752},{"name":"Happy","score":55.83501683501683},{"name":"Euphoric","score":52.870813397129183},{"name":"Relaxed","score":45.22736133262449}],"symptoms":[{"name":"Pain","score":40.157185894028},{"name":"Stress","score":37.431153641679956},{"name":"Fatigue","score":27.773701931596669},{"name":"Depression","score":27.607478291688818},{"name":"Lack of Appetite","score":17.443203969519757}],"conditions":[{"name":"Anxiety","score":24.036150983519406},{"name":"Arthritis","score":15.056884635832004},{"name":"ADD/ADHD","score":14.670919723551302},{"name":"Gastrointestinal Disorder","score":13.670919723551302},{"name":"PTSD","score":12.42495126705653}],"negatives":[{"name":"Dry Mouth","score":20.64664185716817},{"name":"Dry Eyes","score":17.533404217614741},{"name":"Dizzy","score":5.1088073719652662},{"name":"Paranoid","score":2.7001594896331738},{"name":"Anxious","score":1.6586921850079746}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/island-sweet-skunk_100x100_63ba.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003261/b/island-sweet-skunk__primary_2567.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/island-sweet-skunk_100x100_5ab7.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1003260/b/island-sweet-skunk__primary_9982.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/island-sweet-skunk_100x100_0808.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001704/b/island-sweet-skunk__primary_1b4d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/island-sweet-skunk_100x100_3ae9.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001485/b/island-sweet-skunk__primary_c460.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/island-sweet-skunk_100x100_c0f8.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/673489/b/island-sweet-skunk__primary_d973.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/island-sweet-skunk_100x100_9687.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/673517/b/island-sweet-skunk__primary_d16c.jpg"}],"photoTotalCount":180,"popularCities":["Portland, OR","Denver, CO","Chicago, IL","Colorado Springs, CO","Eugene, OR","Los Angeles, CA","Montréal, QC","Toronto, ON","Vancouver, BC","Boulder, CO"],"permalink":"https://mobileapi.leafly.com/sativa/island-sweet-skunk","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.28776978417266/240","testGraph":"https://leafly.s3.amazonaws.com/strains/testing/JuEn9je3Ru9zKB6nj4Q8_island-sweet-skunk.png","weakDescription":false,"videoUrl":null,"parents":[{"name":"Skunk No. 1","subtitle":null,"slug":"skunk-1","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/skunk-1","symbol":"Sk1","applink":"leafly://strain/skunk-1"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":60,"outdoorFinish":null,"height":"Medium","averageYield":"high","environment":null,"growNotes":"\n\tBest results with excellent air circulation\n\tClearing lower branches can improve circulation and air flow\n\tGrows best in temperatures between 70 to\u0026nbsp;80\u0026deg;F (21 to 27\u0026deg;C) and at 50% humidity\n\n"}}
