{
    "aka": null,
    "articleTotalCount": 2,
    "articles": [
        {
            "author": "Rebecca Kelley",
            "category": null,
            "date": "/Date(1468598400000)/",
            "id": "contentitems-3063",
            "text": "Because every day must be deemed a holiday (however pithy) in this digital world, July 12th was “Cow Appreciation Day,” which sounds udderly ridiculous until you realize what our bovine buddies have contributed to the cannabis moo-vement. In addition to a number of cow-themed strains such as Alpha Cow, Madcow, Purple Cow, and Afghan Cow, our comely cattle companions have also inspired an oft-used phrase used in many a Leafly review: “Holy cow!”\nIn honor of these dearly beloved domesticated ungulates, here are eight cannabis strains that inspired Leafly reviewers to exclaim “Holy cow” that I’ve helpfully paired with a corresponding gif.\n  Durban Poison\n“holy cow I’m flying. no such thing as stress or anxiety with this strain.” – chaosanon\n\n \n  Blockhead\n“I hit some of this from a bong along with some crazy dank lemon skunk and then vaped some of this blockhead (all with a friend) and holy cow i was flying high as a kite.” – chroniccannabisconsumsr\n\n \n  Kandy Kush\n“Holy cow was a privilege to try out this strain. […] Probably the smoothest that I have ever smoked. Was like a dream and to boot the exquisite candy floss flavour it brings is unbelievable!” – TheBigGreenGiant\n\n \n  Super Green Crack\n“Holy cow. […] Never felt more energetic in my life. Just felt like an energy to just get up and start doing shit. – hkim823\n\n \n  Sage N Sour\n“first commercially grow strain I’ve ever had, that being said HOLY COW! I ripped three huge hits from a bong and didn’t feel much yet so I killed the bowl, then it hit me …. I had to sit down for a sec and as the high progressed I got more and more energetic and super trippy I dont know how else to describe it but like being in. a 3D movie it was weird and then the world got flat and 2D like it was amazing then as I was coming down I felt like a super hero being ably to switch between reality,2D ,And more real than real 3D movie feeling” – COMetalHead\n\n \n  Lemon Haze\n“Holy COW. […] I got it last night, after I had already been smoking so I didn’t truly know its potential. I woke up this morning and loaded it up, about 2 hours before I had to go to work, with my last hit about 30 minutes before work. It is a GREAT get up and go, but be warned, you might [not] comprehend what you [are] getting up and going to. […] It was a fun experience though. :3” – thewhitewidow\n\n\n  God Bud\n“…I tried this concentrate and HOLY FREAKNG COW! This is the best indica. I was immediately at ease and calm. Great for relaxing at home.” – ariellm91\n\n \n  Pandora’s Box\n“…My new favorite strain. Holy cow man. […] After decades doing this, I’m higher than I have been in recent memory. Crazy good stuff…” – MrFadedGlory",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/07/12001515/cannabis-strains-that-will-make-you-exclaim-holy-cow.jpg",
            "title": "8 Cannabis Strains That Will Make You Exclaim \"Holy Cow!\"",
            "urlslug": "/news/strains-products/cannabis-strains-that-will-make-you-exclaim-holy-cow"
        },
        {
            "author": "Rebecca Kelley",
            "category": null,
            "date": "/Date(1402677600000)/",
            "id": "contentitems-2971",
            "text": "Whether you want to properly celebrate Friday the 13th or are simply in the mood for some elevated frights, here are 13 strains that each have an appropriate scary movie to pair. Enjoy, and remember, that creaking noise you hear coming from the creepy corner of the house is nothing more than a figment of your imagination…\n1. Killer Queen / Carrie\n\nSkip the remake and go with the original 1976 adaptation of the Stephen King novel about an unpopular teenage girl with an overbearing mom. Typical high school angst, right? Not when the teenage girl is telekinetic and a wee bit unstable.\nYou probably don’t want to pull a mean prank on her during the prom—instead, offer her some Killer Queen, a hybrid that yields happy, uplifting effects. Sounds like a match made in sticky, bloody heaven.\n2. Pennywise / It\n\nYou have the option to cue up the original It TV miniseries or check out the 2017 film adaptation of the Stephen King novel. Either way, you’ll be confronted with one of the scariest horror movie villains you’ll peek through your fingers to catch a glimpse of.\nClowns are creepy enough on their own, but a sewer-dwelling razor-teethed clown that eats children will provide enough nightmare fuel that you might need some of the indica Pennywise strain to relax you back down into a state where you aren’t likely to pee yourself at any given moment. Just remember, they all float down here…\n\n3. Jack the Ripper / The Shining\n\nI know that the historic Jack the Ripper went after prostitutes in ye olde timey London, but when I think of a scary Jack, only one man comes to mind: Mr. Torrance from yet another Stephen King novel-turned-movie, The Shining.\nIt may be a little less unnerving to watch the family man become unhinged as a brutal winter keeps his wife and son held captive inside the sinister Overlook Hotel if you pair the experience with the happiness-inducing Jack the Ripper hybrid. Better yet, chase that strain with some appropriately-named Jack Frost once the axe-wielding papa succumbs to that tricky hedge maze.\n4. Alien OG – Alien\n\nFinally, an entry that didn’t come from the warped mind of Stephen King! This Ridley Scott classic boasts impressive special effects and the clever tagline, “In space, no one can hear you scream.”\nSure, Alien practically invented the “What’s that scary rustling in the corner? Oh, it’s just the damn cat OH CRAP A MONSTER’S TRYING TO EAT ME” horror movie trope, but it’s still a top entry in my book mainly because Ellen Ripley is one of the most bad-ass female protagonists in movie history. Celebrate her victory over the drooling, acid-blooded behemoth with a little Alien OG, a hybrid strain with earthy and pine flavors that will make you relieved you’re save and sound back here on Earth.\n\n5. Little Devil / The Exorcist\n\nFrom the iconic creepy-sounding score to the “you’ll never look at pea soup the same again” projectile vomiting, The Exorcist is a horror movie classic. A poor little girl gets possessed by the devil and promptly behaves like the Antichrist (or like those girls on My Super Sweet Sixteen).\nAfter you watch her spider-crawl down the stairs, you might want to chase that scene with some high-THC Little Devil to bring your heart rate back down to a normal range.\n6. Ghost OG / Poltergeist\n\n“You just moved the headstones! You didn’t move the bodies!!” Poltergeist is a cautionary tale as to why you should avoid buying houses built over ancient Indian burial grounds no matter how sweet the deal may seem.\nPair this spooky ghost thriller with the hybrid Ghost OG for a sweet counterbalance to all of the sour supernatural events that plague the Freeling family. Just make sure you peace out if your TV turns on by itself and is all staticky (and whatever you do, don’t go into the light).\n\n7. Zombie OG / Night of the Living Dead\n\nIf you’re going to enjoy some Zombie OG, it’s only fitting to pair the earthy indica with the 1968 classic that kicked off over 45 years of zombie mania, George Romero’s Night of the Living Dead. The black and white film doesn’t bother with happy endings, just wave after wave of undead citizens keen on taking a bite out of anyone within a rotted arm’s reach.\nIf you want to extend your movie marathon, I recommend following up the original with the iconic Dawn of the Dead, a cheeky wink at our society’s zombie-like consumerist ways, and Day of the Dead, which takes the horror underground to a military bunker.\n8. Killing Fields / The Texas Chainsaw Massacre\n\nThe 1974 horror classic The Texas Chainsaw Massacre was so unsettling, some people actually thought it was a real snuff film. What’s remarkable about the movie is that it isn’t gory at all—the creepy family and the film’s realistic, grimy feel mess with your head and make you think it’s more grisly than it actually is.\nWhile watching, partake in the sativa Killing Fields so you’ll have some energy to sprint across a field if Leatherface bursts through your door wielding a gas-powered killing apparatus.\n\n9. Pandora’s Box / Hellraiser\n\nThis ’80’s horror offering is a cautionary tale for anyone who comes across a mysterious puzzle box in a creepy knickknacks shop. Stop, put down the box, and buy a snow globe instead; otherwise, you might accidentally summon some nasty-looking dudes who are all-too keen on dragging you to hell.\nPair Hellraiser with the sweet, grapefruity Pandora’s Box for a little juxtaposition as you watch a dude with pins in his face rip a guy apart with some rusty chains.\n10. Kali Mist / The Mist\n\nHere’s one more Stephen King entry for your horror movie marathon. The Mist is a surprisingly good film from 2007 that follows a man and his son as they struggle to survive against the evils of both otherworldly creatures and mankind after a mysterious mist rolls through a small town. The ending is bleak and if you opt to watch the black and white version, it’ll seem even more eerie.\nHelp clear your mood afterwards with some Kali Mist, which delivers happy, uplifting effects to counterbalance the dread you experience while watching this bummerfest.\n\n11. Mother’s Finest / Psycho\n\nYou think you’ve got mommy issues? This iconic Hitchcock film is the ultimate example of “This dude needs therapy and a hug.” Stay far, far away from the pointless Gus Van Sant remake and opt for the original 1960 classic.\nExperience Psycho with the sweet sativa Mother’s Finest and make sure to lock the bathroom door before you hop into the shower.\n12. OG Shark / Jaws\n\nThe original summer blockbuster that made millions of people afraid to dip a toe into the ocean, Jaws is one of my all-time favorite movies. Given how every other classic horror movie has suffered through an inferior remake, it says a lot about this Steven Spielberg offering that nobody has dared to touch this masterpiece since it first debuted.\nPartake in the hybrid OG Shark and bask in its diesel flavor when Brody shouts “Smile, you son of a bitch!” and blows the massive great white shark to smithereens.\n\n13. Funky Monkey / Dead Alive\n\nOkay, admittedly this warped film from Peter Jackson is more funny-gross than scary, but Dead Alive is still a classic in its own right and a cautionary example of why you shouldn’t mess with rabid Sumatran rat-monkeys.\nEnjoy some of the indica Funky Monkey and giggle it up while you watch a priest kick ass for the Lord and an unlikely protagonist wield a lawnmower against a room full of nasty undeads.\nWhat are some of your favorite movies you can’t wait to watch tonight? Share in the comments and we’ll think of strain pairings to go with them!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/06/12001235/13-strains-and-their-scary-movie-pairings-to-celebrate-friday-the.jpg",
            "title": "13 Cannabis Strains and Their Scary Movie Pairings",
            "urlslug": "/news/strains-products/13-strains-and-their-scary-movie-pairings-to-celebrate-friday-the"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Spinal Cord Injury",
            "score": 33.854166666666664
        },
        {
            "name": "Anxiety",
            "score": 18.973214285714285
        },
        {
            "name": "Migraines",
            "score": 9.399801587301587
        },
        {
            "name": "Arthritis",
            "score": 7.837301587301587
        },
        {
            "name": "Gastrointestinal Disorder",
            "score": 7.837301587301587
        }
    ],
    "description": "<p>A mostly sativa cross of Jack the Ripper and Space Queen, this strain has high THC levels and a citrus flavor.</p>\n",
    "descriptionPlain": "A mostly sativa cross of Jack the Ripper and Space Queen, this strain has high THC levels and a citrus flavor.\n",
    "effects": [
        {
            "name": "Uplifted",
            "score": 63.442460317460316
        },
        {
            "name": "Energetic",
            "score": 61.532738095238095
        },
        {
            "name": "Happy",
            "score": 55.257936507936506
        },
        {
            "name": "Relaxed",
            "score": 39.93055555555555
        },
        {
            "name": "Euphoric",
            "score": 36.38392857142857
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 35.93749999999999
        },
        {
            "name": "Pine",
            "score": 34.54861111111111
        },
        {
            "name": "Spicy/Herbal",
            "score": 8.184523809523808
        },
        {
            "name": "Tree Fruit",
            "score": 7.663690476190475
        },
        {
            "name": "Diesel",
            "score": 7.142857142857142
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1398361,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "I was immediately impressed by the nice, comfortable, even high this strain delivered.  I had to share some with my girlfriend to see how she would react.  Her first response was, \"I feel all tingly, this isn't the same stuff as last time.\"  I can't remember why but we both went into a ten minute laughing fit.  Giggling like a teenager when I'm high isn't something I'm used to experiencing.  So I guess I would describe the feeling as \"uplifting\" for the most part.  I forgot to tell her that I had switched out strains on her, I hope that's not unethical.  Later on I decided to go for the ceiling.  I reached the point where I knew that if I went much further I would no longer be having fun.  It really didn't take much to get that intense head buzz, I'll keep that in mind next time.  My overall impression:  this is how good pot should feel.",
            "username": "The_Shattered_Soldier"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png",
            "id": 1594571,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "awesome place to come to. great customer service.",
            "username": "cassy2018"
        }
    ],
    "id": 5479,
    "name": "Pandora's Box",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 13.045634920634921
        },
        {
            "name": "Dry Eyes",
            "score": 5.034722222222222
        },
        {
            "name": "Dizzy",
            "score": 1.0416666666666665
        },
        {
            "name": "Headache",
            "score": 1.0416666666666665
        },
        {
            "name": "Paranoid",
            "score": 1.0416666666666665
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/jack-the-ripper",
            "category": "Sativa",
            "name": "Jack the Ripper",
            "permalink": "https://mobileapi.leafly.com/sativa/jack-the-ripper",
            "slug": "jack-the-ripper",
            "subtitle": null,
            "symbol": "Jtr"
        },
        {
            "applink": "leafly://strain/space-queen",
            "category": "Hybrid",
            "name": "Space Queen",
            "permalink": "https://mobileapi.leafly.com/hybrid/space-queen",
            "slug": "space-queen",
            "subtitle": null,
            "symbol": "Sq"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/pandoras-box",
    "photoTotalCount": 32,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/557484/b/pandora-s-box__primary_12f0.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pandora-s-box_100x100_8c72.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/512468/b/pandora-s-box__primary_2681.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pandora-s-box_100x100_c553.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/503915/b/pandora-s-box__primary_fb6a.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pandora-s-box_100x100_ba29.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/495089/b/pandora-s-box__primary_c582.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pandora-s-box_100x100_6abb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/493703/b/pandora-s-box__primary_a7fc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pandora-s-box_100x100_139e.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/493732/b/pandora-s-box__primary_43cc.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/pandora-s-box_100x100_f8b0.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Vancouver, BC",
        "Colorado Springs, CO",
        "Goodyear, AZ",
        "Newberg, OR",
        "Portland, OR",
        "Ritzville, WA",
        "Spokane Valley, WA"
    ],
    "rating": 4.25,
    "relatedStrains": [],
    "reviewCount": 128,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "pandoras-box",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.25/240",
    "subtitle": null,
    "symbol": "Pan",
    "symptoms": [
        {
            "name": "Pain",
            "score": 44.816468253968246
        },
        {
            "name": "Stress",
            "score": 20.882936507936506
        },
        {
            "name": "Depression",
            "score": 18.45238095238095
        },
        {
            "name": "Eye Pressure",
            "score": 8.184523809523808
        },
        {
            "name": "Inflammation",
            "score": 8.184523809523808
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
