{"sl_translate":"description,descriptionPlain,category","id":2773,"slug":"laughing-buddha","name":"Laughing Buddha","subtitle":null,"symbol":"Lgb","category":"Sativa","description":"\u003cp\u003e\u003ca href=\"http://www.leafly.com/sativa/laughing-buddha\"\u003eLaughing Buddha\u003c/a\u003e is an award-winning \u003ca href=\"http://www.leafly.com/sativa\"\u003esativa\u003c/a\u003e (2003 \u003cem\u003eHigh Times\u003c/em\u003e Cannabis Cup) from Barney\u0026#39;s Farm that grows fast and tall. \u003cspan style=\"line-height: 20.7999992370605px;\"\u003eAn \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\"\u003eearthy\u003c/a\u003e cross between \u003ca href=\"http://www.leafly.com/sativa/thai\"\u003eThai\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/sativa/jamaican\"\u003eJamaican\u003c/a\u003e strains with a\u003c/span\u003e\u0026nbsp;\u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\"\u003esweet\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-tree-fruit\"\u003efruity\u003c/a\u003e smell that is broken up by hints of \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-spicyherbal\"\u003espice\u003c/a\u003e and provides a rich \u003ca href=\"http://www.leafly.com/explore#!/explore/flavors-pungent\"\u003epungent\u003c/a\u003e smoke that will leave consumers feeling \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-happy\"\u003ehappy\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-uplifted\"\u003eupbeat\u003c/a\u003e, and will leave them \u003ca href=\"http://www.leafly.com/explore#!/explore/tags-giggly\"\u003egiggling\u003c/a\u003e even when battling \u003ca href=\"http://www.leafly.com/explore#!/explore/symptoms-depression\"\u003edepression\u003c/a\u003e.\u0026nbsp;\u003cspan style=\"line-height: 1.6em;\"\u003eThe oversized colas often need pruning and extra support, but the added work pays off come harvest time when full, frosty buds cover almost the entire plant.\u003c/span\u003e\u003c/p\u003e\n","descriptionPlain":"Laughing Buddha is an award-winning sativa (2003 High Times Cannabis Cup) from Barney\u0026#39;s Farm that grows fast and tall. An earthy cross between Thai and Jamaican strains with a\u0026nbsp;sweet, fruity smell that is broken up by hints of spice and provides a rich pungent smoke that will leave consumers feeling happy, upbeat, and will leave them giggling even when battling depression.\u0026nbsp;The oversized colas often need pruning and extra support, but the added work pays off come harvest time when full, frosty buds cover almost the entire plant.\n","aka":null,"rating":4.47,"highlightedReviews":[{"id":1415110,"username":"London_1985","text":"INCREDIBLE STRAIN!\r\n\r\nThis is one of those strains i tend to keep quiet about when im discussing weed with my friends lol\r\n\r\nIts like my dirty little secret. I first tried this in Amsterdam. After 2 days of non stop smoking i was getting to the point where i was all weeded out and a lot of strains where just tasting the same and making me feel the same.\r\n\r\nBut not this.\r\n\r\nI vividly remember sparking up a nice joint of this in Susies Saloon with a nice round of cold Heinekens. By the time i had finished smoking this strain it had transported me back to the first time i had ever gotten high, that amazing soaring feeling that just unlocks your mind and puts you at one with the world and everything around you.\r\n\r\nLots of laughter, incredibly euphoric, incredible smoke.\r\n\r\nI advise anyone to try this atleast once, it really is like finding a Diamond in a haystack (no pun intended).","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4/240","avatar":"https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png"},{"id":1641345,"username":"Ultimate86Man","text":"I think the Laughing Buddha strain is simply a 5 out of 5. The strain is so great because it makes half of the newest day-time strain called Pink Buddha (Laughing Buddha X Fighting Buddha). Millennium Marijuana Concentrates are the BEST, YOU GUYS ROCK FOR WHAT YOU DID!!!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/gn1KTn64cc9D8CRBNayJF1tnfB4=/fit-in/300x300/https%3a%2f%2fddd33q3967xhi.cloudfront.net%2fqmB_VhteSAycRoRafB7zBQ8q7r0%3d%2f120x120%2fhttps%253A%252F%252Fs3.amazonaws.com%252Fleafly%252Fbin%252FmstpXGgRuu3rPFHmtQHb_aviator-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-57756","title":"The 7 Best Strains for High Movie Watching","author":"Hannah Meadows","category":null,"date":"\/Date(1518742834000)\/","text":"Whether you’re getting down with a favorite comedy or tuning in to some classic horror, finding the best cannabis strain to pair with your top flick pick can make or break a movie-watching experience. Strains steeped in creativity tend to highlight subtle messages you wouldn’t notice before a bong hit, while others can ruin a perfectly good film by making those little on-screen nuances glaringly distracting.\n\nTo find the most cerebral strains to pair with your next movie-of-choice, we dove down Leafly’s strain explorer and polished the options to bring you the best strains producing happy, giggly, creative, and focused highs that will complement a trip to the theater or lazy night in. Ditch the scrutiny with these top picks for high move-watching.\nHave a go-to strain you like to pair with your favorite film? Tell us about it in the comments. \nAlice in Wonderland\n\nStrain Type: Sativa\nBest For: Visual documentaries, heady dramas\nAlice in Wonderland is a mostly sativa strain with euphoric cerebral effects. It provides an elevated sensory experience, making it a favorite strain for creative pastimes, outdoor activities, a laid-back weekend, or daytime stress relief. Said to be a descendant of Willy’s Wonder, Alice in Wonderland opens up the mind and relaxes the body. It’s the best match for nature-filled documentaries and heady dramas that require focus with a soft, innovative edge.\nFind Alice in Wonderland Nearby\n\nLemon Larry Lavender\n\nStrain Type: Hybrid\nBest For: Comedies, creative indie films\nLemon Larry Lavender by Big Buddy Seeds is greater than the sum of its parts. The stunningly flavorful cross of Larry OG and Lavender offers sweet citrus aromas overlaid by velvety floral terpenes. Boasting loose sedative effects and an elevated state-of-mind due to a hefty dose of limonene, Lemon Larry Lavender is the perfect pairing with a night of comedy or buzzy indie films.\nFind Lemon Larry Lavender Nearby\nOG LA Affie\n\nStrain Type: Indica\nBest For: Paranormal horror\nOG LA Affie from DNA Genetics is a pure indica variety best known for parenting the famed LA Confidential. The aroma is a subtle blend of earthy and sweet, offering an unusually energetic and psychedelic buzz that holds up against scary movies and horror films. Gather your friends, load up a bowl, and try to keep yourself from hiding under the covers with this bold strain.\nFind OG LA Affie Nearby\n\nChucky’s Bride\n\nStrain Type: Hybrid\nBest For: Educational documentaries\nChucky’s Bride is a cross of Exodus Cheese and Cinderella 99 bred by Eskobar Seeds. This sativa-dominant hybrid gives off an exotic mixture of sharp flavors. Cinderella 99’s tropical aroma of sweet citrus and pineapple blend with the pungent notes of skunky cheese. The unique terpene profile leads a charge of uplifting and creative effects that stimulate the mind with an imaginative punch that’s excellent for educational documentaries. Download something new, invite over your favorite people, and discuss what you learned over a joint or two.\nFind Chucky’s Bride Nearby\nWookie\n\nStrain Type: Hybrid\nBest For: Feel-good movies, creative indie films\nWookie is a tantalizing cross of Lavender and Appalachia supposedly grown by the renowned seed bank Bodhi Seeds. This odoriferous combination blends an intensely floral aroma with sour terpenes, creating a unique fragrance that is sure to fill the room. Lavender’s happy, relaxed effects press firmly up against Appalachia’s dreamy, cerebral effects, making Wookie a whimsical escape from stress and the best choice for a night in front the TV with an original indie film on hand. This tasty strain will make you think outside the box while watching something bright and new.\nFind Wookie Nearby\n\nLaughing Buddha\n\nStrain Type: Sativa\nBest For: Light comedies\nLaughing Buddha is an award-winning sativa (2003 High Times Cannabis Cup) from Barney’s Farm that grows fast and tall. An earthy cross between Thai and Jamaican strains with a sweet, fruity smell that is broken up by hints of spice and provides a rich pungent smoke that will leave consumers feeling happy, upbeat, and giggling. These effects make it a wonderful strain to fill up a joint and press play on a fun comedy or easy, light-hearted TV shows.\nFind Laughing Buddha Nearby\nBig Bull\n\nStrain Type: Indica\nBest For: Unique dramas\nBig Bull by Kannabia Seed Company is a squat indica with award-winning medicinal properties. Winning 2nd Place for Best Indica Seed at the 2012 Treat Yourself Expo in Toronto, Canada, Big Bull (aka Kannabia Special) grows stalky plants with a tantalizing floral aroma. This nearly pure indica offers relaxing effects that are introspective and meditative, which translates to excellent dramas that are both unique and heavy.\nFind Big Bull Nearby","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/14132749/best-strains-high-movie-watching.jpg","urlslug":"/news/strains-products/best-strains-for-high-movie-watching"},{"id":"contentitems-2997","title":"7 Giggly Cannabis Strains for Inducing Laughing Fits","author":"Bailey Rahn","category":null,"date":"\/Date(1451342040000)\/","text":"In your experience, are there any particular cannabis strains that lead to more laughing fits than others? You might already know what your go-to giggly strain is, but we’ve got some recommendations for the next time you need a companion strain to that funny movie, comedy show, or time spent kicking back with friends. With the help of Leafly user-submitted reviews, we uncovered the strains that consumers like yourself rated as most giggly. Here are seven top contenders; you can also browse an expanded list of gut-busting strains in the Explorer.\nBlue Diesel\n \nIntroduced by strong flavors of sour blueberry, Blue Diesel is a hybrid to elevate you to an uplifted and jovial mindset. Its nimble cerebral effects make Blue Diesel a perfect daytime companion strain, and the giddy euphoria is sure to bring on spells of laughter (unfortunately to an exaggerated degree for one Leafly reviewer).\n\n“I laughed so hard that I threw up. And that made me laugh more.”\nLaughing Buddha\n \nLaughing Buddha’s effects can be understood simply by reading its name: a relaxed state of mind gives way to joyful elation. With an earthy and herbal sage aroma, this sativa helps you let go of stress and unlock a more lighthearted outlook on life. This strain is a favorite for weekend nature excursions with friends, or for getting your day started with a smile.\n\n“Made me feel like nothing could annoy me, I just laughed it off! Very giggly, and made me take myself less seriously.”\nChurch OG\n \nA serious name for a not-so-serious strain, Church OG is a heavy indica that’ll knock you into stupefied episodes of laughter (especially if friends are around to trigger it). The OG Kush descendent packs a sleepy punch in large doses, so take this one slowly if bedtime is still far off.\nChemdawg\n \nThe effects produced by Chemdawg’s high THC content can manifest in many ways, one of which is clearly fits of laughter. This one’s a personal favorite of mine for creative collaborations and chilling with close friends, since it lends both social and artistic energy. However, mind the word of caution from the Leafly reviewer below.\n\n“Prepare for laugh attacks and an extremely heavy body and head high. Everything becomes funny as hell and I legit pissed myself while laughing so hard at a Steak and Shake drive-thru.”\nSweet Diesel\n \nWith a champion heritage from OG Kush and Sour Diesel, Sweet Diesel masterfully captures everything we love about sativas: a little boost of wakefulness, creative energy, social engagement, and nonstop giggles.\nBlack Diamond\n \nSometimes the best way to unwind after a long, active week is to sit down with a sedating couch-lock strain and a Netflix comedy marathon. Black Diamond is a perfect match for lazy weekends or long bedrest recoveries that take a toll on your mood.\n\n“One of the main things I noticed when I’m on this is that the smallest things trigger the biggest laughing spell you will ever see in yourself again. I swear I saw the funniest shit ever on it, and it was the first time any strain made me laugh for more than 20 minutes straight.”\nMango Kush\n \nFirst comes that unforgettable mango flavor, and then it’s all giggles. Few strains have more to offer the flavor enthusiast and the social butterfly alike than Mango Kush. Named for its strong fruity mango aroma, this hybrid keeps you chatty and upbeat for social outings or when you’re just kicking it with best friends.\n\n“Two bowls put me and a buddy into a fit of giggles for a good 45 minutes while munching down on a bag of Cheetos. Then we got serious for a bit and had just about the most beautiful in-depth talk ever.”","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/12/12001323/7-giggly-cannabis-strains-for-inducing-laughing-fits.jpg","urlslug":"/news/strains-products/7-giggly-cannabis-strains-for-inducing-laughing-fits"}],"reviewCount":172,"flavors":[{"name":"Spicy/Herbal","score":22.212906504065039},{"name":"Sweet","score":13.533351810790835},{"name":"Earthy","score":12.088645602365114},{"name":"Woody","score":8.8804970436068},{"name":"Flowery","score":7.2348484848484853}],"effects":[{"name":"Euphoric","score":89.620750184774579},{"name":"Happy","score":88.577004804138951},{"name":"Uplifted","score":83.78210458240946},{"name":"Energetic","score":80.14781966001479},{"name":"Giggly","score":70.841186252771621}],"symptoms":[{"name":"Stress","score":39.096452328159643},{"name":"Depression","score":30.132806725794534},{"name":"Fatigue","score":23.491315594974129},{"name":"Lack of Appetite","score":18.554369918699187},{"name":"Insomnia","score":9.6738728750923872}],"conditions":[{"name":"Anxiety","score":18.753464523281593},{"name":"PTSD","score":13.758545824094606},{"name":"ADD/ADHD","score":7.0087305986696222},{"name":"Tourette\u0027s Syndrome","score":6.666666666666667},{"name":"Arthritis","score":6.5236973392461195}],"negatives":[{"name":"Dry Mouth","score":27.777854767184031},{"name":"Dry Eyes","score":11.804554693274206},{"name":"Anxious","score":7.8030303030303036},{"name":"Dizzy","score":3.433342572062084},{"name":"Paranoid","score":1.9886363636363635}],"articlesAvailable":true,"articleTotalCount":4,"photos":[{"uploaded":"\/Date(1397952000000)\/","thumb":"https://d3ix816x6wuc0d.cloudfront.net/sativa/laughing-buddha/primary?width=200","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/sativa/laughing-buddha/primary?width=1024"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/laughing-buddha_100x100_ed8b.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001988/b/laughing-buddha__primary_dc1a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/laughing-buddha_100x100_3d45.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/1001987/b/laughing-buddha__primary_6833.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/laughing-buddha_100x100_fde0.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/626478/b/laughing-buddha__primary_8cec.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/laughing-buddha_100x100_5f91.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/626573/b/laughing-buddha__primary_0a04.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/laughing-buddha_100x100_deeb.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/626607/b/laughing-buddha__primary_c556.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/laughing-buddha_100x100_9d96.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/594745/b/laughing-buddha__primary_3dcf.jpg"}],"photoTotalCount":24,"popularCities":["Los Angeles, CA","Vancouver, BC","Montréal, QC","Calgary, AB","San Francisco, CA","Spokane, WA","Toronto, ON","Anaheim, CA","Fremont, CA","Halifax, NS"],"permalink":"https://mobileapi.leafly.com/sativa/laughing-buddha","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.47093023255814/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Thai","subtitle":null,"slug":"thai","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/thai","symbol":"Tha","applink":"leafly://strain/thai"},{"name":"Jamaican","subtitle":null,"slug":"jamaican","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/jamaican","symbol":"Jam","applink":"leafly://strain/jamaican"}],"growInfo":{"difficulty":"Difficult","preferredMedium":null,"floweringDays":85,"outdoorFinish":"End of October","height":"Tall","averageYield":"Medium","environment":null,"growNotes":"\n\tSuitable for hot climates\n\n"}}
