{
    "aka": "Charlottes Web",
    "articleTotalCount": 4,
    "articles": [
        {
            "author": "Bailey Rahn",
            "category": null,
            "date": "/Date(1519851079000)/",
            "id": "contentitems-59186",
            "text": "Cannabidiol, or CBD, is becoming a mainstay in consumers’ medicine cabinets as it combats pain, inflammation, anxiety, and much more. However, even as CBD strains and products become more readily available, the price tag can often make one flinch. For this reason, it’s worth knowing which products will bring the best value based on CBD abundance.\n\nLooking at data from cannabis testing labs across Washington State, we compiled a list of strains that tend to produce significant amount of CBD. These numbers are derived from the testing samples of cannabis flowers and do not include CBD concentrates.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nIn the above graph, you’ll find the average cannabinoid contents of ten popular CBD-dominant strains. You’ll notice that many of these strains contain only trace amounts of THC, while others exhibit a more balanced CBD:THC ratio (which means they will be more euphoric in effect). This graph is based on datasets from multiple reliable testing labs across Washington State. However, it’s worth noting that the datasets from each individual lab differ slightly.\nTake a look at the cannabinoid data from one lab, and notice how the numbers shift slightly.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nMost strains maintain a CBD:THC ratio similar to that in the averaged dataset. However, you’ll also see deviations, like ACDC which exhibits a more balanced CBD:THC ratio according to this lab’s individual testing results.\nNow let’s see how the dataset of Lab A compares to a different lab, also represented in the larger, averaged dataset above.\nClick to enlarge. (Elysse Feigenblatt/Leafly)\nAs you can see, the CBD levels from Lab B are much higher on average than those from Lab A. There are a number of possible explanations for this. A lab may manufacture bloated cannabinoid profiles, as we’ve seen some labs do in the past. It could also be that Lab B simply tested samples from growers who achieved higher CBD levels in their harvest.\nThe main takeaway here is this: the cannabinoid profile printed on your product depends not only on the strain’s genetics and expertise of the grower, but also on the testing methods (and ethics) of the local lab that performed the chemical analysis. The Dancehall you bought on your last trip to the dispensary is likely to reflect the cannabinoid data illustrated in the above graphs–however, if you see deviation, the reason lies in the many layers of strain and data variability.\n\nCannabis Strains With High Levels of CBD\nWith this caveat in mind, let’s look at the strains that expressed the highest levels of CBD according to the above lab data.\n\nFind Dancehall Nearby\nDancehall is an upbeat and inspiring strain meant to lift your spirits while coercing creativity. With a CBD:THC ratio of nearly 20:1 on average, this strain delivers little to no euphoric effects that might distract focus or dampen cognition in THC-sensitive consumers.\n\nFind ACDC Nearby\nKnown for its keen ability to lift anxiety of all shades, ACDC is a godsend to consumers susceptible to the side effects of THC. This strain allows you to harness many of the desirable traits of cannabis, like light-footed physical relaxation and gentle mood elevation, without the cost of a clear, calm mind.\n\nFind Suzy Q Nearby\nSuzy Q is a CBD-dominant strain with an extremely modest amount of THC, making it another mellow strain with little to no high. The mild effects of this pine-scented strain help you shed anxious or demotivating mental blocks that stood in the way of creativity and productivity.\n\nFind Ringo’s Gift Nearby\nNamed in recognition of the CBD pioneer Lawrence Ringo, Ringo’s Gift imbues the consumer with a sense of wellbeing alongside steady relief in the body. Use this strain to take the edge off pain and stress, while allowing the mind to roam free without the shackles of paranoia or distracting euphoria.\n\nFind Charlotte’s Web Nearby\nCharlotte’s Web was the first CBD strain to receive media attention, and has achieved legendary status among CBD varieties ever since. Although its reputation is built upon its success in treating epilepsy, this strain has aided patients treating many other conditions including pain, anxiety, and inflammation. Charlotte’s Web is grown by CW Pharmaceuticals in Colorado.\n\nFind Remedy Nearby\nRemedy is a high-CBD strain that quietly ushers in easy relaxation without mental fog. For consumers seeking something a little more relaxing than a cup of tea, Remedy offers a solution with effects that rid the mind of anxiety while soothing aches, pains, and inflammation.\n\nFind Sour Tsunami Nearby\nSour Tsunami has become a household name among high-CBD strains. This variety tends to produce less than 1-2% of THC, so you can reap its medicinal benefits without the high. Sour Tsunami is fairly prolific, so keep an eye out for this strain at your next dispensary visit if you’re looking to quell pain or anxiety symptoms without the interference of THC.\n\nFind Hawaiian Dream Nearby\nIf you’re looking to harness the benefits of THC and CBD but wary of getting too high, Hawaiian Dream is the strain for you. With a THC content of around 5% and a CBD profile stretching between 5-10%, Hawaiian Dream can help abate symptoms with only mild, gentle euphoria. As an added bonus, this strain throws in a little tropical flavor to sweeten the experience.\n\nFind Dance World Nearby\nDance World is a CBD-dominant strain that almost achieves a balanced CBD:THC ratio, making it especially appropriate for consumers struggling with pain, depression, and lack of appetite. This synergy of THC and CBD helps to inspire positivity and more vibrant moods by handing you subdued euphoria on a leash.\n\nFind Nordle Nearby\nNordle offers a balanced abundance of both THC and CBD that makes it especially suitable for patients dealing with pain, insomnia, muscle spasms, and anxiety. If your symptoms are keeping you up at night, Nordle is a great nightcap solution for dialing down pain and worries so you can spend less time tossing and turning.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/02/28121936/high-cbd-strains.jpg",
            "title": "Which Cannabis Strains Are Highest in CBD, According to Lab Data?",
            "urlslug": "/news/strains-products/high-cbd-marijuana-strains-according-to-lab-data"
        },
        {
            "author": "Rebecca Kelley",
            "category": null,
            "date": "/Date(1460678400000)/",
            "id": "contentitems-3611",
            "text": "Recently I took a look at the rising female interest in cannabis and shared some business takeaways for dispensaries looking to offer a more female-friendly experience to their clientele. One of the suggestions I made was to make sure dispensaries stock strains that are especially appealing to female consumers, a tip that may have brought about some skepticism. Are there really strains that resonate more strongly with women?\n\nAccording to our data, yes. What are they, and what qualities do they possess that appeal to the fairer sex? First, let’s take a look at the most popular strains women are searching for on Leafly.com.\nThe Strains Women View the Most on Leafly\n\nClick on the image for an enlarged version\nThe above chart highlights the 10 cannabis strains most viewed by women. At first glance the data may seem unsurprising, as these strains are also among our most popular overall, so there aren’t any real surprises here. However, things get really interesting when we look at the strain varieties that women look at more than men:\nCannabis Strains Women Look at More Frequently Than Men Do\n\nClick on the image for an enlarged version\nThe above chart illustrates which strains women view more often than their male counterparts and the percentage increase at which they’re viewing them. This data, supplemented with the list of strains women view the most, leads us to some interesting observations. Why are women attracted to these strains? Here are our hypotheses:\nWomen Like Sativa Strains and Uplifting Effects\n\nUplifting sativas and hybrids dominate female preferences, with both charts combining to include only two indica strains. Even the hybrids offer a patten of euphoric, happy, and uplifting commonalities, suggesting these effects are desirable among female consumers.\n\nWomen Seek Out High-CBD Strains\n\nCharlotte’s Web, Harlequin, and Cannatonic are all known for their high-CBD content. According to research, CBD, or cannabidiol, can offer analgesic, anti-inflammatory, and anti-anxiety properties. Activist and entrepreneur Jaime Lewis told High Times that women turn to cannabis to help treat a variety of diseases or symptoms including menopause, menstrual cramps, anorexia, breast cancer, and PMS. These high-CBD strains can offer pain relief for a lot of the ailments and discomfort women experience.\n\nWomen Are Interested in Anti-Anxiety Strains\n\nUplifting strains and CBD-heavy options have something in common: they also help mitigate anxiety. According to Leafly user reviews, Charlotte’s Web, Harlequin, Cannatonic, Skywalker, Agent Orange, and Jack Herer all possess anti-anxiety effects. Considering women are twice as likely to have an anxiety disorder as men, you can see why strains that help alleviate these feelings would be especially appealing to females.\n\nWomen Enjoy Sweet, Fruity Flavor Profiles\n\nWomen have a better sense of taste than men (and no, this isn’t a dig at bro tanks and board shorts), and they’re more likely to be “supertasters,” or people who experience a much more intense sense of taste than average Joes. Many of the strains women search for have distinctly fruity, sweet flavors, such as Green Crack and Harlequin (both offer flavors similar to mangoes), Lemon Kush and its sweet citrus mix, Purple Haze and its sweet berry taste, and Agent Orange’s, well, orange-y citrus fragrance.\n\nSo what strains do women want? According to our data, it’s high-CBD strains and uplifting sativas and hybrids that deliver anti-anxiety effects and taste damn good. Dispensaries: take note of our findings and stock your shelves accordingly. Women could very well be a major contributing factor to ending cannabis prohibition, so make sure your inventory is ready for our discerning tastes.\nOf course, our readers were quick to weigh in with their thoughts on our findings; check out which strains they recommend instead.\n\nHungry for more marketing insight? Contact Leafly to find out how we can help you grow your cannabusiness!\n\nImage Source: Sara Dilley",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/04/12003004/what-cannabis-strains-do-women-want.jpg",
            "title": "What Cannabis Strains Do Women Want?",
            "urlslug": "/news/strains-products/what-cannabis-strains-do-women-want"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 45.641955412301904
        },
        {
            "name": "PTSD",
            "score": 22.19480257856567
        },
        {
            "name": "Migraines",
            "score": 19.228444802578565
        },
        {
            "name": "Arthritis",
            "score": 18.59051839914048
        },
        {
            "name": "ADD/ADHD",
            "score": 9.466492076282568
        }
    ],
    "description": "<p>Charlotte&rsquo;s Web is a cultivar&nbsp;with less than 0.3% THC&nbsp;that has gained popularity as an&nbsp;option for treating seizures as well as a range of other medical conditions. This medical potency is due to its high-CBD content, which was specifically cultivated by Colorado breeders The Stanley Brothers for a young epileptic patient named Charlotte. Contrary to popular belief, Charlotte&rsquo;s Web is a hemp-derived product&nbsp;with little to no psychoactive effects, making it great for those who don&rsquo;t want their medication to affect their daily tasks. Charlotte&rsquo;s powerful web may cause dizziness for some patients, so new users should be cautious. Learn more about Charlotte&#39;s Web <a href=\"https://www.leafly.com/brands/cw-hemp\">here</a>.</p>\n",
    "descriptionPlain": "Charlotte&rsquo;s Web is a cultivar&nbsp;with less than 0.3% THC&nbsp;that has gained popularity as an&nbsp;option for treating seizures as well as a range of other medical conditions. This medical potency is due to its high-CBD content, which was specifically cultivated by Colorado breeders The Stanley Brothers for a young epileptic patient named Charlotte. Contrary to popular belief, Charlotte&rsquo;s Web is a hemp-derived product&nbsp;with little to no psychoactive effects, making it great for those who don&rsquo;t want their medication to affect their daily tasks. Charlotte&rsquo;s powerful web may cause dizziness for some patients, so new users should be cautious. Learn more about Charlotte&#39;s Web here.\n",
    "effects": [
        {
            "name": "Relaxed",
            "score": 68.34038409884502
        },
        {
            "name": "Uplifted",
            "score": 67.40531829170024
        },
        {
            "name": "Happy",
            "score": 64.69245232339512
        },
        {
            "name": "Focused",
            "score": 41.49207628256782
        },
        {
            "name": "Creative",
            "score": 34.07869997313994
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 26.779478914853613
        },
        {
            "name": "Woody",
            "score": 21.556876175127584
        },
        {
            "name": "Flowery",
            "score": 17.90558689229116
        },
        {
            "name": "Pine",
            "score": 15.23972602739726
        },
        {
            "name": "Earthy",
            "score": 12.729989255976363
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/sEr1lLSsigAbtuUqOjDw7XiLHMg=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fjZ9suBanRKGAwRQasGRx_wayfarers-green.png",
            "id": 1418643,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "I am in my mid 40s and have never used drugs either medicinally or recreationally.  I don't drink.  I have suffered depression along with anxiety for most of my adult life.  A dear friend of mine (who WAS suffering severe depression) told me about greens for treating depression.  I smoked my first pipe (2 hits) at her house of Green Crack and I felt a tiny bit happier.  It did have some relief.  After getting my license (the next day) I did a ton of research. I went to a local shop and the woman helping me told me to try CW with a small bit of Sour Diesel.  I also got a small electronic cig of high CBD.  I tried it today and found myself singing, playing music and doing the dishes.  I also have a terrible compulsive eating disorder and I was not hungry.  I feel  like the sadness has been lifted.  What I smoked was high CBD and little THC.  I do not like the feeling of being high or not in control.  I was crying almost every day and contemplated suicide countless times.  I have been on antidepressants for years but feel they have stopped working.  The CW with a tiny bit of SD (2 puffs only), had completely changed my life.  I am so grateful for this stuff.  I feel like I have a life with living now.. 💕",
            "username": "MichelleStewart"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1642360,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Chronic Lyme disease with daily chronic migraines.  Doctors had no answers for me.  Started using CW and I have not had a headache in over a month.  My quality of life is rising!",
            "username": "Lyme1958"
        }
    ],
    "id": 216,
    "name": "Charlotte's Web",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 18.362207896857374
        },
        {
            "name": "Dizzy",
            "score": 16.17311308084878
        },
        {
            "name": "Dry Eyes",
            "score": 10.675194735428418
        },
        {
            "name": "Paranoid",
            "score": 8.781560569433253
        },
        {
            "name": "Anxious",
            "score": 1.66532366371206
        }
    ],
    "parents": [],
    "permalink": "https://mobileapi.leafly.com/sativa/charlottes-web",
    "photoTotalCount": 12,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/498858/b/charlotte-s-web__primary_2b78.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/charlotte-s-web_100x100_71f8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/418746/b/charlotte-s-web__primary_8e84.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/charlotte-s-web_100x100_89b8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/389468/b/charlotte-s-web__primary_dd72.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/charlotte-s-web_100x100_4c09.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/387502/b/charlotte-s-web__primary_69db.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/charlotte-s-web_100x100_f0f6.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/312094/b/charlotte-s-web__primary_e28c.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/charlotte-s-web_100x100_9e08.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/310927/b/charlotte-s-web__primary_8fc6.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/charlotte-s-web_100x100_5ceb.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Toronto, ON",
        "Vancouver, BC",
        "Calgary, AB",
        "Edmonton, AB",
        "Ottawa, ON",
        "Montréal, QC",
        "Hamilton, ON",
        "Portland, OR",
        "Kelowna, BC",
        "Mississauga, ON"
    ],
    "rating": 4.54,
    "relatedStrains": [],
    "reviewCount": 211,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "charlottes-web",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.53554502369668/240",
    "subtitle": null,
    "symbol": "Cw",
    "symptoms": [
        {
            "name": "Stress",
            "score": 56.06701584743486
        },
        {
            "name": "Depression",
            "score": 51.755976363148
        },
        {
            "name": "Pain",
            "score": 51.07272360999194
        },
        {
            "name": "Inflammation",
            "score": 33.62207896857373
        },
        {
            "name": "Insomnia",
            "score": 27.486234219715286
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
