{
    "aka": "Mothers Finest",
    "articleTotalCount": 3,
    "articles": [
        {
            "author": "Rebecca Kelley",
            "category": null,
            "date": "/Date(1402677600000)/",
            "id": "contentitems-2971",
            "text": "Whether you want to properly celebrate Friday the 13th or are simply in the mood for some elevated frights, here are 13 strains that each have an appropriate scary movie to pair. Enjoy, and remember, that creaking noise you hear coming from the creepy corner of the house is nothing more than a figment of your imagination…\n1. Killer Queen / Carrie\n\nSkip the remake and go with the original 1976 adaptation of the Stephen King novel about an unpopular teenage girl with an overbearing mom. Typical high school angst, right? Not when the teenage girl is telekinetic and a wee bit unstable.\nYou probably don’t want to pull a mean prank on her during the prom—instead, offer her some Killer Queen, a hybrid that yields happy, uplifting effects. Sounds like a match made in sticky, bloody heaven.\n2. Pennywise / It\n\nYou have the option to cue up the original It TV miniseries or check out the 2017 film adaptation of the Stephen King novel. Either way, you’ll be confronted with one of the scariest horror movie villains you’ll peek through your fingers to catch a glimpse of.\nClowns are creepy enough on their own, but a sewer-dwelling razor-teethed clown that eats children will provide enough nightmare fuel that you might need some of the indica Pennywise strain to relax you back down into a state where you aren’t likely to pee yourself at any given moment. Just remember, they all float down here…\n\n3. Jack the Ripper / The Shining\n\nI know that the historic Jack the Ripper went after prostitutes in ye olde timey London, but when I think of a scary Jack, only one man comes to mind: Mr. Torrance from yet another Stephen King novel-turned-movie, The Shining.\nIt may be a little less unnerving to watch the family man become unhinged as a brutal winter keeps his wife and son held captive inside the sinister Overlook Hotel if you pair the experience with the happiness-inducing Jack the Ripper hybrid. Better yet, chase that strain with some appropriately-named Jack Frost once the axe-wielding papa succumbs to that tricky hedge maze.\n4. Alien OG – Alien\n\nFinally, an entry that didn’t come from the warped mind of Stephen King! This Ridley Scott classic boasts impressive special effects and the clever tagline, “In space, no one can hear you scream.”\nSure, Alien practically invented the “What’s that scary rustling in the corner? Oh, it’s just the damn cat OH CRAP A MONSTER’S TRYING TO EAT ME” horror movie trope, but it’s still a top entry in my book mainly because Ellen Ripley is one of the most bad-ass female protagonists in movie history. Celebrate her victory over the drooling, acid-blooded behemoth with a little Alien OG, a hybrid strain with earthy and pine flavors that will make you relieved you’re save and sound back here on Earth.\n\n5. Little Devil / The Exorcist\n\nFrom the iconic creepy-sounding score to the “you’ll never look at pea soup the same again” projectile vomiting, The Exorcist is a horror movie classic. A poor little girl gets possessed by the devil and promptly behaves like the Antichrist (or like those girls on My Super Sweet Sixteen).\nAfter you watch her spider-crawl down the stairs, you might want to chase that scene with some high-THC Little Devil to bring your heart rate back down to a normal range.\n6. Ghost OG / Poltergeist\n\n“You just moved the headstones! You didn’t move the bodies!!” Poltergeist is a cautionary tale as to why you should avoid buying houses built over ancient Indian burial grounds no matter how sweet the deal may seem.\nPair this spooky ghost thriller with the hybrid Ghost OG for a sweet counterbalance to all of the sour supernatural events that plague the Freeling family. Just make sure you peace out if your TV turns on by itself and is all staticky (and whatever you do, don’t go into the light).\n\n7. Zombie OG / Night of the Living Dead\n\nIf you’re going to enjoy some Zombie OG, it’s only fitting to pair the earthy indica with the 1968 classic that kicked off over 45 years of zombie mania, George Romero’s Night of the Living Dead. The black and white film doesn’t bother with happy endings, just wave after wave of undead citizens keen on taking a bite out of anyone within a rotted arm’s reach.\nIf you want to extend your movie marathon, I recommend following up the original with the iconic Dawn of the Dead, a cheeky wink at our society’s zombie-like consumerist ways, and Day of the Dead, which takes the horror underground to a military bunker.\n8. Killing Fields / The Texas Chainsaw Massacre\n\nThe 1974 horror classic The Texas Chainsaw Massacre was so unsettling, some people actually thought it was a real snuff film. What’s remarkable about the movie is that it isn’t gory at all—the creepy family and the film’s realistic, grimy feel mess with your head and make you think it’s more grisly than it actually is.\nWhile watching, partake in the sativa Killing Fields so you’ll have some energy to sprint across a field if Leatherface bursts through your door wielding a gas-powered killing apparatus.\n\n9. Pandora’s Box / Hellraiser\n\nThis ’80’s horror offering is a cautionary tale for anyone who comes across a mysterious puzzle box in a creepy knickknacks shop. Stop, put down the box, and buy a snow globe instead; otherwise, you might accidentally summon some nasty-looking dudes who are all-too keen on dragging you to hell.\nPair Hellraiser with the sweet, grapefruity Pandora’s Box for a little juxtaposition as you watch a dude with pins in his face rip a guy apart with some rusty chains.\n10. Kali Mist / The Mist\n\nHere’s one more Stephen King entry for your horror movie marathon. The Mist is a surprisingly good film from 2007 that follows a man and his son as they struggle to survive against the evils of both otherworldly creatures and mankind after a mysterious mist rolls through a small town. The ending is bleak and if you opt to watch the black and white version, it’ll seem even more eerie.\nHelp clear your mood afterwards with some Kali Mist, which delivers happy, uplifting effects to counterbalance the dread you experience while watching this bummerfest.\n\n11. Mother’s Finest / Psycho\n\nYou think you’ve got mommy issues? This iconic Hitchcock film is the ultimate example of “This dude needs therapy and a hug.” Stay far, far away from the pointless Gus Van Sant remake and opt for the original 1960 classic.\nExperience Psycho with the sweet sativa Mother’s Finest and make sure to lock the bathroom door before you hop into the shower.\n12. OG Shark / Jaws\n\nThe original summer blockbuster that made millions of people afraid to dip a toe into the ocean, Jaws is one of my all-time favorite movies. Given how every other classic horror movie has suffered through an inferior remake, it says a lot about this Steven Spielberg offering that nobody has dared to touch this masterpiece since it first debuted.\nPartake in the hybrid OG Shark and bask in its diesel flavor when Brody shouts “Smile, you son of a bitch!” and blows the massive great white shark to smithereens.\n\n13. Funky Monkey / Dead Alive\n\nOkay, admittedly this warped film from Peter Jackson is more funny-gross than scary, but Dead Alive is still a classic in its own right and a cautionary example of why you shouldn’t mess with rabid Sumatran rat-monkeys.\nEnjoy some of the indica Funky Monkey and giggle it up while you watch a priest kick ass for the Lord and an unlikely protagonist wield a lawnmower against a room full of nasty undeads.\nWhat are some of your favorite movies you can’t wait to watch tonight? Share in the comments and we’ll think of strain pairings to go with them!",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/06/12001235/13-strains-and-their-scary-movie-pairings-to-celebrate-friday-the.jpg",
            "title": "13 Cannabis Strains and Their Scary Movie Pairings",
            "urlslug": "/news/strains-products/13-strains-and-their-scary-movie-pairings-to-celebrate-friday-the"
        },
        {
            "author": "Anna Wilcox",
            "category": null,
            "date": "/Date(1399478400000)/",
            "id": "contentitems-3193",
            "text": "Mother’s Day is just around the corner, and it’s time to find that special gift for a truly one-of-a-kind woman. To help you find the perfect way to say “thank you” to your cannabis-loving mother or the maternal figure in your life, we’re lending a hand with a few suggestions.;\nWithout further ado, here are seven Leafly-approved gifts for Mom:\n \nOdds and Ends\n1. Marijuana Cooking: Good Medicine Made Easy\n\nThis colorful cookbook contains recipes for everything from basic cannabutter to infused honey oatmeal cookies. Not only does this book have incredible photography, it’s also a great resource for those new to cannabis.\n2. RollaBoard\n\nIf you’re looking for a functional yet classy rolling board, RollaBoard is the way to go. So nice that we’ve already featured them once as a gift suggestion, RollaBoard is a truly excellent present for the modern canna-enthusiast. They’re 100% bamboo and beautifully crafted, making them excellent additions to the coffee table or a perfect piece to bring out while entertaining guests.\n3. Peacock Feather Hemp Messenger Bag\n\nA little less hippie-chic and a little more eco-trendy, this hand-made hemp messenger bag is sure to be a crowd-pleaser. Plus, as an Etsy find, most the profits of this purchase have the added benefit of going directly to a small business or an individual.\n \nDo-It-Yourself Gifts\n4. Topicals Spa Package\n\nBest paired with a nice massage, a build-your-own topicals spa package is the perfect gift for all of those hardworking mothers out there. In the cannabis industry, a “topical” is an infused cream or balm that reduces pain caused by inflammation. Topicals are perfect for the mom who walks around all day or may have a little extra tension in her back or shoulders. They tend to run about $20 per one-ounce container, but topicals producers typically create a wide variety of products. For a few ideas, check out this brief guide to picking the right topicals.\n5. DIY Cannabis-Infused Chocolate Dipped Strawberries\nNote: It’s important to wait 30 minutes to one hour after consuming an infused food, as your body must begin to metabolize the product before you can feel the effects. Avoid eating more than the recommended dose of an infused food, as the effects will be quite strong.\n\nThere’s no better way to celebrate both Mother’s Day and the arrival of spring than with some chocolate-covered strawberries. Truly decadent, this simple recipe for cannabis-infused chocolate-covered strawberries will add a little extra pizzazz to an already wonderful day. Eating just one will count as a light dose of medicine, allowing you to enjoy the day without feeling too groggy or setback.\nFor information on creating a truly fantastic canna-friendly Mother’s Day brunch, check out our list of cannabis hosting tips for the perfect cannabis party.\n6. Miniature Clone Garden\n\nFor a slightly new take on the tradition of sending Mom a bouquet of flowers, why not make your mom her very own mini cannabis garden (if your state allows for it, of course)? Pair a plant with a cute colored pot and personalize the gift even further by finding your mother’s favorite strain. Or, if you’d like to help your mom expand her palate, check out a couple of these mom-friendly strains:\n\nCinex: a sociable, well-balanced hybrid that won’t knock you out for the day\nMother’s Finest: a ;new Sensi Seed sativa with a long flowering time\nBlackberry: a flavorful indica that’s great for relaxation and pairing with those brunch desserts.\n\n7. DIY Wine Tasting\n\nWith over 800 cannabis strains floating around in the ether, flavors and effects of the herb are now more distinct than ever. If your mother happens to be a bit of a cannabis connoisseur, why not celebrate her special day with some flavor experiments? Try pairing full-bodied wines with more herbal, pine, woody, or vanilla-based strains and lighter wines with easy floral hybrids. For a full wine paring list, take a peek at this awesome infographic.\n \nSomething Extra Special\n8. Firefly Portable Vaporizer\n\nThe Firefly is a truly unique portable vaporizer. One of the only portable vapes that uses convection to heat and activate cannabinoids, the Firefly may just be one of the healthiest products on the market. Instead of scorching or charring cannabis on a hot plate (conductive heating), the Firefly uses hot air to roast cannabis flower, meaning you aren’t inhaling anything other than pure, activated marijuana vapor. And, come on, you know your mom is worth the splurge.\nIf the Firefly doesn’t suit your fancy, check out some of these high-quality alternatives:\n\nPax by Ploom: a conduction-based portable vape\nVapeXhale Cloud EVO: a tabletop convection vaporizer\n​Puffit Portable Vaporizer: great for medicinal users, this portable vape is one of the most discrete on the market.\n\nIf none of these gift ideas are exactly what you’re looking for, take a look at this list of 5 Cannabis-Chic Products That Women Will Love.\nStrawberries photo credit: greg.turner viaphotopin cc",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2014/05/12001856/mothers-day-gifts-for-the-cannabis-lover.jpg",
            "title": "8 Mother’s Day Gifts for Cannabis-Loving Moms",
            "urlslug": "/news/strains-products/mothers-day-gifts-for-the-cannabis-lover"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [
        {
            "name": "Anxiety",
            "score": 105
        },
        {
            "name": "Spinal Cord Injury",
            "score": 101.25
        },
        {
            "name": "Arthritis",
            "score": 100
        },
        {
            "name": "Asthma",
            "score": 1.25
        },
        {
            "name": "Cancer",
            "score": 1.25
        }
    ],
    "description": "<p>Mother&rsquo;s Finest, brought into existence by Sensi Seeds, is a 70% <a href=\"http://leafly.com/sativa\">sativa</a>-dominant strain with heavy <a href=\"http://leafly.com/sativa/haze\">Haze</a> genetics. Named after Frank Zappa&rsquo;s band Mothers of Invention, Mother&rsquo;s Finest is a masterfully crafted <a href=\"http://leafly.com/hybrid\">hybrid</a> that captures both the desirable sativa buzz and the resin-heavy traits from a <a href=\"http://www.leafly.com/indica/northern-lights\">Northern Lights</a> ancestor. This <a href=\"http://www.leafly.com/sativa/jack-herer\">Jack Herer</a> cousin typically forms spear-shaped buds that carry more weight and density than your archetypal sativa. Its aroma is <a href=\"http://www.leafly.com/explore#!/explore/flavors-sweet\">sweet</a> and tangy with <a href=\"http://www.leafly.com/explore#!/explore/flavors-earthy\">earthy</a> undertones that provide a smooth, complex flavor profile. Mother&rsquo;s Finest typically undergoes a long flowering period of 8 to 10 weeks, but plants expressing an indica-like <a href=\"http://www.leafly.com/knowledge-center/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\">phenotype</a> will finish flowering earlier. This sativa is also suitable for outdoor gardens in warm, sunny climates where flowering completes around the end of October.</p>\n",
    "descriptionPlain": "Mother&rsquo;s Finest, brought into existence by Sensi Seeds, is a 70% sativa-dominant strain with heavy Haze genetics. Named after Frank Zappa&rsquo;s band Mothers of Invention, Mother&rsquo;s Finest is a masterfully crafted hybrid that captures both the desirable sativa buzz and the resin-heavy traits from a Northern Lights ancestor. This Jack Herer cousin typically forms spear-shaped buds that carry more weight and density than your archetypal sativa. Its aroma is sweet and tangy with earthy undertones that provide a smooth, complex flavor profile. Mother&rsquo;s Finest typically undergoes a long flowering period of 8 to 10 weeks, but plants expressing an indica-like phenotype will finish flowering earlier. This sativa is also suitable for outdoor gardens in warm, sunny climates where flowering completes around the end of October.\n",
    "effects": [
        {
            "name": "Happy",
            "score": 112.5
        },
        {
            "name": "Relaxed",
            "score": 107.5
        },
        {
            "name": "Sleepy",
            "score": 105
        },
        {
            "name": "Hungry",
            "score": 105
        },
        {
            "name": "Uplifted",
            "score": 11.25
        }
    ],
    "flavors": [
        {
            "name": "Earthy",
            "score": 101.25
        },
        {
            "name": "Lemon",
            "score": 5
        },
        {
            "name": "Sweet",
            "score": 3.75
        },
        {
            "name": "Pine",
            "score": 3.75
        },
        {
            "name": "Pepper",
            "score": 1.25
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/5DsWrIpoq-56NpD59UXAqpoVN88=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fqSLuo6zNRCeIia1paBYS_wayfarers-purple.png",
            "id": 1219754,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/2/240",
            "text": "Just tried this for the first time and it's \"ok\". Nice fruity aroma. Very light head buzz and gives you a clear mind (more or less...I mean, you're still stoned after all ;) So if that's what you're after then go for it. I prefer more of a body buzz, and while I know that is indica territory, I was told this might have a good head/body mix. It's 100% head, at least it was for me.",
            "username": "coolandfun"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1543978,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4/240",
            "text": "From the first hit I received full body relaxation.  Strong chronic pain relief which is nice and my mood was happier and uplifted.  Gave me the sweet tooth and made me pretty sleepy.",
            "username": "bc7110"
        }
    ],
    "id": 76113,
    "name": "Mother’s Finest",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 6.25
        },
        {
            "name": "Dizzy",
            "score": 5
        },
        {
            "name": "Anxious",
            "score": 2.5
        },
        {
            "name": "Headache",
            "score": 1.25
        },
        {
            "name": "Paranoid",
            "score": 1.25
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/jack-herer",
            "category": "Sativa",
            "name": "Jack Herer",
            "permalink": "https://mobileapi.leafly.com/sativa/jack-herer",
            "slug": "jack-herer",
            "subtitle": null,
            "symbol": "Jh"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/mothers-finest",
    "photoTotalCount": 9,
    "photos": [
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506513/b/mother-s-finest__primary_50ca.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/mother-s-finest_100x100_d771.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/505167/b/mother-s-finest__primary_6157.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/mother-s-finest_100x100_2970.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/414730/b/mother-s-finest__primary_3fc7.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/mother-s-finest_100x100_7a76.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/403579/b/mother-s-finest__primary_d48b.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/mother-s-finest_100x100_f670.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/394783/b/mother-s-finest__primary_2a73.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/mother-s-finest_100x100_f302.jpg",
            "uploaded": "/Date(-62135596800000)/"
        },
        {
            "fullsize": "https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/394116/b/mother-s-finest__primary_bef5.jpg",
            "thumb": "https://leafly-s3.s3.amazonaws.com/leafly/reviews/mother-s-finest_100x100_90b8.jpg",
            "uploaded": "/Date(-62135596800000)/"
        }
    ],
    "popularCities": [
        "Denver, CO"
    ],
    "rating": 4.33,
    "relatedStrains": [],
    "reviewCount": 18,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "mothers-finest",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.33333333333333/240",
    "subtitle": null,
    "symbol": "Mf",
    "symptoms": [
        {
            "name": "Pain",
            "score": 105
        },
        {
            "name": "Depression",
            "score": 103.75
        },
        {
            "name": "Inflammation",
            "score": 102.5
        },
        {
            "name": "Lack of Appetite",
            "score": 101.25
        },
        {
            "name": "Insomnia",
            "score": 100
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
