{"sl_translate":"description,descriptionPlain,category","id":189167,"slug":"kali-47","name":"Kali 47","subtitle":null,"symbol":"K47","category":"Sativa","description":"\u003cp\u003eKali 47 is a mostly sativa strain that is characterized by sweet fruity flavors with hints of caramel. For many patients, Kali 47 may relieve an array of symptoms including depression, pain, and stress. A cross between \u003ca href=\"https://www.leafly.com/sativa/kali-mist\"\u003eKali Mist\u003c/a\u003e and \u003ca href=\"https://www.leafly.com/hybrid/ak-47\"\u003eAK-47\u003c/a\u003e, Kali 47 delivers happy euphoric effects that allow the mind to stay agile while relaxing the body. This sativa is easy to grow, making it an ideal choice for novice cultivators.\u0026nbsp;\u003c/p\u003e\n","descriptionPlain":"Kali 47 is a mostly sativa strain that is characterized by sweet fruity flavors with hints of caramel. For many patients, Kali 47 may relieve an array of symptoms including depression, pain, and stress. A cross between Kali Mist and AK-47, Kali 47 delivers happy euphoric effects that allow the mind to stay agile while relaxing the body. This sativa is easy to grow, making it an ideal choice for novice cultivators.\u0026nbsp;\n","aka":"Kali47, Cali 47, Cali47","rating":5,"highlightedReviews":[{"id":1375051,"username":"safyreshel","text":"Amazing for mood, the best! And, this doesn\u0027t just relieve stress it actually lifts you up! A cure for the moodiness that comes with PMS! I got this strain vape oil \u0026 capsules, both lifted my mood \u0026 helped with all over pain, but the edible version really helped my inflammation, as well. ","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/EsB9lXCri57tN17h49dVOnCDkFI=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fTBeeQQk0TGeLYj4SjC6Z_old-school-red.png"},{"id":1590350,"username":"knbanksy","text":"I picked up this strain based on lineage. I’ve had both strains respectively(Kali Mist, AK-47) and enjoyed both. Together they form kali-47. K47 has a lovely balance between the energetic sativa affects, and pain relieving indica affects, which is testament to its great lineage. It has tight dense buds that both smell and smoke sweet. For the experienced smoker take off the reins and get after it. A great strain for physical activity or any activities that still require focus, or equally as good for any around the house activities. Novice smokers let moderation be your guide until you learn how to properly dose. With al that said if you have the opportunity to get some it may just find a place amongst your mainstays!","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/YEN1LqXiYCOvWiFhmP-4p67iqDM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fY9fB9qHySLml8016ysgJ_goggles-green.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-3375","title":"New Strains Alert: Purple Dog Shit, Critical Kali Mist, Pink Bubba, Afghan Cow, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1448643600000)\/","text":"Still digesting all that food from yesterday? We just added some strains to the Leafly Explorer to help you veg out. Others will motivate you to finally get up and out. Read up about each and find out if any of these are offered near you by checking the links below.\n \n   1. Critical Kali Mist\n\nCritical Kali Mist from Delicious Seeds was bred to be brilliant. Its genetics are a pairing of Critical Mass, an indica known for its growth of large sticky buds, and Kali Mist, a multi-award-winning sativa. The result is a powerful and resinous sativa that produces large, dense flowers after about 70 days. With earthy and pine flavors, this bud provides uplifting effects and endless fits of laughter.\n\nClick here for a full list of locations currently carrying Critical Kali Mist\n \n   2. Pink Bubba\n\nPink Bubba is a mostly indica strain that is said to combine genetics from Bubba Kush and Pink Kush. Earthy pine flavors lead the way with slight floral highlights that bring out this strain’s sweet notes. Perhaps best saved for evening use, Pink Bubba delivers a body-melting blast of physical relaxation alongside dreamy euphoria.\n\nClick here for a full list of locations currently carrying Pink Bubba\n \n   3. Purple Dog Shit\n\nWith a name like Purple Dog Shit, this hybrid strain sure knows how to garner attention. Its parent strain Dog Shit was named for its funky smell that some compare to dog turds, but this stain is more often described as earthy with a sweet touch of grape. Though its genetics aren’t certain, popular conjecture names Purple Urkle or another similar Purple strain as the second parent. Some Purple Dog Shit phenotypes exhibit a high level of CBD, a non-psychoactive cannabinoid known for its ability to treat pain, inflammation, and anxiety. Tranquilizing body effects ease you into deep relaxation and a good night\u0027s sleep.\n\nClick here for a full list of locations currently carrying Purple Dog Shit\n \n   4. Kali 47\n\nKali 47 is a mostly sativa strain that is characterized by sweet fruity flavors with hints of caramel. For many patients, Kali 47 may relieve an array of symptoms including depression, pain, and stress. A cross between Kali Mist and AK-47, Kali 47 delivers happy euphoric effects that allow the mind to stay agile while relaxing the body. This sativa is easy to grow, making it an ideal choice for novice cultivators.\n\n \n   5. Durga Mata\n\nDurga Mata, bred by Paradise Seeds, is an indica-driven strain. Despite being 90% indica, it acts unlike other predominately indica strains. With flavors best described as reminiscent of Turkish Delight, it offers a long-lasting relaxing body buzz without the couch potato effect. This strain has a natural resistance to pests and survives through rough treatment, which makes it a recommended choice for beginners and outdoor growers.\n\nClick here for a full list of locations currently carrying Durga Mata\n \n   6. Early Miss\n\nAn auto-flowering indica-dominant hybrid, Early Miss is a great strain for those looking for pain relief or an appetite boost. Crop King Seeds took the heavy producer Big Bud and paired it with the hard-hitting White Widow to make a moderate yielding plant with high levels of THC, and then crossed it with an auto-flowering ruderalis variety. Flowering in 50 days, this hybrid is a quick and easy grow that will not leave you disappointed.\n\nClick here for a full list of locations currently carrying Early Miss\n \n   7. Afghan Cow\n\nThis sweet-smelling and resinous sativa breed from Dr. Krippling Seeds is sure to keep you off the couch. Afghan Cow is bred from Ash, Kaya 47 (an AK-47 phenotype), and the beloved Kali Mist. The cerebral effects of this sativa are great for clear-headed daytime use. Having a high yield both indoors and out, this is an impressive plant with even more impressive effects.\n\n \nBrowse through our other new strains that were recently added to the Leafly Explorer, or check out last week\u0027s newest additions!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/11/12002324/new-strains-alert-purple-dog-shit-critical-kali-mist-pink-bubba-a.png","urlslug":"/news/strains-products/new-strains-alert-purple-dog-shit-critical-kali-mist-pink-bubba-a"}],"reviewCount":4,"flavors":[{"name":"Sweet","score":105},{"name":"Vanilla","score":5}],"effects":[{"name":"Uplifted","score":110},{"name":"Creative","score":110},{"name":"Energetic","score":110},{"name":"Euphoric","score":110},{"name":"Happy","score":110}],"symptoms":[{"name":"Depression","score":105},{"name":"Fatigue","score":105},{"name":"Inflammation","score":105},{"name":"Pain","score":105},{"name":"Stress","score":105}],"conditions":[{"name":"Anxiety","score":5},{"name":"Migraines","score":5},{"name":"Multiple Sclerosis","score":5},{"name":"PMS","score":5},{"name":"PTSD","score":5}],"negatives":[],"articlesAvailable":true,"articleTotalCount":1,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kali-47_100x100_a4ea.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/653836/b/kali-47__primary_6cac.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/kali-47_100x100_4c8e.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/637039/b/kali-47__primary_2f18.jpg"}],"photoTotalCount":2,"popularCities":[],"permalink":"https://mobileapi.leafly.com/sativa/kali-47","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Kali Mist","subtitle":null,"slug":"kali-mist","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/kali-mist","symbol":"Km","applink":"leafly://strain/kali-mist"},{"name":"AK-47","subtitle":null,"slug":"ak-47","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/ak-47","symbol":"Ak","applink":"leafly://strain/ak-47"}],"growInfo":{"difficulty":"Easy","preferredMedium":null,"floweringDays":58,"outdoorFinish":"Mid-October","height":null,"averageYield":"Medium","environment":null,"growNotes":""}}
