{
    "aka": null,
    "articleTotalCount": 1,
    "articles": [
        {
            "author": "Rae Lland",
            "category": null,
            "date": "/Date(1514937575000)/",
            "id": "contentitems-53442",
            "text": "EDM (short for electronic dance music) is often described as futuristic, grimy, technical, filthy, or heavy. Born in Europe in the 1990s, contemporary EDM encompasses a huge collection of sub-genres such as dubstep, riddim, techno, and trance—just to name a few. Its primal emphasis on drums and heavy use of bass make it a physical experience as much as an auditory one. For this reason, some sub-genres have been described as “future metal,” due to a technical styling and heavy sound that inspire high-energy dance and emotional release.\n\nBelow, enjoy five excellent EDM albums with our recommended strains for a stimulating, cerebral, and emotional experience that will move with you from the inside out.\nMass Manipulation by Rezz\n(mau5trap Recordings)\nStrain Pairing Recommendation: Raspberry Kush\nMass Manipulation begins with a soothing, masculine voice urging you to focus on your breathing and allow hypnosis to loosen your entire body. “Relax,” the voice whispers before the music breaks and dives into dirty, technical dance beats. The result is an album that urges the listener to turn off their mind and feel their body with the upbeat, gritty music that tends to move it. The rest of Mass Manipulation follows a similar trajectory, expertly walking the line between meditative music and EDM. Rezz’s thick, hypnotic, futuristic sound pulls you in like quicksand, gently tugging you along and reminding you not to struggle—just relax.\nReflective Part 1 and Part 2 by Bassnectar\n(Amorphous Music)\nStrain Pairing Recommendation: Love Potion #1\nBassnectar has been releasing music for fourteen years and has steadily risen to the height of success in the EDM scene. Reflective is his latest, released in 2017. It reflects Bassnectar’s penchant for effortless yet complex and structured music that keeps the listener engaged while immersing her in a futuristic musical journey. The bass-heavy album balances spacey, techy sounds with hard, grimy, bold breaks for a guttural feeling that demands movement (whether it be dance or head thrashing). Reflective won’t disappoint as it builds a world around you and invites you deep, deep inside.\n\nDie Young EP by Kai Wachi\n(Kannibalen Records)\nStrain Pairing Recommendation: Supernatural\nThe Die Young EP may only have five songs total, but Kai Wachi’s unique, distinctive sound and playful vibe makes it 20 minutes of solid, engaging EDM that will have you scouring his discography for more. Die Young isn’t afraid to explore feelings and sounds spanning whimsical melodies to gritty drops that can be felt deep in your bones. The album makes use of a variety of instruments in addition to its eclectic electronic beats, creating a complexity that will keep listeners guessing in the best way possible.\nOpen the Vault by Ill-Esha\n(666590 Records DK)\nStrain Pairing Recommendation: Morning Glory\nOpen the Vault stands out with its lighthearted and spirited vibe. Ill-Esha’s distinct style of musical fusion is in full force as she creates a soundscape that delves into floaty, fanciful melodies and metallic, technical beats. The cherry on top is Ill-Esha’s own harmonic voice, as she sings atop certain tracks and reminds listeners of all the ways in which she stands out. Open the Vault’s eclectic rhythms, deep bass, and captivating melodies are like a cool drink of water mixed with mind-altering punch.\n\nThere The Vultures Will Gather by Helicopter Showdown\n(Anemnesis)\nStrain Pairing Recommendation: Dutch Haze\nThere The Vultures Will Gather begins with a spacey, transcendental medley of music and distant voices before plunging suddenly and mercilessly into heavy, gritty beats. “Helicopter Showdown” manages to blend these two elements simultaneously, casting airy, tinkling melodies on top of filthy, bass-heavy breaks. The result makes There The Vultures Will Gather wild, bold music capable of whisking anyone into an intergalactic dance frenzy.",
            "thumbnail": "https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2018/01/02113546/edm-albums-while-high.jpg",
            "title": "5 Incredible EDM Albums to Listen to While High",
            "urlslug": "/news/lifestyle/best-electronic-dance-music-to-listen-to-while-high"
        }
    ],
    "articlesAvailable": true,
    "category": "Sativa",
    "conditions": [],
    "description": "<p>Dutch Haze by Dutch Passion is a 90% sativa-dominant strain crafted for Haze lovers everywhere. &ldquo;Born&rdquo; in 2009, Dutch Haze is the product of hundreds of <a href=\"https://www.leafly.com/sativa/haze\">Haze</a> plants and several years of breeding both American Haze and Dutch Haze genetics in search of the perfect <a href=\"https://www.leafly.com/news/cannabis-101/cannabis-genotypes-and-phenotypes-what-makes-a-strain-unique\">phenotype</a>. This strain has a spicy aroma with notes of citrus, earth, and tropical fruit. The stalks grow tall and abundant with an average flowering time of approximately 10 weeks. Dutch Haze offers consumers a strong cerebral energy with uplifting and creative qualities to help take the edge off of mundane tasks while improving your mood.</p>\n",
    "descriptionPlain": "Dutch Haze by Dutch Passion is a 90% sativa-dominant strain crafted for Haze lovers everywhere. &ldquo;Born&rdquo; in 2009, Dutch Haze is the product of hundreds of Haze plants and several years of breeding both American Haze and Dutch Haze genetics in search of the perfect phenotype. This strain has a spicy aroma with notes of citrus, earth, and tropical fruit. The stalks grow tall and abundant with an average flowering time of approximately 10 weeks. Dutch Haze offers consumers a strong cerebral energy with uplifting and creative qualities to help take the edge off of mundane tasks while improving your mood.\n",
    "effects": [
        {
            "name": "Energetic",
            "score": 22.619047619047617
        },
        {
            "name": "Happy",
            "score": 15.476190476190474
        },
        {
            "name": "Relaxed",
            "score": 15.476190476190474
        },
        {
            "name": "Creative",
            "score": 14.285714285714285
        },
        {
            "name": "Aroused",
            "score": 7.142857142857142
        }
    ],
    "flavors": [
        {
            "name": "Citrus",
            "score": 15.476190476190474
        },
        {
            "name": "Earthy",
            "score": 8.333333333333332
        }
    ],
    "growInfo": {
        "averageYield": null,
        "difficulty": null,
        "environment": null,
        "floweringDays": 0,
        "growNotes": "",
        "height": null,
        "outdoorFinish": null,
        "preferredMedium": null
    },
    "highlightedReviews": [
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/tAHHcVjF5EvieYWgrsxPA0WBCr8=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fRAbBXkNBSHOIMMxhio7k_wide-brim-red.png",
            "id": 1379165,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "Loved it. Got me into my happy house-projects mood. Fantastic taste as well. Loved the citrus. ",
            "username": "Foghor"
        },
        {
            "avatar": "https://ddd33q3967xhi.cloudfront.net/LN9qqi4LLaHMKnh02esy-mIM7HY=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2f81c50UjRtmwRXtUVVQKw_aviator-purple.png",
            "id": 1577972,
            "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/5/240",
            "text": "One of my favorites. I don’t usually taste the difference in weed strains, but this ones taste was so prominent all I tasted was citrus. So delicious. It’s a happy hazy relaxed high. 10/10 recommend ",
            "username": "hermyb"
        }
    ],
    "id": 268816,
    "name": "Dutch Haze",
    "negatives": [
        {
            "name": "Dry Mouth",
            "score": 15.476190476190474
        }
    ],
    "parents": [
        {
            "applink": "leafly://strain/haze",
            "category": "Sativa",
            "name": "Haze",
            "permalink": "https://mobileapi.leafly.com/sativa/haze",
            "slug": "haze",
            "subtitle": null,
            "symbol": "H"
        }
    ],
    "permalink": "https://mobileapi.leafly.com/sativa/dutch-haze",
    "photoTotalCount": 0,
    "photos": [],
    "popularCities": [
        "Seattle, WA",
        "Bremerton, WA",
        "Lynnwood, WA",
        "Redmond, WA",
        "Chimacum, WA",
        "Ephrata, WA",
        "Gig Harbor, WA",
        "Los Angeles, CA",
        "Mukilteo, WA",
        "Olympia, WA"
    ],
    "rating": 4.14,
    "relatedStrains": [],
    "reviewCount": 7,
    "sl_translate": "description,descriptionPlain,category",
    "slug": "dutch-haze",
    "starImage": "https://d3ix816x6wuc0d.cloudfront.net/stars/4.14285714285714/240",
    "subtitle": null,
    "symbol": "Dhz",
    "symptoms": [
        {
            "name": "Depression",
            "score": 7.142857142857142
        },
        {
            "name": "Stress",
            "score": 7.142857142857142
        }
    ],
    "testGraph": null,
    "videoUrl": null,
    "weakDescription": false
}
