{"sl_translate":"description,descriptionPlain,category","id":65457,"slug":"red-congolese","name":"Red Congolese","subtitle":null,"symbol":"Rc","category":"Sativa","description":"\u003cp class=\"p1\"\u003eWhile some argue that Red Congolese is an \u003ca href=\"https://www.leafly.com/sativa/african\"\u003eAfrican\u003c/a\u003e sativa \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\"\u003e\u003cspan class=\"s1\"\u003elandrace\u003c/span\u003e\u003c/a\u003e, the variety popularized in California weaves in \u003ca href=\"https://www.leafly.com/sativa/mexican\"\u003eMexican\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/indica/afghani\"\u003e\u003cspan class=\"s1\"\u003eAfghani\u003c/span\u003e\u003c/a\u003e roots, giving it a more indica-like appearance. This colorful palette of landrace strains, which had adapted to their environment over many years, creates a complex profile of effects and flavors. The sativa genetics dominate the physical effects of Red Congolese, resulting in a weightless euphoria that promotes focus and mental clarity. Its energizing properties make Red Congolese perfect for morning treatment of nausea, cachexia, tension, or Alzheimer\u0026rsquo;s.\u003c/p\u003e\n","descriptionPlain":"While some argue that Red Congolese is an African sativa landrace, the variety popularized in California weaves in Mexican and Afghani roots, giving it a more indica-like appearance. This colorful palette of landrace strains, which had adapted to their environment over many years, creates a complex profile of effects and flavors. The sativa genetics dominate the physical effects of Red Congolese, resulting in a weightless euphoria that promotes focus and mental clarity. Its energizing properties make Red Congolese perfect for morning treatment of nausea, cachexia, tension, or Alzheimer\u0026rsquo;s.\n","aka":null,"rating":4.59,"highlightedReviews":[{"id":1413944,"username":"iwcwoodson","text":" I smoked less than half gram to myself and I\u0027m spending the next 4 hours cleaning my house, car, all my bongs and pipes and walked my dog 4 miles. I\u0027m usually a lazy stoner, this is the cocaine of marijuanas. 10/10 Walden Cannabis.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1642769,"username":"LadyEll","text":"I loved this strain.  No pain, lower stress, but a bit of an energy lift, while not increasing my anxiety or clouding my thinking. \nI am a medicinal user with high tolerances, but friends who use recreationally and have  much lower tolerances also enjoyed this strain.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2955","title":"10 Cannabis Strains That Won’t Make You (As) Hungry","author":"Bailey Rahn","category":null,"date":"\/Date(1455998400000)\/","text":"“There’s weed that don’t make you hungry? For real? Honey, this changes everything.”\nThat was my Lyft driver’s response when I told her not all cannabis makes your gullet an insatiable black hole. Most cannabis consumers – especially first-time experimenters – have only tried high-THC strains, so it’s no wonder that the dispelling of this common misconception comes to the surprise of many who have long associated cannabis with the inevitable “munchies” syndrome.\nThe munchies can be a beautiful thing, and I’m not just talking about the pure ecstasy that comes with dual-wielding a fried chicken leg and an ice cream sandwich once in a while. That appetite stimulation is life-changing for patients dealing with cancer, depression, and other gastrointestinal/appetite disorders. But not everyone wants uncontrollable food lust, and some will actively avoid cannabis because of this one side effect – particularly those struggling with pre-existing eating and weight issues.\nFor those of you interested in reaping the myriad of benefits cannabis has to offer without the unbridled gluttony, we hope you find this list helpful. Remember, you can click the strain to see if it’s available at a store or dispensary near you!\n\n \nHigh-CBD Strains\nIf you’ve ever tried a high-CBD strain before, you’ve probably noticed that they don’t summon the munchies monster like THC-rich varieties. A Yale study published last year found that THC – the same chemical responsible for cannabis’ euphoric high – stimulated a group of nerve cells in the hypothalamus, the area of the brain that governs instincts like hunger and arousal.\n\nWhile less is known about CBD’s influence on appetite, we do know that this non-psychoactive constituent counteracts many effects of THC and researchers have even eyed CBD as an anti-obesity treatment based on its activity in the brain. Our own anecdotal evidence leads us to recommend high-CBD, low-THC strains for the best “munchie-less” experience, but a strain with equal parts CBD and THC can also induce less hunger with the added benefit of mild euphoria.\n\n \n\nA popular strain found in many Oregon shops, Harle-Tsu is hybrid cross between two high-CBD parents, Harlequin and Sour Tsunami (which are also worth looking into for minimal munchies strains). Harle-Tsu typically expresses a high-CBD profile with very little THC, making it a perfect choice for anyone who wants the relaxing and therapeutic effects of cannabis minus the euphoria or paranoia.\n \n\nThe “Remedy” for your over-excited appetite is this indica cross between Cannatonic and Afghan Skunk. With a THC content that rarely squeaks past 1%, Remedy delivers mental tranquility and physical relief without the psychoactive burden. This Pacific Northwest strain is perfect for the patient needing to curb pain, anxiety, tension, headaches, or insomnia, but doesn’t want to interrupt their day with hourly snack breaks.\n \n\nCanna-Tsu is taking off across the U.S., discoverable in Oregon, California, Illinois, Washington, Colorado, and many other medical marijuana states. Sweet and earthy in flavor, Canna-Tsu provides a boost to both mood and focus. Though this strain may calm upset tummies, you shouldn’t feel any extra rumblings of hunger.\n \n\nFor uncompromised energy and clarity, we recommend the low-munchies sativa MediHaze. This one can sometimes exhibit equal levels of THC and CBD, but compared to high-THC, low-CBD strains, MediHaze is much better for keeping the appetite at bay.\n \n\nSimilar to the widely coveted ACDC hybrid, Cannatonic is a high-CBD strain that relaxes the body while leaving the mind free to focus. On average, Cannatonic has a 2:1 ratio of CBD:THC, meaning you probably won’t feel much in the way of a high or hunger.\n \nHigh THCV Sativa Strains\nBy now you know what THC and CBD is, but you may not be familiar with the less ubiquitous THCV, a related chemical that suppresses appetite. While most strains on the market today tend to test anywhere between 10-20% THC, what’s considered a high THCV content might only hit a high-water mark of 5%. THCV tends to be more abundant in sativa strains, and it’s possible you’ve noticed that sativas tend to provoke hunger less than indica strains. The unique metabolic effects of THCV even have researchers considering its utility in treating obesity and diabetes.\n\nWhile high-CBD strains tend to induce little to no high, these THCV-rich sativas produce high-energy, psychoactive effects. That’s good news if you like the euphoria associated with cannabis, but don’t want the raging appetite.\n \n\nWith an average THCV content that ranges between 0.2 to 1.8%, Durban Poison is the perfect weapon against overactive appetites and can be found in most major markets. Cherished for its active, upbeat high that can fuel productivity, this pure African sativa keeps you focused on what matters more than snacks.\n \n\nResist the call of the pizza with Power Plant, an electrifying sativa that descends from African landrace strains. Its spicy, peppery aroma perks up the senses, leaving you with inspiration and positivity instead of a demanding stomach. You can find Power Plant in many different markets across the U.S. and beyond, so check to see if a shop near you is carrying it.\n \n\nKill the temptation to order half Taco Bell’s menu with Jack the Ripper, a sativa strain that carries a tantalizing lemon scent. A favorite in the Pacific Northwest, this invigorating sativa is sure to summon a talkative mood long before a talkative tum.\n \n\nAnother African sativa, Red Congolese focuses all of its psychoactive energy in the head, helping creativity and focus to thrive. Among the list of activities this sativa motivates, you’ll sooner find hiking, painting, and reading more appealing than eating the entire contents of your fridge. Though most frequently found in Vancouver, BC and Ontario, you might be delightfully surprised by its occasional appearance on the West Coast and in other areas of the U.S..\n \n\nAs sweet and citrusy as this sativa might taste, Moby Dick doesn’t coerce the appetite as much as other strains. Expect instead to feel your mood and energy elevate to a place in which it’s easy to feel satisfied whether or not you treated yourself to an entire cheesecake. This sativa is lovingly embraced in Canada and Spain, although Americans have also reported sightings of the legendary Moby Dick in many markets.\nInterested in strains that do make you hungry? Try these 10!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/10173255/iStock-526148526.jpg","urlslug":"/news/strains-products/10-cannabis-strains-that-wont-make-you-as-hungry"},{"id":"contentitems-5905","title":"What Is THCV and What Are the Benefits of This Cannabinoid?","author":"Bailey Rahn","category":null,"date":"\/Date(1422986400000)\/","text":"THCV, or tetrahydrocannabivarin, is a compound in cannabis that offers a unique array of effects and medical benefits that sets it apart from other cannabinoids like THC and CBD. Whether you’re a medical marijuana patient looking for a particular type of relief or a casual consumer chasing a specific effect, we’d like to introduce you to this fascinating compound that’s sure to make major waves in the cannabis world as we discover and utilize its full potential.\nWhat are THCV’s Effects and Benefits?\nAs its name suggests, THCV is similar to THC in molecular structure and psychoactive properties, but it provides a variety of pronounced and altogether different effects. A note for vaporizer enthusiasts: THCV has a boiling point of 428 °F (220 °C), so you’ll need to turn it up higher than you would THC.\n\n\nTHCV is an appetite suppressant. In contrast to THC, THCV may dull the appetite. This may be good for consumers focused on weight loss, but THCV should be avoided by patients treating appetite loss or anorexia.\nTHCV may help with diabetes. Research shows promise in THCV’s ability to regulate blood sugar levels and reduce insulin resistance.\nTHCV may reduce panic attacks. It appears to curb anxiety attacks in PTSD patients without suppressing emotion.\nTHCV may help with Alzheimer’s. Tremors, motor control, and brain lesions associated with Alzheimer’s disease appear to be improved by THCV, but research is in progress.\nTHCV stimulates bone growth. Because it promotes the growth of new bone cells, THCV is being looked at for osteoporosis and other bone-related conditions.\n\n\nWhere Can I Find THCV?\nSo you’re looking for the effects mentioned above, but you aren’t sure where to start your search for high-THCV strains and products. Most strains only contain trace, undetectable amounts of THCV, making it difficult to achieve the desired therapeutic effect. We can assume that more THCV-rich products will be introduced alongside its growing popularity, but in the meantime, here are some useful hints for locating this rare therapeutic gem.\n\nLook for African sativas. Lab results show that THCV is most abundant in sativas, particularly landrace strains from Africa. Durban Poison is one of the more common high-THCV strains, but other options can be found in the strain list below.\nAsk about parent genetics. Having trouble finding an African sativa? Plenty of strains have hybridized African genetics that predispose it to a higher THCV potential. Cherry Pie, for example, may express a high THCV content by way of its Durban Poison parent. Look for lineage information in Leafly’s strain pages or ask your budtenders to point out their African hybrids.\nRequest test results. Genetics alone can’t promise a high-THCV content, and cannabinoid contents can vary from harvest to harvest. If possible, ask your budtender for lab-tested strains to ensure that you’re indeed getting a THCV-rich product.\n\n\nHigh THCV Cannabis Strains\nThis list is by no means comprehensive, but it includes strains best known for their tendency toward higher-than-average THCV contents. These strains can be consumed in flower form or they can be processed into extracts, oils, and edibles for a higher concentration of cannabinoids. A few of the strains below, like Doug’s Varin and Pineapple Purps, were specially bred to contain higher levels of THCV. Again, be sure to steer your choices toward African sativas as they tend to contain the most THCV.\n\n\n\n\nDoug’s Varin\n\nPineapple Purps\n\nDurban Poison\n\n\n\nPower Plant\n\nWillie Nelson\n\nRed Congolese\n\n\n\nJack the Ripper\n\nDurban Cheese\n\nSkunk #1","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/02/29195248/what-is-thcv-and-what-are-the-benefits-of-this-cannabinoid.jpg","urlslug":"/news/cannabis-101/what-is-thcv-and-what-are-the-benefits-of-this-cannabinoid"}],"reviewCount":182,"flavors":[{"name":"Earthy","score":39.166467479350914},{"name":"Spicy/Herbal","score":26.137359572942398},{"name":"Pungent","score":22.399543197089208},{"name":"Sweet","score":19.546118503173716},{"name":"Citrus","score":18.097761134570948}],"effects":[{"name":"Energetic","score":98.158579661647138},{"name":"Happy","score":88.368788675537132},{"name":"Uplifted","score":82.503651767455452},{"name":"Focused","score":81.298966881788971},{"name":"Creative","score":72.287201551005225}],"symptoms":[{"name":"Stress","score":67.913579263272524},{"name":"Depression","score":66.032321461769314},{"name":"Fatigue","score":43.939526730937772},{"name":"Pain","score":24.319177754760577},{"name":"Headaches","score":18.239980878017686}],"conditions":[{"name":"Anxiety","score":33.251799325418951},{"name":"PTSD","score":18.393355111146519},{"name":"Hypertension","score":15.961676360449365},{"name":"ADD/ADHD","score":14.398321514885932},{"name":"PMS","score":9.6771837569383585}],"negatives":[{"name":"Dry Mouth","score":23.092183889729903},{"name":"Dry Eyes","score":19.085995803787213},{"name":"Anxious","score":8.7161713542081642},{"name":"Paranoid","score":2.8918014500836584},{"name":"Dizzy","score":2.4316787506971558}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_7d24.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/576460/b/red-congolese__primary_83b9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_d603.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/556249/b/red-congolese__primary_4c6a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_122f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/538698/b/red-congolese__primary_d338.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_414d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/538666/b/red-congolese__primary_a05c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_6c6c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/521883/b/red-congolese__primary_9c47.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_0001.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506433/b/red-congolese__primary_87fb.jpg"}],"photoTotalCount":26,"popularCities":["Toronto, ON","Vancouver, BC","Calgary, AB","Ottawa, ON","Montréal, QC","Edmonton, AB","Hamilton, ON","Saskatoon, SK","Winnipeg, MB","Halifax, NS"],"permalink":"https://mobileapi.leafly.com/sativa/red-congolese","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.58791208791209/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"African","subtitle":null,"slug":"african","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/african","symbol":"Afr","applink":"leafly://strain/african"},{"name":"Mexican","subtitle":null,"slug":"mexican","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/mexican","symbol":"Mex","applink":"leafly://strain/mexican"},{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":65457,"slug":"red-congolese","name":"Red Congolese","subtitle":null,"symbol":"Rc","category":"Sativa","description":"\u003cp class=\"p1\"\u003eWhile some argue that Red Congolese is an \u003ca href=\"https://www.leafly.com/sativa/african\"\u003eAfrican\u003c/a\u003e sativa \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\"\u003e\u003cspan class=\"s1\"\u003elandrace\u003c/span\u003e\u003c/a\u003e, the variety popularized in California weaves in \u003ca href=\"https://www.leafly.com/sativa/mexican\"\u003eMexican\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/indica/afghani\"\u003e\u003cspan class=\"s1\"\u003eAfghani\u003c/span\u003e\u003c/a\u003e roots, giving it a more indica-like appearance. This colorful palette of landrace strains, which had adapted to their environment over many years, creates a complex profile of effects and flavors. The sativa genetics dominate the physical effects of Red Congolese, resulting in a weightless euphoria that promotes focus and mental clarity. Its energizing properties make Red Congolese perfect for morning treatment of nausea, cachexia, tension, or Alzheimer\u0026rsquo;s.\u003c/p\u003e\n","descriptionPlain":"While some argue that Red Congolese is an African sativa landrace, the variety popularized in California weaves in Mexican and Afghani roots, giving it a more indica-like appearance. This colorful palette of landrace strains, which had adapted to their environment over many years, creates a complex profile of effects and flavors. The sativa genetics dominate the physical effects of Red Congolese, resulting in a weightless euphoria that promotes focus and mental clarity. Its energizing properties make Red Congolese perfect for morning treatment of nausea, cachexia, tension, or Alzheimer\u0026rsquo;s.\n","aka":null,"rating":4.59,"highlightedReviews":[{"id":1413944,"username":"iwcwoodson","text":" I smoked less than half gram to myself and I\u0027m spending the next 4 hours cleaning my house, car, all my bongs and pipes and walked my dog 4 miles. I\u0027m usually a lazy stoner, this is the cocaine of marijuanas. 10/10 Walden Cannabis.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1642769,"username":"LadyEll","text":"I loved this strain.  No pain, lower stress, but a bit of an energy lift, while not increasing my anxiety or clouding my thinking. \nI am a medicinal user with high tolerances, but friends who use recreationally and have  much lower tolerances also enjoyed this strain.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2955","title":"10 Cannabis Strains That Won’t Make You (As) Hungry","author":"Bailey Rahn","category":null,"date":"\/Date(1455998400000)\/","text":"“There’s weed that don’t make you hungry? For real? Honey, this changes everything.”\nThat was my Lyft driver’s response when I told her not all cannabis makes your gullet an insatiable black hole. Most cannabis consumers – especially first-time experimenters – have only tried high-THC strains, so it’s no wonder that the dispelling of this common misconception comes to the surprise of many who have long associated cannabis with the inevitable “munchies” syndrome.\nThe munchies can be a beautiful thing, and I’m not just talking about the pure ecstasy that comes with dual-wielding a fried chicken leg and an ice cream sandwich once in a while. That appetite stimulation is life-changing for patients dealing with cancer, depression, and other gastrointestinal/appetite disorders. But not everyone wants uncontrollable food lust, and some will actively avoid cannabis because of this one side effect – particularly those struggling with pre-existing eating and weight issues.\nFor those of you interested in reaping the myriad of benefits cannabis has to offer without the unbridled gluttony, we hope you find this list helpful. Remember, you can click the strain to see if it’s available at a store or dispensary near you!\n\n \nHigh-CBD Strains\nIf you’ve ever tried a high-CBD strain before, you’ve probably noticed that they don’t summon the munchies monster like THC-rich varieties. A Yale study published last year found that THC – the same chemical responsible for cannabis’ euphoric high – stimulated a group of nerve cells in the hypothalamus, the area of the brain that governs instincts like hunger and arousal.\n\nWhile less is known about CBD’s influence on appetite, we do know that this non-psychoactive constituent counteracts many effects of THC and researchers have even eyed CBD as an anti-obesity treatment based on its activity in the brain. Our own anecdotal evidence leads us to recommend high-CBD, low-THC strains for the best “munchie-less” experience, but a strain with equal parts CBD and THC can also induce less hunger with the added benefit of mild euphoria.\n\n \n\nA popular strain found in many Oregon shops, Harle-Tsu is hybrid cross between two high-CBD parents, Harlequin and Sour Tsunami (which are also worth looking into for minimal munchies strains). Harle-Tsu typically expresses a high-CBD profile with very little THC, making it a perfect choice for anyone who wants the relaxing and therapeutic effects of cannabis minus the euphoria or paranoia.\n \n\nThe “Remedy” for your over-excited appetite is this indica cross between Cannatonic and Afghan Skunk. With a THC content that rarely squeaks past 1%, Remedy delivers mental tranquility and physical relief without the psychoactive burden. This Pacific Northwest strain is perfect for the patient needing to curb pain, anxiety, tension, headaches, or insomnia, but doesn’t want to interrupt their day with hourly snack breaks.\n \n\nCanna-Tsu is taking off across the U.S., discoverable in Oregon, California, Illinois, Washington, Colorado, and many other medical marijuana states. Sweet and earthy in flavor, Canna-Tsu provides a boost to both mood and focus. Though this strain may calm upset tummies, you shouldn’t feel any extra rumblings of hunger.\n \n\nFor uncompromised energy and clarity, we recommend the low-munchies sativa MediHaze. This one can sometimes exhibit equal levels of THC and CBD, but compared to high-THC, low-CBD strains, MediHaze is much better for keeping the appetite at bay.\n \n\nSimilar to the widely coveted ACDC hybrid, Cannatonic is a high-CBD strain that relaxes the body while leaving the mind free to focus. On average, Cannatonic has a 2:1 ratio of CBD:THC, meaning you probably won’t feel much in the way of a high or hunger.\n \nHigh THCV Sativa Strains\nBy now you know what THC and CBD is, but you may not be familiar with the less ubiquitous THCV, a related chemical that suppresses appetite. While most strains on the market today tend to test anywhere between 10-20% THC, what’s considered a high THCV content might only hit a high-water mark of 5%. THCV tends to be more abundant in sativa strains, and it’s possible you’ve noticed that sativas tend to provoke hunger less than indica strains. The unique metabolic effects of THCV even have researchers considering its utility in treating obesity and diabetes.\n\nWhile high-CBD strains tend to induce little to no high, these THCV-rich sativas produce high-energy, psychoactive effects. That’s good news if you like the euphoria associated with cannabis, but don’t want the raging appetite.\n \n\nWith an average THCV content that ranges between 0.2 to 1.8%, Durban Poison is the perfect weapon against overactive appetites and can be found in most major markets. Cherished for its active, upbeat high that can fuel productivity, this pure African sativa keeps you focused on what matters more than snacks.\n \n\nResist the call of the pizza with Power Plant, an electrifying sativa that descends from African landrace strains. Its spicy, peppery aroma perks up the senses, leaving you with inspiration and positivity instead of a demanding stomach. You can find Power Plant in many different markets across the U.S. and beyond, so check to see if a shop near you is carrying it.\n \n\nKill the temptation to order half Taco Bell’s menu with Jack the Ripper, a sativa strain that carries a tantalizing lemon scent. A favorite in the Pacific Northwest, this invigorating sativa is sure to summon a talkative mood long before a talkative tum.\n \n\nAnother African sativa, Red Congolese focuses all of its psychoactive energy in the head, helping creativity and focus to thrive. Among the list of activities this sativa motivates, you’ll sooner find hiking, painting, and reading more appealing than eating the entire contents of your fridge. Though most frequently found in Vancouver, BC and Ontario, you might be delightfully surprised by its occasional appearance on the West Coast and in other areas of the U.S..\n \n\nAs sweet and citrusy as this sativa might taste, Moby Dick doesn’t coerce the appetite as much as other strains. Expect instead to feel your mood and energy elevate to a place in which it’s easy to feel satisfied whether or not you treated yourself to an entire cheesecake. This sativa is lovingly embraced in Canada and Spain, although Americans have also reported sightings of the legendary Moby Dick in many markets.\nInterested in strains that do make you hungry? Try these 10!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/10173255/iStock-526148526.jpg","urlslug":"/news/strains-products/10-cannabis-strains-that-wont-make-you-as-hungry"},{"id":"contentitems-5905","title":"What Is THCV and What Are the Benefits of This Cannabinoid?","author":"Bailey Rahn","category":null,"date":"\/Date(1422986400000)\/","text":"THCV, or tetrahydrocannabivarin, is a compound in cannabis that offers a unique array of effects and medical benefits that sets it apart from other cannabinoids like THC and CBD. Whether you’re a medical marijuana patient looking for a particular type of relief or a casual consumer chasing a specific effect, we’d like to introduce you to this fascinating compound that’s sure to make major waves in the cannabis world as we discover and utilize its full potential.\nWhat are THCV’s Effects and Benefits?\nAs its name suggests, THCV is similar to THC in molecular structure and psychoactive properties, but it provides a variety of pronounced and altogether different effects. A note for vaporizer enthusiasts: THCV has a boiling point of 428 °F (220 °C), so you’ll need to turn it up higher than you would THC.\n\n\nTHCV is an appetite suppressant. In contrast to THC, THCV may dull the appetite. This may be good for consumers focused on weight loss, but THCV should be avoided by patients treating appetite loss or anorexia.\nTHCV may help with diabetes. Research shows promise in THCV’s ability to regulate blood sugar levels and reduce insulin resistance.\nTHCV may reduce panic attacks. It appears to curb anxiety attacks in PTSD patients without suppressing emotion.\nTHCV may help with Alzheimer’s. Tremors, motor control, and brain lesions associated with Alzheimer’s disease appear to be improved by THCV, but research is in progress.\nTHCV stimulates bone growth. Because it promotes the growth of new bone cells, THCV is being looked at for osteoporosis and other bone-related conditions.\n\n\nWhere Can I Find THCV?\nSo you’re looking for the effects mentioned above, but you aren’t sure where to start your search for high-THCV strains and products. Most strains only contain trace, undetectable amounts of THCV, making it difficult to achieve the desired therapeutic effect. We can assume that more THCV-rich products will be introduced alongside its growing popularity, but in the meantime, here are some useful hints for locating this rare therapeutic gem.\n\nLook for African sativas. Lab results show that THCV is most abundant in sativas, particularly landrace strains from Africa. Durban Poison is one of the more common high-THCV strains, but other options can be found in the strain list below.\nAsk about parent genetics. Having trouble finding an African sativa? Plenty of strains have hybridized African genetics that predispose it to a higher THCV potential. Cherry Pie, for example, may express a high THCV content by way of its Durban Poison parent. Look for lineage information in Leafly’s strain pages or ask your budtenders to point out their African hybrids.\nRequest test results. Genetics alone can’t promise a high-THCV content, and cannabinoid contents can vary from harvest to harvest. If possible, ask your budtender for lab-tested strains to ensure that you’re indeed getting a THCV-rich product.\n\n\nHigh THCV Cannabis Strains\nThis list is by no means comprehensive, but it includes strains best known for their tendency toward higher-than-average THCV contents. These strains can be consumed in flower form or they can be processed into extracts, oils, and edibles for a higher concentration of cannabinoids. A few of the strains below, like Doug’s Varin and Pineapple Purps, were specially bred to contain higher levels of THCV. Again, be sure to steer your choices toward African sativas as they tend to contain the most THCV.\n\n\n\n\nDoug’s Varin\n\nPineapple Purps\n\nDurban Poison\n\n\n\nPower Plant\n\nWillie Nelson\n\nRed Congolese\n\n\n\nJack the Ripper\n\nDurban Cheese\n\nSkunk #1","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/02/29195248/what-is-thcv-and-what-are-the-benefits-of-this-cannabinoid.jpg","urlslug":"/news/cannabis-101/what-is-thcv-and-what-are-the-benefits-of-this-cannabinoid"}],"reviewCount":182,"flavors":[{"name":"Earthy","score":39.166467479350914},{"name":"Spicy/Herbal","score":26.137359572942398},{"name":"Pungent","score":22.399543197089208},{"name":"Sweet","score":19.546118503173716},{"name":"Citrus","score":18.097761134570948}],"effects":[{"name":"Energetic","score":98.158579661647138},{"name":"Happy","score":88.368788675537132},{"name":"Uplifted","score":82.503651767455452},{"name":"Focused","score":81.298966881788971},{"name":"Creative","score":72.287201551005225}],"symptoms":[{"name":"Stress","score":67.913579263272524},{"name":"Depression","score":66.032321461769314},{"name":"Fatigue","score":43.939526730937772},{"name":"Pain","score":24.319177754760577},{"name":"Headaches","score":18.239980878017686}],"conditions":[{"name":"Anxiety","score":33.251799325418951},{"name":"PTSD","score":18.393355111146519},{"name":"Hypertension","score":15.961676360449365},{"name":"ADD/ADHD","score":14.398321514885932},{"name":"PMS","score":9.6771837569383585}],"negatives":[{"name":"Dry Mouth","score":23.092183889729903},{"name":"Dry Eyes","score":19.085995803787213},{"name":"Anxious","score":8.7161713542081642},{"name":"Paranoid","score":2.8918014500836584},{"name":"Dizzy","score":2.4316787506971558}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_7d24.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/576460/b/red-congolese__primary_83b9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_d603.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/556249/b/red-congolese__primary_4c6a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_122f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/538698/b/red-congolese__primary_d338.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_414d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/538666/b/red-congolese__primary_a05c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_6c6c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/521883/b/red-congolese__primary_9c47.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_0001.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506433/b/red-congolese__primary_87fb.jpg"}],"photoTotalCount":26,"popularCities":["Toronto, ON","Vancouver, BC","Calgary, AB","Ottawa, ON","Montréal, QC","Edmonton, AB","Hamilton, ON","Saskatoon, SK","Winnipeg, MB","Halifax, NS"],"permalink":"https://mobileapi.leafly.com/sativa/red-congolese","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.58791208791209/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"African","subtitle":null,"slug":"african","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/african","symbol":"Afr","applink":"leafly://strain/african"},{"name":"Mexican","subtitle":null,"slug":"mexican","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/mexican","symbol":"Mex","applink":"leafly://strain/mexican"},{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
{"sl_translate":"description,descriptionPlain,category","id":65457,"slug":"red-congolese","name":"Red Congolese","subtitle":null,"symbol":"Rc","category":"Sativa","description":"\u003cp class=\"p1\"\u003eWhile some argue that Red Congolese is an \u003ca href=\"https://www.leafly.com/sativa/african\"\u003eAfrican\u003c/a\u003e sativa \u003ca href=\"http://www.leafly.com/knowledge-center/cannabis-101/the-cannabis-origin-what-is-a-landrace-strain\"\u003e\u003cspan class=\"s1\"\u003elandrace\u003c/span\u003e\u003c/a\u003e, the variety popularized in California weaves in \u003ca href=\"https://www.leafly.com/sativa/mexican\"\u003eMexican\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/indica/afghani\"\u003e\u003cspan class=\"s1\"\u003eAfghani\u003c/span\u003e\u003c/a\u003e roots, giving it a more indica-like appearance. This colorful palette of landrace strains, which had adapted to their environment over many years, creates a complex profile of effects and flavors. The sativa genetics dominate the physical effects of Red Congolese, resulting in a weightless euphoria that promotes focus and mental clarity. Its energizing properties make Red Congolese perfect for morning treatment of nausea, cachexia, tension, or Alzheimer\u0026rsquo;s.\u003c/p\u003e\n","descriptionPlain":"While some argue that Red Congolese is an African sativa landrace, the variety popularized in California weaves in Mexican and Afghani roots, giving it a more indica-like appearance. This colorful palette of landrace strains, which had adapted to their environment over many years, creates a complex profile of effects and flavors. The sativa genetics dominate the physical effects of Red Congolese, resulting in a weightless euphoria that promotes focus and mental clarity. Its energizing properties make Red Congolese perfect for morning treatment of nausea, cachexia, tension, or Alzheimer\u0026rsquo;s.\n","aka":null,"rating":4.59,"highlightedReviews":[{"id":1413944,"username":"iwcwoodson","text":" I smoked less than half gram to myself and I\u0027m spending the next 4 hours cleaning my house, car, all my bongs and pipes and walked my dog 4 miles. I\u0027m usually a lazy stoner, this is the cocaine of marijuanas. 10/10 Walden Cannabis.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/Y7BSixzkNSIjwGyJmmVeYdOkdXM=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fgcfM1zHxS6e5qNX7cx4M_goggles-red.png"},{"id":1642769,"username":"LadyEll","text":"I loved this strain.  No pain, lower stress, but a bit of an energy lift, while not increasing my anxiety or clouding my thinking. \nI am a medicinal user with high tolerances, but friends who use recreationally and have  much lower tolerances also enjoyed this strain.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-2955","title":"10 Cannabis Strains That Won’t Make You (As) Hungry","author":"Bailey Rahn","category":null,"date":"\/Date(1455998400000)\/","text":"“There’s weed that don’t make you hungry? For real? Honey, this changes everything.”\nThat was my Lyft driver’s response when I told her not all cannabis makes your gullet an insatiable black hole. Most cannabis consumers – especially first-time experimenters – have only tried high-THC strains, so it’s no wonder that the dispelling of this common misconception comes to the surprise of many who have long associated cannabis with the inevitable “munchies” syndrome.\nThe munchies can be a beautiful thing, and I’m not just talking about the pure ecstasy that comes with dual-wielding a fried chicken leg and an ice cream sandwich once in a while. That appetite stimulation is life-changing for patients dealing with cancer, depression, and other gastrointestinal/appetite disorders. But not everyone wants uncontrollable food lust, and some will actively avoid cannabis because of this one side effect – particularly those struggling with pre-existing eating and weight issues.\nFor those of you interested in reaping the myriad of benefits cannabis has to offer without the unbridled gluttony, we hope you find this list helpful. Remember, you can click the strain to see if it’s available at a store or dispensary near you!\n\n \nHigh-CBD Strains\nIf you’ve ever tried a high-CBD strain before, you’ve probably noticed that they don’t summon the munchies monster like THC-rich varieties. A Yale study published last year found that THC – the same chemical responsible for cannabis’ euphoric high – stimulated a group of nerve cells in the hypothalamus, the area of the brain that governs instincts like hunger and arousal.\n\nWhile less is known about CBD’s influence on appetite, we do know that this non-psychoactive constituent counteracts many effects of THC and researchers have even eyed CBD as an anti-obesity treatment based on its activity in the brain. Our own anecdotal evidence leads us to recommend high-CBD, low-THC strains for the best “munchie-less” experience, but a strain with equal parts CBD and THC can also induce less hunger with the added benefit of mild euphoria.\n\n \n\nA popular strain found in many Oregon shops, Harle-Tsu is hybrid cross between two high-CBD parents, Harlequin and Sour Tsunami (which are also worth looking into for minimal munchies strains). Harle-Tsu typically expresses a high-CBD profile with very little THC, making it a perfect choice for anyone who wants the relaxing and therapeutic effects of cannabis minus the euphoria or paranoia.\n \n\nThe “Remedy” for your over-excited appetite is this indica cross between Cannatonic and Afghan Skunk. With a THC content that rarely squeaks past 1%, Remedy delivers mental tranquility and physical relief without the psychoactive burden. This Pacific Northwest strain is perfect for the patient needing to curb pain, anxiety, tension, headaches, or insomnia, but doesn’t want to interrupt their day with hourly snack breaks.\n \n\nCanna-Tsu is taking off across the U.S., discoverable in Oregon, California, Illinois, Washington, Colorado, and many other medical marijuana states. Sweet and earthy in flavor, Canna-Tsu provides a boost to both mood and focus. Though this strain may calm upset tummies, you shouldn’t feel any extra rumblings of hunger.\n \n\nFor uncompromised energy and clarity, we recommend the low-munchies sativa MediHaze. This one can sometimes exhibit equal levels of THC and CBD, but compared to high-THC, low-CBD strains, MediHaze is much better for keeping the appetite at bay.\n \n\nSimilar to the widely coveted ACDC hybrid, Cannatonic is a high-CBD strain that relaxes the body while leaving the mind free to focus. On average, Cannatonic has a 2:1 ratio of CBD:THC, meaning you probably won’t feel much in the way of a high or hunger.\n \nHigh THCV Sativa Strains\nBy now you know what THC and CBD is, but you may not be familiar with the less ubiquitous THCV, a related chemical that suppresses appetite. While most strains on the market today tend to test anywhere between 10-20% THC, what’s considered a high THCV content might only hit a high-water mark of 5%. THCV tends to be more abundant in sativa strains, and it’s possible you’ve noticed that sativas tend to provoke hunger less than indica strains. The unique metabolic effects of THCV even have researchers considering its utility in treating obesity and diabetes.\n\nWhile high-CBD strains tend to induce little to no high, these THCV-rich sativas produce high-energy, psychoactive effects. That’s good news if you like the euphoria associated with cannabis, but don’t want the raging appetite.\n \n\nWith an average THCV content that ranges between 0.2 to 1.8%, Durban Poison is the perfect weapon against overactive appetites and can be found in most major markets. Cherished for its active, upbeat high that can fuel productivity, this pure African sativa keeps you focused on what matters more than snacks.\n \n\nResist the call of the pizza with Power Plant, an electrifying sativa that descends from African landrace strains. Its spicy, peppery aroma perks up the senses, leaving you with inspiration and positivity instead of a demanding stomach. You can find Power Plant in many different markets across the U.S. and beyond, so check to see if a shop near you is carrying it.\n \n\nKill the temptation to order half Taco Bell’s menu with Jack the Ripper, a sativa strain that carries a tantalizing lemon scent. A favorite in the Pacific Northwest, this invigorating sativa is sure to summon a talkative mood long before a talkative tum.\n \n\nAnother African sativa, Red Congolese focuses all of its psychoactive energy in the head, helping creativity and focus to thrive. Among the list of activities this sativa motivates, you’ll sooner find hiking, painting, and reading more appealing than eating the entire contents of your fridge. Though most frequently found in Vancouver, BC and Ontario, you might be delightfully surprised by its occasional appearance on the West Coast and in other areas of the U.S..\n \n\nAs sweet and citrusy as this sativa might taste, Moby Dick doesn’t coerce the appetite as much as other strains. Expect instead to feel your mood and energy elevate to a place in which it’s easy to feel satisfied whether or not you treated yourself to an entire cheesecake. This sativa is lovingly embraced in Canada and Spain, although Americans have also reported sightings of the legendary Moby Dick in many markets.\nInterested in strains that do make you hungry? Try these 10!","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/02/10173255/iStock-526148526.jpg","urlslug":"/news/strains-products/10-cannabis-strains-that-wont-make-you-as-hungry"},{"id":"contentitems-5905","title":"What Is THCV and What Are the Benefits of This Cannabinoid?","author":"Bailey Rahn","category":null,"date":"\/Date(1422986400000)\/","text":"THCV, or tetrahydrocannabivarin, is a compound in cannabis that offers a unique array of effects and medical benefits that sets it apart from other cannabinoids like THC and CBD. Whether you’re a medical marijuana patient looking for a particular type of relief or a casual consumer chasing a specific effect, we’d like to introduce you to this fascinating compound that’s sure to make major waves in the cannabis world as we discover and utilize its full potential.\nWhat are THCV’s Effects and Benefits?\nAs its name suggests, THCV is similar to THC in molecular structure and psychoactive properties, but it provides a variety of pronounced and altogether different effects. A note for vaporizer enthusiasts: THCV has a boiling point of 428 °F (220 °C), so you’ll need to turn it up higher than you would THC.\n\n\nTHCV is an appetite suppressant. In contrast to THC, THCV may dull the appetite. This may be good for consumers focused on weight loss, but THCV should be avoided by patients treating appetite loss or anorexia.\nTHCV may help with diabetes. Research shows promise in THCV’s ability to regulate blood sugar levels and reduce insulin resistance.\nTHCV may reduce panic attacks. It appears to curb anxiety attacks in PTSD patients without suppressing emotion.\nTHCV may help with Alzheimer’s. Tremors, motor control, and brain lesions associated with Alzheimer’s disease appear to be improved by THCV, but research is in progress.\nTHCV stimulates bone growth. Because it promotes the growth of new bone cells, THCV is being looked at for osteoporosis and other bone-related conditions.\n\n\nWhere Can I Find THCV?\nSo you’re looking for the effects mentioned above, but you aren’t sure where to start your search for high-THCV strains and products. Most strains only contain trace, undetectable amounts of THCV, making it difficult to achieve the desired therapeutic effect. We can assume that more THCV-rich products will be introduced alongside its growing popularity, but in the meantime, here are some useful hints for locating this rare therapeutic gem.\n\nLook for African sativas. Lab results show that THCV is most abundant in sativas, particularly landrace strains from Africa. Durban Poison is one of the more common high-THCV strains, but other options can be found in the strain list below.\nAsk about parent genetics. Having trouble finding an African sativa? Plenty of strains have hybridized African genetics that predispose it to a higher THCV potential. Cherry Pie, for example, may express a high THCV content by way of its Durban Poison parent. Look for lineage information in Leafly’s strain pages or ask your budtenders to point out their African hybrids.\nRequest test results. Genetics alone can’t promise a high-THCV content, and cannabinoid contents can vary from harvest to harvest. If possible, ask your budtender for lab-tested strains to ensure that you’re indeed getting a THCV-rich product.\n\n\nHigh THCV Cannabis Strains\nThis list is by no means comprehensive, but it includes strains best known for their tendency toward higher-than-average THCV contents. These strains can be consumed in flower form or they can be processed into extracts, oils, and edibles for a higher concentration of cannabinoids. A few of the strains below, like Doug’s Varin and Pineapple Purps, were specially bred to contain higher levels of THCV. Again, be sure to steer your choices toward African sativas as they tend to contain the most THCV.\n\n\n\n\nDoug’s Varin\n\nPineapple Purps\n\nDurban Poison\n\n\n\nPower Plant\n\nWillie Nelson\n\nRed Congolese\n\n\n\nJack the Ripper\n\nDurban Cheese\n\nSkunk #1","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/02/29195248/what-is-thcv-and-what-are-the-benefits-of-this-cannabinoid.jpg","urlslug":"/news/cannabis-101/what-is-thcv-and-what-are-the-benefits-of-this-cannabinoid"}],"reviewCount":182,"flavors":[{"name":"Earthy","score":39.166467479350914},{"name":"Spicy/Herbal","score":26.137359572942398},{"name":"Pungent","score":22.399543197089208},{"name":"Sweet","score":19.546118503173716},{"name":"Citrus","score":18.097761134570948}],"effects":[{"name":"Energetic","score":98.158579661647138},{"name":"Happy","score":88.368788675537132},{"name":"Uplifted","score":82.503651767455452},{"name":"Focused","score":81.298966881788971},{"name":"Creative","score":72.287201551005225}],"symptoms":[{"name":"Stress","score":67.913579263272524},{"name":"Depression","score":66.032321461769314},{"name":"Fatigue","score":43.939526730937772},{"name":"Pain","score":24.319177754760577},{"name":"Headaches","score":18.239980878017686}],"conditions":[{"name":"Anxiety","score":33.251799325418951},{"name":"PTSD","score":18.393355111146519},{"name":"Hypertension","score":15.961676360449365},{"name":"ADD/ADHD","score":14.398321514885932},{"name":"PMS","score":9.6771837569383585}],"negatives":[{"name":"Dry Mouth","score":23.092183889729903},{"name":"Dry Eyes","score":19.085995803787213},{"name":"Anxious","score":8.7161713542081642},{"name":"Paranoid","score":2.8918014500836584},{"name":"Dizzy","score":2.4316787506971558}],"articlesAvailable":true,"articleTotalCount":3,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_7d24.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/576460/b/red-congolese__primary_83b9.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_d603.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/556249/b/red-congolese__primary_4c6a.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_122f.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/538698/b/red-congolese__primary_d338.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_414d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/538666/b/red-congolese__primary_a05c.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_6c6c.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/521883/b/red-congolese__primary_9c47.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/red-congolese_100x100_0001.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/506433/b/red-congolese__primary_87fb.jpg"}],"photoTotalCount":26,"popularCities":["Toronto, ON","Vancouver, BC","Calgary, AB","Ottawa, ON","Montréal, QC","Edmonton, AB","Hamilton, ON","Saskatoon, SK","Winnipeg, MB","Halifax, NS"],"permalink":"https://mobileapi.leafly.com/sativa/red-congolese","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.58791208791209/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"African","subtitle":null,"slug":"african","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/african","symbol":"Afr","applink":"leafly://strain/african"},{"name":"Mexican","subtitle":null,"slug":"mexican","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/mexican","symbol":"Mex","applink":"leafly://strain/mexican"},{"name":"Afghani","subtitle":null,"slug":"afghani","category":"Indica","permalink":"https://mobileapi.leafly.com/indica/afghani","symbol":"Afg","applink":"leafly://strain/afghani"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
