{"sl_translate":"description,descriptionPlain,category","id":145199,"slug":"thors-hammer","name":"Thor\u0027s Hammer","subtitle":null,"symbol":"Thm","category":"Sativa","description":"\u003cp\u003eThor\u0026rsquo;s Hammer by SnowHigh Seeds is an \u003ca href=\"http://www.leafly.com/explore/tags-uplifted\"\u003euplifting\u003c/a\u003e \u003ca href=\"http://www.leafly.com/explore/category-sativa\"\u003esativa\u003c/a\u003e strain that combines genetics from \u003ca href=\"http://leafly.com/sativa/vortex\"\u003eVortex\u003c/a\u003e, \u003ca href=\"http://www.leafly.com/hybrid/cinderella-99\"\u003eCinderella 99\u003c/a\u003e, and \u003ca href=\"http://www.leafly.com/sativa/acapulco-gold\"\u003eAcapulco Gold\u003c/a\u003e. Like a bolt of lightning commanded by the Norse god himself, Thor\u0026rsquo;s Hammer delivers an electrifying blast of cerebral \u003ca href=\"http://www.leafly.com/explore/tags-energetic\"\u003eenergy\u003c/a\u003e that awakens \u003ca href=\"http://www.leafly.com/explore/tags-creative\"\u003ecreativity\u003c/a\u003e and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush \u003ca href=\"http://www.leafly.com/explore/symptoms-fatigue\"\u003efatigue\u003c/a\u003e and \u003ca href=\"http://www.leafly.com/explore/symptoms-depression\"\u003edepression\u003c/a\u003e like the giants of Jotunheimr will likely find Thor\u0026rsquo;s Hammer to be the perfect weapon. You may also find a\u0026nbsp;genetic variant of Thor\u0026#39;s Hammer from Alaska\u0026nbsp;that instead\u0026nbsp;combines \u003ca href=\"http://www.leafly.com/indica/god-bud\"\u003eGod Bud\u003c/a\u003e and \u003ca href=\"http://leafly.com/sativa/sour-diesel\"\u003eSour Diesel\u003c/a\u003e\u0026nbsp;in a more balanced indica-sativa hybrid cross.\u003c/p\u003e\n","descriptionPlain":"Thor\u0026rsquo;s Hammer by SnowHigh Seeds is an uplifting sativa strain that combines genetics from Vortex, Cinderella 99, and Acapulco Gold. Like a bolt of lightning commanded by the Norse god himself, Thor\u0026rsquo;s Hammer delivers an electrifying blast of cerebral energy that awakens creativity and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush fatigue and depression like the giants of Jotunheimr will likely find Thor\u0026rsquo;s Hammer to be the perfect weapon. You may also find a\u0026nbsp;genetic variant of Thor\u0026#39;s Hammer from Alaska\u0026nbsp;that instead\u0026nbsp;combines God Bud and Sour Diesel\u0026nbsp;in a more balanced indica-sativa hybrid cross.\n","aka":"Mjolnir, Thors Hammer","rating":4.26,"highlightedReviews":[{"id":1394267,"username":"GrandMasterStash","text":"This strain will blow your socks off and your woman\u0027s Panties!!  I don\u0027t know what other people are calling a mediocre high but this shit is straight FIRE!!! \n\nCheck it out Analytical 360 tested the Thors Hammer at 28.97 % THC on one test and CBD being below 1% at 0.3 % CBD\n\nThe strain used to be called Mjölnir but Snow changed the name to Thors Hammer because it was a pain in the ass to say. Those test are from 18% THC to 27.48 % THC\n\nNot to mention this strain yields spears, large yields of resinous crystalline buds. This is a easy strain to grow, very consistent and its just a powerhouse, plain and simple. Snow offers this line pure and in crosses that got to be even more potent.\n\nI\u0027m just super impressed with all the SnowHigh Gear, just plant the seed and get a female, the selections already done. You guys are missing out, if you haven\u0027t tried Thors Hammer!!\n\nGrand Master Stash","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/lJ2VY3JcKjYut_50Yn5tnVlftCU=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fGkYePhpuTiO6OltZh89O_wide-brim-purple.png"},{"id":1461200,"username":"HOMEBOI","text":"okay, the BEST crossfaded strain!!! but this is really good, the taste is at first weird (started my stash with a blueberry blunt) but i got used to it after many sessions with my vape. heavy sativa, best for when you want to get something done. i will agree the flavor is weird, but not bad - high is worth it.","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/5/240","avatar":"https://ddd33q3967xhi.cloudfront.net/bn1HUI7tvLyn0Fkk1dLIMSCvROQ=/fit-in/300x300/https%3a%2f%2fs3.amazonaws.com%2fleafly%2fbin%2fUxAMHptTuuQR3BjlU2Hc_nerd-purple.png"}],"relatedStrains":[],"articles":[{"id":"contentitems-8229","title":"Try These Cannabis Strains That Are as Sweet as Honey","author":"Jeremiah Wilhelm","category":null,"date":"\/Date(1475440520000)\/","text":"Honey is an amazing substance — it’s a natural sweetener, a super-food with a nearly endless shelf life (if sealed properly), and has outstanding nutritional and medicinal benefits that can even help people adapt to local allergens (not to mention how delicious it is on baklava, peanut butter sandwiches, and in a cup of hot coffee or tea!).\nLeafly is home to over 60 specific strains that exhibit notes of honey. As your strain researcher and a passionate purveyor of fine cannabis, I’ve curated a shortlist of honey-flavored strains that will make your fingers sticky and your taste buds smile. Enjoy!\n   Panama Red\nPanama Red is best described as an old-school cannabis classic. Originating from Panama, this pure sativa rose to stardom in the late 1960’s thanks to its typical sativa effects: speedy and intense, bordering on psychedelic. As cannabis cultivation matured, Panama Red, which has a lengthy flowering time of at least 11 weeks, was left behind for faster growing strains and increased profits. However, those who fondly recall days of its prominence love its smooth medicating experience and loftily contemplate its revival. If you can get your hands on this sentimental throwback, do not hesitate to groove down memory lane and enjoy the ride.\n   Chocolate Thunder\nWhen you combine the sweet cocoa flavor of Chocolope with the strength and potency of Alaskan Thunder Fuck, you get none other than Chocolate Thunder. This clear-headed, active sativa may be all you need to inspire creativity or promote concentration, and patients will appreciate its ability to dull symptoms without fogging mental faculties. True to its name, Chocolate Thunder has a subtle sweet, earthy aroma similar to that of chocolate.\n   Thor’s Hammer\nThor’s Hammer by SnowHigh Seeds is an uplifting sativa strain that combines genetics from Vortex, Cinderella 99, and Acapulco Gold. Like a bolt of lightning commanded by the Norse god himself, Thor’s Hammer delivers an electrifying blast of cerebral energy that awakens creativity and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush fatigue and depression like the giants of Jotunheimr will likely find Thor’s Hammer to be the perfect weapon. You may also find a genetic variant of Thor’s Hammer from Alaska that instead combines God Bud and Sour Diesel in a more balanced indica-sativa hybrid cross.\n   Honey Banana\nHoney Bananas from Elemental Seeds is a heavy-handed hybrid strain bred from Strawberry Banana and Honey Boo Boo. This cannabis strain earns its name with a resinous coat as sticky as honey and an unmistakable banana aroma. She leans heavily toward the indica side of the family, providing weighty full-body effects coupled with an invigorating buzz of cerebral euphoria.\n   Lodi Dodi\nLodi Dodi is a sativa-dominant hybrid popular in Washington State. Exclusively bred by The Clone Zone, the genetic heritage of Lodi Dodi is undefined and closely guarded. Lodi Dodi carries a sweet, unique flavor of tropical fruit and fresh wildflowers. The pungent aroma leads the way towards a cerebral buzz, known to spark creativity and a boost of energy that will turn any task into a more enjoyable adventure.\n   Nebula\nThe Nebula marijuana strain was bred by Paradise Seeds in 1996. Its name means “Starcloud” and it has been known to “twinkle” with THC coating, with a head and body buzz described as intense and almost psychedelic. The buds have been known to smell and taste like honey, and flowering time is a minimum of 9 weeks. Nebula has won many awards, including 3rd place in the sativa category at the High Times Cannabis Cup in 1999 and 2nd place in 2005. It also took 3rd place at the Highlife Cup in 2004 in the Hydro category, and 1st place at the Copa La Bella Flor Spain in 2005.\n   Fortune Cookies\nFortune Cookies is a hybrid cannabis strain that combines the famed genetics of GSC (f.k.a Girl Scout Cookies) and OG Kush in a potent mix of earthy, honeyed flavors. OG Kush genes are already present in GSC (f.k.a Girl Scout Cookies), but Fortune Cookies has pronounced characteristics that OG fans will appreciate. Sativa genetics usually lead the way with Fortune Cookies, inducing a soaring, long-lasting buzz perfect for creative escapes. This hybrid can hit hard in larger doses, pushing past the confines of a subtle buzz into the weighty “couch-lock” effects typically associated with indica strains.\n   BC Sweet Tooth\nDeveloped in British Columbia by BC Bud Depot, BC Sweet tooth is an indica-dominant hybrid known for its quick flowering time and candy taste.  A hardy plant, this strain can be grown outdoors where it can flower in under 7 weeks, but it prefers the indoors where it may flower as soon as 6 weeks. The result of a cross with earlier generations of BC Sweet Tooth and classic Sweet Tooth, these sugary flowers are sure to satisfy your craving. The crystalline buds have a strong, sweet smell with a hint of citrus, and consumers report that this treat satisfies with a long-lasting, potent feeling that hits fast.\n   Danky Doodle\nOriginally named Double D as a reference to the large buds on these plants (we’ll let you make the connection there), breeder KC Brains decided to rename the strain Danky Doodle at the suggestion of some American friends in order to avoid confusion with the similarly named Double Dutch. Danky Doodle certainly isn’t a shy plant; it grows like the weed it is and will make its presence known with its pungent sweet smell. Plants flower at 9 to 11 weeks and should provide a high yield of large buds covered in a rich frost. This plant is a cross between several strains, and it’s no surprise that Big Bud is included in its lineage along with the strains Viking and the breeder’s own KC 636. The result is a strong indica that provides full body relief no matter what you call it.\n   Cream Caramel\nCream Caramel, named after its sweet caramel aroma, is a 90% indica cross between BlueBlack, Maple Leaf Indica, and White Rhino. Covered in a sugary coat of THC-rich resin, Cream Caramel delivers heavy, relaxing indica effects that soothe the mind and body. Though originally bred by Sweet Seeds in Spain, Royal Queen Seeds have also championed their own rendition called Royal Caramel. Early October is the finish line for outdoor Cream Caramel flowers, while indoor gardens should be harvested after a 7 to 8 week flowering period.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2016/09/02131126/cannabis-strains-that-taste-like-honey.jpg","urlslug":"/news/strains-products/cannabis-strains-that-taste-like-honey"},{"id":"contentitems-3419","title":"New Strains Alert: Swiss Gold, Thor\u0027s Hammer, Hawaiian Cookies, Blueberry Skunk, and More","author":"Bailey Rahn","category":null,"date":"\/Date(1426266000000)\/","text":"Thanks to our app users for all your strain submissions this week! We\u0027ve highlighted 10 strains we thought you might be into, but there\u0027s plenty more exploring to be done in the Leafly Explorer.\nWant to find out where to find these strains near you? Check the \"Availability\" tab on their strain pages to find out if someone\u0027s carrying it in your area. Maybe you\u0027ve tried one of these new strains already; if this is the case, go leave a review!\n \n   1. Swiss Gold\nCharacteristics of Swiss Gold:\n\nSwiss Gold is a high-CBD strain from Northern California that is typically classified as a sativa and was bred by the late Lawrence Ringo. Ringo describes the structure of the strain as “pure indica, short and fat.” Swiss Gold regularly tests with CBD:THC ratios of 2:1, and carries an earthy aroma of fresh citrus. The relaxing effects reduce pain and stress while stimulating the appetite, and eventually cradle you to sleep.\n\n \n   2. Blueberry Skunk\nCharacteristics of Blueberry Skunk:\n\nBlueberry Skunk is an indica-dominant hybrid of Blueberry and Skunk #1 genetics. It has a reputation for being potent, flavorful, and relatively easy to grow. The aroma of Blueberry Skunk is a complex mix of sweet berry flavors that blend with an earthy, skunky musk. The effects are led by a long-lasting euphoric buzz that generates giggles as well as the munchies.\n\n \n   3. Thor\u0027s Hammer\nCharacteristics of Thor\u0027s Hammer:\n\nThor’s Hammer by SnowHigh Seeds is an uplifting sativa strain that combines genetics from Vortex, Cinderella 99, and Acapulco Gold. Like a bolt of lightning commanded by the Norse god himself, Thor’s Hammer delivers an electrifying blast of cerebral energy that awakens creativity and motivation. Its lightweight body effects make this strain a great choice for daytime use, and patients needing to crush fatigue and depression like the giants of Jotunheimr will likely find Thor’s Hammer to be the perfect weapon. You may also find a genetic variant of Thor\u0027s Hammer from Alaska that instead combines God Bud and Sour Diesel in a more balanced indica-sativa hybrid cross.\n\n \n   4. Black \u002784\nCharacteristics of Black \u002784:\n\nBlack ’84, also known as UW Black ’84, is one of a few elusive strains that managed to escape from the medical cannabis garden at the University of Washington in the early and mid-1980s. Believed to descend from Afghani genetics, Black ‘84’s unknown indica lineage expresses itself as a stout, dark, and bushy plant. The aroma is a complex mix of sweet tropical flavors that blend with a smooth nutty finish. Its powerful, relaxing effects on the body make Black ’84 a great nighttime strain when combating anxiety, pain, and insomnia.\n\n \n   5. Zeta Sage\nCharacteristics of Zeta Sage:\n\nZeta Sage is a sativa-dominant hybrid that combines SAGE and OG Kush genetics. The flavors of Zeta Sage are a sweet, pungent mix of sharp diesel and blueberry that leave a lingering menthol aftertaste. Its uplifting rush of euphoric effects provides a heady buzz that relaxes the body without overpowering, making Zeta Sage a great choice for daytime activities.\n\n \n    6. White Urkle\nCharacteristics of White Urkle:\n\nWhite Urkle is a hybrid of Purple Urkle and The White bred by OG Raskal Genetics. Most phenotypes will express themselves with deep violet hues that show the influence of its Purple Urkle mother. This strain is known for having a short stature and a fruity bouquet of flavors that mix with an earthy, pine aroma that gives rise to relaxing yet balanced effects.\n\n \n   7. Blueberry Lambsbread\nCharacteristics of Blueberry Lambsbread:\n\nBlueberry Lambsbread is an uplifting hybrid strain that folds together genetics from Jamaican Lamb’s Bread and Blueberry. Invigorating, creative effects are lightly anchored by mellow relaxation, making Blueberry Lambsbread a good choice for day or evening use. Earthy and woody notes mingle with a sweet berry aroma passed down from its Blueberry parent.\n\n \n   8. Mad Scientist\nCharacteristics of Mad Scientist:\n\nMad Scientist, or Mad.S, by Sannie’s Seeds is an indica-dominant concoction that combines Herijuana and White Widow genetics. With a THC profile that often stretches to 24%, Mad Scientist delivers powerfully relaxing effects that ease the mind and body into a peaceful sedation. Hints of sweet lemon and coffee release on the exhale, and its dense buds are powdered with a snow-white blanket of crystal resin.\n\n \n   9. Alien Reunion\nCharacteristics of Alien Reunion:\n\nAlien Reunion is an indica-dominant cross of Alien OG and Alien Dawg bred by Cannobi Genetics. Its dense colas emit a pungent mix of flavors that include sweet fruity tones of cherry and lemon combined with a skunky, diesel note. The relaxing effects of Alien Reunion calm the body while stimulating the mind with an energetic and creative rush that helps you stay productive without feeling sluggish.\n\n \n   10. Hawaiian Cookies\nCharacteristics of Hawaiian Cookies:\n\nHawaiian Cookies is a sativa-dominant hybrid cross between Hawaiian Snow and GSC (f.k.a Girl Scout Cookies) that first entered the scene in 2014. From its Hawaiian Snow parent, Hawaiian Cookies inherits a tropical citrus aroma in a flavorful introduction to its potent euphoric effects. Its rounded bud structure and dark coloration further testify to this strain’s elite parent genetics.","thumbnail":"https://d3atagt0rnqk7k.cloudfront.net/wp-content/uploads/2015/03/12002431/new-strains-alert-swiss-gold-thors-hammer-hawaiian-cookies-bluebe.png","urlslug":"/news/strains-products/new-strains-alert-swiss-gold-thors-hammer-hawaiian-cookies-bluebe"}],"reviewCount":19,"flavors":[{"name":"Sweet","score":26.219512195121951},{"name":"Pungent","score":26.219512195121951},{"name":"Menthol","score":25.609756097560975},{"name":"Spicy/Herbal","score":25},{"name":"Lemon","score":25}],"effects":[{"name":"Euphoric","score":31.097560975609756},{"name":"Creative","score":28.658536585365852},{"name":"Energetic","score":28.658536585365852},{"name":"Happy","score":28.658536585365852},{"name":"Aroused","score":26.829268292682926}],"symptoms":[{"name":"Depression","score":26.829268292682926},{"name":"Fatigue","score":26.219512195121951},{"name":"Headaches","score":25},{"name":"Stress","score":3.0487804878048781},{"name":"Pain","score":2.4390243902439024}],"conditions":[{"name":"Anxiety","score":3.0487804878048781},{"name":"Migraines","score":2.4390243902439024},{"name":"ADD/ADHD","score":1.2195121951219512},{"name":"Gastrointestinal Disorder","score":1.2195121951219512},{"name":"Arthritis","score":0.6097560975609756}],"negatives":[{"name":"Dry Mouth","score":30.487804878048781},{"name":"Anxious","score":26.219512195121951},{"name":"Dizzy","score":25},{"name":"Dry Eyes","score":1.2195121951219512},{"name":"Paranoid","score":1.2195121951219512}],"articlesAvailable":true,"articleTotalCount":2,"photos":[{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/thor-s-hammer_100x100_7e1d.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/589867/b/thor-s-hammer__primary_4b2d.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/thor-s-hammer_100x100_8652.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/589866/b/thor-s-hammer__primary_a1e5.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/thor-s-hammer_100x100_f1b6.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/494568/b/thor-s-hammer__primary_b731.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/thor-s-hammer_100x100_f2c3.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/493937/b/thor-s-hammer__primary_f5c2.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/thor-s-hammer_100x100_c359.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/493964/b/thor-s-hammer__primary_b244.jpg"},{"uploaded":"\/Date(-62135596800000)\/","thumb":"https://leafly-s3.s3.amazonaws.com/leafly/reviews/thor-s-hammer_100x100_52de.jpg","fullsize":"https://d3ix816x6wuc0d.cloudfront.net/cdn/strain-photo/50608/b/thor-s-hammer_825x550_20a5.jpg"}],"photoTotalCount":6,"popularCities":["Battle Ground, WA","Detroit, MI","Lacey, WA","Seaside, OR"],"permalink":"https://mobileapi.leafly.com/sativa/thors-hammer","starImage":"https://d3ix816x6wuc0d.cloudfront.net/stars/4.26315789473684/240","testGraph":null,"weakDescription":false,"videoUrl":null,"parents":[{"name":"Vortex","subtitle":null,"slug":"vortex","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/vortex","symbol":"Vor","applink":"leafly://strain/vortex"},{"name":"Cinderella 99","subtitle":null,"slug":"cinderella-99","category":"Hybrid","permalink":"https://mobileapi.leafly.com/hybrid/cinderella-99","symbol":"C99","applink":"leafly://strain/cinderella-99"},{"name":"Acapulco Gold","subtitle":null,"slug":"acapulco-gold","category":"Sativa","permalink":"https://mobileapi.leafly.com/sativa/acapulco-gold","symbol":"Aca","applink":"leafly://strain/acapulco-gold"}],"growInfo":{"difficulty":null,"preferredMedium":null,"floweringDays":0,"outdoorFinish":null,"height":null,"averageYield":null,"environment":null,"growNotes":""}}
